["We reexamine a succesful fermion mass Ansatz proposed by Giudice for a wide range of the ratio $tanβ=\\frac {<\\bar h>}{<h>}$ (where ${\\bar h},h$ are the two standard higgs fields), in the context of supersymmetric grand unified theories. We find that the 7 predictions of the ansatz, $V_{us}, V_{cb}, V_{ub}, m_u, m_d, m_s$ and $m_b$ are in good agreement with the experiment when either {\\it i) } $tanβ\\simeq 1$ or {\\it ii)} $tanβ\\geq 30$. A correct prediction for the bottom mass gives a lower limit on $m_t\\geq 125$ for case {\\it (i)}, in agreement with the previous analysis, while in case {\\it (ii)} $m_t\\geq 145$. △ Less", "We calculate the soft SUSY breaking terms arising from a large class of string scenarios, namely symmetric orbifold constructions, and study its phenomenological viability. They exhibit a certain lack of universality, unlike the usual assumptions of the minimal supersymmetric standard model. Assuming gaugino condensation in the hidden sector as the source of SUSY breaking, it turns out that squark and slepton masses tend to be much larger than gaugino masses. Furthermore, we show that these soft breaking terms can be perfectly consistent with both experimental and naturalness constraints (the latter comes from the absence of fine tuning in the $SU(2)\\times U(1)_Y\\rightarrow U(1)_{em}$ breaking process). This is certainly non--trivial and in fact imposes interesting constraints on measurable quantities. More precisely, we find that the gluino mass ($M_3$) and the chargino mass ($M_{χ^{\\pm}}$) cannot be much higher than their present experimental lower bounds ($M_3\\stackrel{<}{{}_\\sim}285\\ $GeV ; $M_{χ^\\pm}\\stackrel{<}{{}_\\sim}80\\ $GeV), while squark and slepton masses must be much larger ($\\stackrel{>}{{}_\\sim} 1\\ $TeV). This can be considered as an observational signature of this kind of stringy scenarios. Besides, the top mass is constrained to be within a range ($80\\ $GeV$\\stackrel{<}{{}_\\sim}m_t\\stackrel{<}{{}_\\sim}165\\ $GeV) △ Less", "We show that supersymmetry automatically leads to density fluctuations $ΔT/T\\sim6\\times10^{-6}$ in agreement with the recent COBE measurement. △ Less", "We review the theoretical and experimental status of minimal grand unified theories (GUTS), contrasting the failure of minimal non-supersymmetric $SU(5)$ with the success of the minimal supersymmetric $SU(5)$ and minimal supersymmetric Flipped $SU(5)\\times U(1)$ models. We show that a reasonable value for the universal soft supersymmetry-breaking gaugino mass, $45\\GeV<m_{1/2}<1\\TeV$, and a $1-σ$ range of the other inputs constrains the strong coupling, $\\as>.114$. We define the supersymmetric standard model (SSM), the minimal supersymmetric extension of the standard model with gauge coupling unification and universal soft supersymmetry-breaking at the unification scale, as a baseline model for unified theories. We review the structure of the allowed parameter space of the SSM and suggest sparticle spectroscopy as the experimental means to determine the parameters of the SSM and search for departures from the baseline SSM. △ Less", "We extend a fermion mass matrix Ansatz by Giuduce to include neutrino masses. The previous predictions are maintained. With two additional parameters, a large Majorana neutrino mass and a hierarchy factor, we have seven {\\it further} low energy predictions: the masses of the neutrinos, the mixing angles and the phase in the leptonic sector. We choose a reasonable hierarchy of Majorana masses and fit the overall mass scale according to a solution of the solar neutrino problem via the MSW mechanism, which is in agreement with the $^{37}Cl$, Kamiokande, and GALLEX data. We then also obtain a cosmologically interesting tau-neutrino mass. △ Less", "The status of coupling constant unification in the standard model and its supersymmetric extension are discussed. Uncertainties associated with the input coupling constants, $m_{t}$, threshold corrections at the low and high scales, and possible nonrenormalizable operators are parametrized and estimated. A simple parametrization of a general supersymmetric new particle spectrum is given. It is shown that an effective scale $M_{SUSY}$ can be defined, but for a realistic spectrum it may differ considerably from the typical new particle masses. The implications of the lower (higher) values of $α_{s}(M_{Z})$ suggested by low-energy ($Z$-pole) experiments are discussed. △ Less", "We make a numerical study of gauge and Yukawa unification in supersymmetric grand unified models and examine the quantitative implications of fermion mass ansätze at the grand unified scale. Integrating the renormalization group equations with $α_1(M_Z)$ and $α_2(M_Z)$ as inputs, we find $α_3(M_Z)\\simeq 0.111 (0.122)$ for $M_{SUSY}^{}=m_t$ and $α_3(M_Z)\\simeq 0.106 (0.116)$ for $M_{SUSY}^{}=1$ TeV at one-loop (two-loop) order. Including $b$ and $τ$ Yukawa couplings in the evolution, we find an upper limit $m_t\\ltap 200$ GeV from Yukawa unification. For given $m_t\\ltap 175$ GeV, there are two solutions for $β$, one with $\\tan β> m_t/m_b$, and one with $\\sin β\\simeq 0.78(m_t/150\\;{\\rm GeV})$. Taking a popular ansatz for the mass matrices at the unified scale, we obtain a lower limit on the top quark mass of $m_t\\gtap 150 (115)$ GeV for $α_3(M_Z)=0.11 (0.12)$ and an upper limit on the supersymmetry parameter $\\tan β\\ltap 50$ if $α_3(M_Z)=0.11$. The evolution of the quark mixing matrix elements is also evaluated. △ Less", "We make a detailed analysis on the nucleon decay in the minimal supersymmetric $SU(5)$ grand unified model. We find that a requirement of the unification of three gauge coupling constants leads to a constraint on a mass $M_{H_C}$ of color-triplet Higgs multiplet as $2 \\times 10^{13}~\\GeV \\leq M_{H_C} \\leq 2 \\times 10^{17}~\\GeV$, taking both weak- and GUT-scale threshold effects into account. Contrary to the results in the previous analyses, the present experimental limits on the nucleon decay turn out to be consistent with the SUSY particles lighter than 1~TeV even without a cancellation between matrix elements contributed from different generations, if one adopts a relatively large value of $M_{H_C}$ ($\\ge2\\times 10^{16}~\\GeV$). We also show that the Yukawa coupling constant of color-triplet Higgs multiplet does not necessarily blow up below the gravitational scale ($2.4\\times10^{18}~\\GeV$) even with the largest possible value of $M_{H_C}$. We point out that the no-scale model is still viable, though it is strongly constrained. △ Less", "We compute the cosmic relic (dark matter) density of the lightest supersymmetric particle (LSP) in the framework of minimal $N=1$ Supergravity models with radiative breaking of the electroweak gauge symmetry. To this end, we re--calculate the cross sections for all possible annihilation processes for a general, mixed neutralino state with arbitrary mass. Our analysis includes effects of all Yukawa couplings of third generation fermions, and allows for a fairly general set of soft SUSY breaking parameters at the Planck scale. We find that a cosmologically interesting relic density emerges naturally over wide regions of parameter space. However, the requirement that relic neutralinos do not overclose the universe does not lead to upper bounds on SUSY breaking parameters that are strictly valid for all combinations of parameters and of interest for existing or planned collider experiments; in particular, gluino and squark masses in excess of 5 TeV cannot strictly be excluded. On the other hand, in the ``generic'' case of a gaugino--like neutralino whose annihilation cross sections are not ``accidentally'' enhanced by a nearby Higgs or $Z$ pole, all sparticles should lie within the reach of the proposed $pp$ and $e^+e^-$ supercolliders. We also find that requiring the LSP to provide all dark matter predicted by inflationary models imposes a strict lower bound of 40 GeV on the common scalar mass $m$ at the Planck scale, while the lightest sleptons would have to be heavier △ Less", "Constraints on the core temperature (T_c) of the Sun and on neutrino- oscillation parameters are obtained from the existing solar neutrino data, including the recent GALLEX and Kamiokande III results. (1) A purely astrophysical solution to the solar neutrino problem is strongly disfavored by the data: the best fit in a cooler Sun model requires an 8% reduction in T_c, but the chi-sqaured test rejects this hypothesis at 99.99% C.L., suggesting new neutrino physics. (2) Assuming the Standard Solar Model (SSM) and MSW oscillations, the MSW parameters are constrained to two small regions: one in the non-adiabatic region and the other in the large-mixing region. The non-adiabatic solution gives a considerably better fit. For nu_e oscillations into sterile neutrinos, the allowed region (90%) is constrained to non- adiabatic oscillations. As long as the SSM is assumed, the neutrino mixing angles are at least four times larger, or considerably smaller, than the corresponding quark mixing angles. (3) Allowing both MSW oscillations and a non-standard core temperature, a) the experiments determine the core temperature at the 5% level, yielding a value consistent with the SSM prediction. b) When T_c is used as a free parameter, the allowed MSW region is broadened: a cooler Sun (T_c=0.95) allows mass and mixing implied by the SUSY SO(10) GUT, while a warmer Sun (T_c=1.05) allows parameter space suggested by intermediate-scale SO(10) GUTs. Superstring-inspired models are consistent with all solutions. (4) From the narrowed parameter space, we predict the neutrino spectral shape which should be observed in SNO. Throughout the calculation we use the latest Bahcall-Pinsonneault SSM, and include nuclear and astrophysical uncertainties in a simplified, but physically transparent way. △ Less", "The lightest CP-even Higgs boson $h$ in the minimum supersymmetric standard model (MSSM) has a mass upper bound depending on the top quark and squark masses. An $e^+e^-$ collider with enough energy and luminosity to produce $h+Z$ at measurable rates up to the maximum $h$ mass would cover the entire MSSM parameter space, if $h+A$ production was also searched for. We explore the energy and/or luminosity needed for various top quark and squark masses. For $m_t=150$\\,GeV and 1\\,TeV SUSY mass scale, a 230\\,GeV collider with 10\\,fb$^{-1}$ luminosity would suffice. △ Less", "Barbieri and Hall have argued that threshold effects at the scale of grand-unification wipe out predictions on the SUSY scale, M_S. Using triviality arguments we give upper bounds on ultraheavy particles, while proton stability gives lower bounds on the mass of the higgs color-triplet. We find no useful lower bound on the $Σ$ supermultiplet, but if the strong coupling constant is as large as recent experiments suggest, unification in the minimal SUSY SU(5) model requires that the $Sigma$ masses be $\\sim 10^{-7}M_V$ and that the color octet and weak triplet be split in mass by a factor of $\\sim$100. △ Less", "Assuming that perturbative QCD is the dominant explanation for the narrowness of the vector quarkonia, we perform a $χ^2$ minimization analysis of their hadronic decays as a function of two parameters, the mass of the gluino and the value of $α_3(M_Z)$. A value below 1 GeV for the gluino mass is strongly preferred. Consequences for SUSY breaking scenarios are discussed. △ Less", "Models with dynamical supersymmetry breaking have the potential to solve many of the naturalness problems of hidden sector supergravity models. We review the argument that in a generic supergravity theory in which supersymmetry is {\\it dynamically} broken in the hidden sector, only tiny Majorana masses for gauginos are generated. This situation is similar to that of theories with continuous R-symmetries, for which Hall and Randall have suggested that gluino masses could arise through mixings with an octet of chiral fields. We note that in hidden sector models, such mixing can only occur if the auxiliary D field of a $U(1)$ gauge field has an expectation value. This in turn gives rise to a catastrophically large Fayet-Iliopoulos term for ordinary hypercharge. To solve this problem it is necessary to unify hypercharge at least partially in a non-Abelian group. We consider, also, some general issues in models with continuous or discrete R symmetries, noting that it may be necessary to include $SU(2)$ triplet fields, and that these are subject to various constraints. In the course of these discussions, we consider a number of naturalness problems. We suggest that the so-called ``$μ$-problem\" is not a problem, and point out that in models in which the axion decay constant is directly related to the SUSY breaking scale, squarks, sleptons and Higgs particles generically acquire huge masses. △ Less", "We re-examine the gravitational wave background resulting from inflation and its effect on the cosmic microwave background radiation. The new COBE measurement of a cosmic background quadrupole anisotropy places an upper limit on the vacuum energy during inflation of $\\approx 5 \\times 10^{16}$ GeV. A stochastic background of gravitational waves from inflation could produce the entire observed signal (consistent with the observed dipole anisotropy and a flat spectrum) if the vacuum energy during inflation was as small as $1.5 \\times 10^{16}$ GeV at the 95\\% confidence level. This coincides nicely with the mass scale for Grand Unification inferred from precision measurements of the electroweak and strong coupling constants, for the SUSY Grand Unified Theories. Thus COBE could be providing the first direct evidence, via gravitational waves, for GUTs, and supersymmetry. Further tests of this possibility are examined, based on analyzing the energy density associated with gravitational waves from inflation. △ Less", "We refute the claims made by Chaichian and Smilga in a recent paper in Phys Rev Letters on the impossibility of spontaneous R Parity breaking. Apart from explaining their error we summarize the results of a more detailed work that demonstrates explicitly that R parity can break spontaneously at a scale anywhere in the range 10 GeV to 1 Tev in a simple extension of the minimal SUSY standard model proposed previously. △ Less"]