["\\def\\nle{{\\stackrel{<}{\\sim}}} We examine a possibility for existence of a light supersymmetric partner of the top quark (stop) with mass 15 $\\sim$ 16 GeV in the framework of the minimal supergravity GUT model. Such light stop could explain the slight excess of the high $p_{T}$ cross section of the $D^{*\\pm}$-meson production in two-photon process at TRISTAN. We point out that the existence of such stop could change the dominant decay mode of gluino and could weaken substantially present experimental bounds on the mass of gluino. It seems that there is a finite parameter region allowing existence of such light stop even if we consider the present experimental data. Inversely, if such light stop was discovered at TRISTAN, masses and mixing parameters of the other SUSY partners as well as masses of the Higgs and the top will be severely constrained, for example, $m_{\\tilde{g}}\\simeq$85GeV, $m_{\\tilde{W_{1}}}\\nle$50GeV, 110GeV$\\nle m_{\\tilde{\\ell}}\\nle$140GeV, 120GeV$\\nle m_{\\tilde{q}}\\nle$160GeV, $θ_{t}\\simeq0.9$, $m_{h}\\nle$ 65GeV and 130GeV$\\nle m_{t}\\nle$140GeV. We also discuss briefly the proton decay and the dark matter constraints. △ Less", "I present a model for inflation based on the gaugino-dilaton dynamics of supersymmetry breaking. The inflaton is the dimension--1 scalar field $φ$ related to the gaugino condensate via $λ^Tλ=φ^3.$ Recent work in this area is used to obtain two significant results: (1) Scalar density fluctuations at second horizon crossing are generated on scale $λ$ with amplitude \\[ \\drr=A\\cdot \\ 10^3\\cdot\\ \\left(\\frac{m_{SUSY}}{m_{Pl}}\\right)^{\\half}\\ \\left(\\fracλ{100\\ \\mbox{Mpc}}\\right)^{0.03}\\ \\ , \\] where $A$ is a constant which depends on (unknown) details of gaugino-dilaton dynamics in the strong-coupling phase. Agreement with COBE results is obtained if $A\\simeq 2.$ \\ (2) Due to mixing with hidden sector glueballs, the dilaton mass is large $(\\sim \\left(\\mp\\ \\ms^2\\right)^ {\\frac{1}{3}}\\sim 10^8\\ \\mbox{GeV}),$ and reheating takes place at $T\\sim 1\\tev.$ This {\\em necessitates} that the presently observed baryon asymmetry be generated at a cosmic temperature below 1 TeV. △ Less", "Taking seriously phenomenological indications for supersymmetry, we have made a detailed study of unified minimal SUSY, including effects at the few percent level in a consistent fashion. We report here a general analysis without choosing a particular unification gauge group. We find that the encouraging SUSY unification results of recent years do survive the challenge of a more complete and accurate analysis. Taking into account effects at the 5-10% level leads to several improvements of previous results, and allows us to sharpen our predictions for SUSY in the light of unification. We perform a thorough study of the parameter space. The results form a well-defined basis for comparing the physics potential of different facilities. Very little of the acceptable parameter space has been excluded by LEP or FNAL so far, but a significant fraction can be covered when these accelerators are upgraded. A number of initial applications to the understanding of the SUSY spectrum, detectability of SUSY at LEP II or FNAL, BR($b\\to sγ$), Width($Z\\to b\\bar b$), dark matter, etc, are included in a separate section. We formulate an approach to extracting SUSY parameters from data when superpartners are detected. For small tan(beta) or large $m_top$ both $M_half$ and $M_0$ are entirely bounded from above at O(1 tev) without having to use a fine-tuning constraint. △ Less", "In the SUSY GUT scenario, it is natural to assume the right-handed-neutrino Majorana-mass scale to be $10^{16}$ GeV. This will in principle lead, by the seesaw mechanism, to a $ ν_τ $ mass of order $ m_t^2 / (10^{16}\\, {\\rm GeV}) \\sim 3 \\times 10^{-3}\\, {\\rm eV} $. This suggests that the solution of the solar-neutrino puzzle should be either the MSW effect in $ν_e$--$ν_τ$ oscillations, with $ m_{ν_τ}^2 \\sim 10^{-5}\\, {\\rm eV}^2 $, or long-wavelength $ν_e$--$ν_μ$ oscillations, with $ m_{ν_μ}^2 \\sim 10^{-10}\\, {\\rm eV}^2 $. These solutions require unexpectedly large mixings of $ ν_e $ with $ ν_τ $ and $ ν_μ $, respectively. I suggest a variation of the Dimopoulos--Hall--Raby model for the fermion mass matrices which can accomodate such large mixings. △ Less", "After a brief review of the flavour problem we present a new predictive framework based on SUSY $SO(10)$ theory, where the first family plays a role of the mass unification point. The inter-family hierarchy is first generated in a sector of superheavy fermions and then transfered in an inverse way to ordinary quarks and leptons by means of the universal seesaw mechanism. The obtained mass matrices are simply parametrized by two small coefficients which can be given by the ratio of the GUT and superstring compactification scales. The model allows a natural (without fine tuning) doublet-triplet splitting. It has a strong predictive power, though no special texture is utilized in contrast to the known predictive frameworks. Namely, the model implies that $m_b=4-5$ GeV, $m_s=100-150$ MeV, $m_u/m_d=0.5-0.7$ and $\\tanβ<1.1$. The Top quark is naturally in the 100 GeV range, but not too heavy: $m_t<150$ GeV. All CKM mixing angles are in correct range. The Higgsino mediated $d=5$ operators for the proton decay are naturally suppressed. {On the basis of talks given at the XVI International Warsaw Meeting on Elementary Particle Physics \"New Physics with New Experiments\", Kazimierz, Poland, 24-28 May 1993, and at the II Gran Sasso Summer Institute \"From Particle Physics to Cosmology\", Gran Sasso National Laboratory, Italy, 6-17 September 1993.} △ Less", "We examine the radiative corrections to the mass of the lightest Higgs boson in the minimal supersymmetric extension of the standard model. We use the renormalization-group improved effective potential which includes the next-to-leading-order contributions. We find that, contrary to the result of Espinosa and Quirós, the higher-order corrections to the lightest Higgs boson mass are non-negligible, adding $3-11$ GeV ($3-9$ GeV) to the result in the leading logarithm approximation for the range of top quark mass $100 {\\rm GeV} < m_t < 200 {\\rm GeV}$ and for the supersymmetric breaking scale $M_{\\rm SUSY} = 1 {\\rm TeV}$ ($M_{\\rm SUSY} = 10 {\\rm TeV}$). Also we find that our result is stable under the change of the renormalization parameter $t$. △ Less", "In supersymmetric models, there are new CP violating phases which, if unsuppressed, would give a too large neutron electric dipole moment. We examine the possibility of small SUSY phases in string-inspired supergravity models in which supersymmetry is broken by the auxiliary components of the dilaton and moduli superfields. It is found that the SUSY phases can be suppressed by a small factor governing the breakdown of the approximate Peccei Quinn symmetries nonlinearly realized for the moduli superfields that participate in supersymmetry breaking. In many cases, the symmetry breaking factors are exponentially small for moderately large values of the moduli, leading to small phase values in a natural way. △ Less", "The scaling behavior and fixed points in the evolution of fermion Yukawa couplings and mixing angles are discussed. The relevance of fixed points in determining the top quark mass is described. △ Less", "The determination of the most straightforward evidence for the existence of the Superworld requires a guide for non-experts (especially experimental physicists) for them to make their own judgement on the value of such predictions. For this purpose we review the most basic results of Super-Grand unification in a simple and clear way. We focus the attention on two specific models and their predictions. These two models represent an example of a direct comparison between a traditional unified-theory and a string-inspired approach to the solution of the many open problems of the Standard Model. We emphasize that viable models must satisfy {\\em all} available experimental constraints and be as simple as theoretically possible. The two well defined supergravity models, $SU(5)$ and $SU(5)\\times U(1)$, can be described in terms of only a few parameters (five and three respectively) instead of the more than twenty needed in the MSSM model, \\ie, the Minimal Supersymmetric extension of the Standard Model. A case of special interest is the strict no-scale $SU(5)\\times U(1)$ supergravity where all predictions depend on only one parameter (plus the top-quark mass). A general consequence of these analyses is that supersymmetric particles can be at the verge of discovery, lurking around the corner at present and near future facilities. This review should help anyone distinguish between well motivated predictions and predictions based on arbitrary choices of parameters in undefined models. △ Less", "A new procedure is developed which enables one to start from the quark and lepton mass and mixing data at the low scale and construct mass matrices which exhibit simple SO(10) structure at the SUSY GUT scale. This approach is applied to the present data involving quark and charged lepton masses, the CKM mixing matrix and the MSW solar neutrino and atmospheric neutrino depletion effects. In terms of just 12 model parameters suggested by the procedure for the 5 mass matrices, we can reproduce 15 masses and 8 mixing parameters remarkably consistent with the input starting values. △ Less", "The isolated like sign dilepton signature for gluino production is investigated at the LHC energy for the $R$ conserving as well as the $L$ and $B$ violating SUSY models over a wide range of the parameter space. One gets viable signals for gluino masses of 300 and 600 GeV for both $R$ conserving and $L$ violating models, while it is less promising for the $B$ violating case. For a 1000 GeV gluino, the $L$ violating signal should still be viable; but the $R$ conserving signal becomes too small at least for the low luminosity option of LHC. △ Less", "Linear collider designs are optimized for \\ep\\ collisions. However, from the physics point of view, \\lc s may also be advantageously operated in an \\ee, \\eg\\ or \\pp\\ mode. These options, which have not been available up to now, will provide unique tests of the \\sm\\ and of physics beyond it. As an example, we review the prospects for discovering and studying \\susy\\ at linear colliders in \\ee, \\eg\\ and \\pp\\ collisions. In particular, we argue that \\ee\\ scattering is much better suited than \\ep\\ annihilation for discovering \\sel s or \\co s. △ Less", "Prospects for SO(10) as a minimal grand unification group have recently been heightened by several considerations such as the MSW resolution of the solar neutrino puzzle, baryogenesis, possibility for understanding fermion masses etc. I review the present status of the minimal SO(10) models with special emphasis on the predictions for proton lifetime and predictions for neutrino masses for the non-supersymmetric case and discuss some preliminary results for the supersymmetric case. It was generally believed that minimal SO(10) models predict wrong mass relations between the charged fermions of the first and second generations; furthermore, while the smallness of the neutrino masses in these models arises from the see-saw mechanism, it used to be thought that detailed predictions for neutrino masses and mixings require further adhoc assumptions. In this talk, I report some recent work with K.S.Babu, where we discovered that the minimal SO(10) model, both with and without SUSY, has in it a built-in mechanism that not only corrects the bad mass relations between the charged fermions but at the same time allows a complete prediction for the masses and mixings in the neutrino sector. We define our minimal model as the one that consists of the smallest set of Higgs multiplets that are needed for gauge symmetry breaking. Our result is based on the hypothesis that the complex {\\bf 10} of Higgs bosons has only a single coupling to the fermions. This hypothesis is guaranteed in supersymmetric models and in non-SUSY models that obey a softly broken Peccei-Quinn symmetry. △ Less", "We calculate the region of the MSSM parameter space (i.e. $M_{1/2}$, $m_{0}$, $μ$, \\ldots) compatible with a correct electroweak breaking and a realistic top-quark mass. To do so we have included {\\em all} the one-loop corrections to the effective potential $V_{1}$ and checked their importance in order to obtain consistent results. We also consider the fine-tuning problem due to the enormous dependence of $M_{Z}$ on $h_{t}$ (the top Yukawa coupling), which is substantially reduced when the one-loop effects are taken into account. We also explore the reliability of the so-called \"standard\" criterion to estimate the degree of fine-tuning. As a consequence, we obtain a new set of upper bounds on the MSSM parameters or, equivalently, on the supersymmetric masses perfectly consistent with the present experimental bounds. △ Less", "In this paper we study and compare susy unification using two different approaches in order to take into account the effect of light particle thresholds on the evolution of gauge couplings: the step--function approximation, on the one hand, and a mass dependent procedure, which gives a more accurate description of the dependence of the results on the masses, on the other. We also include the effect of heavy thresholds, when $SU(5)$ is chosen as the unifying group. We find that the mass--dependent procedure excludes scenarios where all susy masses are below $1\\;TeV$, and favors a value of $α_3(m_Z)$ near its upper experimental bound, contrary to the results obtained with the step--function approximation. We underline the dependence of the results on the procedure chosen to deal with light thresholds. △ Less", "In the Minimal Supersymmetric Standard Model (MSSM) the existence of an upper bound on the mass of the $CP=+1$ lightest Higgs boson, equal to $m_Z$ at tree--level and $\\simlt 120\\ GeV$ after the inclusion of radiative corrections, has important phenomenological consequences for Higgs searches. A similar bound, independent of mass parameters other than the electroweak scale, can be calculated in supersymmetric models with an extended Higgs sector. In models with arbitrary Higgs sectors perturbative up to $10^{16}\\ GeV$, we find, including radiative corrections, $m_h \\simlt 155\\ GeV$ for $m_t \\simlt 190\\ GeV$. △ Less", "We point out a connection between R symmetry and \\susy\\ breaking. We show that the existence of an R symmetry is a necessary condition for \\susy\\ breaking and a spontaneously broken R symmetry is a sufficient condition provided two conditions are satisfied. These conditions are: {\\it genericity}, \\ie\\ the effective Lagrangian is a generic Lagrangian consistent with the symmetries of the theory (no fine tuning), and {\\it calculability}, \\ie\\ the low energy theory can be described by a supersymmetric Wess-Zumino effective Lagrangian without gauge fields. All known models of dynamical supersymmetry breaking possess such a spontaneously broken R symmetry and therefore contain a potentially troublesome axion. However, we use the fact that genericity is {\\it not} a feature of supersymmetric theories, even when nonperturbative renormalization is included, to show that the R symmetry can in many cases be explicitly broken without restoring supersymmetry and so the axion can be given an acceptably large mass. △ Less", "\\def\\nle{{\\stackrel{<}{\\sim}}} We examine a possibility for existence of a light supersymmetric partner of the top quark (stop) with mass 15 $\\sim$ 20 GeV in the framework of the minimal supergravity GUT model. Such light stop could explain the slight excess of the high $p_{T}$ cross section of the $D^{*\\pm}$-meson production in two-photon process at TRISTAN. We point out that the existence of such stop could change the dominant decay mode of some particles and could weaken substantially present experimental bounds on the supersymmetric parameter space. It seems that there is a finite parameter region allowing existence of the light stop even if we consider the present experimental data. Inversely, if the light stop was discovered at TRISTAN, masses and mixing parameters of the other SUSY partners as well as masses of the Higgs and the top will be severely constrained, for example, $m_{\\tilde{g}} \\simeq$75GeV, $m_{\\tilde{W_{1}}}\\nle$55GeV, 90GeV$\\nle m_{\\tilde{\\ell}} \\nle$130GeV, 100GeV$\\nle m_{\\tilde{q}}\\nle$150GeV, $m_{h}\\nle$60GeV and 115GeV$\\nle m_{t}\\nle$135GeV. Some phenomenological implications on the present and future experiments are also discussed. △ Less", "We discuss the effect of the renormalization procedure in the computation of the unification point for running coupling constants. We explore the effects of threshold--crossing on the $β$--functions. We compute the running of the coupling constants of the Standard Model, between $m_Z$ and $M_P$, using a mass dependent subtraction procedure, and then compare the results with $\\bar{MS}$, and with the $θ$-- function approximation. We also do this for the Minimal Supersymmetric extension of the Standard Model. In the latter, the bounds on susy masses that one obtains by requiring perturbative unification are dependent, to some extent, on the procedure. △ Less", "The full parameter space of supergravity grand unified theory with $SU(5)$ type $p \\rightarrow \\barν K$ proton decay is analysed using renormalization group induced electroweak symmetry breaking under the restrictions that the universal scalar mass $m_o$ and gluino mass are $\\leq 1$ TeV (no extreme fine tuning) and the Higgs triplet mass obeys $M_{H_3}/M_G < 10$. Future proton decay experiments at SuperKamiokande or ICARUS can reach a sensitivity for the $\\barν K$ mode of $(2-5) \\times 10^{33}$ yr allowing a number of predictions concerning the SUSY mass spectrum. Thus either the $p \\rightarrow\\barν K$ decay mode will be seen at these experiments or a chargino of mass $m_{\\tilde{W}} < 100$ GeV will exist and hence be observable at LEP2. Further, if $(p \\rightarrow \\barν K) > 1.5 \\times 10^{33}$ yr, then either the light Higgs has mass $m_h \\leq 95$ GeV or $m_{\\tilde{W}} \\leq 100$ GeV i.e. either the light Higgs or the light chargino (or both) would be observable at LEP2. Thus, the combination of future accelerator and future underground experiments allow for strong experimental tests of this theory. △ Less", "The neutralino relic abundance is evaluated for a wide range of the neutralino mass, ${\\rm 20\\ GeV} \\leq m_χ\\leq {\\rm 1\\ TeV}$, by taking into account the full set of final states in the neutralino-neutralino annihilation. The analysis is performed in the Minimal SuSy Standard Model; it is not restricted by stringent GUT assumptions but only constrained by present experimental bounds. We also discuss phenomenological aspects which are employed in the companion paper (II. Direct Detection) where the chances for a successful search for dark matter neutralino are investigated. △ Less", "Several independent constraints on the minimal supersymmetric model with constraints from grand unifications and cosmology select the region of low-energy supersymmetry below ${\\cal O}$(1~TeV). The resulting mass of the lightest Higgs boson can probably be covered at LEP II only if its beam energy exceeds 200~GeV, and is within the detectability range of the NLC with $\\sqrt{s}=300$~GeV. △ Less", "Standard (level one) heterotic string models with standard model gauge group predict the unification of $SU(3)$ and $SU(2)$ gauge couplings whereas the $U(1)$ factor is unified modulo an unknown normalization factor $k_1$. On the other hand the unification mass is known. I argue that this situation is quite analogous (though opposite) to that in SUSY-GUTs in which the $U(1)$ normalization is known ($k_1=5/3$) but the unification mass $M_X$ is unknown. I emphasize that $k_1$ should be taken as a free parameter in the string approach (quite in the same way as $M_X$ is taken as a free parameter in SUSY-GUTs). If this is done, the success of the string approach concerning gauge coupling unification is comparable to that in SUSY-GUTs △ Less", "I analyze the predictions for the strong gauge coupling, $α_3(M_Z) $, and the top quark and light Higgs masses in the framework of gauge and bottom-tau Yukawa coupling unification in the minimal supersymmetric standard model. These predictions depend on the effective supersymmetric threshold scale $T_{SUSY}$, which is only very slightly dependent on the squark and slepton masses, and strongly dependent on the Higgsino masses as well as on the mass ratio of the gauginos of the strong and weak interactions. Within the minimal supersymmetry breaking scheme and for supersymmetric masses below or of the order of 1 TeV, I obtain $α_3(M_Z) \\geq 0.116$, while, if the running bottom quark mass at the physical mass is constrained to be $ m_b(M_b) \\leq 4.1 $GeV, then, for moderate values of $\\tan β$, perturbative unification is achieved only if $α_3(M_Z) \\leq 0.124$. Unification of gauge and bottom-tau Yukawa couplings yield predictions for the top quark mass, 140 GeV $\\leq M_t \\leq 210 $ GeV for $1 \\leq \\tan β\\leq 30$, which are remarkably close to the infrared quasi fixed point values for this quantity. For the light Higgs mass I obtain $m_h \\leq 130(165)$ GeV if the characteristic squark mass is below 1 (10) TeV. △ Less", "We compute the supersymmetric contribution to the anomalous magnetic moment of the muon within the context of $SU(5)\\times U(1)$ supergravity models. The largest possible contributions to $a^{susy}_μ$ occur for the largest allowed values of $\\tanβ$ and can easily exceed the present experimentally allowed range, even after the LEP lower bounds on the sparticle masses are imposed. Such $\\tanβ$ enhancement implies that $a^{susy}_μ$ can greatly exceed both the electroweak contribution ($\\approx1.95\\times10^{-9}$) and the present hadronic uncertainty ($\\approx\\pm1.75\\times10^{-9}$). Therefore, the new E821 Brookhaven experiment (with an expected accuracy of $0.4\\times10^{-9}$) should explore a large fraction (if not all) of the parameter space of these models, corresponding to slepton, chargino, and squarks masses as high as 200, 300, and 1000 GeV respectively. Moreover, contrary to popular belief, the $a^{susy}_μ$ contribution can have either sign, depending on the sign of the Higgs mixing parameter $μ$: $a^{susy}_μ>0\\,(<0)$ for $μ>0$ ($μ<0$). The present $a_μ$ constraint excludes chargino masses in the range $45-120\\GeV$ depending on the value of $\\tanβ$, although there are no constraints for $\\tanβ\\lsim8$. We also compute $a^{susy}_τ$ and find $|a^{susy}_τ|\\approx(m_τ/m_μ)^2\\,|a^{susy}_μ|\\lsim10^{-5}$ and briefly comment on its possible observability. △ Less", "An introduction to the most important concepts in the subject of supersymmetric unified theories is presented. The emphasis is on the practical aspects leading to state-of-the-art calculations in this renascent subject. The topics covered include: generalities of supersymmetric unified theories, gauge and Yukawa coupling unification including the most up-to-date numerical analyses, soft supersymmetry breaking, and radiative electroweak symmetry breaking enforced using the tree-level and one-loop effective potentials. This class of supersymmetric models can be described in terms of five parameters: the top-quark mass ($m_t$), the ratio of Higgs vacuum expectation values ($\\tanβ$), and three universal soft-supersymmetry-breaking parameters ($m_{1/2},m_0,A$). Thus, highly correlated predictions can be expected for all conceivable experimental observables. In effect, these general models provide a basic framework upon which more constrained models can be built. △ Less", "We calculate the two-loop renormalization group equations for the running gaugino masses in general SUSY gauge models, improving our previous result. We also study its consequence to the unification of the gaugino masses in the SUSY SU(5) model. The two-loop correction to the one-loop relation $m_i(μ)\\proptoα_i(μ)$ is found to be of the order of a few \\%. △ Less", "Within the Minimal Supersymmetric Grand Unified Theory (MSGUT) masses of the predicted supersymmetric particles are constrained by the world averaged values of the electroweak and strong coupling constants, the lower limits on the proton lifetime,the lower limit on the lifetime of the universe, which implies an upper limit on the dark matter density, the electroweak symmetry breaking originating from radiative corrections due to the heavy top quark, and the ratio of the masses of the b-quark and tau-lepton. A combined fit shows that indeed the MSGUT model can satisfy all these constraints simultaneously and the corresponding values for all SUSY masses are given within the minimal model, taking into account the complete second order renormalisation group equations for the couplings and the one-loop corrections to the Higgs potential for the calculation of the Z-mass and the Higgs masses. These one-loop corrections to MZ have been derived explicitly as function of the stop- and top masses and found to be small for the best solution, but unnaturally large for the 90% C.L. upper limits on the SUSY masses. △ Less", "Present data indicates that the gluino (if it exists) must be heavier than about 95~GeV. During the next few years as the Tevatron integrated luminosity increases, gluino searches will be able to probe the mass range between 100 and 200~GeV. For masses in this range, a variety of gluino decay modes can provide viable signatures for gluino detection. Apart from the classic missing transverse energy signal, the detection of high transverse momentum like-sign dileptons may be the cleanest signature for gluino production. Other signatures such as the production of a hard photon in the gluino cascade decay may also play an important role in confirming the supersymmetric origin of events originating from gluino production and decay. △ Less", "Supersymmetry (SUSY) has many well known attractions, especially in the context of Grand Unified Theories (GUTs). SUSY stabilizes scalar mass corrections (the hierarchy problem), greatly reduces the number of free parameters, facilitates gauge coupling unification, and provides a plausible candidate for cosmological dark matter. In this conference report we survey some recent examples of progress in SUSY-GUT applications. △ Less", "An elementary method of determination of the character of the hot phase transition in 4d four-fermion NJL-type models is applied to non-supersymmetric and supersymmetric versions of simple NJL model. We find that in the non-susy case the transition is usually of the second order. It is weakly first order only in the region of parameters which correspond to fermion masses comparable to the cut-off. In the supersymmetric case both kinds of phase transitions are possible. For sufficiently strong coupling and sufficiently large susy-breaking scale the transition is always of the first order. △ Less", "I review the main properties of four-dimensional strings constructed with free-fermions on the world-sheet. In particular I discuss possible model independent low energy predictions related to the existence of states with fractional electric charges, the computation of the string unification scale, the string model building, and the perturbative approach to supersymmetry breaking which makes the spectacular prediction of a new large dimension at the TeV scale. △ Less", "Using a combination of renormalisation group and effective potential methods, we discuss the bound on the lightest CP-even Higgs boson mass $m_h$ in the next-to-minimal supersymmetric standard model. We find $m_h\\leq 146,139,149 \\ GeV$ for $m_t=90,140,190 \\ GeV$. △ Less", "We have used ISAJET 7.0/ISASUSY 1.0 to evaluate the rates and study distributions for trilepton events from the leptonic decays of charginos and neutralinos produced at the Fermilab Tevatron via the reaction, $p\\bar p\\rightarrow \\tilde{W_1} \\tilde{Z_2}$ + X for cuts inspired by the CDF and D0 experiments. We find that about 60\\% of these events do not contain any jets, and so should be easily identifiable over Standard Model backgrounds from $t\\bar{t}$ and WZ production, provided that the decay $\\tilde{Z_2}\\rightarrow\\tilde{Z_1}Z$ is kinematically inaccessible. We further show that, with suitable cuts, these backgrounds can be reduced to less than 1-2 $fb$ even if $n_{jet} = 1$, effectively increasing the SUSY sample by 50\\%. We confirm that the signal is only rate-limited, and that the Fermilab Tevatron after an accumulation of 100 $pb^{-1}$ of integrated luminosity will be able to explore parameters well beyond the range of LEP and, if sleptons are substantially lighter than squarks, close to the reach of LEP 200. △ Less", "Constraints from flavour changing neutral currents are discussed in the context of predictive Grand Unified Supersymmetric Theories. Uncertainties in the estimation of their amplitudes are minimized by using a successful mass matrix ansatz which predicts the arbitrary parameters of the Standard Model. Furthermore, Renormalization Group Equations are used in order to express the sparticle masses involved, in terms of the gaugino mass $m_{1/2}$, the universal scalar mass $m_0$ and the trilinear coupling $A$ at the GUT scale. Modifications in the low energy expressions for the squark masses due to a large top Yukawa coupling are also considered. The above results, reconciled with experimental limits are used to put lower bounds on the parameters $m_{1/2}$, $m_0$ and the low energy scalar masses. △ Less", "Supersymmetric (SUSY) theories are often thought to give large branching ratios for $b \\rightarrow s γ$ from charged Higgs loops. We show that in many cases chargino loop contributions can cancel those of the Higgs, and SUSY can give $B(b \\rightarrow s γ)$ at or below the \\SM\\ prediction. We show this occurs because the large stop mass splittings usually found in SUSY break a GIM mechanism suppression. These effects are strongly enhanced by large $\\tanβ$, so that $B(b \\rightarrow s γ)$ is very sensitive to the value of $\\tanβ$, contrary to what has been claimed. We also note that the supergravity relation $B_0 = A_0-1$ is somewhat disfavored over the general case. △ Less", "Summary Talk of the Workshop `Properties of SUSY particles' Erice, September 28 -- October 4, 1992. △ Less", "In a SUSY theory with a spontaneously broken global symmetry, G, if the scale of SUSY breaking, $M_s$ is smaller than the scale $M_G$ of the global symmetry, the Nambu-Goldstone boson, $χ$ is accompanied by two massive superpartners ( a fermionic, $Ψ_χ$ and a scalar $σ_χ$) with mass of order $M_s$. Cosmological considerations imply stringent constraints on the couplings of $Ψ_χ$ and $σ_χ$. Application of these considerations to the supersymmetric singlet Majoron model leads to an upper limit on the scale $V_{BL}$ of global $U(1)_{B-L}$ symmetry to be less than $10^4 GeV$, for resonable values of parameters in the theory. △ Less", "Recent developments in unifying treatment of domain wall configurations and their global space-time structure is presented. Domain walls between vacua of non-equal cosmological constant fall in three classes depending on the value of their energy density $σ$: (i) extreme walls with $σ=σ_{ext}$ are planar, static walls corresponding to the supersymmetric configurations, (ii) non-extreme walls with $σ>σ_{ext}$ are expanding bubbles with two insides, (iii) ultra-extreme walls with $σ<σ_{ext}$ are bubbles of false vacuum decay. As a prototype exhibiting all three types of configurations vacuum walls between Minkowski and anti-deSitter vacua are discussed. Space-times associated with these walls exhibit non-trivial causal structure closely related to the one of the corresponding extreme and non-extreme charged black holes, however, without singularities. Recently discovered extreme dilatonic walls, pertinent to string theory, are also addressed. They are static, planar domain walls with metric in the string frame being {\\it flat} everywhere. Intriguing similarities between the global space-time of dilatonic walls and that of charged dilatonic black holes are pointed out. △ Less", "In the last 20 years we have accumulated an enormous amount of data on elementary particles and their interactions. This data serves two purposes: to fix the phenomenological parameters of the Standard Model [SM] and to verify that the SM is an excellent description of nature. It is our goal to understand the origin of these many arbitrary parameters. In this talk we consider a supersymmetric [SUSY] SO(10) grand unified theory [GUT]. We present a straightforward procedure, incorporating a general operator analysis, which allows us to use low energy data to determine the fermionic sector of the theory at the GUT scale. △ Less", "Properties and experimental predictions of a broad class of supergravity grand unified models possessing an $SU(5)$-type proton decay and $R$ parity are described. Models of this type can be described in terms of four parameters at the Gut scale in addition to those of the Standard Model i.e. $m_o$ (universal scalar mass), $m_{1/2}$ (universal gaugino mass), $A_o$ (cubic soft breaking parameter) and $\\tanβ=<H_2>/<H_1>$. Thus the 32 SUSY masses can be expressed in terms of $m_o, m_{1/2}, A_o \\tanβ$ and the as yet unknown t-quark mass $m_t$. Gut thresholds are examined and a simple model leads to grand unification consistent with $p$-decay data when $0.114<α_3 (M_z)<0.135$, in agreement with current values of $α_3 (M_Z)$.Proton decay is examined for the superheavy Higgs triplet mass $M_{H_3}<10M_G(M_G\\simeq 1.5 \\times10^{16}$~GeV) and squarks and gluinos lighter than 1 TeV. Throughout most of the parameter space chargino-neutralino scaling relations are predicted to hold: $2m_{\\tilde{Z}_1}\\cong m_{\\tilde{W}_1}\\cong m_{\\tilde{Z}_2}, m_{\\tilde{W}_1}\\simeq(1/4)m_{\\tilde{g}}$ (for $μ>0$) or $m_{\\tilde{W}_1} \\simeq(1/3)m_{\\tilde{g}}$ (for $μ<0$), while $m_{\\tilde{W}_2}\\cong m_{\\tilde{Z}_3}\\cong m_{\\tilde{Z}_4}>>m_{\\tilde{Z}_1}$. Future proton decay experiments combined with LEP2 lead to further predictions, e.g. for the entire parameter space either proton decay should be seen at these or the$\\tilde{W}_1$ seen at LEP2. Relic density constraints on the $\\tilde{Z}_1$ further constrain the parameter space e.g. so that $m_t<165$~GeV, $m_h<105$~GeV, $m_{\\tilde{W}_1} <100$~GeV and $m_{\\tilde{Z}_1}<50$~GeV when $M_{H_3}/M_G < 6$. (Invited talk at Les Rencontres de Physique de la Vallee D'Aoste} △ Less", "The general SUSY soft breaking terms for a large class of phenomenologically relevant string scenarios (symmetric orbifolds) are given. They show a certain lack of universality, but not dangerous for flavor changing neutral currents. To get more quantitative results a specific SUSY breaking mechanism has to be considered, namely gaugino condensation in the hidden sector. Then, it turns out that squark and slepton masses tend to be much larger than scalar masses ($m_φ > 10 M_a$), which probably is a quite general fact. Experimental bounds and the requirement of a successful electroweak breaking without fine tuning impose further restrictions on the soft breaking terms. As a consequence the gluino and chargino masses should be quite close to their present experimental limits, whereas squark and slepton masses should be much higher (> 1 TeV). △ Less", "We review some recent results and future prospects in the phenomenology of Supersymmmetry. We discuss the searches for superpartner states, the searches for Higgs bosons in the minimal SUSY model, and additional parameter constraints arising in SUSY-GUT models. △ Less", "We investigate the sparticle production processes $eγ\\goto \\sele\\sz1$ and $γγ\\goto \\sfermion\\overline{\\sfermion}$ at high energy $eγ$ and $γγ$ colliders in the framework of the minimal supersymmetric standard model (MSSM). It will be shown that the $eγ$ colliders would be more suitable in searching for the heavy selectrons than $ee$ colliders because of the low mass threshold of the process $eγ\\goto \\sele\\sz1$. We show that the standard background processes $eγ\\goto νW$ and $eZ$ can be suppressed in terms of initial beam polarization as well as the kinematical cuts on the energy and angle of the final electron. Moreover, it will be argued that the experimental measurements of the cross sections for the processes $eγ\\goto \\sele\\sz1$ and $γγ\\goto \\sfb\\sf$ could enable us to constrain the basic parameters in the MSSM. This is originated from the simplicity of SUSY parameter dependence of these processes. We also give comments on the stop production at $e^{+}e^{-}$ colliders with the longitudinally polarized electron beams. △ Less", "We evaluate the SUSY and top threshold effects in the context of the MSSM and the string derived model based on SU(4)$\\times$SU(2)$_L\\times$SU(2)$_R$. In both cases we run the two loop RGEs and determine the lower bounds of the supersymmetric particle masses, dictated by the experimentally accepted regions of the values of the low energy parameters. △ Less", "In supersymmetric Grand Unified Theories, proton decay mediated by the color--triplet higgsino is generally problematic and requires some fine--tuning of parameters. We present a mechanism which naturally suppresses such dimension 5 operators in the context of SUSY $SO(10)$. The mechanism, which implements natural doublet--triplet splitting using the adjoint higgs, converts these dimension 5 operators effectively into dimension 6. By explicitly computing the higgs spectrum and the resulting threshold uncertainties we show that the successful prediction of $\\sin^2θ_W$ is maintained {\\it as a prediction} in this scheme. It is argued that only a weak suppression of the higgsino mediated proton decay is achievable within SUSY $SU(5)$ without fine--tuning, in contrast to a strong suppression in SUSY $SO(10)$. △ Less", "The status of coupling constant unification (with and without a unification of Yukawa couplings) is discussed. Uncertainties associated with the input coupling constants, $m_{b}$ and $m_{t}$, threshold corrections at the low and high scale, and possible nonrenormalizable operators are described and a discrepancy between effective and physical scales is pointed out. Theoretical uncertainties in the predictions of $α_{s}(M_{Z})$, $m_{b}$, and the unification scale, $M_{G}$, are discussed and estimated. Constraints on the super-partner spectrum are found to be weak if uncertainties associated with the high-scale are included. However, requiring $h_{b} = h_τ$ at $M_{G}$ excludes $3 < \\tan β< 40$ (for $m_{t} < 200$ GeV). △ Less", "We review the physics assumptions and input used in ISAJET~7.0 / ISA\\-SUSY~1.0 that are relevant for simulating fundamental processes within the framework of the Minimal Supersymmetric Standard Model (MSSM) at $p\\bar p$ and $pp$ colliders. After a brief discussion of the underlying MSSM framework, we discuss event simulation and list the sparticle production processes and decay modes that have been incorporated into our calculations. We then describe how to set up and run an ISAJET / ISASUSY job and the user input and output formats. The ISAJET program is sufficiently flexible that some non-minimal supersymmetry scenarios may be simulated as well. Finally, plans for future upgrades which include the extension to $e^+ e^-$ collisions, are listed. △ Less", "A survey is made of some recent ideas and progress in the phenomenological applications of Supersymmetry (SUSY). We describe the success of SUSY-GUT models, the expected experimental signatures and present limits on SUSY partner particles, and the phenomenology of Higgs bosons in the minimal SUSY model.} △ Less", "We survey some recent ideas and progress in looking for particle physics beyond the Standard Model, connected by the theme of Supersymmetry (SUSY). We review the success of SUSY-GUT models, the expected experimental signatures and present limits on SUSY partner particles, and Higgs phenomenology in the minimal SUSY model. △ Less", "We are discussing some aspects of the magnetic monopoles and cosmic strings interactions with axion domain walss and membranes. The monopole moving through an axion domain wall is transformed into a monopole bag - the state with a dyon quantum number, but smaller mass. In the case of an axion membrane the passing monopole excites the chiral charged state at the membrane boundary. It will be shown that if cosmic string intersects an axion domain wall there will be $θ= π$, i.e. maximal $CP$-violation inside the string. Strings carrying the flux of the $Z$-boson field become the sources of the baryon charge nonconservation. The symbiosis of the two pictures - monopole passing through an axion domain wall and string intersecting it - is the case of the interaction between an axion domain wall and a Nambu electroweak string carrying $SU(2)_{L}$ monopoles at the ends. △ Less", "In minimal SUSY-GUT models with $M_{SUSY}\\alt 1$ TeV, the renormalization group equations have a solution dominated by the infrared fixed point of the top Yukawa coupling. This fixed point predicts $m_t\\simeq (200\\; {\\rm GeV})\\sin β$; combined with the LEP results it excludes $m_t\\alt 130$ GeV. For $m_t$ in the range 130--160 GeV, it predicts that the lightest scalar $h$ has mass 60--85 GeV (detectable at LEP\\,II). At SSC/LHC, each of the five scalars $h$, $H$, $A$, $H^{\\pm }$ may be detectable, but not all of them together; in one parameter region none would be detectable. △ Less", "In the standard model with two Higgs doublets it is shown that the existence of the electroweak Z-string in general requires the same characteristic length for the two Higgs fields as well as a specific ratio of the two Higgs vacuum expectation values, i.e. $\\tanβ$. This ratio can be determined in terms of the couplings in the Higgs potential. Some remarks on the supersymmetric case are given. \\noindent (Talk presented at SUSY '93, March 29-April 1st, Northeastern University, Boston, MA 02115, USA.) △ Less", "Precision electroweak measurements at LEP currently check the validity of the Standard Model to about one part in a thousand. Any successful model of physics beyond the Standard Model must be consistent with these observations. The impact of radiative corrections on the Minimal Supersymmetric Model (MSSM) is considered. The influence of supersymmetric particles on precision electroweak measurements is generally negligible since radiative corrections mediated by supersymmetric particles are suppressed by a factor of order $m_Z^2/M_{\\rm SUSY}^2$ (where $M_{\\rm SUSY}$ is the scale characterizing the scale of supersymmetric particle masses). However, there are a few pertinent exceptions. For example, the radiative corrections to the rare decay $b\\to sγ$ from charged Higgs and supersymmetric particle exchange can be of the same order as the Standard Model contribution. Large radiative corrections also lead to modifications of MSSM tree-level (natural) relations. The largest corrections of this type occur in the MSSM Higgs sector and are enhanced by powers of the top quark mass. The consequences of the radiatively corrected MSSM Higgs sector are briefly discussed. △ Less", "We discuss the large radiative corrections to the masses of supersymmetric Higgs bosons in the MSSM and in its simplest extension, the NMSSM, with particular attention paid to the bounds on the lightest CP-even Higgs mass found in both models. In the case of the MSSM, these corrections are found to be primarily associated with the effects top quark and stop squark loops, while for extended models they also include significant contributions from Higgs and Higgsino loops. (Talk presented at SUSY-93, Boston, March 1993) △ Less", "We discuss the upper bound on the lightest CP-even Higgs boson mass in the next-to-minimal supersymmetric standard model within the framework of a low energy renormalisation group analysis. We find $m_h$ < 146 GeV for $m_t$ = 90 GeV, decreasing to $m_h$ < 123 GeV for $m_t$ = 180 GeV. △ Less", "In minimal SUSY-GUT models with $M_{SUSY}\\ltap 1$ TeV, the renormalization group equations have a solution dominated by the infrared fixed point of the top Yukawa coupling. This fixed point predicts $m_t=(200\\; {\\rm GeV})\\sin β$; combined with the LEP results it excludes $m_t\\ltap 130$ GeV. For $m_t$ in the range 130-160 GeV, we discuss the sensitivity of the $m_t$ fixed point result to GUT threshold corrections and point out the implications for Higgs boson searches. The lightest scalar $h$ has mass 60-85 GeV and will be detectable at LEPII. At SSC/LHC, each of the five scalars $h$, $H$, $A$, $H^{\\pm }$ may be detectable, but not all of them together; in one parameter region none will be detectable. △ Less", "In addition to the very good theoretical motivations for supersymmetry, there are now at least nine phenomenological indications that nature is supersymmetric. All are indirect, so more is better. They are enumerated here. Some discussion is also given of models, of when and where superpartners might be directly detected, and of why the scale of supersymmetry cannot be pushed up if superpartners and SUSY Higgs bosons are not directly detected. △ Less", "Sparticle production and detection at HERA are studied within the recently proposed no-scale flipped $SU(5)$ supergravity model. Among the various reaction channels that could lead to sparticle production at HERA, only the following are within its limit of sensitivity in this model: $e^-p\\to \\tilde e^-_{L,R}χ^0_i+X, \\tilde ν_eχ^-_1+X$, where $χ^0_i(i=1,2)$ are the two lightest neutralinos and $χ^-_1$ is the lightest chargino. We study the elastic and deep-inelastic contributions to the cross sections using the Weizsäcker-Williams approximation. We find that the most promising supersymmetric production channel is right-handed selectron ($\\tilde e_{R}$) plus first neutralino ($χ^0_1$), with one hard electron and missing energy signature. The $\\tildeν_eχ^-_1$ channel leads to comparable rates but also allows jet final states. A right-handedly polarized electron beam at HERA would shut off the latter channel and allow preferentially the former one. With an integrated luminosity of ${\\cal L}=100\\ipb$, HERA can extend the present LEPI lower bounds on $m_{\\tilde e_R}, m_{\\tildeν_e},m_{χ^0_1}$ by $\\approx25\\GeV$, while ${\\cal L}=1000\\ipb$ will make HERA competitive with LEPII. We also show that the Leading Proton Spectrometer (LPS) at HERA is an excellent supersymmetry detector which can provide indirect information about the sparticle masses by measuring the leading proton longitudinal momentum distribution. △ Less", "This is a phenomenological review of $R$ parity violating SUSY models, with particular emphasis on explicit $R$ parity violation. △ Less", "After an introduction to the Higgs sector of supersymmetric extensions of the Standard Model, recent results on radiative corrections to Higgs boson masses and couplings are reviewed. The phenomenology of supersymmetric Higgs searches at large hadron colliders and at a possible linear $\\epem$ collider is also described. (Invited talk at the Workshop `Ten years of SUSY confronting experiment', CERN, 7--9 September 1992, to appear in the Proceedings) △ Less", "We analyze the breakdown of SUSY GUTs driven by Nambu--Jona--Lasinio condensates. Starting with the most general gauge invariant and pure Kählerian Lagrangian up to quartic order we solve the one loop gap equation and determine the breaking direction. This is done for various classes of groups and spectra of fundamental particles which especially cover the most promising unifying groups $SU(5)$, $SO(10)$ and $E_6$. Heavy masses for the fundamental as well as for the composite particles are calculated. The results are used to single out candidates which may lead to an acceptable low energy theory. In these models we discuss some phenomenological aspects and point out the difficulties in constructing phenomenological viable theories in our scenario. △ Less", "Four-dimensional strings with the standard model gauge group $SU(3)\\times SU(2)\\times U(1)$ give model-dependent predictions for the tree level weak mixing-angle. In the presence of an extra pseudo-anomalous gauged- ${U(1)}_X$, the value of the weak angle may be computed purely in terms of the charges of the massless fermions of the theory, independently of the details of the massive string sector. I present the simplest such $ {U(1)}_X$ which leads to the canonical result $sin^2θ_W=3/8$ in the supersymmetric standard model. This is a sort of gauged Peccei-Quinn symmetry which requires the presence of just the minimal set of Higgs doublets and forbids dimension-four $B$ and $L$-violating terms. In this approach the cancellation of the $U(1)_X$ anomalies through a Green-Schwarz mechanism plays a crucial role. In a different context (that of non-string low-energy supersymmetric models) I briefly discuss wether this type of anomaly cancellation mechanism could be of phenomenological relevance close to the electroweak scale. (Talk at the 23-th Workshop of the INFN Eloisatron Project on Properties of Susy particles, Erice, October 1992) △ Less", "The unification of gauge and Yukawa couplings within the minimal supersymmetric standard model is studied at the two loop level. We derive an expression for the effective scale, $T_{SUSY}$, which characterizes the supersymmetric particle threshold corrections to the gauge couplings, and demonstrate that $T_{SUSY}$ is only slightly dependent on the squark and slepton masses, and strongly dependent on the Higgsino masses as well as on the mass ratio of the gauginos of the strong and weak interactions. Moreover, the value of the top quark Yukawa coupling necessary to achieve the unification of bottom and tau Yukawa couplings is also governed by $T_{SUSY}$, and it yields predictions for the top quark mass which are close to the quasi infrared fixed point results associated with the triviality bounds on this quantity. From the requirement of perturbative consistency of the top quark Yukawa sector of the theory, we obtain constraints on the allowed splitting of the supersymmetric spectrum, which, for certain values of the running bottom quark mass, are stronger than those ones coming from the experimental constraints on the strong gauge coupling. △ Less", "The predictions of SU(5) supergravity models with radiative breaking constrained by experimental proton decay bounds are discussed. It is shown that cosmological constraints further restrict the parameter space but can be satisfied for a wide range of parameters. It is also shown that no serious fine tuning problems (either at $M_{SUSY}$ or $M_{GUT}$) exist. △ Less", "We study the occurrence of final states with only an electron-positron pair and missing transverse momentum as a signal of \\susy\\ in photon-photon collisions. Suitable high energy photon beams may be provided at linear colliders by back-scattering laser beams on electron beams. The final states considered represent a typical signature for the production and decay of selctron and chargino pairs within the \\mssm. We show that, away from the kinematical threshold, selctrons produce this signal far more abundantly than charginos. The standard model background is dominated by W-pair production. We propose a series of kinematical cuts which reduce this background to an acceptable level. With a 1 TeV collider operated in the $γγ$-mode, we find that interesting and complementary tests of \\susic\\ models can be performed for selctron masses up to 350 GeV. △ Less", "It is well known that if phases and masses in the Minimal Supersymmetric Standard Model (MSSM) are allowed to have general values, the resulting neutron EDM ($d_n$) exceeds the experimental upper limit by about $10^3$. We assume that the needed suppression is not due to a fine-tuning of phases or masses, and ask what natural size of $CP$ violation (CPV) results. We show that (1) the phase of one of the superpotential parameters, $μ$, does not contribute to any CPV in the MSSM and so is not constrained by \\dn; (2) the MSSM contribution to $d_n$ is tiny, just coming from the CKM phase; (3) the phases in the MSSM cannot be used to generate a baryon asymmetry at the weak scale, given our assumptions; and (4) in non-minimal SUSY models, an effective phase can enter at one loop giving $d_n \\sim 10^{-26}$\\ecm, $d_e \\sim 10^{-27}$\\ecm, and allowing a baryon asymmetry to be generated at the weak scale, without fine-tunings. Our results could be evaded by a SUSY breaking mechanism which produced phases for the SUSY breaking parameters that somehow were naturally of order $10^{-3}$. △ Less", "We show that the present LEPI lower bound on the Standard Model Higgs boson mass ($M_H\\gsim60\\GeV$) applies as well to the lightest Higgs boson ($h$) of the minimal $SU(5)$ and no-scale flipped $SU(5)$ supergravity models. This result would persist even for the ultimate LEPI lower bound ($M_H\\gsim70\\GeV$). We show that this situation is a consequence of a decoupling phenomenon in the Higgs sector driven by radiative electroweak breaking for increasingly larger sparticle masses, and thus it should be common to a large class of supergravity models. A consequence of $m_h\\gsim60\\GeV$ in the minimal $SU(5)$ supergravity model is the exclusion from the allowed parameter space of `spoiler modes' ($χ^0_2\\toχ^0_1 h$) which would make the otherwise very promising trilepton signal in $p\\bar p\\toχ^\\pm_1χ^0_2X$ unobservable at Fermilab. Within this model we also obtain stronger upper bounds on the lighter neutralino and chargino masses, \\ie, $m_{χ^0_1}\\lsim50\\GeV$, $m_{χ^0_2,χ^\\pm_1}\\lsim100\\GeV$. This should encourage experimental searches with existing facilities. △ Less", "We have explored the electroweak phase transition in minimal supergravity models by extending previous analysis of the one-loop Higgs potential to include finite temperature effects. Minimal supergravity is characterized by two higgs doublets at the electroweak scale, gauge coupling unification, and universal soft-SUSY breaking at the unification scale. We have searched for the allowed parameter space that avoids washout of baryon number via unsuppressed anomalous Electroweak sphaleron processes after the phase transition. This requirement imposes strong constraints on the Higgs sector. With respect to weak scale baryogenesis, we find that the generic MSSM is {\\it not} phenomenologically acceptable, and show that the additional experimental and consistency constraints of minimal supergravity restricts the mass of the lightest CP-even Higgs even further to $m_h\\lsim 32\\GeV$ (at one loop), also in conflict with experiment. Thus, if supergravity is to allow for baryogenesis via any other mechanism above the weak scale, it {\\it must} also provide for B-L production (or some other `accidentally' conserved quantity) above the electroweak scale. Finally, we suggest that the no-scale flipped $SU(5)$ supergravity model can naturally and economically provide a source of B-L violation and realistically account for the observed ratio $n_B/n_γ\\sim 10^{-10}$. △ Less"]