["It is shown that the minimal supersymmetric SO(10) model with electroweak radiative breaking and universal soft mass terms at the GUT scale is strongly disfavoured by the combination of constraints from the $b\\to s γ$ decay and the condition $Ωh^2 < 1$ for the lightest (stable) neutralino. The constraints are, however, easily satisfied for certain class of supersymmetric SO(10) models with non--universal scalar masses which gives small supersymmetric corrections to the bottom quark mass and light higgsino--like neutralinos. △ Less", "The supersymmetric $SU(6)$ model accompanied by the flavour-blind discrete symmetry $Z_3$ can succesfully deal with such key problems of SUSY GUTs, as are the gauge hierarchy/doublet-triplet splitting, $μ$-problem and flavour problem. The Higgs doublets arise as Goldstone modes of the spontaneously broken {\\em accidental} global $SU(6)\\times U(6)$ symmetry of the Higgs superpotential. Their couplings to fermions have peculiarities leading to the consistent picture of the quark and lepton masses and mixing, without invoking any of horizontal symmetry/zero texture concepts. In particular, the only particle that has direct Yukawa coupling with the Higgs doublet is top quark. Other fermion masses appear from the higher order operators, with natural mass hierarchy. Specific mass formulas are also obtained. [On the basis of talks given at the Int. Workshop \"Physics from Planck Scale to Electroweak Scale\", Warsaw, Poland, 21-24 September 1994, and at the III Trieste Conference \"Recent Developments in the Phenomenology of Particle Physics\", Trieste, Italy, 3-7 October 1994.] △ Less", "A systematic analysis of the like-sign dipleton signature for gluino production at LHC is performed in the $R$-conserving minimal supersymmetric standard model, taking into account the top quark and Higgs boson effects in the cascade decay. We consider two representative values of the gluino mass, 300 and 800 GeV, along with those of the other SUSY parameters. While the top quark contribution is kinematically suppressed for the former case it is very import for the latter. Ways of separating the signal from the background are discussed. One expects a viable LSD signals upto a gluino mass of $\\sim 800$ (1200) GeV at the low (high) luminosity option of LHC over practically the full parameter space of MSSM. △ Less", "The $b\\rightarrow s+ γ$ decay is a powerful tool for testing models of new physics because the new physics diagrams enter in the same loop order as the Standard Model ones. The current experimental and theoretical status of this decay is reviewed. Predictions based on the minimal supergravity model (MSGM) in the leading order (LO) are discussed. It is shown that results are sensitive to the value of $m_{t}$ and $α_{G}$. The current experimental value for the $b\\rightarrow s + γ$ rate already very likely eliminates part of the SUSY parameter space when both $m_{o}$ and $m_{\\tilde{g}}$ are small and when $A_{t}$ and $μ$ have the same sign. Dark matter detection rates for $\\tilde{Z}_{1}$ cold dark matter for $μ<0$ are only minimally affected by the current data, as are proton decay predictions for models consistent with current proton lifetime and $\\tilde{Z}_{1}$ relic density bounds. [†Invited talk at ``Physics From Planck Scale to Electroweak Scale'', Warsaw, Sept. 21-24, 1994]. △ Less", "An algorithm is presented that formalizes different steps in a classical Supersymmetric (SUSY) calculation. Based on the algorithm Dill, a symbolic software package, that can perform the calculations, is developed in the Mathematica programming language. While the algorithm is quite general, the package is created for the 4-D, N=1 model. Nevertheless, with little modification, the package could be used for other SUSY models. The package has been tested and some of the results are presented. △ Less", "In the Standard Model (SM), dilepton production in hadron--hadron collisions proceeds through the conventional Drell--Yan mechanism $q \\bar{q} \\rightarrow l^+ l^-$ with the exchange of a gauge boson. Some extensions of the SM contain a quark--lepton contact interaction {\\it via} a $q l φ$ Yukawa coupling, where $φ$ is a scalar. Theories with scalar leptoquarks and $R$--parity violating SUSY models are the most important examples of such extensions. These Yukawa couplings induce a different dynamical configuration compared to the SM ($t$-channel vs. $s$-channel) in the $q\\bar{q} \\rightarrow l^+l^-$ process and thus offer the possibility of being identifiable upon imposition of suitable kinematic cuts. We discuss these effects in the context of the dilepton production in the CDF experiment, and explore consequences in the forthcoming Large Hadron Collider (LHC). △ Less", "A brief review is given of the decay b-s+gamma in SUSY extensions of the Standard Model.It is found that the recent CLEO results put strong constraints on the parameter space of the minimal N=1 Supergravity unified theory.Dark matter analyses are also strongly constrained for mu>0. △ Less", "I discuss a SUSY-GUT model with a non-Abelian discrete family symmetry that explains the observed hierarchical pattern of quark and lepton masses. This $SO(10) \\times Δ(75)$ model predicts modified quadratic seesaw neutrino masses and mixing angles which are interesting for three reasons: i.) they offer a solution to the solar neutrino problem, ii.) the tau neutrino has the right mass for a cosmologically interesting hot dark matter candidate, and iii.) they suggest a positive result for the $ν_μ\\rightarrow ν_τ$ oscillation searches by the CHORUS and NOMAD collaborations. However, the model shares some problems with many other predictive GUT models of quark and lepton masses. Well-known and once successful mass and angle relations, such as the $SU(5)$ relation $λ_b^{GUT}=λ_τ^{GUT}$, are found to be in conflict with the current experimental status. Attempts to correct these relations seem to lead to rather contrived models. △ Less", "{\\tenrm The possibility of detecting supersymmetric dark matter is examined within the framework of the minimal supergravity model (MSGM), where the $\\tilde{Z}_{1}$ is the LSP for almost the entire parameter space. A brief discussion is given of experimental strategies for detecting dark matter. The relic density is constrained to obey 0.10 $\\leq Ω_{\\tilde{Z}_{1}}h^2 \\leq$0.35, consistent with COBE data. Expected event rates for an array of possible terrestial detectors ($^3$He, CaF$_2$, Ge, GaAs, NaI and Pb) are examined. In general, detectors relying on coherrent $\\tilde{Z}_{1}$-nucleus scattering are more sensitive than detectors relying on incoherrent (spin-dependent) scattering. The dependence of the event rates as a function of the SUSY parameters are described. The detectors are generally most sensitive to the small $m_0$ and small $m_{\\tilde{q}}$ and large tan$β$ part of the parameter space. The current $b\\rightarrow s+γ$ decay rate eliminates regions of large event rates for $μ>0$, but allows large event rates to still occur for $μ<0$. MSGM models that also possess SU(5)-type proton decay generally predict event rates below the expected sensitivity of current dark matter detectors.} △ Less", "A basic introduction to the physics of the Standard Model Higgs boson is given. We discuss Higgs boson production in $e^+e^-$ and hadronic collisions and survey search techniques at future accelerators. The Higgs bosons of the minimal SUSY model are briefly considered. Indirect limits from triviality arguments, vacuum stability and precision measurements at LEP are also presented. △ Less", "We calculate ~$\\sin^2θ(M_Z)$ ~in the MSSM in terms of ~ $α_{EM}$, ~$G_F$, ~$m_t$, ~$\\tanβ$ ~and SUSY mass parameters with the same accuracy as the present calculations of ~$\\sin^2θ(M_Z)$ ~in the SM. We compare the results with the standard leading logarithmic approximation used for SUSY threshold corrections and find important differences in the case of light sparticles. We give approximate formulae connecting coupling constants in the SM and in the MSSM and comment on process dependence of such formulae. The obtained values of the MSSM couplings ~$α_i(M_Z)$ ~are used to investigate gauge coupling unification in the minimal SUSY ~SU(5) ~model. Our non-logarithmic corrections lower the predicted value of the Higgs triplet mass. The interplay between the supersymmetric and GUT thresholds in achieving unification for the coupling constants in the range of the experimentally acceptable values is quantified. △ Less", "We study the possibility of an intermediate scale existing in supersymmetric SO(10) grand unified theories: The intermediate scale is demanded to be around 10^{12} GeV so that neutrinos can obtain masses suitable for explaining the experimental data on the deficit of solar neutrino with Mikheev-Smirnov-Wolfenstein solution and the existence of hot dark matter. We show that any Pati-Salam type intermediate symmetries are excluded by requiring reasonable conditions and only $SU(2)_L\\times SU(2)_R \\times SU(3)_C\\times U(1)_{B-L}$ is likely to be realized as an intermediate symmetry. △ Less", "Standard SUSY-GUTs such as those based on $SU(5)$ or $SO(10)$ lead to predictions for the values of $α_s$ and $sin^2θ_W$ in amazing agreement with experiment. In this article we investigate how these models may be obtained from string theory, thus bringing them into the only known consistent framework for quantum gravity. String models with matter in standard GUT representations require the realization of affine Lie algebras at higher levels. We start by describing some methods to build level $k=2$ orbifold string models with gauge groups $SU(5)$ or $SO(10)$. We present several examples and identify generic features of the type of models constructed. Chiral fields appropriate to break the symmetry down to the standard model generically appear in the massless spectrum. However, unlike in standard SUSY-GUTs, they often behave as string moduli, i.e., they do not have self-couplings. We also discuss briefly the doublet-triplet Higgs splitting. We find that, in some models, built-in sliding-singlet type of couplings exist. △ Less", "Relatively light sneutrinos which are experimentally allowed and are not theoretically disfavoured may significantly affect the currently popular search strategies for supersymmetric particles by decaying dominantly into an invisible channel. In certain cases the second lightest neutralino may also decay invisibly leading to two extra carriers of missing energy (in addition to the lightest supersymmetric particle (LSP) ) - the virtual LSPs (VLSPs). The lighter charginos which would be produced in pairs with reasonably large cross-sections at TEVATRON energies, decay dominantly into the hadronically quiet lepton + sneutrino ($\\not{E_T}$ ) modes with large branching ratios leading to interesting unlike sign dilepton events which are not swamped by the standard model background. The kinematical cuts required to eliminate the backgrounds from WW, Drell-Yan and $τ$ pair production are discussed in detail. With 100 $pb^{-1}$ luminosity 10 - 35 background free events can be found in a large region of the SUSY parameter space. △ Less", "We address the computation of Γ_Z and of the intriguing quantity R_b in the MSSM including full treatment of the Higgs sector. For a pseudoscalar Higgs mass m_{A^0}>70\\,GeV and CDF limits on m_t, the bounds on R_b at 1σlevel leave no room to the MSSM to solve the `R_b crisis' for any combination of the parameters, not even admitting the possibility of a light chargino and a light stop of O(50) GeV; however, for m_t not restricted by CDF, a `tangential' solution exists in the window 2<\\tanβ<10 with a light chargino and stop. In contrast, for a pseudoscalar mass 40\\,GeV<m_{A^0}<60\\,GeV and CDF limits on m_t, the `R_b crisis' can be solved in a comfortable way, for any SUSY spectrum above the phenomenological bounds, provided \\tanβ>m_t/m_b. Our general conclusion is that, if there is a `R_b crisis' at all, its solution within the MSSM has to do more with the peculiar structure of the SUSY Higgs sector rather than with the spectrum of genuine supersymmetric particles. In view of the range predicted for m_{A^0}, LEP 200 should be able to definitely settle down this question. △ Less", "Within the framework of the MSSM, we compute the complete set of electroweak one-loop supersymmetric quantum effects on the width $Γ_Z$ of the $Z$-boson in the on-shell renormalization scheme. Numerical analyses of the corrections to the various partial widths into leptons and quarks are presented. On general grounds, the average size of the electroweak SUSY corrections to $Γ_Z$ may well saturate the level of the present theoretical uncertainties, even if considering the full supersymmetric spectrum lying in the neighbourhood of the unaccessible LEP 200 range. Remarkably enough, for the present values of the top quark mass, the electroweak SUSY effects could be, globally, very close or even bigger than the electroweak SM corrections, but opposite in sign. Therefore, in the absence of theoretical errors, there are large regions of parameter space where one could find that, effectively, the electroweak SM corrections are ``missing'', or even having the ``wrong'' sign. This should be helpful in discriminating between the SM and the MSSM. However, an accurate prediction of the electroweak quantum effects on $Γ_Z$ will only be possible, if $Δr$ and $α_s$ are pinned down in the future with enough precision. △ Less", "The electric dipole moment of the neutron (EDMN) is re-examined in a general framework of the soft supersymmetry breaking. We point out some features of the relation between the EDMN and non-universal soft supersymmetry breaking terms. We give the constraints on the soft scalar masses and the soft CP phases, which have the rather large dependence on the non-universality of the soft breaking terms. We also show that the soft CP phase $φ_B$ which has no natural suppression mechanism may not have large contribution to the EDMN in a certain parameter region where the radiative symmetry breaking occurs successfully. $φ_B$ may not need to be so small. △ Less", "We present the results of the gluino and scalar quarks contribution to the flavour changing top quark decay into a charm quark and a photon, gluon or a $Z^0$\\ boson within the minimal supersymmetric standard model. We include the mixing of the scalar partners of the left and right handed top quark. This mixing has several effects, the most important of which are to greatly enhance the c Z decay mode for large values of the soft SUSY breaking scalar mass $m_S$\\ and to give rise to a GIM--like suppresion in the c $γ$\\ mode for certain combinations of parameters. △ Less", "We summarize two sets of signals at HERA in supersymmetric models with explicitly broken R-parity. (1) The resonant production of single squarks through an operator $L_1Q_i{ \\bar D}_j$. (2) The MSSM production of a squark and a slepton followed by R-parity violating decays via the operators $L_iQ_j{\\bar D}_k$. The first case allows for a very large mass reach: $m_{\\tilde q}\\leq 275\\gev$ for moderate couplings. For masses $\\sim 100\\gev$ couplings down to $\\lam\\geq10^{-3}$ can be probed. In the second case the production mechanism is independent of the R-parity violating Yukawa couplings. The full generation structure and very low couplings, $10^{-6}$(!!), can be probed. In the most optimistic case the mass reach is $170,195,205\\gev$ for the operators $L_{τ,μ,e}Q{\\bar D}$ respectively. We conclude that HERA offers a {\\it very promising} discovery potential for \\rpv\\ SUSY.}} △ Less", "We discuss supersymmetric $SU(2)$ gauge theory with a single matter field in the $I=3/2$ representation. This theory has a moduli space of exactly degenerate vacua. Classically it is the complex plane with an orbifold singularity at the origin. There seem to be two possible candidates for the quantum theory at the origin. In both the global chiral symmetry is unbroken. The first is interacting quarks and gluons at a non-trivial infrared fixed point -- a non-Abelian Coulomb phase. The second, which we consider more likely, is a confining phase where the singularity is simply smoothed out. If this second, more likely, possibility is realized, supersymmetry will dynamically break when a tree level superpotential is added. This would be the simplest known gauge theory which dynamically breaks supersymmetry. △ Less", "I discuss how effective grand unified theories requiring adjoint Higgs fields for breaking to the standard model can be contained within string theory. Initial findings are presented in a search for and classification of effective three generation SO(10) SUSY-GUT models built using the free-fermionic string approach. Based on talk presented at PASCOS '94, Syracuse, NY. △ Less", "Two vector-like families with masses of order 1 TeV, one of which is a doublet of $SU(2)_L$ and the other a doublet of $SU(2)_R$, have been predicted to exist in the context of a viable and economical SUSY composite model. One of the many attractive features of the model is an explanation of the inter-family mass-hierarchy for which the existence of the two vector-families is crucial. This paper is devoted to a detailed study of the expected masses, mixings and decay modes of the fermions belonging to the two vector-like families. The masses of the vector-like quarks are expected to lie in the range of 500 GeV to about 2.5 TeV, while those of the vector-like leptons are expected to be in the range of 200 GeV to 1 TeV. Their mass pattern and decay modes exhibit certain distinguishing features and characteristic signals. For example, when the LHC and, possibly a future version of the SSC are built, pair-production of the vector-like quarks would lead to systems such as ($b\\overline{b}+4Z+W^+W^-$) and ($b\\overline{b}+2Z+W^+W^-$), while an $e^-e^+$ linear collider (NLC) of suitable energy can produce appreciably a single neutral heavy lepton $N$ together with $ν_τ$, followed by the decay of $N$ into $(Z+ν_τ) \\rightarrow (e^-e^+) + ν_τ$. This last signal may conceivably materialize even at LEP 200 if $N$ is lighter than about 190 GeV. △ Less", "We demonstrate that supersymmetric decay modes of the neutral Higgs bosons of the MSSM could well make their detection extremely difficult when produced singly in $\\gam\\gam$ collisions at a back-scattered laser beam facility. △ Less", "Talk given at Frontiers in Particle Physics Conference, Cargese. In this paper, I provide some motivation for supersymmetric grand unified theories, briefly explain an extension of the standard model based on them and present a calculation performed using certain properties of some SUSY GUTs to constrain the available parameter space. △ Less", "Event rates for dark matter detectors in neutralino--nucleus scattering are studied for supergravity unified models, including the constraint arising from the $b\\rightarrow sγ$ experiment. The recent experimental measurement of this decay by the CLEO Collaboration leads to strong constraints on the SUSY particle spectrum,and also significantly affects the event rates in dark matter detectors. The analysis given here uses the accurate method for the computation of the relic density and leads to a dip in the event rate when the neutralino mass is $\\sim M_Z/2$ due to the $Z$-pole, and similar results hold when the neutralino mass is $\\sim m_h/2$ due to the Higgs pole . Implication of these results for dark matter detectors are discussed. △ Less", "In the context of supersymmetric $SO(10)$ grand unified models, it is shown that the gauge symmetry breaking as well as a natural doublet--triplet splitting can be achieved with a minimal Higgs system consisting of a single adjoint and a pair of vector and spinor multiplets. Such a Higgs spectrum has been shown to arise in the free fermionic formulation of superstrings. Since the symmetry breaking mechanism relies on non--renormalizable operators, some of the Higgs particles of the model turn out to have masses somewhat below the GUT scale. As a consequence, the unification scale is raised to about $2 \\times 10^{17}~GeV$ and sin$^2θ_W$ is predicted to be slightly larger than the minimal SUSY--$SU(5)$ value. Including threshold uncertainties, which turn out to be surprisingly small in the model, we show that sin$^2θ_W$ prediction is consistent with experiments. △ Less", "Holomorphy of the superpotential and of the coefficient of the gauge kinetic terms in supersymmetric theories lead to powerful results. They are the underlying conceptual reason for the important non-renormalization theorems. They also enable us to study the exact non-perturbative dynamics of these theories. We find explicit realizations of known phenomena as well as new ones in four dimensional strongly coupled field theories. These shed new light on confinement and chiral symmetry breaking. This note is based on a talk delivered at the PASCOS (94) meeting at Syracuse University. △ Less", "Gluino and lightest neutralino masses are naturally less than a few GeV if dimension-3 susy-breaking operators are absent from the low energy theory. In this case gaugino masses come from loops and are calculable in terms of known particle masses and two mass parameters, $μ$ and $\\tilde{m}$. The phenomenology of such a scenario is discussed. △ Less", "In this talk I present the contribution of gluinos and scalar quarks to the decay rate of the top quark into a charged Higgs boson and a bottom quark within the minimal supersymmetric standard model, including the mixing of the scalar partners of the left- and right-handed top quark. △ Less", "In this talk I comment on the contributions of all three types of particles (scalars, fermions and bosons) to the three--photon Z decay within the standard model (SM) and its extensions to the 2 Higgs doublet model (2 HDM) and the minimal supersymmetric extension of the standard model (MSSM). I also comment briefly on the charginos contribution to this decay rate. Finally I comment on the fermions and scalars contributions to the three--gluon Z decay. △ Less", "Using the new CLEO bound on the branching ratio of the decay mode $b\\longrightarrow sγ$ given by $1\\times10^{-4}< B(b\\longrightarrow sγ)<4\\times10^{-4}$ at 95\\% c.l., and the experimental bounds on the masses of the lightest chargino, the second lightest neutralino, and the light CP-odd Higgs, we find that a light gluino is incompatible with a class of supergravity models defined by $N=1$ supergravity, with a radiatively broken electroweak symmetry group and universality of scalar and gaugino masses at the unification scale. We also find in this scenario strong constraints on the parameter space due to the new CLEO bounds on $B(b\\longrightarrow sγ)$. Presented in the International Workshop ``SUSY-94'', University of Michigan, Ann Arbor MI, May 14-17, 1994. △ Less", "I review the theoretical expectactions for the top-quark mass in a variety of models: the Standard Model, unified models (GUTs), low-energy supersymmetric models (SUSY), unified supersymmetric models (SUSY GUTs), supergravity models, and superstring models. In all instances I consider the constraints on the top-quark mass which arise by demanding that these theories be weakly interacting. This assumption is quantified by the use of partial-wave unitarity or triviality. The resulting upper bounds on the top-quark mass are most stringent in SUSY GUTs models ($m^{\\rm pole}_t\\lsim200\\sinβ\\GeV$). I also discuss a class of $SU(5)\\times U(1)$ superstring models where $m^{\\rm pole}_t\\sim(170-195)\\GeV$ is predicted. I conclude that experimental determinations of the top-quark mass can be {\\em naturally} understood in SUSY GUTs and superstring models. (Lecture presented at the International School of Subnuclear Physics, 32nd Course: From Superstring to Present-Day Physics, Erice--Sicily: July 3--11, 1994.) △ Less", "After a lightning review of current bounds on the masses of supersymmetric particles, we describe strategies that may be helpful for extracting signals from the production of squarks, gluinos or top squarks, and from associated chargino-neutralino production at the Tevatron. We then briefly review SUSY signals at hadron and $e^+e^-$ supercolliders. We discuss how various SUSY signals may be correlated within the supergravity framework and indicate the sense in which $e^+e^-$ and hadron colliders may be complementary. **Presented at the Eighth DPF Meeting, Albuquerque, NM, August, 1994** △ Less", "Assuming that the actual values of the top quark mass at FNAL and of the ratio of partial widths Z->bb/Z->hadrons at LEP are within their current one-sigma reported ranges, we present a No-Lose Theorem for superpartner searches at LEP II and an upgraded Tevatron. We impose only two theoretical assumptions: the Lagrangian is that of the Minimal Supersymmetric Standard Model with arbitrary soft-breaking terms, and all couplings remain perturbative up to scales of order 10^16 GeV; there are no assumptions about the soft SUSY breaking parameters, proton decay, cosmology, etc. In particular, if the LEP and FNAL values hold up and supersymmetry is responsible for the discrepancy with the SM prediction of the partial width of Z->bb, then we must have charginos and/or top squarks observable at the upgraded machines. Furthermore, little deviation from the SM is predicted within \"super-unified\" SUSY. Finally, it appears to be extremely difficult to find any unified MSSM model, regardless of the form of soft SUSY breaking, that can explain the partial width for large tan(beta); in particular, no model with top-bottom-tau Yukawa coupling unification appears to be consistent with the experiments. △ Less", "Combining the constraints coming from the ~$M_W$ ~measurements and the unsuccesful search for the Higgs boson at LEP we determine in the framework of MSSM the allowed mass regions for the lighter scalar partner of the top quark. For a heavy top quark particularily strong bounds are obtained for low values of ~$\\tanβ\\equiv v_2/v_1$ ~and light bottom squark. △ Less", "We show that, for standard N=1 supergravity coupled to chiral matter, if the Kahler potential has no terms linear in chiral superfields then none are generated through quad. div. one--loop corrections. If however <V>=0 and susy is spontaneously broken, linear terms are present and new linear terms may be generated due to nonrenormalizable couplings in K. These can potentially destabilize the weak-scale hierarchy. △ Less", "Vacuum stability implies a lower limit on the mass of the higgs boson in the Standard Model (SM). In contrast, an upper limit on the lightest higgs mass can be calculated in supersymmetric (susy) models. The main uncertainty in each limit is the value of the top mass, which may now be fixed by the recent CDF result. We study the possibility that these bounds do not overlap, and find that (i) a mass gap emerges at $m_t\\sim 160$ GeV between the SM and the Minimal Susy Standard Model (MSSM); and between the SM and the Minimal plus Singlet Susy Model [(M+1)SSM] if the independent scalar self--coupling of the latter is perturbatively small or if the $\\tanβ$ parameter is large; this gap widens with increasing $m_t$; (ii) there is no overlap between the SM and the MSSM bounds at even smaller values of $m_t$ for the $\\tanβ$ value ($\\sim 1$--2) preferred in Supersymmetric Grand Unified Theories. Thus, if the new top mass measurement remains valid, a measurement of the first higgs mass will serve to exclude either the SM or MSSM/(M+1)SSM higgs sectors. In addition, we discuss the upper bound on the lightest higgs mass in susy models with an extended higgs sector, and in models with a strongly interacting higgs sector. Finally, we comment on the discovery potential for the lightest higgses in these models. △ Less", "Allowing for realistic uncertainties in input parameters, we demonstrate that the present CLEO limit of $5.4\\times 10^{-4}$ for inclusive $b\\to sγ$ decay does not yet fully exclude the $t\\to bH^+$ decay possibility in supersymmetric type of two Higgs doublet models. Combined with direct search for $t\\to bH^+$ via $H^+\\to τ^+ν$ at the Tevatron, we conclude that $\\tanβ\\sim 1$ is the ``allowed\" window for $m_{H^+} < m_t < M_W$. The possibility becomes excluded, however, {\\it if} the CLEO limit is pushed below $4\\times 10^{-4}$. △ Less", "We construct a supersymmetric model based on the semi-simple gauge group $SU(3)_c \\times SU(3)_L \\times SU(3)_R$ with the relation $tanβ\\simeq m_t/m_b$ automatically arising from its structure. The model below a scale $\\sim 10^{16}$ GeV gives naturally rise just to the minimal supersymmetric standard model and therefore to the presently favored values for $sin^2 θ_w$ and $α_s$ without fields in representations higher than the fundamental. △ Less", "We construct a supersymmetric SO(10) model with the asymptotic relation tan$β\\simeq m_t/m_b$ automatically arising from its structure. The model retains the significant Minimal Supersymmetric Standard Model predictions for $sin^2 θ_w$ and $α_s$ and contains an automatic $Z_2$ matter parity. Proton decay through $d=5$ operators is sufficiently suppressed. It is remarkable that no global symmetries need to be imposed on the model. △ Less", "The top-quark Yukawa infrared fixed-point solution of the renormalization group equations, with minimal supersymmetry and GUT unification, defines a low-energy spectrum of supersymmetric particle masses in terms of a few GUT-scale parameters assuming universal boundary conditions. We give predictions in this model for the inclusive $b\\to sγ$ branching fraction and investigate the impact of non-universal scalar mass boundary conditions. We find our results do not depend significantly on the value of the GUT-scale trilinear coupling $A^G$. The small $\\tan β$ region favors predictions for the inclusive $b\\to sγ$ branching fraction close to that of the Standard Model value. Nevertheless forthcoming experimental results can eliminate some regions of the GUT parameter space. △ Less", "We present a new predictive approach based on SUSY $SO(10)$ theory. The inter-family hierarchy is first generated in the sector of hypothetical superheavy fermions and then transfered inversely to ordinary quarks and leptons by means of the universal seesaw mechanism. The obtained mass matrices are simply parametrized by two small complex coefficients $\\eps_u$ and $\\eps_d$, which can be given by the ratio of the GUT scale $M_G\\simeq 10^{16}$ GeV and some higher scale $M\\simeq 10^{17}-10^{18}$ GeV (presumably superstring scale). The model provides a possibility for doublet-triplet splitting without fine tuning and the Higgsino mediated $d=5$ operators for the proton decay are naturally suppressed. Our ansatz provides the correct {\\em qualitative} picture of fermion mass hierarchy and mixing pattern, provided that $\\eps_d/\\eps_u\\sim 10$. The running masses of the first family fermions: electron, u-quark and d-quark obey an approximate $SO(10)$ symmetry limit. At GUT scale we have: $u\\sim d\\simeq 3e$, $(\\frac{\\eps_u}{\\eps_d})c\\sim s\\simeq \\frac{1}{3}μ$ and $(\\frac{\\eps_u}{\\eps_d})^2t\\sim b\\simeq τ$. The Cabibbo angle is large: $s_{12}\\simeq \\sqrt{m_d/m_s}$ while other mixing angles have their natural size: $s_{23}\\sim m_s/m_b$ and $s_{13}\\sim m_d/m_b$. We have many strong {\\em quantitative} predictions though no special `zero' texture is utilized (in contrast to the known predictive frameworks). Namely, taking as input the lepton, c-quark and b-quark masses, $m_s/m_d$ mass ratio and Cabibbo angle, we can obtain the light (u,d,s) quark masses, top mass and $\\tanβ$. The top quark is naturally in the 100 GeV range, but not too heavy: $m_t<165$ GeV. The lower bound $M_t>150$ GeV (160 GeV) △ Less", "The minimal supersymmetric SO(10) model, in which not only the gauge but also the third generation fermion Yukawa couplings are unified, provides a simple and highly predictive theoretical scenario for the understanding of the origin of the low energy gauge interactions and fermion masses. In the framework of the MSSM, with universal soft supersymmetry breaking parameters at the grand unification scale, large values of the universal gaugino mass $M_{1/2}\\geq 300$ GeV are needed in order to induce a proper breakdown of the electroweak symmetry. In addition, in order to obtain acceptable experimental values for both the pole bottom mass and the $b\\rightarrow sγ$ decay rate, even larger values of the gaugino masses are required. The model is strongly constrained by theoretical and phenomenological requirements and a heavy top quark, with mass $M_t\\geq 170$ GeV, is hard to accomodate within this scheme. However, we show that to accommodate a top quark mass $M_t\\simeq180$ GeV, it is sufficient to relax the condition of universality of the scalar soft SUSY breaking parameters at the grand unification scale. Still, the requirement of a heavy top quark demands a very heavy squark spectrum, unless specific relations between the soft SUSY breaking parameters are fulfilled. △ Less", "I discuss the weak scale threshold corrections in supersymmetric models. I describe the ``match and run\" approximation to the threshold corrections and compare with the exact one-loop results. With explicit examples I show that in cases without large hierarchies in the mass spectra the ``match and run\" approximation can lead to order $\\cal{O}$(1) errors in the determination of the threshold corrections. I demonstrate how to obtain the threshold-corrected Yukawa coupling from the fermion pole mass. I present corrections to the top quark and squark/slepton masses as a function of the GUT scale parameters $m_0$ and $m_{1/2}$ and show that the gauge/Higgs sector corrections to the top quark mass are small while the gluino correction can be larger than the well known gluon correction. △ Less", "Analysis of the SUSY spectrum in supergravity unified models is given under the naturalness criterion that the universal scalar mass $(m_0)$ and the gluino mass $(m_{\\tilde g})$ satisfy the constraint $m_0, m_{\\tilde g}$ less than or equal to 1 TeV. The SUSY spectrum is analysed in four different scenarios: (1) minimal supergravity models ignoring proton decay from dimension five operators, (2) imposing proton stability constraint in supergravity models with SU(5) type embedding which allow proton decay via dimension five operators, (3) with inclusion of dark matter constraints in models of type (1), and (4) with inclusion of dark matter constraint in models of type (2). It is found that there is a very strong upper limit on the light chargino mass in models of type (4), i.e., the light chargino mass is less than or equals 120 GeV. △ Less", "An analysis of the $b \\rightarrow sγ$ is given in supergravity grand unification using the framework of the radiative breaking of the electro-weak symmetry under three separate sets of constraints:1) neutralino relic density does not overclose the universe,2)p-stability constraint, and 3) the combined constraints of p-stability and COBE data .For case 1 it is found that the CLEO II data on the branching ratio already imposes very strong further constraints on dark matter analyses. For case2 the branching ratio is found to lie in the range (1.5-6.3)x$10^{-4}$ and thus the data does not at present significantly limit the analyses with p-stability constraint. It is shown that improvements by a factor of 3 in the $p \\rightarrow\\barνK^{+}$ lifetime will reduce SUSY effects to less than O(30$\\%$) of the Standard Model value.For case3,the branching ratio lies in the interval (3.1-5.3)x$10^{-4}$, and the SUSY effects lie within (-10$\\%$,+50$\\%$) of the SM value. Thus as experimental bounds on $B(b \\rightarrow sγ)$ improve, one would need in cases 2 and 3 the next-to-leading order QCD corrections to disentangle SUSY effects. △ Less", "The sensitivity of dark matter detectors to the lightest neutralino (${\\tilde {Z}_1}$) is considered within the framework of supergravity grand unification with radiative breaking of SU(2)xU(1). The relic density of the ${\\tilde {Z}_1}$ is constrained to obey $0.10 \\leq Ω_{\\tilde {Z}_1}h^2 \\leq 0.35$, consistent with COBE data and current measurements of the Hubble constant. Detectors can be divided into two classes: those most sensitive to spin dependent incoherent scattering of the ${\\tilde {Z}_1}$ (e.g. $CaF_2$) and those most sensitive to spin independent coherent scattering (high A nuclei e.g. Pb). The parameter space is studied over the range of $100GeV \\leq m_0, m_{\\tilde {g}} \\leq 1 TeV; 2 \\leq tanβ\\leq 20$; and $-2 \\leq A_t/m_0 \\leq 3$ and it is found that the latter type detector is generally more sensitive than the former type. Thus at a sensitivity level of $R \\geq 0.1$ events/kg da, a lead detector could scan roughtly 30% of the ~parameter space studied, and an increase of ~this sensitivity by a factor of 10 ~would lead to coverage of about 70% of the parameter space. Dark matter detectors are in general more sensitive to the high $tanβ$, low $m_{\\tilde {g}}$ and low m_0 parts of the parameter space. The conditions of radiative breaking of SU(2)xU(1) enter importantly in analysing the efficiency of dark matter detectors. △ Less", "In this talk~\\footnote{Talk presented at the IFT Workshop on Yukawa Couplings, Gainesville, FL, February 1994.} I summarize published work on a systematic operator analysis for fermion masses in a class of effective supersymmetric SO(10) GUTs \\cite{adhrs}~\\footnote{This work is in collaboration with G. Anderson, S. Dimopoulos, L.J. Hall, and G. Starkman.}. Given a minimal set of four operators at $M_G$, we have just 6 parameters in the fermion mass matrices. We thus make 8 predictions for the 14 low energy observables (9 quark and charged lepton masses, 4 quark mixing angles and $\\tan β$). Several models, i.e. particular sets of dominant operators, are in quantitative agreement with the low energy data. In the second half of the talk I discuss the necessary ingredients for an SO(10) GUT valid below the Planck (or string) scale which reproduces one of our models. \\footnote{These are preliminary results of work in progress with Lawrence Hall.} This complete GUT should still be interpreted as an effective field theory, i.e. perhaps the low energy limit of a string theory.} △ Less", "In automatic R-parity conserving SO(10) models, the simplest way to accomodate realistic fermion masses is to demand that that the light Higgs doublets be linear combinations of the {10} and {126}-bar grand unified Higgs representations. We study the realization of this mixed light Higgs property consistent with doublet-triplet splitting in a minimal model and discuss its predictions for neutrino masses and implications for proton decay. △ Less", "In the Minimal Supersymmetric Standard Model (MSSM), the scale $M_{SUSY}$ of soft supersymmetry breaking is usually {\\em assumed} to be of the order of the electroweak scale. We reconsider here the possibility of treating $M_{SUSY}$ as a dynamical variable. Its expectation value should be determined by minimizing the vacuum energy, after including MSSM quantum corrections. We point out the crucial role of the cosmological term for a dynamical generation of the desired hierarchies $m_Z, M_{SUSY} << M_P$. Inspired by four-dimensional superstring models, we also consider the Yukawa couplings as dynamical variables. We find that the top Yukawa coupling is attracted close to its effective infrared fixed point, corresponding to a top-quark mass in the experimentally allowed range. As an illustrative example, we present the results of explicit calculations for a special case of the MSSM. △ Less", "There are two different types of perturbative unification in SUSY GUTs. Perturbative gauge unification is necessary for the extremely successful prediction of $\\sin^2θ_w$. ``Perturbative validity'' requires that {\\it all} couplings (not just the gauge couplings) remain small; this assumption is essential to the proof that any SUSY GUT must have a light Higgs with a mass below 140 GeV. It is pointed out here that if the latter bound is violated (so that there need be no light Higgs bosons), then it is plausible that the successful prediction of $\\sin^2θ_w$ will {\\it not} be significantly altered. △ Less", "We explore the possibility of a fourth generation in the gauge-coupling-unified, minimal supersymmetric (MSSM) framework. We find that a sequential fourth generation (with a heavy neutrino $ν'$) can still fit, surviving all present experimental constraints, provided $λ_b(M_U)=λ_τ(M_U)$ Yukawa unification is relaxed. For the theory to remain perturbative up to $M_U$, the new leptonic generation must lie within reach of LEP-II and the new $b',t'$ must have masses within the reach of the Tevatron. For example, for $\\mt>150\\gev$ we find $m_{ν'},m_{τ'}< 86\\gev$, $m_{t'}<178$, and $m_{b'}<156\\gev$. Experiments at Fermilab are already sensitive to the latter mass regions; we comment on direct $b'$ searches and on the $m_{t'}\\simeq \\mt$ case in light of new CDF data. Discovery may involve novel decay signatures; however, CDF and LEP-II will confirm or exclude an MSSM fourth generation in the near future. △ Less", "Supersymmetric grand unified theories with non-universal soft supersymmetry breaking terms are studied. By integrating out the superheavy fields at an unification scale, we compute their low-energy effective Lagrangian. We find new contributions to the scalar potential specific to the non-universal supersymmetry breaking. $D$-term contribution to the scalar masses is one example. The gauge hierarchy achieved by a fine-tuning in the superpotential would be violated in general due to the non-universal SUSY breaking terms. We show, however, it is preserved for a certain class of the soft terms derived from a {\\em hidden} ansatz. We also discuss some phenomenological implications of the non-universal supersymmetry breaking, including predictions of the radiative electroweak symmetry breaking scenario and of no-scale type models. △ Less", "Only small regions in the $m_{t} - \\tanβ$ plane are allowed when considering simultaneously (assuming the MSSM) coupling constant unification and (minimal) GUT relations among Yukawa couplings (i.e., $h_{b} = h_τ$ at the unification point). In particular, if $m_{t} \\simle 175$ GeV we find that only $1 \\simle \\tanβ\\simle 1.5$ or $\\tanβ\\simgr 40 \\pm 10$ is allowed. The former implies that the light Higgs boson is $\\simle 110$ GeV and, in principle, visible to LEPII. The prediction for the Higgs boson mass in the $\\tanβ\\approx 1$ scenario is discussed and uncertainties related to ($i$) vacuum stability constraints, ($ii$) different methods for calculating the Higgs boson mass, ($iii$) two-loop calculations and ($iv$) GUT corrections are briefly reviewed. It is shown that large left-right mixing between the $t$-scalars can significantly enhance the Higgs boson mass. That and an ambiguity in the size of the two-loop correction lead to our conservative upper bound of 110 GeV. Vacuum stability considerations constrain the $t$-scalar mixing and slightly diminish the upper bound (depending on the value of $m_{t}$). Improved two-loop calculations are also expected to strengthen the bound. △ Less", "It is shown that the recently proposed preon model which provides a unified origin of the diverse mass scale and an explanation of family replication as well as of inter-family mass-hierarchy, possesses a Peccei-Quinn symmetry whose spontaneous breaking leads to an automatic invisible axion. Existence of the PQ-symmetry is simply a consequence of supersymmetry and requirement of minimality in the field-content and interactions, which propose that the lagrangian should possess only those terms which are dictated by the gauge principle and no others. In addition to the axion, the model also generates two superlight Goldstone bosons and their superpartners which are cosmologically safe. △ Less", "In the constrained MSSM one is typically able to restrict the supersymmetric mass spectra below roughly 1-2\\tev\\ {\\em without} resorting to the ambiguous fine-tuning constraint. △ Less", "I discuss the construction of realistic superstring standard--like models in the four dimensional free fermionic formulation. I discuss the massless spectrum of the superstring standard--like models and the texture of fermion mass matrices. These models suggest an explanation for the top quark mass hierarchy. At the cubic level of the superpotential only the top quark get a mass term. The lighter quarks and leptons obtain their mass terms from nonrenormalizable terms that are suppressed relative to the cubic order term. A numerical estimate yielded $m_t\\sim175-180~GeV$. The suppression of the lightest generation masses results from the horizontal symmetries in the superstring models. The problems of neutrino masses, gauge coupling unification and hierarchical SUSY breaking are discussed. I argue that the realistic features of these models are due to the underlying $Z_2\\times Z_2$ orbifold, with standard embedding, at the free fermionic point in toroidal compactification space. △ Less", "We analyze some consequences of grand unification of the third-generation Yukawa couplings, in the context of the minimal supersymmetric standard model. We address two issues: the prediction of the top quark mass, and the generation of the top-bottom mass hierarchy through a hierarchy of Higgs vacuum expectation values. The top mass is strongly dependent on a certain ratio of superpartner masses. And the VEV hierarchy always entails some tuning of the GUT-scale parameters. We study the RG equations and their semi-analytic solutions, which exhibit several interesting features, such as a focusing effect in the limit of certain symmetries and a correlation between the $A$ terms (which contribute to $b\\rightarrow sγ$) and the gaugino masses. This study shows that non-universal soft-SUSY-breaking masses are favored (in particular for splitting the Higgs doublets via D-terms and for allowing more natural scenarios of symmetry breaking), and hints at features desired in Yukawa-unified models. Several phenomenological implications are also revealed. △ Less", "We systematically analyze the anomalous dipole $Δk_γ$ and quadrupole $ΔQ_γ$ moments of the W gauge bosons in the context of the minimal supersymmetric standard model as functions of the soft SUSY breaking parameters $A_0,m_0,M_{1/2}$ and the top quark mass. The severe constraints imposed by the radiative breaking mechanism of the electroweak symmetry\\,$ SU(2)\\times U(1)$\\, are duly taken into account. The supesymmetric values of $Δk_γ$ and $ΔQ_γ$ can be largely different, in some cases, from the standard model predictions but of the same order of magnitude for values of \\quad $A_0,m_0,M_{1/2} \\leq {\\cal O}(1 TeV) $. Therefore possible supersymmetric structure can be probed provided the accuracy of measurements for $Δk_γ$, $ΔQ_γ$ reaches $10^{-2}-10^{-3}$ and hence hard to be detected at LEP2. If deviations from the standard model predictions are observed at LEP2, most likely these are not due to an underlying supersymmetric structure. In cases where $M_{1/2} \\ll A_0,m_0 $, the charginos and neutralinos may give substantial contributions saturating the LEP2 sensitivity limits. This occurs when their masses $m_{\\tilde C},m_{\\tilde Z}$ turn out to be both light satisfying $m_{\\tilde C}+m_{\\tilde Z} \\simeq M_W $. However these extreme cases are perturbatively untrustworthy and besides unnatural for they occupy a small region in the parameter space. } △ Less", "We consider the baryon parity signals at HERA for the case of the MSSM production mechanisms and the decays via the lepton number violating couplings $L_iQ{\\bar D}$. We can probe very small Yukawa couplings $\\lam' \\gsim 3\\cdot 10^{-6}$, limited only by the decay length of the LSP. We assume the LSP to be the lightest neutralino and study its decays in detail. We present the matrix element squared for the tree-level decay amplitude of a generally mixed neutralino explicitly. We find that the branching fraction to charged leptons strongly depends on the SUSY parameters and can differ significantly from the naively expected $50\\%$. The SUSY mass reaches of the studied processes in the ZEUS detector at HERA were found to be: $(m({\\tilde e}, {\\tilde ν})+m({\\tilde q}))\\leq 170\\gev$, $195\\gev$ and $205\\gev$ for the $L_τQ{\\bar D}, L_μQ{\\bar D}$ and $L_e Q{\\bar D}$ couplings respectively. These are well above existing limits on R-parity violating (\\rpv) SUSY from previous experiments. We conclude that HERA offers a {\\it very promising} discovery potential for \\rpv\\ SUSY. △ Less", "The expected trilepton signals from $p \\bar p \\to χ^\\pm_1χ^0_2 \\to (χ^0_1\\ell^\\pmν) (χ^0_1\\ell'^+\\ell'^-) $ will be converted into hadronically quiet multilepton signals, if the two final $χ^0_1$ have leptonic $R$-parity-violating (RPV) decays $χ^0_1 \\to \\ell \\ell' ν$. We make illustrative calculations of the acceptance for these spectacular RPV signals, and point out that distinctive multilepton signals are possible even when the $R$-conserving trilepton signals are blocked by the ``spoiler mode\" $χ^0_2 \\to h^0 χ^0_1$. Other channels such as $p\\bar p\\to χ_1^\\pm χ_2^0 \\to (χ_1^0\\ell^\\pmν) (χ_1^0νν)$, $p\\bar p\\to χ_1^\\pm χ_1^0 \\to (χ_1^0\\ellν)χ_1^0$ and $p\\bar p\\toχ_1^+χ_1^-\\to(χ_1^0\\ell^+ν)(χ_1^0\\ell'^-ν)$ can also give quiet multileptons from RPV. We investigate these signals in the context of supersymmetric models with radiative electroweak symmetry breaking, using examples in the low-$\\tanβ$ $λ_t$ fixed-point region. △ Less", "Some of the soft SUSY breaking parameters in hidden sector supergravity model depend on the expectation value of the hidden sector scalar potential, $<V_h>$, whose tree level value is equal to the tree level cosmological constant. The current practice of calculating soft parameters assumes that $<V_h>=0$. Quantum correction to the cosmological constant can differ from the correction to $<V_h>$ by an amount of order $m^2_{3/2}M_{Pl}^2/8π$. This implies that, for the vanishing cosmological constant, the $<V_h>$--dependent parts of soft terms can be sizable, and hence the supergravity phenomenology should be accordingly modified. △ Less", "The Higgs particle can have dominantly invisible decay in a large class of Majoron models as well as some SUSY models. The LEP signal and mass limit for a Higgs particle undergoing invisible decay are explored. They are found to be very similar to those for the standard model decay. The best signatures and discovery limit for an invisibly decaying Higgs particle at the LHC are also discussed. (Invited Talk at the XXIXth Rencontres de Moriond on QCD and High Energy Hadronic Interactions, Méribel, France, 19--26 March 1994.) △ Less", "It was recently shown that unbroken N=1 Susy relates, in a model independent way, the magnetic transitions between states of different spin within a given charged massive supermultiplet. We verify explicitly these sum rules for a vector multiplet in the case of massless and massive fermions. The purpose of this analysis is to provide the ground for the broken susy case. We study the modifications of these results when an explicit soft Susy breaking realized through a universal mass for all scalars is present. As a by-product we provide a computation of the $g-2$ of the $W$ boson in the standard model which corrects previous evaluations in the literature. △ Less", "We consider the search for the Higgs boson at a high-luminosity Fermilab Tevatron, an upgraded Tevatron of energy 3.5 TeV, and the CERN Large Hadron Collider, via $WH/ZH$ production followed by H -> bb~ and leptonic decay of the weak vector bosons. We show that each of these colliders can potentially observe the standard Higgs boson in the intermediate-mass range, 80 GeV <m_H < 120 GeV. This mode complements the search for and the study of the intermediate-mass Higgs boson via H -> γγat the LHC. In addition, it can potentially be used to observe the lightest Higgs scalar of the minimal supersymmetric model in a region of parameter space not accessible to CERN LEP II or the LHC (using h -> γγ,ZZ^*). △ Less", "We reexamine a possibility for the existence of a light supersymmetric partner of the top quark (stop) with mass 15$\\sim$16GeV in the framework of the minimal supergravity GUT model (MSGUT). Such a stop could explain the slight excess of the high $p_{T}$ cross section of the $D^{*\\pm}$-meson production in the two-photon process at TRISTAN. We find two types of solution for the RGEs in the MSGUT allowing the existence of the light stop. The type I [type II] solution is characterized by the heavy [light] top quark, $m_t\\simeq$ 150GeV [100GeV], and the light [heavy] squarks . It is found that the type II solution is more favorable because these parameter sets seem to satisfy all constraints settled by the recent collider experiments as well as by the cosmological considerations. The existence of such a stop could change the dominant decay mode of sparticles, the top quark and the Higgs bosons. Consequently,the present experimental bounds on the supersymmetric parameters as well as on masses of the top and the Higgs could be weakened substantially. However, the allowed parameter region is rather restricted and in turn masses and mixing parameters of the other SUSY partners as well as masses of the Higgs and the top are severely constrained. △ Less", "We introduce a new approach for studying unified supergravity models. In this approach all the parameters of the grand unified theory (GUT) are fixed by imposing the corresponding number of low energy observables. This determines the remaining particle spectrum whose dependence on the low energy observables can now be investigated. We also include some SUSY threshold corrections that have previously been neglected. In particular the SUSY threshold corrections to the fermion masses can have a significant impact on the Yukawa coupling unification. △ Less", "We study the penguin induced transition $b\\to s\\ γ$ in the minimal N=1 supersymmetric extension of the Standard Model with radiative breaking of the electroweak group. We include the effects of one-loop corrections to the Higgs potential and scalar masses. We show that the present upper and lower experimental limits on the inclusive decay sharply constrain the parameter space of the model in a wide range of $\\tanβ$ values. The implications of the recently advocated relation $|B|\\ge 2$ for the bilinear SUSY soft breaking parameter in grand unified theories are also analyzed. △ Less", "The structure of the quark and lepton masses and mixing angles provides one of the few windows we have on the underlying physics generating the \\sm. In an attempt to identify the underlying symmetry group we look for the simplest gauge extension of the SUSY standard model capable of generating the observed structure. We show that the texture structure and hierarchical form found in the (symmetric) quark and lepton mass matrices follows if one extends the gauge group of the standard model to include an horizontal $U(1)$ gauge factor, constrained by the need for anomaly cancellation. This $U(1)$ symmetry is spontaneously broken slightly below the unification/string scale leaving as its only remnant the observed structure of masses and mixings. Anomaly cancellation is possible only in the context of superstring theories via the Green Schwarz mechanism with $sin^2(θ_W)=3/8$. △ Less", "We construct a $SU(3)^3$ supersymmetric gauge theory with a common gauge coupling g. Spontaneous breaking of this gauge group at a scale $M_X=1.3\\times10^{16} $GeV gives naturally rise exactly to the Minimal Supersymmetric Standard Model $(MSSM)$ and consequently to the experimentally favored values of $sin^2θ_w$ and $α_s$.The gauge hierarchy problem is naturally solved by a missing-partner-type mechanism which works to all orders in the superpotential. The baryon asymmetry can be generated in spite of the (essential) stability of the proton. The solar neutrino puzzle is solved by the MSW mechanism. The LSP is a natural \"cold\" dark matter candidate and \"hot\" dark matter might consist of $τ$-neutrinos. This model could be thought of as an effective $4d$ theory emerging from a more fundamental theory at a scale $M_c=M_P/\\sqrt{8π}$ where $a_G\\equiv{g^2\\over{4π}}$ happens to be equal to unity. △ Less", "We study the predictions of the simplest SU(5) grand unified model within the framework of minimal supergravity, including constraints from the radiative breaking of electroweak symmetry. As a consequence of the unification of the $b$-quark and $τ$-lepton Yukawa couplings, the top quark mass is predicted to be close to its fixed point value. We delineate the regions of the supergravity parameter space allowed by constraints from the non-observation of proton decay and from the requirement that the LSP does not overclose the universe. These constraints lead to a definite pattern of sparticle masses: the feature unique to Yukawa unified models is that some of the third generation squarks are much lighter than those of the first two generations. Despite the fact that all sparticle masses and mixings are determined by just four SUSY parameters at the GUT scale (in addition to $m_t$), we find that the signals for sparticle production can vary substantially over the allowed parameter space. We identify six representative scenarios and study the signals from sparticle production at the LHC. We find that by studying the signal in various channels, these scenarios may be distinguished from one another, and also from usually studied ``minimal models'' where squarks and sleptons are taken to be degenerate. In particular, our studies allow us to infer that some third generation squarks are lighter than other squarks---a feature that could provide the first direct evidence of supergravity grand unification. △ Less", "We show that the Polonyi problem is solved in the minimum SUSY-GUT model in which a self-coupling strength for a heavy Higgs $Σ$, $λΣ^{3}$, is very small $λ\\sim 10^{-6}$. It is stressed that with this small $λ$ the mass of the physical $Σ$ becomes $m_Σ \\sim 10^{12}\\GEV$ and the unification scale is raised up to the gravitational one, $M\\simeq 2\\times 10^{18}\\GEV$. A potential problem, however, is also pointed out in this GUT model. △ Less", "$CP$ violating phenomena predicted by the minimal supersymmetric standard model are discussed in a case where the $CP$ violating phases in SUSY sector are not suppressed. The electric dipole moments of the neutron and the electron are large, but can be smaller than their experimental upper bounds if the scalar quarks and leptons are heavier than a few TeV. $T$ violating asymmetries in the production processes of the different neutralino pair and the different chargino pair emerge at the tree level. They could be as large as of order $10^{-2}$ in unpolarized electron beam experiments and $10^{-1}$ in polarized electron beam experiments. In a pair production of the charginos of the same mass, the asymmetry emerges through the electric and the weak \"electric\" dipole moments of the charginos at the loop level, but its magnitude is at most of order $10^{-4}$. △ Less", "We show that a recently proposed extension of the MSSM can provide a scenario where both the cold and hot dark matter of the universe owe their origin to a single scale connected with the breakdown of the global B-L symmetry. The susy partner of the majoron and the light Majorana neutrinos are the cold and hot dark matter candidates respectively in this model and their desired relative abundances emerge when the scale of B-L symmetry breaking is in the TeV range. △ Less", "A new procedure proposed recently enables one to start from the quark and lepton mass and mixing data at the low scale and construct mass matrices which exhibit simple SO(10) structure at the SUSY GUT scale. We elaborate here on the numerical details which led us to an SO(10) model for the quark and lepton mass matrices that explain the known quark data at the low scale along with the observed depletions of solar- and atmospheric-neutrinos. We also apply the procedure to a second scenario incorporating the solar-neutrino depletion and a 7 eV tau-neutrino for the cocktail model of mixed dark matter but find the SO(10) model deduced in this case does not exhibit as simple a structure as that observed for the first scenario. △ Less", "One of the most efficient mechanisms for producing the baryon asymmetry of the Universe is the decay of scalar condensates in a SUSY GUT as was first suggested by Affleck and Dine. We show that given a large enough asymmetry, the baryon number will be preserved down to low temperatures even if B - L = 0, because the baryon number carrying scalars form bose condensates that give the W a mass. We derive the conditions on the condensate needed to suppress electroweak sphaleron interactions which would otherwise drive the baryon asymmetry to zero when B - L = 0. △ Less", "We consider four dimensional quantum field theories which have a continuous manifold of inequivalent exact ground states -- a moduli space of vacua. Classically, the singular points on the moduli space are associated with extra massless particles. Quantum mechanically these singularities can be smoothed out. Alternatively, new massless states appear there. These may be the elementary massless particles or new massless bound states. △ Less", "We calculate the two loop contribution to the predictions of the mass scales in an SO(10) grand unified theory. We consider the modified unification scale boundary conditions due to the non-renormalizable higher dimensional terms arising from quantum gravity or spontaneous compactification of extra dimensions in Kaluza-Klein type theory. We find the range of these couplings which allows left-right symmetry to survive till very low energy (as low as $\\sim$ TeV) and still be compatible with the latest values of $\\sin^2 θ_W$ and $α_s$ derived from LEP. We consider both the situation when the left-right parity is broken and conserved.We consider both supersymmetric and non-supersymmertic versions of the SO(10) theory.Taking the D-conserved non-susy case as an example we calculate the effects of moderate threshold uncertainties at the heavy scale, due to the unknown higgs masses,on the gravity induced couplings. △ Less", "Following the termination of the Superconducting Super Collider, there is an urgent need to develop a strategic plan for the future of high energy physics and an accompanying vision to guide the priorities of the U.S. program. This document proposes such a strategic plan and presents a singular opportunity for the U.S. program. The existing hadron collider at Fermilab could be upgraded to create a major discovery potential for supersymmetry, one of the most profound concepts in the world of elementary particles. Using a single ring of SSC magnets in the existing tunnel, the recently improved understanding of SUSY phenomenology, and the upgraded detectors in place at the Tevatron, the DiTevatron could be doing physics within five years and reach most of the range of parameters permitted in SUSY models. We propose that it be funded as a worthy component of the SSC termination, bringing to fruition both the technology and the science of the SSC at very modest cost. △ Less", "It is well known that supersymmetric models allow new sources for CP violation that arise from soft supersymmetry breaking terms. If unsuppressed, these new CP-violating phases would give too large a neutron electric dipole moment. We discuss a mechanism for suppressing SUSY phases in string-inspired supergravity models in which supersymmetry is assumed to be broken by the auxiliary components of the dilaton and moduli superfields. (To appear in the Proceeding of the Third KEK Topical Conference on CP Violation, its Implication to Particle Physics and Cosmology) △ Less", "We introduce and define operatively in a model independent way a new ``heavy\" b-vertexparameter, $η_b$, that can be derived from the measurement of a special polarization asymmetry for production of b-quarks on Z resonance. We show that the combination of the measurement of $η_b$ with that of a second and previously defined ``heavy\" b-vertex parameter $δ_{bV}$ can discriminate a number of models of New Physics that remain associated to different ``trajectories\" in the plane of the variations of the two parameters. This is shown in particular for some popular SUSY and technicolor-type models. In general, this discrimination is possible if a measurement of \\underline{both} parameters is performed. △ Less", "Non--strongly interacting supersymmetric particles -- sleptons, charginos, neutral\\-inos, and charged Higgs bosons -- are difficult to detect at the Large Hadron Collider. We therefore examine the possibility of producing particles of this type in virtual $γγ$ collisions at the LHC. Since photons can be emitted from protons which do not break up in the radiation process, very clean events can be generated, compensating to some extent for the small event numbers. Higher rates are expected, at the expense of stray hadrons, for events in which one or two protons break up. △ Less", "It is shown that, in a theory where the dilaton is coupled to a Yang-Mills gauge field which enters a confining phase at scale Λ, the dilaton may grow a mass $m_{dilaton}\\sim Λ^2/m_{Pl}\\sim (m_{SUSY}^2 m_{Pl})^{1/3}\\sim 10^8\\ \\mbox{GeV}. $ This allows ample time for decay before the electroweak era if $m_{SUSY}\\simeq 1\\ \\mbox{TeV},$ and circumvents cosmological problems normally associated with its existence. △ Less", "Review to appear in Progress in Particle and Nuclear Physics. Contents: {1}Introduction}{1} {2}High precision LEP data and convergence of couplings: physics is not Euclidean geometry}{2} {3}Interconnections between the measured quantities due to Unification}{7} {4}The origin of $M_{SUSY}$ and why it should be abandoned: masses and spectra are needed}{13} {5}The new step forward: Supergravity}{21} {6}The SU(5) Supergravity Model}{22} {7}SU(5)xU(1) Supergravity}{32} {8}Detailed calculations for the Tevatron}{47} {9}Detailed calculations for LEP}{48} {10}Detailed calculations for HERA}{53} {11}Detailed calculations for Underground Labs and Underwater facilities}{55} {12}Detailed calculations for indirect experimental detection}{65} {13}The problem of mass and $m_t$}{73} {14}Conclusions}{77} △ Less", "We explore the prospects for detection of sparticles and Higgs bosons at the Tevatron, LEP-200 and the LHC in the allowed parameter space of a `yukawa unified' ($λ_b(M_U)=λ_τ(M_U)$) minimal supergravity (YUMS) model, where the only non-zero unification scale soft-SUSY-breaking terms are a universal gaugino mass and a Higgs mixing term. In a bottom-up approach, just two weak scale parameters, $\\tanb$ and $\\mha$, (along with the sign of the Higgs mixing parameter $μ$) completely parameterize the model. Many interesting `special' situations regarding sparticle and Higgs discovery arise, such as the importance of the invisible $\\hl\\rta\\cnone\\cnone,\\snu\\snubar$ decay modes. △ Less", "The Lightest Supersymmetric Particle (LSP) makes a good Dark Matter (DM) candidate, since its relic density quite naturally comes out close to the cosmologically required value. This is true even in minimal Supergravity models with radiative symmetry breaking, which have a rather small number of free parameters. On the other hand, the experimental detection of SUSY DM might be quite difficult, necessitating km$^2$ size neutrino detectors or direct detection experiments with several tons of detector material. △ Less", "In the Supersymmetric extension of the Standard Model with minimal particle content the three neutrinos can have non trivial masses and mixings, generated at 1 loop due to renormalizable lepton number violating interactions. We show that the resulting mass matrix can provide simultaneously a significant amount of the Dark Matter of the Universe and solve the solar neutrino problem, if the free parameters of the model are fixed to values which are consistent with all the present accelerator and cosmological constraints. The theory also predicts new effects in future experiments looking for neutrino oscillations. △ Less", "A next--to--leading order QCD analysis of deep inelastic scattering data is performed allowing for contributions due to a light gluino. We obtain the values of $α_s(M_Z^2) \\pm δα_s^{stat} = 0.108 \\pm 0.002, 0.124 \\pm 0.001, 0.145 \\pm 0.009$ for QCD, SUSY QCD with a Majorana gluino and a Dirac gluino respectively. The value of $\\alsm$ obtained in SUSY QCD with a Majorana gluino best agrees with the direct measurements of $α_s(M_Z^2)$ at LEP. △ Less", "We consider the SUSY-model neutralino as a dominant Dark Matter particle in the galactic halo and investigate some general issues of direct DM searches via elastic neutralino-nucleus scattering. On the basis of conventional assumptions about the nuclear and nucleon structure, without referring to a specific SUSY-model, we prove that it is impossible in principle to extract more than three constraints on fundamental SUSY-model parameters from the direct Dark matter searches. Three types of Dark matter detectors probing different groups of parameters are recognized. △ Less", "We investigate the role of nuclear spin in elastic scattering of Dark Matter (DM) neutralinos from nuclei in the framework of the Minimal SUSY standard model (MSSM). The relative contribution of spin-dependent axial-vector and spin-independent scalar interactions to the event rate in a DM detector has been analyzed for various nuclei. Within general assumptions about the nuclear and nucleon structure we find that for nuclei with atomic weights $A > 50$ the spin-independent part of the event rate $R_{si}$ is larger than the spin-dependent one $R_{sd}$ in the domain of the MSSM parameter space allowed by the known experimental data and where the additional constraint for the total event rate $R =R_{sd} + R_{si} > 0.01$ is satisfied. The latter reflects realistic sensitivities of present and near future DM detectors. Therefore we expect equal chances for discovering the DM event either with spin-zero or with spin-non-zero isotopes if their atomic weights are $A_{1} \\sim A_{2} > 50$. △ Less", "We obtain the one- and two-loop renormalization group equations for soft SUSY breaking scalar interactions in general, semi-simple SUSY gauge model, by using the supergraph method. We find that the method simplifies the calculation significantly because of the non-renormalization theorem and also because of the property that the relevant divergences are derived by simple algebra from those in exact SUSY case. A disagreement with the existing result is found in $β^{(2)}(m^2)$ and its cause is briefly discussed. △ Less", "We consider the predictions for the hierarchy of mass scales, the fine structure constant, the radii of compactification and the soft SUSY breaking terms which follow if SUSY breaking is triggered by a gaugino condensate. △ Less", "In the minimal supersymmetric model (MSSM), the upper limit of the lightest Higgs boson mass, $\\mhl$, depends strongly on the top quark mass, $m_t$. We have computed the dominant two-loop radiative corrections to this upper limit of $\\mhl$ in order to eliminate large uncertainties due to QCD and $m_t^6$ corrections. It is shown that the QCD corrections significantly reduce the one-loop corrections. As a result, the SUSY parameter space accessible to LEP experiments is significantly increased. △ Less", "It is well known that supersymmetry (SUSY) gives neutron and electron electric dipole moments ($d_n$ and $d_e$) which are too large by about $10^{3}$. If we assume a SUSY model cannot contain fine-tunings or large mass scales, then one must require that the SUSY breaking mechanism give real soft breaking parameters, in which case the minimal SUSY model has no $CP$ violation other than from the CKM matrix (besides possible strong $CP$ violating effects). We show that in non-minimal SUSY models, a moderate amount of $CP$ violation can be induced through one loop corrections to the scalar potential, giving an effective phase of order $10^{-3}$, and thus implying $d_n$ and $d_e$ can be near their current experimental bounds $naturally$. This moderate amount of SUSY $CP$ violation could also prove important for models of electroweak baryogenesis. We illustrate our results with a specific model. △ Less", "Fritzsch's texture is imposed on {\\em all} mass matrices in a SUSY-SO(10) via a family $U(1)_{PQ}$ symmetry. The observed charged fermion parameters fix the $ν$-masses and mixing, while the later are evolved from the GUT scale to low energies using the RG. Large $\\sin^2 2θ_{12}$ results. As in a SUSY-GUT no intermediate scale is allowed, the RH-neutrino scale is the unification one and this gives in our model $Δm_{12}^2 \\approx {10}^{-10} eV^2$, in accordance with the vacuum oscillation solution to the solar-$ν$ puzzle. △ Less"]