["In a $SU(6)$ gauge theory we found the irreducible representation (175-plet) which does not contain the Higgs doublet. Using this representation we construct two SUSY $SU(6)$ models in which the doublet-triplet splitting occurs naturally, without fine tuning. The crucial role is played by the ``custodial\" global $SU(2)_H$ in combination with discrete or continuous $R$ symmetries. △ Less", "We use ISAJET to perform a detailed study of the multilepton signals expected from cascade decays of supersymmetric particle produced at the CERN LHC. Our analysis is performed within the framework of the minimal supergravity model with gauge coupling unification and radiative electroweak symmetry breaking. We delineate the regions of parameter space where jets plus missing energy plus 1, 2 (opposite sign and same-sign dileptons), and 3 isolated lepton events should be visible above standard model backgrounds. We find that if any $\\eslt$ signal at the LHC is to be attributed to gluino and/or squark production, and if $m_{\\tg} \\alt 1$~TeV, then several of these signals must be simultaneously observable. Furthermore, assuming $10\\,\\fb^{-1}$ of integrated luminosity, we find that the reach for supersymmetry in the 1$\\ell + \\jets +\\eslt$ channel extends to $m_{\\tg}\\sim 2300\\ (1600)$ GeV for $m_{\\tq}\\sim m_{\\tg}$ ($m_{\\tq} \\sim 1.5m_{\\tg}$), and exceeds the corresponding reach in the $0\\ell+\\eslt$ channel. We show that measurements of the various topological cross sections, jet and $B$-hadron multiplicities in these events, together with the charge asymmetry for single lepton and same-sign dilepton events, and flavor asymmetry for opposite sign dilepton events, serve to narrow the allowed range of underlying SUGRA parameter values. We also delineate parameter regions where signals with clean isolated dilepton (from slepton production) and trilepton events (from chargino/neutralino production) are visible at the LHC, and examine the extent to which these signals can be separated from other SUSY sources. △ Less", "Although the possible existence of dangerous charge and color breaking (CCB) directions in the MSSM has been known since the early 80's, only particular directions in the field-space have been considered, thus obtaining necessary but not sufficient conditions to avoid dangerous CCB minima. Furthermore, the radiative corrections to the potential were not normally included in a proper way, often leading to an overestimation of the restrictive power of the bounds. It turns out that when correctly evaluated, the ``traditional\" CCB bounds are very weak. I give here a brief survey of recent results on this subject, which represent a complete analysis, showing that the new CCB bounds are very strong and, in fact, there are extensive regions in the parameter space that become forbidden. This produces important bounds, not only on the value of $A$, but also on the values of $B$ and $M_{1/2}$. The form of strongest one of the new bounds, the so called UFB-3 bound, is explicitely given. △ Less", "We re-examine the possible magnitude of the supersymmetric contribution to $R_b\\equivΓ(Z^0\\to\\bar b b)/Γ(Z^0\\to{\\rm all})$ in the light of the constraints imposed by the absence of light charginos at LEP~1.5, implementing also other available phenomenological constraints. We find the supersymmetric contribution to be $R^{\\rm susy}_b < 0.0017$, and discuss the extent to which this upper bound could be strengthened by future constraints on the chargino and top-squark masses. Such values of $R^{\\rm susy}_b$ tend to disfavor a supersymmetry explanation of the apparent $R_b$ discrepancy. △ Less", "There are few robust solutions to the doublet-triplet splitting problem in supersymmetric GUT theories. One of the more promising solutions is the Higgs as pseudo-Goldstone boson mechanism. In its minimal implementation, such a solution places an additional restriction on the parameter space of the minimal supersymmetric standard model. A testable consequence of this constraint is an equation for $\\tan β$. We present this restriction and study its solutions in order to constrain the allowed parameter space. Thus the assumptions on the GUT scale Higgs sector should yield testable predictions for weak scale physics. If the SUSY parameters are measured then it should be possible to check the predictions, yielding insight into GUT scale physics. △ Less", "Evaluation of nucleon decay modes and branching ratios in a non-minimal supersymmetric SO(10) grand unified theory is presented. The non-minimal GUT considered is the supersymmetrised version of the `realistic' SO(10) model originally proposed by Harvey, Reiss, and Ramond, which is realistic in that it gives acceptable charged fermion and neutrino masses within the context of a phenomenological fit to the low energy standard model inputs. Despite a complicated Higgs sector, the SO(10) $\\underline{10}$ Higgs superfield mass insertion is found to be the sole contribution to the tree level F-term governing nucleon decay. The resulting dimension 5 operators that mediate nucleon decay give branching ratio predictions parameterised by a single parameter, the ratio of the Yukawa couplings of the $\\underline{10}$ to the fermion generations. For parameter values corresponding to a lack of dominance of the third family self coupling, the dominant nucleon decay modes are $p \\rightarrow K^{+} + \\barν_μ$ and $n \\rightarrow K^{0} + \\barν_μ$, as expected. Further, the charged muon decay modes are enhanced by two orders of magnitude over the standard minimal SUSY SU(5) predictions, thus predicting a distinct spectrum of `visible' modes. These charged muon decay modes, along with $p \\rightarrow π^{+} + \\barν_μ$ and $n \\rightarrow π^{0} + \\barν_μ$, which are moderately enhanced over the SUSY SU(5) prediction, suggest a distinguishing fingerprint of this particular GUT model, and if nucleon decay is observed at Super-KAMIOKANDE the predicted branching ratio spectrum can be used to determine the validity of this `realistic' SO(10) SUSY GUT model. △ Less", "We study supersymmetric unified models with three fermion generations based on the gauge group $SO(10)$ and require Gauge-Yukawa Unification, i.e., a renormalization group invariant functional relationship among the gauge and Yukawa couplings of the third generation in the symmetric phase. In the case of the minimal model, we find that the predicted values for the top and bottom quark masses are in agreement with the present experimental data for a wide range of supersymmetry breaking scales. We also find that an experimental accuracy of less than $1 \\%$ for the top quark mass could test the corresponding prediction of the Gauge-Yukawa unified model. △ Less", "The neutrinoless double beta decay ($\\znbb$) induced by light Majorana neutrino exchange between decaying nucleons, accompanied by the squark exchange inside one nucleon, recently discussed by Babu and Mohapatra, is carefully analyzed both from the particle and nuclear physics sides. New nuclear matrix elements relevant to this mechanism are calculated. We extend the analysis to include mixing of light neutrinos with heavy and \"sterile\" neutrinos. It introduces another supersymmetric (SUSY) contribution to $\\znbb$. We discuss constraints on the \\rp MSSM parameters imposed by the current experimental limit on $\\znbb$ decay half-life of $^{76}$Ge. △ Less", "Vacuum stability and metastability imply lower limits on the mass of the higgs boson in the Standard Model (SM). In contrast, we present an improved calculation of an upper limit on the lightest higgs mass in supersymmetric (susy) models, by summing to all orders in perturbation theory the leading and next--to--leading logarithms with a renormalization group equation technique, and by including finite two-loop QCD corrections.The improvement lowers the Minimal Susy Standard Model (MSSM) upper limit by about 10 GeV. The main uncertainty in each limit is the value of the top mass, which is now constrained by the Fermilab results. We study the possibility that these bounds do not overlap, and find that (i) a mass gap emerges between the SM and the MSSM at $m_t\\sim 175$ GeV for $α_s(M_Z^2)=0.118$ and at $m_t \\sim 180$ GeV for more generous values $\\sim (0.130)$ of $α_s$; and between the SM and the Minimal plus Singlet Susy Model [(M+1)SSM] if the independent scalar self--coupling of the latter is perturbatively small or if the $\\tanβ$ parameter is large; these gaps widen with increasing $m_t$; (ii) the mass gap emerges with $m_t$ 10 GeV lighter if only vacuum stability and not metastability is imposed; (iii) there is no overlap between the SM and the MSSM bounds at even smaller values of $m_t$ for the $\\tanβ$ value ($\\sim 1$--2) preferred in Supersymmetric Grand Unified Theories. Thus, a measurement of the first higgs mass will serve to exclude either the MSSM/(M+1)SSM higgs sectors or the SM higgs sector. Finally, we comment on the discovery potential for the lightest higgses in these models. △ Less", "We discuss supersymmetric contributions to the electroweak precision measurements in the Minimal Supersymmetric Standard Model for two cases: the quark-lepton universality violation $δ_{q\\ell}$ in charged currents and the ratio $R_b=Γ(Z\\rightarrow b\\bar{b})/Γ(Z\\rightarrow \\rm hadrons)$. The recent experimental data suggest deviations from the Standard Model for these observables, at the 1-$σ$ level for the former and at more than 3-$σ$ level for the latter. We analyze the non-oblique corrections from the SUSY particles to explain these discrepancies. The observed non-zero $δ_{q\\ell}$ may be explained by relatively light sleptons, charginos and neutralinos. Although the observed excess of $R_b$ can be explained by very light scalar top and chargino for low $\\tanβ$, this interpretation is severely constrained by the opening of exotic decay modes for the top quark. △ Less", "Arguments for the confinement of transverse gauge field excitations, which are based upon superconvergence relations of the propagator, and upon the BRST algebra, are reviewed and applied to supersymmetric models. They are shown to be in agreement with recent results obtained as a consequence of holomorphy and duality in certain $N=1$ SUSY models. The significance of the one loop anomalous dimension of the gauge field in the Landau gauge is emphasized. For the models considered, it is shown to be proportional, with negative relative sign, to the one loop coefficient of the renormalization group function for the {\\it dual map} of the original theory. △ Less", "We propose a supersymmetric hypercolor SU(3)_H gauge theory interacting strongly at the grand unification scale, in which the hyperquark condensation breaks SU(5)_GUT down to SU(3)_C x SU(2)_L without unbroken U(1)_Y at the classical level. However, we show that the broken U(1)_Y symmetry is restored by quantum mechanical effects and hence there remains the standard-model gauge symmetry at the electroweak scale. The dynamics of the strong interactions also produces naturally a pair of massless Higgs doublets. In addition to these Higgs doublets, we have a pair of massless singlets which contributes to the renormalization-group equations of gauge coupling constants and hence affects the GUT unification. We discuss a simple solution to this problem. △ Less", "There is a natural solution to the strong CP problem in the Minimal Supersymmetric Standard Model if it arises from a parity symmetric theory which is spontaneously broken to MSSM at Planck, GUT or intermediate scales. The strong CP phase is zero at the tree level and is not induced to two loops. The SUSY phase problems are also solved. The universal soft SUSY breaking parameters A, B, μ, m_{1/2} are all automatically real and the only additional CP violation effects of the low-energy MSSM are characterized by a Hermitian squark mass matrix whose phases depend on the CKM phase. Cases with non-universal boundary conditions are also considered. △ Less", "We summarize the dominant decay modes of the neutral and charged Higgs bosons in the Minimal Supersymmetric extension of the Standard Model. While two--body decays are in general dominating, the branching ratios for three--body decays of the heavy scalar, pseudoscalar and charged Higgs bosons can be large below the thresholds if top quarks, $W/Z$ bosons or heavy scalar bosons are involved. Analytical expressions have been derived for the partial decay widths and the physical implications of these decay modes are discussed. △ Less", "The lighter scalar tau lepton $\\sti$ may be the lightest scalar lepton and therefore would be found earlier in future collider experiments. We point out the impact of the measurement of the mass and the mixing angle of $\\st$ to discriminate the models of SUSY breaking. Furthermore, the measurement of the polarization of $τ$ lepton($P_τ$) from the decaying $\\sti$ helps to determine the Yukawa sector of minimal supersymmetric standard model. We present our MC study of the production and the decay of $\\sti$ lepton at a future linear collider at $\\sqrt{s}=500$ GeV. The mass, mixing angle of $\\sti$ and $P_τ(\\sti\\rightarrowτχ_1^0)$ would be measured precisely at the future LC. ( talks given at Yukawa International Seminar(YIKS) '95 on some very hot and humid day in August, and also at Workshop on {\\it Physics and Experiments with Linear $e^+e^-$ Colliders} Appi, Iwate Japan Sep.8-12 1995.) △ Less", "We study the phenomenological implications of effective supergravities based on string vacua with spontaneously broken N=1 supersymmetry by dilaton and moduli $F$-terms. We further require Minimal String Unification, namely that large string threshold corrections ensure the correct unification of the gauge couplings at the grand unification scale. The whole supersymmetric mass spectrum turns out to be determined in terms of only two independent parameters, the dilaton-moduli mixing angle and the gravitino mass. In particular we discuss the region of the parameter space where at least one superpartner is ``visible\" at LEP2. We find that the most likely candidates are the scalar partner of the right-handed electron and the lightest chargino, with interesting correlations between their masses and with the mass of the lightest higgs. We show how discovering SUSY particles at LEP2 might rather sharply discriminate between scenarios with pure dilaton SUSY breaking and mixed dilaton-moduli breaking. △ Less", "A supersymmetric $Sp_{L}(6) \\times U_{Y}(1)$ model (SUSY $Sp(6)$) is proposed as an extension of the standard electroweak model. The model is applied in a phenomenological study of $B^{0}_{d} \\bar{B}^{0}_{d}$ mixing. It is found that the supersymmetric (SUSY) partner $\\tilde{z}^{\\prime}$ of the extra $Z^{\\prime}$ can significantly cancel the other contributions to bring the mixing parameter $x_{d}$ within the experimentally allowed range $0.57 \\stackrel{<}{\\sim} x_{d} \\stackrel{<}{\\sim} 0.77$ for a top mass of $158 \\stackrel{<}{\\sim} m_{t} \\stackrel{<}{\\sim} 194$ Gev. Other interesting and possibly novel features of flavor changing neutral currents (FCNC) in SUSY theories with horizontal gauge symmetries are pointed out. △ Less", "We study the stability of the gauge hierarchy in hidden-sector supergravity theories. We show that a destabilizing tadpole can appear if a theory has a gauge- and global-symmetry singlet with renormalizable couplings to the visible fields. We also find a quadratically divergent two-loop contribution to the supersymmetric effective potential. This term illustrates the difficulty of using the \"LHC mechanism\" to control quadratic divergences in theories with Planck-scale vevs. △ Less", "Precision electroweak data allow one to test the standard model, constrain its parameters, and search for the effects of some kinds of new physics. The results of the most recent data from LEP, SLC, and elsewhere are described, as are their predictions for $m_t$, $M_H$, and $α_s$. The implications for the two major classes of extensions of the standard model, supersymmetry/unification and compositeness, are described. △ Less", "If the reported excess (over the standard model prediction) for Z->bb from LEP persists, and is explained by supersymmetric particles in loops, then we show that (1) a superpartner (chargino and/or stop) will be detected at LEP2, and probably at LEP1.5 in 1995, (2) the basic parameter tan(beta) is at its lower perturbative limit, (3) BR(t->t1+chi0) is at or above 0.4, (4) the upper limit on m_h is considerably reduced, and (5) several important consequences arise for the form of a unified supersymmetric theory. Our analysis is done in terms of a general weak scale Lagrangian and does not depend on assumptions about SUSY breaking. △ Less", "A mechanism is suggested by which the dynamics of confinement could be responsible for the fermion mass matrix. In this approach the large top quark Yukawa coupling is generated naturally during confinement, while those of the other quarks and leptons stem from non-renormalizable couplings at the Planck scale and are suppressed. Below the confinement scale(s) the effective theory is minimal supersymmetric $SU(5)$ or the supersymmetric standard model. Particles in the $\\bar 5$ representations of $SU(5)$ are fundamental while those in the $10$ and $5$ are composite. The standard model gauge group is weakly coupled and predictions of unification can be preserved. A hierarchy in confinement scales helps generate a hierarchical spectrum of quark and lepton masses and ensures the Kobayashi-Maskawa matrix is nearly diagonal. However, the most natural outcome is that the strange quark is heavier than the charm quark; additional structure is required to evade this conclusion. No attempt has been made to address the issues of $SU(5)$ breaking, SUSY breaking, doublet/triplet splitting or the $μ$ parameter. While the models presented here are neither elegant nor complete, they are remarkable in that they can be analyzed without uncontrollable dynamical assumptions. △ Less", "The supersymmetric SO(10) GUT with $t$--$b$--$τ$ Yukawa coupling unification has problems with correct electroweak symmetry breaking, experimental constraints (especially $b\\rightarrow sγ$) and neutralino abundance, if the scalar masses are universal at the GUT scale. We point out that non-universality of the scalar masses at the GUT scale generated both by (1) renormalization group running from the Planck scale to the GUT scale and (2) $D$--term contribution induced by the reduction of the rank of the gauge group, has a desirable pattern to make the model phemenologically viable (in fact the only one which is consistent with experimental and cosmological constraints). At the same time the top quark mass has to be either close to its quasi IR--fixed point value or below $\\sim$170 GeV. We also briefly discuss the spectrum of superpartners which is then obtained. △ Less", "We analyze the scalar lepton mass matrices in a supersymmetric SO(10) grand unified model with soft SUSY breaking terms generated at Planck scale and a Georgi-Jarslkog Yukawa texture at GUT scale induced by higher dimensional operators. This model predicts lepton flavor violation. The predictive features of the Georgi-Jarlskog texture are used to estimate branching ratios for the radiative decays $e_{a} \\rightarrow e_{b}+γ,$ and we find rates that could provide an experimental test for this kind of model. △ Less", "We consider the neutralino as a dominant Dark Matter particle in the galactic halo and investigate some general issues of direct Dark Matter searches via elastic neutralino-nucleus scattering. On the basis of conventional assumptions about the nuclear and nucleon structure we analyse constraints on SUSY model parameter space accessible by the direct Dark Matter searches. This analysis shows that Dark Matter detectors fall into the THREE different categories with respect to their sensitivity to different groups of the SUSY model parameters. We calculate the event rate for various experimentally interesting isotopes within the Minimal Supersymmetric Standard Model (MSSM) taking into account the known accelerator and cosmological constraints on the MSSM parameter space. We investigate the role of nuclear spin in elastic neutralino - nucleus scattering. It is found that the contribution of the spin-dependent interaction to this process is subdominant for nuclei with atomic weights A > 50. △ Less", "This is a review of basic ideas and mechanisms encountered in the supersymmetry breaking problem at the global level, in supergravity models, and in superstring theory. △ Less", "We construct an extension of the recently proposed dynamical model for the breaking of SU(5)$_{\\rm GUT}$ gauge symmetry, in which a pair of massless chiral supermultiplets for Higgs doublets are naturally obtained. We point out that a model at a specific point in the parameter space of superpotential is regarded as a low-energy effective theory of an N=2 supersymmetric gauge model for the strongly interacting hypercolor sector. △ Less", "We consider FCNC and CP violating processes mediated by gluino exchange in generalized supersymmetric theories. We present the constraints on flavour (F) changing squark mass terms at the electroweak energy scale, focusing our analysis on $ΔF = 2$ transitions. Results are also given for $ΔF = 1$ CP conserving processes both in the hadronic and leptonic sectors, while we limit ourselves to some remarks on the relevance of box diagrams in the evaluation of $ε^{\\prime}/ε$. △ Less", "We analyze the theory of softly broken supersymmetric $QCD$. Exotic behavior like spontaneously broken baryon number, massless composite fermions and Seiberg's duality seems to persist also in the presence of (small) soft supersymmetry breaking. We argue that certain, specially tailored, lattice simulations may be able to detect the novel phenomena. Most of the exotic behavior does not survive the decoupling limit of large SUSY breaking parameters. △ Less", "We review various effective potential methods which have been useful to compute the Higgs mass spectrum and couplings of the minimal supersymmetric standard model. We compare results where all-loop next-to-leading-log corrections are resummed by the renormalization group, with those where just the leading-log corrections are kept. Pole masses are obtained from running masses by addition of convenient self-energy diagrams. Approximate analytical expressions are worked out, providing an excellent approximation to the numerical results which include all next-to-leading-log terms. An appropriate treatment of squark decoupling allows to consider large values of the stop and/or sbottom mixing parameters and thus fix a reliable upper bound on the mass of the lightest CP-even Higgs boson mass. △ Less", "We study the structure of the soft SUSY-breaking terms obtained from large classes of 4-D Strings under the assumption of dilaton/moduli dominance in the process of SUSY-breaking. In particular, we first analyze in detail the dilaton-dominated limit because of its finiteness properties and phenomenological predictivity, and second, we consider the new features appearing when several moduli fields contribute to SUSY breaking. Although some qualitative features indeed change in the multimoduli case with respect to the dilaton dominance one, the most natural mass relations at low-energy $m_l < m_q \\simeq M_g$ are still similar. We also study the presence of tachyons pointing out that their possible existence may be, in some cases, an interesting advantage in order to break extra gauge symmetries. Finally, we find that the mechanism for generating a ``$μ$-term'' by the Kähler potential, as naturally implemented in orbifolds, leads to the prediction $|tgβ|=1$ at the String scale, independently of the Goldstino direction. In this connection, it is worth noticing that in the dilaton-dominated case we obtain the remarkable result that the whole SUSY spectrum is completely determined with no free parameters. △ Less", "I present a way of reconciling gauge coupling unification in minimal supersymmetry with small $α_s(m_Z) \\approx 0.11$ and discuss the ensuing consequences. △ Less", "A detailed analysis of dark matter event rates in minimal supergravity models (MSGM) is given. It is shown analytically that the lightest neutralino the ${{\\tilde {Z}_{1}}}$ is the LSP over almost all of the parameter space, and hence the natural candidate for cold dark matter (CDM). The radiative breaking of $SU(2)\\times U(1)$ constraints are shown to be crucial in determining the expected event rates. Approximate analytic formulae are obtained to determine the gaugino-higgsino content of the ${{\\tilde{Z}_{1}}}$ particle.From this one can deduce the behavior of the event rates as one varies the SUSY soft breaking parameters and tan $β$. The constraint on the event rates due to the recently measured $b\\rightarrow s+γ$ decay is calculated. It is seen that this data eliminates most of the parameter space where $μ$ (the Higgs mixing parameter) and $A_t$ (the t-quark cubic soft breaking parameter) have the same sign. Since the t-quark is close to its Landau pole, $A_t$ is restricted to be mostly positive, and so most of the $μ>0$ part of the parameter space is eliminated... △ Less", "We show that in automatically R-conserving minimal SUSY left-right symmetric models there is a theoretical upper limit on the mass of the right-handed $W_R$ boson given by $M_{W_R}\\leq g M_{SUSY}/f$, where $M_{SUSY}$ is the scale of supersymmetry breaking, g is the weak gauge coupling and $f$ is the Yukawa coupling responsible for generating the right-handed neutrino masses. If $M_{W_R}$ violates the above limit, the ground state of the theory breaks electromagnetism. The only way to avoid this bound while keeping the theory automatically R-conserving is to expand the theory to include very specific kinds of additional multiplets and demanding unnatural finetuning of their couplings. △ Less", "We introduce the idea of natural mass matrices, an organizing principle useful in the search for GUT scale quark mass matrix patterns that are consistent with known CKM constraints and quark mass eigenvalues. An application of this idea is made in the context of SUSY GUTs and some potentially ``successful'' GUT scale mass patterns are found. The CKM predictions of these patterns are presented and some relevant strong CP issues are discussed. △ Less", "We study in detail the structure of Grand Unified Theories derived as the low-energy limit of orbifold four-dimensional strings. To this aim, new techniques for building level-two symmetric orbifold theories are presented. New classes of GUTs in the context of symmetric orbifolds are then constructed. The method of permutation modding is further explored and SO(10) GUTs with both $45$ or $54$-plets are obtained. SU(5) models are also found through this method. It is shown that, in the context of symmetric orbifold $SO(10)$ GUTs, only a single GUT-Higgs, either a $54$ or a $45$, can be present and it always resides in an order-two untwisted sector. Very restrictive results also hold in the case of $SU(5)$. General properties and selection rules for string GUTs are described. Some of these selection rules forbid the presence of some particular GUT-Higgs couplings which are sometimes used in SUSY-GUT model building. Some semi-realistic string GUT examples are presented and their properties briefly discussed. △ Less", "Fermion masses and mixing angles including that of neutrinos are studied in a model with symmetry group SUSY $SO(10)\\times Δ(48) \\times U(1)$. Universality of Yukawa coupling of superfields is assumed. The resulting texture of mass matrices in the low energy region depends only on a single coupling constant and VEVs caused by necessary symmetry breaking. 13 parameters involving masses and mixing angles in the quark and charged lepton sector are successfully described by only five parameters with two of them determined by the scales of U(1), SO(10) and SU(5) symmetry breaking compatible with the requirement of grand unification and proton decay. The neutrino masses and mixing angles in the leptonic sector are also determined with the addition of a Majorana coupling term. It is found that LSND $\\barν_μ\\rightarrow \\barν_{e}$ events, atmospheric neutrino deficit and the mass limit put by hot dark matter can be naturally explained. Solar neutrino puzzle can be solved only by introducing sterile neutrino with one additional parameter. More precise measurements of $α_{s}(M_{Z})$, $V_{cb}$, $V_{ub}/V_{cb}$, $m_{b}$, $m_{t}$, as well as various CP violation and neutrino oscillation experiments will provide crucial tests of the present model. △ Less", "We review the gauging of an R-symmetry in local and global susy. We then construct the first anomaly-free models. We break the R-symmetry and susy at the Planck scale and discuss the low-energy effects. We include a solution to the mu-problem, and the prediction of observable effects at HERA. The models also nicely allow for GUT-scale baryogenesis and R-parity violation without the sphaleron interactions erasing the baryon-asymmetry. △ Less", "When SUSY breaking produces only dimension-2 terms in the minimal supersymmetric standard model, the parameters of the theory can be rather well constrained. This paper deals with strategies for the detection of the new hadrons predicted in the 1-3 GeV mass range. Some limits are obtained. New signatures for squarks are also given. Squark masses as small as 45 GeV are not yet excluded. △ Less", "I explore an economical variant on supersymmetric standard models which may be indicated on cosmological grounds and is shown to have no SUSY-CP problem. Demanding radiative electroweak symmetry breaking suggests that the Higgs is light; other scalar masses may be ~ 100-200 GeV or less. In this case the gluino and photino, while massless at tree level, have 1-loop masses m(gluino) ~ 100 - 600 MeV and m(photino) ~ 100 - 1000 MeV. New hadrons with mass ~ 1 - 3 GeV are predicted and their lifetimes estimated. Existing experimental limits are discussed. △ Less", "The neutrino mass problem in $SU(4) \\times SU(2)_{L} \\times SU(2)_{R}$ SUSY GUT obtained from the compactification of $E_{8} \\times E_{8}$ heterotic string is analyzed. The estimated values of the neutrino masses and mixing angles can explain the experimental data on solar neutrino flux. △ Less", "We examine a superpotential for an SO(10) GUT and show that if the parameters of the superpotential are in a certain region, the SO(10) GUT has an intermediate symmetry ${\\rm SU(2)}_L \\otimes {\\rm SU(2)}_R \\otimes {\\rm SU(3)}_C \\otimes {\\rm U(1)}_{B-L}$ which breaks down to the group of the Standard Model at an intermediate scale $10^{10-12}$ GeV. In the model by the breakdown of the symmetry right-handed neutrinos acquire mass of the intermediate scale through a renormalizable Yukawa coupling. △ Less", "A complete phenomenological study of the next-to-lightest neutralino decays is performed in the MSSM. The widths and branching ratios for all the possible decay channels (including the radiative decay X0(2) --> X0(1) gamma and the decay into a light Higgs X0(2) --> X0(1) h0) are studied in detail as functions of all the SuSy parameters of the model. Particular attention is paid to situations that are interesting for LEP2 searches. Non-trivial decay patterns are found that critically depend on the region of the parameter space considered. △ Less", "We discuss the fermion mass problem in SUSY GUTs, including such ideas as texture zeroes, and Georgi-Jarlskog textures. We focus on a specific supersymmetric model based on the gauge group $SU(4)\\otimes SU(2)_L \\otimes SU(2)_R$. In this model the gauge group is broken to that of the standard model at $10^{16}$ GeV, and supersymmetry is broken at low-energy. The model may be regarded as a ``surrogate SUSY GUT'', and has several advantages over the $SU(5)$ and $SO(10)$ SUSY GUTs, such as the absence of the doublet-triplet splitting problem, and a simpler Higgs sector which does not involve any large Higgs representations. The model predicts full quadruple Yukawa unification (top-bottom-tau-tau neutrino), leading to the prediction of large top mass and $\\tan β$. An operator analysis leads to schemes where the strange and down mass are predicted, and $|V_{ub}|>0.004$. △ Less", "We apply the full one-loop corrections to the masses, gauge couplings, and Yukawa couplings in the minimal supersymmetric standard model. We focus on predictions for the strong coupling and the bottom-quark pole mass in the context of SU(5) supersymmetric grand unification. We discuss our results in both the small and large $\\tanβ$ regimes. We demonstrate that the finite (non-logarithmic) corrections to the weak mixing angle are essential in determining $α_s$ and $m_b$ when some superpartner masses are light. Minimal SU(5) predicts acceptable $α_s$ and $m_b$ only at small $\\tanβ$ with SUSY masses of $\\cal O$(TeV). The missing doublet model accommodates gauge and Yukawa coupling unification for small or large $\\tanβ$, and for any SUSY mass scale. In the large $\\tanβ$ case, the bottom mass is acceptable only if the Higgsino mass parameter $μ$ is positive. △ Less", "We study Radiative Electroweak Symmetry Breaking in the Minimal Supersymmetric Standard Model (MSSM). We employ the 2-loop Renormalization Group equations for running masses and couplings taking into account sparticle threshold effects. The decoupling of each particle below its threshold is realized by a step function in all one-loop Renormalization Group equations (RGE). This program requires the calculation of all wavefunction, vertex and mass renormalizations for all particles involved. Adapting our numerical routines to take care of the succesive decoupling of each particle below its threshold, we compute the mass spectrum of sparticles and Higgses consistent with the existing experimental constraints. The effect of the threshold corrections is in general of the same order of magnitude as the two-loop contributions with the exception of the heavy Higgses. △ Less", "The doublet-triplet splitting problem is probably the most significant challenge to supersymmetric GUT theories. In this talk, we review potential solutions and their problematic aspects. We also present a complete consistent realization of our preferred solution, higgses as pseudogoldstone bosons, and discuss some distinctive aspects of its phenomenology. △ Less", "We study $N=1$ SUSY gauge theories in four dimensions with gauge group $Spin(7)$ and $N_f$ flavors of quarks in the spinorial representation. We find that in the range $6< N_f < 15$, this theory has a long distance description in terms of an $SU(N_f-4)$ gauge theory with a symmetric tensor and $N_f$ antifundamentals. As a spin-off, we obtain by deforming along a flat direction a dual description of the theories based on the exceptional gauge group $G_2$ with $N_f$ fundamental flavors of quarks. △ Less", "We extend Seiberg's qualitative picture of the behavior of supersymmetric QCD to nonsupersymmetric models by adding soft supersymmetry breaking terms. In this way, we recover the standard vacuum of QCD with $N_f$ flavors and $N_c$ colors when $N_f < N_c$. However, for $N_f \\geq N_c$, we find new exotic states---new vacua with spontaneously broken baryon number for $N_f = N_c$, and a vacuum state with unbroken chiral symmetry for $N_f > N_c$. These exotic vacua contain massless composite fermions and, in some cases, dynamically generated gauge bosons. In particular Seiberg's electric-magnetic duality seems to persist also in the presence of (small) soft supersymmetry breaking. We argue that certain, specially tailored, lattice simulations may be able to detect the novel phenomena. Most of the exotic behavior does not survive the decoupling limit of large SUSY breaking parameters. △ Less", "In this talk I discuss three-body decays of the SUSY Higgs bosons which proceed via intermediate two-body states in which one of the particles is off-mass-shell. Some of these decays will be shown to have substantial branching ratios in some range of the SUSY parameter space. △ Less", "The structure of gauged R supergravity Lagrangians is reviewed, and we consider models with a hidden sector plus light fields of the MSSM. A simple potential for the hidden sector is presented which has a global minimum with zero cosmological constant and spontaneously broken SUSY and R-symmetry. The $\\rm U(1)_R$ vector multiplet acquires a Planck scale mass through the Higgs mechanism, and it decouples at low energy. Due to very interesting cancellations, the $\\rm U(1)_R$ D-terms also drop out at low energy. Thus no direct effects of the gauging of R-symmetry remain in the low energy effective Lagrangian, and this result is model independent, requiring only that R-symmetry be broken at the Planck scale and $<D> = 0$, where $D$ is the auxiliary field of the $\\rm U(1)_R$ vector multiplet. The low energy theory is fairly conventional with soft SUSY breaking terms for the MSSM fields. As a remnant of the gauging of R-symmetry, it also contains light fields, some required to cancel R-anomalies and others from the hidden sector. △ Less", "A quantitative analysis of $\\amu\\equiv{1\\over 2}(g-2)_μ$ within the framework of Supergravity Grand Unification and radiative breaking of the electro-weak symmetry is given. It is found that $a_μ^{SUSY}$ is dominated by the chiral interference term from the light chargino exchange, and that this term carries a signature which correlates strongly with the sign of $μ$. Thus as a rule $a_μ^{SUSY}>0$ for $μ>0$ and $a_μ^{SUSY}<0$ for $μ<0$ with very few exceptions when tan$β\\sim 1$. At the quantitative level it is shown that if the E821 BNL experiment can reach the expected sensitivity of $4\\times 10^{-10}$ and there is a reduction in the hadronic error by a factor of four or more, then the experiment will explore a majority of the parameter space in $ m_0-m_{\\tilde g}$ plane in the region $m_0\\lsim 400$ GeV, $m_{\\tilde g}\\lsim 700$ GeV for $\\tanbeta \\gsim 10$ assuming the experiment will not discard the Standard Model result within its $2σ$ uncertainty limit. For smaller $\\tanbeta$, the SUSY reach of E821 will still be considerable. Further, if no effect within $2 σ$ limit of the Standard Model value is seen, then large $\\tanbeta$ scenarios will be severely constrained within the current naturalness criterion, ie., $m_0, m_{\\tilde g}\\lsim 1$ TeV. △ Less", "We show that the soft SUSY breaking mass terms may have infra-red stable fixed points at which they are related to the gaugino masses and argue that in a generic unification these masses should lie close to their fixed points. We consider the implications for the family dependence of squark and slepton masses and the related flavour changing neutral currents and determine conditions under which models with flavour changing couplings and masses at a high scale may lead to a family independent effective theory at low scales. The analysis is illustrated for a variety of models for which we compute both the fixed point structure and determine the rate of approach to the fixed point. △ Less", "We investigate the phenomenology of minimal four-family MSSM supergravity theories containing an additional generation of heavy fermions along with their superpartners. We demand: gauge coupling constant unification at high energy scales; perturbative values for all Yukawa couplings for energy scales $\\leq \\mgut$; radiative electroweak symmetry breaking via renormalization group evolution; and a neutral LSP. The perturbative constraints imply a light fourth-family quark and lepton spectrum, and $\\tanb\\lsim 3$. The lightest CP-even Higgs mass is increased. Fourth-family Yukawa coupling contributions to the evolution of scalar masses lead to unexpected mass hierarchies; \\eg\\ the $\\staupone$ is generally the lightest slepton and the lightest squark is the $\\wt\\bpr_1$. A significant lower bound is placed on the gluino mass by the requirement that the $\\staupone$ not be the LSP. Sleptons of the first two families are much more massive compared to the LSP and other neutralinos and charginos than in the three-family models, and could easily lie beyond the reach of a $\\sqrt s=500\\gev$ $\\epem$ collider. Relations between slepton masses and gaugino masses are shown to be very sensitive to the presence of a fourth generation. The most important near-future experimental probes of the four-family models are reviewed. A scenario with $\\mt\\sim\\mw$ and $t\\rta {\\wt t_1}\\cnone$ is shown to be inconsistent with universal soft-SUSY-breaking boundary conditions. Full four-family evolution of $α_s$ is shown to lead to a significant enhancement in inclusive jet and di-jet spectra at Tevatron energies when all sparticle masses are near their lower bounds. △ Less", "I consider the superfield derivation of the effective theory of softly broken supersymmetry below the GUT scale. I point out the role of supergauge invariance in determining the form of the result, which is rather restricted in interesting classes of models. As an example I discuss sfermion mass splittings for matter embedded in a single GUT multiplet. Interesting differences arise between the cases of $SU(5)$, $SO(10)$ and $E_6$. △ Less", "We give a preliminary report of a new quark mass matrix model basing on a $SU(5)\\otimes SU(5)\\otimes Q_{12}$ symmetry embedding into a fully gauged $SU(5)\\otimes SU(5)\\otimes SU(2)$.~\\cite{fk} The two $SU(5)$'s contain the standard SUSY $SU(5)$ as a diagonal subgroup, while the $Q_{12}$ or $SU(2)$ is horizontal. Starting by assuming a judiciously-chosen set of chiral supermultiplets, and a pattern of spontaneous symmetry breaking, we obtain the low-energy chiral fermions together with a spectrum of superheavy fermions at two different scales. The latter mediate Froggatt-Nielsen tree graphs that give rise to a phenomenologically viable effective quark mass matrix texture. The model is the first example of a nontrivial combination of supersymmetry without R-parity, gauged nonabelian horizontal symmetry and unification/anti-unification. It is expected to have some very interesting features in SUSY-GUT phenomenology. △ Less", "Going beyond the theta function approximation we discuss supersymmetric unification of gauge couplings with exact decoupling of light and heavy particles at energy scales below their masses. We find that the Minimal SUSY model is strongly disfavored while the Missing Doublet Model survives with GUT scale masses rising into the $10^{18}$ GeV region. △ Less", "Some possible tests of physics beyond the Standard Model in the next generation collider experiments are considered. The main emphasis is put on the processes which may be studied in the non-conventional $e^-e^-$, $e^-γ$ and $γγ$ operation modes of the next linear collider (NLC). In particular, sensitivity of the NLC for testing the gauge boson self-interactions through the reaction $e^-γ\\to W^-ν$ is investigated. High energy tests of the susy and non-susy left-right symmetric models are analysed. △ Less", "We consider thermal properties of the susy singlet majoron model. We compute the critical temperature $T_c$ and the subsequent reheating temperature $T_{\\rm RH}$ for $R$-parity breaking. Succesful baryogenesis constrains the parameter space via the requirements that $T_c$ and $T_{\\rm RH}$ are lower than the electroweak phase transition temperature. A further constraint is provided by requiring that the gauge singlet should be kinematically allowed to decay, in order not to have a matter dominated universe at the time of nucleosynthesis. We have made a detailed study of the parameter space and find an upper limit for the susy breaking scalar mass $\\mm\\lsim 750~(900)$ GeV if $\\gluino=100~(1000)$ GeV, which is valid except for certain special values of the singlet sector parameters. △ Less", "Recently the vacuum structure of a large class of four dimensional (supersymmetric) quantum field theories was determined exactly. These theories exhibit a wide range of interesting new physical phenomena. One of the main new insights is the role of ``electric-magnetic duality.'' In its simplest form it describes the long distance behavior of some strongly coupled, and hence complicated, ``electric theories'' in terms of weakly coupled ``magnetic theories.'' This understanding sheds new light on confinement and the Higgs mechanism and uncovers new phases of four dimensional gauge theories. We review these developments and speculate on the outlook. △ Less", "Supersymmetry breaking may be linked to the formation of gaugino condensates in a hidden sector. In this work, the process of formation of the condensate is examined in a cosmological context, using an effective field theory of the gaugino bilinear which provides a reasonable interpolation between the high- and low-temperature phases. The implementation of anomaly requirements generates a large potential barrier between the zero-condensate configuration and that of the true (SUSY-breaking) vacuum. As a consequence, the transition to bubbles of true vacuum may be subject to an enormous exponential suppression. This leads to the same difficulties with inhomogeneity of the universe which occurred in the original inflationary scenarios. △ Less", "Working within the framework of the minimal supergravity model with gauge coupling unification and radiative electroweak symmetry breaking (SUGRA), we map out regions of parameter space explorable by experiments at LEP2, for center of mass energy options of $\\sqrt{s}=150,\\ 175$, $190$ and 205 GeV. We compute signals from all accessible $2 \\rightarrow 2$ SUSY pair production processes using the ISAJET simulation program, and devise cuts that enhance the signal relative to Standard Model backgrounds, and which also serve to differentiate various supersymmetric processes from one another. We delineate regions of SUGRA parameter space where production of neutralino pairs, chargino pairs, slepton pairs and the production of the light Higgs scalar of SUSY is detectable above Standard Model backgrounds and distinguishable from other SUSY processes. In addition, we find small regions of SUGRA parameter space where $\\te\\te$, $\\tz_2\\tz_2$ and $\\tnu_L\\tnu_L$ production yields spectacular events with up to four isolated leptons. The combined regions of parameter space explorable by LEP2 are compared with the reach of Tevatron Main Injector era experiments. Finally, we comment on how the reach via the neutralino pair channel is altered when the radiative electroweak symmetry breaking constraint is relaxed. △ Less", "It is noted that in the context of a supersymmetric preonic approach to unification, gravity, though weak, can play an essential role in determining some crucial aspects of low-energy physics. These include: (i) SUSY-breaking, (ii) electroweak symmetry-breaking, and (iii) generation of masses of quarks and leptons, all of which would vanish if we turn off gravity. Such a role of gravity has its roots in the Witten index theorem which would forbid SUSY-breaking, within the class of theories under consideration, in the absence of gravity. △ Less", "Supersymmetric flat directions can have a number of important consequences in the very early universe. Depending on the form of the SUSY breaking potential arising from the finite energy density at early times, coherent production of scalar condensates can result along such directions. This leads a cosmological disaster for Polonyi type flat directions with only Planck suppressed couplings, but can give rise to the baryon asymmetry for standard model flat directions. Flat directions are also natural candidates to act as inflatons. Achieving density fluctuations of the correct magnitude generally requires an additional hidden SUSY breaking sector. △ Less", "If $R$-parity is not conserved, the SUSY-threshold production process $e^+e^- \\to χ_1^0χ_1^0$ could be detectable with relatively low luminosity. Hence an interesting mass range for the lightest SUSY particle $χ_1^0$ could be explored at the CERN LEP collider during its intermediate energy development, even before the full LEP200 upgrade is completed. We present cross section formulas and discuss event rates and detection for the three distinct decay options: $χ_1^0\\to 2\\, {\\rm charged \\; leptons}\\, +\\, {\\rm neutrino}$, $χ_1^0\\to {\\rm lepton}\\, +2\\, {\\rm quarks}$, and $χ_1^0\\to 3\\, {\\rm quarks}$. △ Less", "We study the effects of additional fields on the unification of gauge couplings in supersymmetric models. We find that the effects are quite constrained by the requirement of SU(5) gauge invariance. In general, we find that any extension of the MSSM will form complete SU(5) multiplets or spoil gauge coupling unification. △ Less", "It is shown that in realistic SUSY GUT models of quark and lepton masses both the proton decay rate and branching ratios differ in general from those predicted in the minimal $SU(5)$ supersymmetric model. The observation of proton decay, and in particular the branching ratio $B[(p \\rightarrow π^+ \\overlineν)/(p \\rightarrow K^+ \\overlineν)]$, would thus allow decisive tests of these fermion mass schemes. It is shown that the charged lepton decay modes $p \\rightarrow K^0 μ^+, p \\rightarrow K^0 e^+$ arising through gluino dressing diagrams are significant and comparable to the neutrino modes in large tan$β$ models. Moreover, it is found that in certain classes of models the Higgsino-mediated proton decay amplitudes are proportional to a model-dependent group-theoretical factor which in some cases can be quite small. The most interesting such class consists of $SO(10)$ models in which the dominant flavor-symmetric contribution to the up-quark mass matrix comes from an effective operator of the form ${\\bf 16}_i{\\bf 16}_j {\\bf 10}_H {\\bf 45}_H$, where $\\langle {\\bf 45}_H \\rangle$ points approximately in the $I_{3R}$ direction. This class includes a recent model of quark and lepton masses proposed by the authors. △ Less", "Gauge and Yukawa (for the third family) coupling unification seem to be the best predictions of the grand-unified theories (GUTs). In supersymmetric GUTs, one also expects that the sparticle masses unify at the GUT scale (for sparticles embedded in the same GUT multiplet). I show under what circumstances GUTs do not lead to sparticle mass unification. In particular, I give examples of SU(5) and SO(10) SUSY GUTs in which squarks and sleptons of a family have different tree-level masses at the unification scale. The models have interesting relations between Yukawa couplings. For example, I present an SO(10) GUT that allows for a large ratio of the top to bottom Yukawas, accounting for the large $m_t /m_b$. The splittings can also be induced in the Higgs soft masses and accommodate the electroweak breaking. △ Less", "In this paper we study the influence of the threshold effects due to massive degrees of freedom in the evolution with scale of gauge coupling constants. We first describe in detail the (standard) mass dependent renormalization prescription we use. This guides us to introduce and work with effective couplings, which are finite, process independent, and include complete threshold effects. We compute the evolution of the effective couplings in both, the Standard Model and its Minimal Supersymmetric extension, from \\mz\\ to the high energy region. We find that the effects from thresholds due to the standard massive gauge bosons are non--negligible, contrary to what is generally assumed when using other, less--accurate, descriptions of the thresholds, as for example in the step--function approximation. Moreover, we find that thresholds are relevant when studying perturbative SUSY unification, changing the conclusions reached when using the step--function approach. We find that threshold effects bring conflict between the known experimental data at $m_Z$, the naturalness upper bound on the masses of SUSY partners and the $perturbative$ unification of couplings. △ Less", "We compute the supersymmetric contribution to $R_{b}\\equiv Γ(Z\\to b{\\bar b})/Γ(Z\\to {\\rm hadrons})$ in a variety of supersymmetric models. In the context of supergravity models with universal soft-supersymmetry-breaking and radiative electroweak breaking we find $R^{\\rm susy}_b\\lsim0.0004$, which does not shift significantly the Standard Model prediction ($R^{\\rm SM}_b=0.2157$ for $m_t=175\\GeV$; $R^{\\rm exp}_b=0.2204\\pm0.0020$). We also compute $R_b$ in the minimal supersymmetric standard model (MSSM), and delineate the region of parameter space which yields interestingly large values of $R_b$. This region entails light charginos and top-squarks, but is {\\em strongly} restricted by the {\\em combined} constraints from $B(b\\to sγ)$ and a not-too-large invisible top-quark branching ratio: only a few percent of the points with $R^{\\rm susy}_b>0.0020\\,(1σ)$ are allowed. △ Less", "I discuss several issues concerning the use of string models as unified theories of all interactions. After a short review of gauge coupling unification in the string context, I discuss possible motivations for the construction of $SU(5)$ and $SO(10)$ String-GUTs. I describe the construction of such String-GUTs using different orbifold techniques and emphasize those properties which could be general. Although $SO(10)$ and $SU(5)$ String-GUTs are relatively easy to build, the spectrum bellow the GUT scale is in general bigger than that of the MSSM and includes colour octets and $SU(2)$ triplets. The phenomenological prospects of these theories are discussed. I then turn to discuss soft SUSY-breaking terms obtained under the assumption of dilaton/moduli dominance in SUSY-breaking string schemes. I underline the unique finiteness pr of the soft terms induced by the dilaton sector. These improved finiteness properties seem to be related to the underlying $SU(1,1)$ structure of the dilaton couplings. I conclude with an outlook and some speculations regarding $N=1$ duality. △ Less", "We discuss the unification of gauge couplings within the framework of a wide class of realistic free-fermionic string models which have appeared in the literature, including the flipped SU(5), SO(6)xSO(4), and various SU(3)xSU(2)xU(1) models. If the matter spectrum below the string scale is that of the Minimal Supersymmetric Standard Model (MSSM), then string unification is in disagreement with experiment. We therefore examine several effects that may modify the minimal string predictions. First, we develop a systematic procedure for evaluating the one-loop heavy string threshold corrections in free-fermionic string models, and we explicitly evaluate these corrections for each of the realistic models. We find that these string threshold corrections are small, and we provide general arguments explaining why such threshold corrections are suppressed in string theory. Thus heavy thresholds cannot resolve the disagreement with experiment. We also study the effect of non-standard hypercharge normalizations, light SUSY thresholds, and intermediate-scale gauge structure, and similarly conclude that these effects cannot resolve the disagreement with low-energy data. Finally, we examine the effects of additional color triplets and electroweak doublets beyond the MSSM. Although not required in ordinary grand unification scenarios, such states generically appear within the context of certain realistic free-fermionic string models. We show that if these states exist at the appropriate thresholds, then the gauge couplings will indeed unify at the string scale. Thus, within these string models, string unification can be in agreement with low-energy data. △ Less", "A long-standing problem in string phenomenology has been the fact that the string unification scale disagrees with the GUT scale obtained by extrapolating low-energy data within the framework of the minimal supersymmetric standard model (MSSM). In this paper we examine several effects that may modify the minimal string predictions and thereby bring string-scale unification into agreement with low-energy data. These include heavy string threshold corrections, non-standard hypercharge normalizations, light SUSY thresholds, intermediate gauge structure, and thresholds arising from extra matter beyond the MSSM. We explicitly evaluate these contributions within a variety of realistic free-fermionic string models, including the flipped SU(5), SO(6) x SO(4), and various SU(3) x SU(2) x U(1) models, and find that most of these sources do not substantially alter the minimal string predictions. Indeed, we find that the only way to reconcile string unification with low-energy data is through certain types of extra matter. Remarkably, however, many of the realistic string models contain precisely this required matter in their low-energy spectra. △ Less", "The first fermion family might play a key role in understanding the structure of flavour: a role of the mass unification point. The GUT scale running masses $\\bar{m}_{e,u,d}$ are rather close, which may indicate an approximate symmetry limit. Following this observation, we present a new predictive approach based on the SUSY $SO(10)$ theory with $\\tanβ\\sim 1$. The inter-family hierarchy is first generated in a sector of hypothetical superheavy fermions and then transfered inversely to ordinary quarks and leptons by means of the universal seesaw mechanism. The Yukawa matrices are simply parametrized by the small complex coefficients $\\eps_{u,d,e}$ which are related by the $SO(10)$ symmetry properties. Their values are determined by the ratio of the GUT scale $M_X\\simeq 10^{16}$ GeV to a higher (possibly string) scale $M\\simeq 10^{17}-10^{18}$ GeV. The suggested ansatz correctly reproduces the fermion mass and mixing pattern. By taking as input the masses of leptons and $c$ and $b$ quarks, the ratio $m_s/m_d$ and the value of the Cabibbo angle, we compute the $u,d,s$ quark masses, top mass and $\\tanβ$. The top quark is naturally in the 100 GeV range, but with upper limit $M_t<165$ GeV, while the lower bound $M_t>160$ GeV implies $m_s/m_d>22$. $\\tanβ$ can vary from 1.4 to 1.7. The proton decaying $d=5$ operators $qqql$ are naturally suppressed. △ Less", "We show that one of the ways of obtaining consistency between the idea of supersymmetric grand unification and an apparent low value of $α_{strong}(M_Z)\\simeq .11$ indicated by several low energy experiments is to have an intermediate scale corresponding to a local $B-L$ symmetry breaking around the mass scale of $10^{10}$ to $10^{12}$ GeV. We discuss the realization of this idea within the framework of supersymmetric $SO(10)$ grand unified theories with spectra of particles derivable from simple superstring-inspired versions of this model. We then study the $b-τ$ mass unification within this class of models and show that due to the influence of new gauge and Yukawa interactions beyond the intermediate scale, the prediction of the $b$-quark mass comes out well within the presently accepted values. We also discuss an un-orthodox class of SUSY models inspired by some theoretical considerations having two pairs of Higgs doublets at low energy and show that they also can lead to unification with intermediate scales and low $α_{s}(M_Z)$ as desired. △ Less", "We investigate Supersymmetric models where neither R parity nor lepton number is imposed. Neutrino masses can be kept highly suppressed compared to the electroweak scale if the $μ$-terms in the superpotential are aligned with the SUSY-breaking bilinear $B$-terms. This situation arises naturally in the framework of horizontal symmetries. The same symmetries suppress the trilinear R parity violating terms in the superpotential to an acceptable level. △ Less", "A case is made for an alternative approach to unification that is based on a {\\it purely gauge origin of the fundamental forces}, and is thus devoid of the Higgs-sector altogether. This approach seems to call for the ideas of local supersymmetry and preons. The advantage of this marriage of the ideas of local supersymmetry and preons, subject to two broad dynamical assumptions which are specified, are noted. These include true economy and viability as well as an understanding of the origins of (a) family-replication, (b) inter-family mass-hierarchy, and (c) diverse mass-scales which span from $M_{Planck}$ to $m_W \\sim m_t$ to $m_e$ to $m_ν$. In short, the approach seems capable of providing {\\it a unified origin of the forces, the families and the mass-scales}. In the process, the preonic approach provides the scope for synthesizing a rich variety of phenomena all of which could arise dynamically through one and the same tool -- the SUSY metacolor force coupled with gravity -- at the scale of $10^{11}GeV$. The phenomena include: (i) spontaneous violations of parity, CP, B-L and Peccei-Quinn symmetry, (ii) origin of heavy Majorana mass for $ν_R$, (iii) SUSY breaking, (iv) origins of even $m_W,~m_q$ and $m_\\ell$, as well as, (v) inflation and lepto/baryo-genesis. Some intriguing experimental consequences of the new approach which could show at LEPI, LEPII and Tevatron and a {\\it crucial prediction} which can be probed at the LHC and NLC are presented. △ Less", "I present a detailed SUSY QCD calculation of the decay rate of the lightest Higgs boson $H^0_2$\\ into two gluons, where all quarks and scalar quarks are taken within the relevant loop diagrams. I include the mixing of all the scalar partners of the left and right handed quarks and show that their contribution is more than several tens of per cent compared to the quark contribution in the MSSM for some SUSY parameter space. Furthermore the fermionic contribution is enhanced by several factors for large $\\tanβ$\\ and large Higgs masses. As a result, the two gluon decay rate of $H_2^0$\\ is much larger than the two gluon decay rate of an equal mass standard model Higgs boson. I further compare the decay mode of $H^0_2\\rightarrow gg$\\ to the similar decay modes of $H^0_2\\rightarrow c\\overline c$\\ and $H^0_2\\rightarrow b\\overline b$\\ including one loop QCD corrections and show that in some cases $Γ(H^0_2\\rightarrow gg)$\\ is even higher than $Γ(H^0_2\\rightarrow c\\overline c)$, although still much smaller than $Γ(H^0_2\\rightarrow b\\overline b)$. △ Less", "We evaluate the finite 1-loop threshold corrections, proportional to $tanβ$, to the down quark mass matrix. These result in corrections to down quark masses and to Cabibbo-Kobayashi-Maskawa [CKM] matrix elements. The corrections to CKM matrix elements are the novel feature of this paper. For grand unified theories with large $\\tanβ$ these corrections may significantly alter the low energy predictions of four of the CKM matrix elements and the Jarlskog parameter J, a measure of CP violation. The angles $α,\\: β$ and $γ$ of the unitarity triangle and the ratio $|{V_{ub} \\over V_{cb}}|$, however, are not corrected to this order. We also discuss these corrections in the light of recent models for fermion masses. Here the corrections may be useful in selecting among the various models. Moreover, if one model fits the data, it will only do so for a particular range of SUSY parameters. △ Less", "We study the $C$ and $P$ even $WWγ$ and $WWZ$ trilinear gauge boson vertices (TGV's), in the context of the MSSM as functions of the soft SUSY breaking parameters $A_0, m_0, M_{1/2}$ and the momentum $q$ carried by $γ, Z$, assuming the external $W$'s are on their mass shell. We follow a complete renormalization group analysis taking into account all constraints imposed by the radiative breaking of the electroweak symmetry. It is found that for energies ${\\sqrt{s}} \\equiv q^2 \\le 200 \\; GeV$ squark and slepton contributions to the aforementioned couplings are two orders of magnitude smaller than those of the Standard Model (SM). In the same energy range the bulk of the supersymmetric Higgs corrections to the TGV's is due to the lightest neutral Higgs, $h_0$, whose contribution is like that of a Standard Model Higgs of the same mass. The rest have negligible effect due to their heaviness. The contributions of the Neutralinos and Charginos are sensitive to the input value for the soft gaugino mass $M_{1/2}$ being more pronounced for values $M_{1/2} < 100 \\; GeV$. In this case and in the unphysical region, $0 < \\sqrt{s} < 2 M_W $ their contributions are substantially enhanced resulting to large corrections to the static quantities of the $W$ boson. However such an enhancement is not observed in the physical region and their corrections to the TGV's are rather small. In general for $2 M_W < \\sqrt{s} < 200 \\; GeV $ the MSSM predictions differ from those of the SM but they are of the same order of magnitude. Deviations from the SM predictions to be detectable require sensitivities reaching the per mille level and hence unlikely to be observed at LEP200. For higher energies SM and MSSM predictions exhibit a fast fall off behaviour, in accord with unitarity requirements, getting smaller by almost an △ Less", "We discuss the motivations and implications of models of low-energy supersymmetry. We present the case for the minimal supersymmetric standard model, which we define to include the minimal particle content and soft supersymmetry-breaking interactions which are universal at the GUT or Planck scale. This model is in agreement with all present experimental results, and yet depends on only a few unknown parameters and therefore maintains considerable predictive power. From the theoretical side, it arises naturally in the context of supergravity models. We discuss radiative electroweak symmetry breaking and the superpartner spectrum in this scenario, with some added emphasis on regions of parameter space leading to unusual or interesting experimental signals at future colliders. We then examine how these results may be affected by various modifications and extensions of the minimal model, including GUT effects, extended gauge, Higgs, and matter sectors, non-universal supersymmetry breaking, non-conservation of R-parity, and dynamical supersymmetry breaking at low energies. △ Less", "The differential cross-section for the elastic scattering of the lightest supersymmetric particle (LSP) with nuclear targets is calculated in the context of currently fashionable supersymmetric theories (SUSY). An effective four fermion interaction is constructed by considering i) $Z^0$ exchange ii)s-quark exchange and iii) Higgs exchange. It is expressed in terms of the form factors $f^0_V,f^0_A, f^0_S$ (isoscalar) and $f^1_V,f^1_A$ and $f^1_S$ (isovector) which contain all the information of the underlining theory. Numerical values were obtained using representative input parameters in the constrained parameter space of SUSY phenomenology. Both the coherent and for odd-A nuclei the incoherent (spin) nuclear matrix elements were evaluated for nuclei of experimental interest. The spin matrix elements tend to dominate for odd nuclei but the coherent matrix elements become more important in all other cases. For the coherent part the Higgs contribution competes with the Z- and s-quark contributions. Cross-sections as high as $10^{-37} cm^2$ have been obtained. △ Less", "We propose, for the computation of the Higgs mass spectrum and couplings, a renormalization-group improved leading-log approximation, where the renormalization scale is fixed to the top-quark pole mass. For the case $m_A\\sim M_{\\rm SUSY}$, our leading-log approximation differs by less than 2 GeV from previous results on the Higgs mass computed using a nearly scale independent renormalization-group improved effective potential up to next-to-leading order. Moreover, for the general case $m_A\\simlt M_{\\rm SUSY}$, we provide analytical formulae (including two-loop leading-log corrections) for all the masses and couplings in the Higgs sector. For $M_{\\rm SUSY}\\simlt 1.5$ TeV and arbitrary values of $m_A$, $\\tanβ$ and the stop mixing parameters, they reproduce the numerical renormalization-group improved leading-log result for the Higgs masses with an error of less than 3 GeV. For the Higgs couplings, our analytical formulae reproduce the numerical results equally well. Comparison with other methods is also performed. △ Less", "I advocate the virtues of a very economical version of the minimal supersymmetric standard model which avoids cosmological problems often encountered in dynamical SUSY-breaking and solves the SUSY-CP problem. Imposing $m_Z=91$ GeV and $m_t \\sim 175$ GeV implies that scalar masses are generally $100-200$ GeV. The gluino and photino are massless at tree level. At 1-loop, the gluino mass is predicted to be in the range $m_{\\gluino}: 100 - 600$ MeV and the photino mass can be estimated to be $m_{\\photino}: 100 - 1400$ MeV. New hadrons with mass $\\sim 1 \\frac{1}{2}$ GeV are predicted and described. The ``extra'' flavor singlet pseudoscalar observed in two experiments in the $ι(1440)$ region, if confirmed, is naturally interpreted as the state which gets its mass via the QCD anomaly. Its superpartner, a gluon-gluino bound state, generally has a lifetime longer than $5~10^{-11}$ sec and would not have shown up in existing searches. Search strategies and other consequences of the scenario are discussed. △ Less", "We calculate the induced Einstein action from supersymmetric models in general space-time. Supersymmetric models consist of two kinds of supermultiplets, called scalar supermultiplets and vector supermultiplets, respectively. We show that the vector multiplets generate a negative Newton constant, while the scalar multiplets a positive one. Then we find that the positivity of Newton constant depends on the ratio of the number of scalar multiplets to one of vector multiplets. If we apply this result to two hopeful supersymmetric unified models: one is minimal SUSY standard model and another is minimal SUSY SU(5) GUT, we are led to the conclusion that we need more than or equal to three generations of quark and lepton multiplets to have a positive Newton constant, i.e., an attractive gravity. △ Less", "Supersymmetric hadrons of the type $\\tg\\tg$, $\\tg g$ and $\\tg q\\bar q$ could exist depending on the masses of the gluino and the squarks being in an appropriate range of values. We find the energy levels of $\\tg g$ and $\\tg q\\bar q$ bound states (where $q$ denotes a light quark, $u$, $d$ or $s$), as well as the strong interaction transition rates among them, using a Heavy Gluino Effective Theory, much in the same spirit as the well-known Heavy Quark Effective Theory. The results are obtained with greater ease and elegance in comparison to other approaches. △ Less", "Motivated by the possibility that new (gauge) symmetries which are broken at the grand- (string-) unification scale give rise to texture zeros in the fermion mass matrices which are at the origin of the hierarchy of masses and mixings we explore the effect of such zeros on the neutrino spectrum of SUSY-GUT models. We find that the quadratic-seesaw spectrum on which most expectations are focused is neither the only nor the most interesting possibility. Cases of strong $ν_μ - ν_τ$ or $ν_e - ν_τ$ mixing are present for a specific texture structure of the Yukawa matrices and experimental evidence can thus throw some light on the latter. In contrast if the quadratic-seesaw scenario should be confirmed very little could be said about the symmetries of the Yukawa sector. △ Less", "Moduli fields, which parameterize perturbative flat directions of the potential in supersymmetric theories, are natural candidates to act as inflatons. An inflationary potential on moduli space can result if the scale of dynamical SUSY breaking in some sector of the theory is determined by a moduli dependent coupling. The magnitude of density fluctuations generated during inflation then depends on the scale of SUSY breaking in this sector. This can naturally be hierarchically smaller than the Planck scale in a dynamical model, giving small fluctuations without any fine tuning of parameters. It is also natural for SUSY to be restored at the minimum of the moduli potential, and to leave the universe with zero cosmological constant after inflation. Acceptable reheating can also be achieved in this scenario. △ Less", "We introduce a new method to treat Majorana fermions on the GRACE system, which has already been developed for the computation of the matrix elements for the processes of the standard model. In the standard model, we already have included such particles as Dirac fermions, gauge bosons and scalar bosons in the system. On the other hand, there are four Majorana fermions called neutralinos in the minimal SUSY standard model (MSSM). In consequence, we have constructed a system for the automatic computation of cross-sections for the processes of the MSSM. It is remarkable that our system is also applicable for another model including Majorana fermions once the definition of the model file is given. △ Less", "Relatively light sneutrinos, which are experimentally allowed, may significantly affect the currently popular search strategies for supersymmetric particles by decaying dominantly into an invisible channel. In certain cases the second lightest neutralino may also decay invisibly leading to two extra carriers of missing energy -- in addition to the lightest supersymmetric particle (LSP) \\zi\\ -- the virtual LSPs (VLSPs). It is shown that these VLSPs are allowed in supergravity models with common scalar and gaugino masses at the unification scale for a sizable region of parameter space and are consistent with all constraints derived so far from SUSY searches. The pair production of right handed sleptons, which can very well be the lightest charged SUSY particles in this scenario, at LEP 200 and their decay signatures are discussed. The signal survives kinematical cuts required to remove the standard model background. Charginos are also pair produced copiously if kinematically accessible; they also decay dominantly into hadronically quiet di--lepton + \\etmiss\\ modes leading to interesting unlike sign dilepton events which are again easily separable from the Standard Model backgrounds at LEP 200 energies. △ Less", "I discuss non-trivial effects in the soft SUSY breaking terms which appear when one integrates out heavy fields. The effects exist only when the SUSY breaking terms are non-universal. They may spoil (1) the hierarchy between the weak and high-energy scales, or (2) degeneracy among the squark masses even in the presense of a horizontal symmetry. I argue, in the end, that such new effects may be useful in probing physics at high-energy scales from TeV-scale experiments. △ Less", "We discuss how the inflation induced supersymmetry breaking affects the flat directions of SUSY vacua. We show that under general assumptions all gauge nonsinglet fields, parameterizing flat directions (and in particular squarks and sleptons), get large $radiative$ masses which are related to the value of the Hubble constant ($H$) and to the expectation value of the inflaton field. This mass (typically $\\sim H$) is of ``non-gravitational'' origin and does not vanishes in the global SUSY limit. Large radiative corrections are induced by $F$-term (or $D$-term) density, which dominates the inflationary universe and strongly breaks supersymmetry. In such theories it is difficult to treat squarks and sleptons as the light fields in the inflationary period. In the generic supergravity theories all flat directions, including moduli, are getting curvature of order the Hubble constant. However, for the gauge-nonsinglet flat directions radiative contribution to the curvature (induced by renormalizable gauge interactions) may be dominant. △ Less", "We study an extension of the supersymmetric standard model with four families and gauged horizontal symmetry $SU(4)_H$, in which R parity automatically follows as a consequence of gauge invariance and of the field content of the model. Beyond ensuring R parity conservation, the horizontal symmetry allows for the dynamical generation of a hierarchical pattern of fermion masses, without the need of any ad hoc choice of small Yukawa couplings. The structure of the mass matrices implies that the fourth family does not mix with the other three, and that the $b',t',τ',ν'$ masses are all naturally in the 100 GeV range. The model has other interesting phenomenological implications. The scale of the horizontal symmetry breaking is constrained by cosmological and astrophysical arguments to be $\\sim 10^{11}$ GeV. Then the late $b'$ decays could explain a magnitude of the isotropic cosmic gamma flux. In addition, a lower bound of a few eV is found for the mass of the $τ$-neutrino, which can thus provide a hot component for the cosmological dark matter. Due to R parity conservation, the lightest supersymmetric particle is stable and can provide the cold component. The $ν_e$ and $ν_μ$ masses can naturally be in the correct ranges for a solution of the solar or atmospheric neutrino problems via neutrino oscillations. △ Less", "The supersymmetric $SU(6)$ model equipped by the flavour-blind discrete gauge symmetry $Z_3$ is considered. It provides simultaneous solution to the doublet-triplet splitting problem, $μ$-problem and leads to natural understanding of fermion flavour. The Higgs doublets arise as Goldstone modes of the spontaneously broken {\\em accidental} global symmetry $SU(6)\\times U(6)$ of the Higgs superpotential. Their couplings to fermions have peculiarities leading to the consistent picture of the quark and lepton masses and mixing, without invoking the horizontal symmetry or zero texture concepts. In particular, the only particle that has direct $O(1)$ Yukawa coupling with the Higgs doublet is top quark. Other fermion masses arise from the higher order operators, with natural mass hierarchy described in terms of small ratios $\\eps_Σ=V_Σ/V_H$ and $\\eps_H=V_H/M$, where $V_H$ and $V_Σ$ correspondingly are the $SU(6)$ and $ SU(5)$ symmetry breaking scales, and $M$ is a large (Planck or string) scale. The model automatically implies $b-τ$ Yukawa unification. Specific mass formulas are also obtained, relating the down quark and charged lepton masses. Neutrinos get small ($\\sim 10^{-5}\\,$eV) masses which can be relevant for solving the solar neutrino problem via long wavelength vacuum oscillation. △ Less", "We introduce a new method to treat Majorana fermions on the GRACE system which has been developed for the automatic computation of the matrix elements for the processes of the standard model. In the GRACE system, we already have such particles as Dirac fermions, gauge bosons and scalar bosons within the standard model. On the other hand, in the SUSY models there are Majorana fermions. In the first instance, we have constructed a system for the automatic computation of cross-sections for the processes of the SUSY QED. The system has also been applied to another model including Majorana fermions, the minimal SUSY standard model (MSSM), by the re-definition of the model file. △ Less", "We have constructed a system for the automatic computation of cross-sections for the processes of the SUSY QED by the extension of the GRACE system including a Majorana fermion. The system has also been applied to another model including Majorana fermions, MSSM, by the definition of the model file. △ Less", "We introduce a new method to treat Majorana fermions on the GRACE system which has been developed for the computation of the matrix elements for the processes of the standard model. In the standard model, we already have such particles as Dirac fermions, gauge bosons and scalar bosons in the system. On the other hand, in the SUSY models there are Majorana fermions. In the first instance, we have constructed a system for the automatic computation of cross-sections for the processes of the SUSY QED. It is remarkable that our system is also applicable to another model including Majorana fermions (e.g. MSSM) once the definition of the model file is given. △ Less", "A thorough study is performed on pair production and signatures of supersymmetric neutralinos in the MSSM at LEP2. Particular attention is paid to the region of the SuSy parameter space where the associated production of lightest and next-to-lightest neutralinos is the only visible allowed supersymmetric process. In that region, the signal is critically dependent on the selectron masses m(e_L,R). For sqrt(s)/2 < m(e_L,R) < 200-300 GeV and charginos above the threshold for pair production, neutralinos arising from e+e- --> X0(1)X0(2) could be the only SuSy signal detectable at LEP2. △ Less", "The possible role of supersymmetry in our understanding of big bang baryogenesis and cosmological dark matter is explored. The discussion will be limited to the out-of equilibrium decay scenario in SUSY GUTs, the decay of scalar condensates, and lepto-baryogenesis as a means for generating the observed baryon asymmetry. Attention will also be focused on neutralino dark matter. △ Less", "We present a detailed calculation of the contributions of charginos, scalar quarks, and charged Higgs boson to the $K^+\\rightarrow π^+ν\\overlineν$\\ and $K^0_L\\rightarrowμ^+μ^-$\\ decays. We include mixings: that of charginos and that of the scalar partners of the left and right handed top quark. We find that the box contribution to the amplitudes is much smaller than the penguin contribution, which can be $\\sim$10\\% of the Standard Model contribution, even for relatively large SUSY masses. The charged Higgs contribution can be as large as 25\\% of the SM contribution in the first decay and as much as 40\\% of the SM contribution in the second decay. △ Less", "The potential of seeing supersymmetry (SUSY) at the CERN Large Hadron Collider (LHC) was studied by looking at 3 types of signals: dilepton events from slepton pair productions, trilepton events from chargino/neutralino productions and missing energy plus multi-jet events from gluino/squark productions. I described my results by mapping out reachable areas in the supergravity parameter space. Areas explorable at LEP II were also mapped out for comparison. △ Less", "We show that in generic supergravity theories the mass of the moduli during inflation is larger (or at least of the same order of magnitude) than the Hubble constant. This fact does not depends on the details of the inflation and on the value of the Hubble parameter during it. The reason is that inflationary universe is dominated by large F-term (or D-term) density which is higher than the SUSY breaking scale in the present minimum and stabilizes the flat directions of the supersymmetric vacua. Therefore, in general even standard inflationary scenarios (with large H) may solve the cosmological moduli problem. △ Less", "We give examples of minimal extensions of the simplest SU(5) SUSY-GUT in which all squarks and sleptons of a family have different tree level masses at the unification scale. This phenomenon is general; it occurs when the quarks and leptons are the light remnants of a theory which contains extra heavy families at the unification scale. The examples have interesting relations between Yukawa couplings: In one model the ratio of the top to bottom Yukawas is as large as $\\simeq 3$, partly accounting for the large $m_t /m_b$. Another gives $m_b/m_τ$ between 2/3 and 1; this relaxes the strict bounds on the top mass and neutrino properties that come from $b$--$τ$ unification. Still another allows $ m_s/m_μ$ to be between 1/6 and 1 and evades the potentially problematic GUT relation of $m_s=m_μ$. The final example has horizontal sparticle splittings in spite of the existence of horizontal symmetries. △ Less", "It is shown that analyses at the electroweak scale can be significantly affected due to Landau pole effects in certain regions of the parameter space. This phenomenon arises due to a large magnification of errors of the input parameters $m_t$, $α_G$ which have currently a 10 percent uncertainty in their determination. The influence of the Landau pole on the constraint that the scalar SUSY spectrum be free of tachyons is also investigated.It is found that this constraint is very strong and eliminates a large portion of the parameter space.Under the above constraint the trilinear soft SUSY breaking term at the electroweak scale is found to lie in a restricted domain. △ Less", "Neutrinoless double beta decay ($\\znbb$) induced by superparticle exchange is investigated. Such a supersymmetric (SUSY) mechanism of $\\znbb$ decay arises within SUSY theories with R-parity non-conservation (\\rp). We consider the minimal supersymmetric standard model (MSSM) with explicit \\rp terms in the superpotential (\\rp MSSM). The decay rate for the SUSY mechanism of $\\znbb$ decay is calculated. Numerical values for nuclear matrix elements for the experimentally most interesting isotopes are calculated within pn-QRPA. Constraints on the \\rp MSSM parameter space are extracted from current experimental half-life limits. The most stringent limits are derived from data on $^{76}$Ge. It is shown that these constraints are more stringent than those from other low-energy processes and are competitive to or even more stringent than constraints expected from accelerator searches. △ Less", "It is shown that the complex phase of $B^0$--$\\bar {B^0}$ mixing matrix element is same as that of the standard model one up to the minor correction of the order of $(m_c/m_t)^2$ or less in the SUSY standard model. This conclusion is valid as far as the Yukawa coupling constants are perturbative and realistic, and can be available for other realistic models where generation mixing and CP violation are solely due to Yukawa interaction among quarks and Higgs doublets. △ Less", "This paper is motivated by three issues associated with the supersymmetric extension of the standard model: the $μ$ problem, the possibility of raising the upper bound on the lightest-Higgs mass, and the triviality problem associated with the Higgs sector. A new scheme based on the Higgs-Higgs condensation is proposed, and it is shown that these three issues are well solved by this scheme. As the first realization of this new scheme, the Minimal Supersymmetric Model of Higgs-Higgs Condensation (MSMHHC) is constructed and studied in detail. The MSMHHC is identical with the MSSM (Minimal Supersymmetric Standard Model) in the fundamental particle content, and their lagrangians differ only in the Higgs sector. The Higgs sector of the MSMHHC is based on the softly-broken supersymmetric Nambu$-$Jona-Lasinio model with the four-field interaction of the Higgs doublets. At low energy, these two Higgs doublets condense into two neutral Higgs gauge singlets, and the low-energy effective lagrangian of the MSMHHC has the form of the non-minimal supersymmetric standard model which contains two more Higgs singlets than the MSSM. Another unique feature of the MSMHHC is that heavy top quark always implies strongly-interacting low-energy Higgs sector, i.e., a large mass for the lightest Higgs boson. A systematic study of the parameter space is also made in order to reveal the qualitative features of the MSMHHC. Finally, we comment on the question \"How large can the lightest-Higgs mass be?\" with the conclusion that the supersymmetric model of Higgs-Higgs condensation will be the most promising candidate if the lightest-Higgs mass of the MSSM is excluded by the future experiments. △ Less", "We study the implications of the triviality problem for the Higgs masses and other relevant parameters in the Next to Minimal Supersymmetric Standard Model (NMSSM). By means of triviality, a new way to constrain parameters is proposed, and therefore we are able to derive triviality bounds on the heaviest-Higgs mass, the lightest-Higgs mass, the soft SUSY- breaking parameters, and the vacuum expectation value of the Higgs gauge singlet through a thorough examination of the parameter space. The triviality upper bound on the lightest-Higgs mass predicted by NMSSM is indeed larger than the upper bound predicted by MSSM. △ Less", "We study the correlation of quantum effects on the ratios R_b and R_c within the framework of the MSSM. While in the SM the quantity R_b is in discrepancy with experiment at the 2 σlevel from below, and R_c differs from the experimental result at the 1.5 σlevel from above, the theoretical prediction for both observables could simultaneously improve in the MSSM, provided that \\tanβis large enough (\\tanβ\\sim m_t/m_b) and there exists a light supersymmetric pseudoscalar Higgs, and also a light stop and a light chargino, all of them in the 50 GeV ballpark. In view of the masses predicted for these SUSY particles, persistence of the `R_b-R_c crisis' in the next run of experiments would not only suggest indirect evidence of SUSY, but should also encourage direct finding of SUSY at LEP 200. We also point out the consistency of this picture with other observables and the intriguing possibility that this Z-physics scenario might allow getting a hint of SUSY at Tevatron through the simple observation of t\\to H^{+}b. △ Less", "We present a systematic search for SUSY-SO(10) models which predict the neutrino properties. The models are based on the five sets of quark mass matrices, with texture zeros, discussed recently by Roberts, Ramond and Ross. We found 8 such neutrino textures three of which can solve the solar neutrino problem. The latter have tau-neutrino masses of few eV i.e. relevant for cosmology and $ν_τ - ν_μ$ mixing angles that can be observed by the CHORUS, NOMAD and P803 experiments. △ Less", "We discuss in detail the possibility of determining dynamicaly the gravitino mass $m_{3/2}$, which is related to the supersymmetry breaking scale, within the minimal supersymmetric standard model (MSSM). Using the complete MSSM spectrum, we minimize the vacuum energy including one-loop corrections and a cosmological term of ${\\cal O}(m_{3/2}^4)$ induced by the underlying fundamental theory. We find that both terms are necessary to determine dynamically the gravitino mass. Other useful constraints for the low energy phenomenology are also obtained. △ Less", "Flavor changing neutral current and CP violating processes are discussed in the minimal supergravity model. The constraint on charged Higgs mass from the new measurement of the inclusive branching ratio of the $b\\rightarrow sγ$ process is obtained. The $B^0_d-\\bar{B}^0_d$ mixing parameter ($x_d$) and the CP violating parameter in the $K^0-\\bar{K}^0$ mixing ($ε_K$) are calculated in this model and it is shown that these parameters can be enhanced by 10\\% $\\sim$ 20 \\% compared to the prediction within the standard model. Impacts on new physics search at B factories are also discussed. △ Less", "R parity violation can induce mixing of the supersymmetric Higgs bosons with the sneutrinos at the tree level. We study the effect of this mixing on the decays of Higgs scalars as well as sneutrinos in an effective model where the violation of R parity is included in the minimal supersymmetric model through bilinear lepton number violating superpotential terms. We show that a small violation of R parity can lead to a sizeable branching ratio for the supersymmetric Higgs boson decay mode $H \\to χ\\ell$ (where $χ$ denotes an electroweak gaugino and $\\ell$ is either a tau neutrino or a tau lepton). Relevant constraints on R parity violation as well as those coming from SUSY particle searches still allow the decay $H \\to χ\\ell$ to compete with the conventional decay $H\\ra b \\bar{b}$, at least for some ranges of parameters of the model. Moreover, the tau sneutrino will have dominant R parity violating decays to standard model fermions $b \\bar{b}$, $τ^+ τ^-$ or to the invisible mode $ν\\barν$ whenever the phase space for R parity conserving channels is closed. △ Less", "Spontaneous violation of R parity can induce rare single photon decays of the $Z^0$ involving the emission of (nearly) massless pseudoscalar Goldstone bosons, majorons, as well as massive CP even or CP odd spin zero bosons that arise in the electroweak breaking sector of these models. We show that the majoron emitting decays can have a sizeable branching ratio of $10^{-5}$ or so, without conflicting any experimental observation from neutrino physics or particle searches. These decays may lead to interesting structures for the single photon spectrum involving either mono chromatic photons as well as continuous spectra that grow with energy. They would easily account for an excess of single photon events at high energies recently hinted at by the OPAL collaboration. △ Less", "Considerations of massive neutrinos, baryogenesis as well as fermion mass textures in the grand unified theory framework provide strong motivations for supersymmetric(SUSY) SO(10) as the theory beyond the standard model. If one wants to simultaneously solve the strong CP problem via the Peccei-Quinn mechanism, the most natural way to implement it within the framework of the SUSY SO(10) model is to have an intermediate scale ($v_{BL}$) (corresponding to B-L symmetry breaking) around the invisible axion scale of about 10$^{11}$ - 10$^{12}$ GeV. Such a scale is also desirable if $ν_τ$ is to constitute the hot dark matter (HDM) of the universe. In this paper, we discuss examples of superstring inspired SUSY SO(10) models with intermediate scales that are consistent with the low energy precision measurements of the standard model gauge couplings. The hypothesis of $b-τ$ unification which is a successful prediction of many grand unified theories is then required of these models and the resulting prediction of $b$-quark mass is used as a measure of viability of these schemes. Detailed analysis of a model with a $v_{BL}\\simeq 10^{11}$ GeV, which satisfies both the requirements of invisible axion and $ν_τ$ as HDM is presented and shown to lead to $m_b\\simeq 4.9$ GeV in the one-loop approximation. △ Less", "The unification of gauge coupling constants in the minimal supersymmetric model (MSSM) is unaffected at the one-loop level by the inclusion of additional mass-degenerate SU(5) multiplets. Perturbativity puts an upper limit on the number of additional fields. We analyse the evolution of the gauge coupling constants in all models satisfying these criteria using two-loop $β$ functions and including low energy threshold effects. We find that similarly to the minimal supersymmetric model (MSSM) unification takes place within the theoretical and experimental errors. The dominant proton decay mode is more suppressed in all extended models as opposed to the MSSM due to renormalization group effects. However, the prediction for the bottom to $τ$ mass ratio becomes worse in all models under consideration. △ Less", "In this talk I summarize published work on a systematic operator analysis for fermion masses in a class of effective supersymmetric SO(10) GUTs\\cite{adhrs}~\\footnote{This work is in collaboration with G. Anderson, S. Dimopoulos, L.J. Hall, and G. Starkman.}. Given a minimal set of four operators at $M_G$, we have just 6 parameters in the fermion mass matrices. We thus make 8 predictions for the 14 low energy observables (9 quark and charged lepton masses, 4 quark mixing angles and $\\tan β$). Several models, i.e. particular sets of dominant operators, are in quantitative agreement with the low energy data. In the second half of the talk I discuss the necessary ingredients for an SO(10) GUT valid below the Planck (or string) scale which reproduces one of our models. \\footnote{These are preliminary results of work in progress with Lawrence Hall.} This complete GUT should still be interpreted as an effective field theory, i.e. perhaps the low energy limit of a string theory. △ Less", "Working group II at WHEPP3 concentrated on issues related to the supersymmetric standard model as well as SUSY GUTS and neutrino properties. The projects identified by various working groups as well as progress made in them since WHEPP3 are briefly reviewed. △ Less", "We compute the supersymmetric contribution to $R_{b}\\equiv Γ(Z\\to b{\\bar b})/Γ(Z\\to {\\rm hadrons})$ in a variety of supergravity models. We find $R^{\\rm susy}_b\\lsim0.0004$, which does not shift significantly the Standard Model prediction ($R^{\\rm SM}_b=0.2162$ for $m_t=160\\GeV$). An improvement in experimental precision by a factor of four would be required to be sensitive to such an effect. △ Less", "Supergravity models are constructed in which the effective low energy theory contains only ``super-soft'' explicit supersymmetry breaking: masses of the scalars and pseudoscalars within a multiplet are split in opposite directions. With this form of supersymmetry breaking the radiative corrections of the matter sector to the vacuum energy are bounded by ${\\cal O} (M^4_{Susy})$ to all orders in perturbation theory, and we require $Str M^2 = 0$ including the hidden sector. The models are based on Kähler potentials obtained in recent orbifold compactifications, and we describe the construction of realistic theories. △ Less", "We discuss a novel form of CP violation in the standard model. It takes place at temperatures of the order of the electroweak transition, when two regions with different values of the Wilson line are juxtaposed. This CP violation is maximal. A sufficient condition is simply the existence of a long-lived metastable state; this can occur for fewer than three generations, and also in the minimal susy standard model. It leads to baryogenesis in all of these models. △ Less", "We investigate the possibility that gauginos are massless at tree level and that the U(1) R-invariance is broken spontaneously by Higgs vevs, like the chiral symmetry of quarks in the standard model, or else explicitly by dimension 2 or 3 SUSY-breaking terms in the low energy effective Lagrangian. Gluino and lightest neutralino masses then depend on only a few parameters. For a SUSY-breaking scale <~ 400 GeV, the gluino and lightest neutralino have masses typically in the range 1/10 ~ 2 1/2 GeV. On the other hand, for a SUSY-breaking scale several TeV or larger, radiative contributions can yield gluino and lightest neutralino masses of O(50-300) GeV and O(10-30) GeV, respectively. As long as the Higgs vev is the only source of R-invariance breaking, or if SUSY breaking only appears in dimension 2 terms in the effective Lagrangian, the gluino is generically the lightest SUSY particle, modifying the usual phenomenology in interesting ways. △ Less", "We calculate the dilution of the baryon-to-photon ratio by the decay of superstring axions. We find that the dilution is of the order of $10^7$. We review several models of baryogenesis and show that most of them can not tolerate such a large dilution. In particular, only one current model of electroweak baryogenesis possibly survives. The Affleck-Dine mechanism in SUSY GUTs is very robust and the dilution by axions could contribute to the dilution required in these models. Baryogenesis scenarios involving topological defects and black hole evaporation are also capable of producing a sufficiently large baryon asymmetry. △ Less", "In grand unified theories (GUT) based on SO(10) all fermions of one generation are embedded in a single representation. As a result, the top quark, the bottom quark, and the $τ$ lepton have a universal Yukawa coupling at the GUT scale. This implies a very large ratio of Higgs vacuum expectation values, $\\tanb \\simeq m_t/m_b$. We analyze the naturalness of such a scenario quantitatively including all the relevant radiative corrections and find that in minimal unified supergravity models with universal soft supersymmetry breaking parameters at the GUT scale, the necessary amount of fine-tuning needed is excessive. GUT threshold correction to the universal Higgs mass parameter can significantly reduce the fine-tuning required for such large values of $\\tanb$. We also point out that the top quark mass can play a crucial role in explaining the hierarchy between the SUSY breaking scale and the electro-weak scale and, hence, the naturalness of large values of $\\tanb$. △ Less", "We consider the gravity induced dimension six terms in addition to the dimension five terms in the SUSY GUT Lagrangian and find that the prediction for $α_s$ may be washed out completely in supersymmetric grand unified theories unless the triplet higgs mass is smaller than $ 7\\times 10^{16} $ GeV. △ Less"]