["Higher dimensional supersymmetric quantum mechanics is studied. General properties of the two dimensional case are presented. For three spatial dimesions or higher, a spin structure is shown to arise naturally from the nonrelativistic supersymmetry algebra. △ Less", "A supersymmetry anomaly is found in the presence of non-perturbative fields. When the action is expressed in terms of the correct quantum variables, anomalous surface terms appear in its supersymmetric variation - one per each collective coordinate. The anomalous surface terms do not vanish in general when inserted in two- or higher-loop bubble diagrams, and generate a violation of the SUSY Ward identities. △ Less", "This Letter addresses a provocative question: ``Can the standard electroweak Higgs doublets and their color-triplet partners be the messengers of a low energy gauge-mediated SUSY breaking?\" Such a possibility does not seem to be immediately ruled out. If so, it can lead to a very economical scheme with clear-cut predictions quite distinct from those of the conventional gauge-mediated scenario. Namely, we get (i) a single light Higgs below the original SUSY- breaking scale; (ii) tan(beta) = 1; (iii) flavor non-universal, but automatically flavor-conserving soft scalar masses; (iv) a light colored scalar with peculiar phenomenology. The familiar mu problem looses its meaning in this approach. △ Less", "A previous study of supersymmetric models has indicated that they are unlikely to make a large contribution to R_b. We revisit this analysis, taking into account the improved lower limits on sparticle masses provided recently by LEP 2 and the Tevatron, finding that a generic supersymmetric model cannot contribute more than about one-and-a-half current experimental standard deviations to R_b. We then specialize this analysis to minimal supergravity models with universal high-energy boundary conditions, and find a much more stringent upper bound R^{susy}_b < 0.0003. We discuss in detail why such models can only attain values of R^{susy}_b that are considerably smaller even than those obtainable in more general supersymmetric models. △ Less", "We investigate the SU(N) supersymmetric Grand Unified Theories with ``custodial symmetry'' mechanism to explane the doublet-triplet hierarchy. We show that in such type of SU(7) SUSY theory intermediate scale appears naturally and the correct value for sin^2(θ)_W is predicted via vector-like matter superfields splitting. The unification appears to be closed to M_Pl for all the reasonable values of α_s and M_SUSY. Due to the large unification scale the baryon number violating d=5 operator is suppressed in comparison with that in minimal SU(5) theory. △ Less", "We analyze the contribution of the SUSY particles to the coupling of the lightest Higgs boson to two photons in supersymmetric theories. We discuss to what extent these contributions can be large enough to allow for a discrimination between the lightest SUSY and the standard Higgs particles in the decoupling limit where all other Higgs bosons are very heavy and no supersymmetric particle has been discovered at future colliders. We find that only chargino and top squark loops can generate a sizeable difference between the standard and the SUSY Higgs-photon couplings. For masses above 250 GeV, the effect of chargino loops on the two-photon width is however smaller than $\\sim 10%$ in the entire SUSY parameter space. Top squarks heavier than 250 GeV can induce deviations larger than 10% only if their couplings to the Higgs boson are large. Since top squark contributions can be sizeable, we derive the two-loop QCD correction to squark loops and show that they are well under control. △ Less", "We present a new contribution of the R-parity violating supersymmetry (SUSY) to neutrinoless double beta decay via the pion exchange between decaying neutrons. The pion coupling to the final state electrons is induced by the R-parity violating SUSY interactions. We have found this pion-exchange mechanism to dominate over the conventional two-nucleon one. The latter corresponds to direct interaction between quarks from two decaying neutrons without any light hadronic mediator like pion. The constraints on the certain R-parity violating SUSY parameters are extracted from the current experimental neutrinoless double beta decay half-life limit. These constraints are significantly stronger than those previously known or expected from the ongoing accelerator experiments. △ Less", "We analyze the effective 3 dimensional theory previously constructed for the MSSM and multi-Higgs models to determine the regions of parameter space in which the electroweak phase transition is sufficiently strong for a $B+L$ asymmetry to survive in the low temperature phase. We find that the inclusion of all supersymmetric scalars and all 1-loop corrections has the effect of enhancing the strength of the phase transition. Without a light stop or extension of the MSSM the phase transition is sufficiently first order only if the lightest Higgs mass $M_{h}\\lsi 70$ GeV and $tanβ\\lsi 1.75$. △ Less", "We examine the prospects for determining $tan β$ from heavy Higgs scalar production in the minimal supersymmetric standard model at a future $e^+ e^-$ collider. Our analysis is independent of assumptions of parameter unification, and we consider general radiative corrections in the Higgs sector. Bounds are presented for $\\sqrt{s} = 500$ GeV and 1 TeV, several Higgs masses, a variety of integrated luminosities and b-tagging efficiencies, and in scenarios with and without supersymmetric decays of the Higgs bosons. We find stringent constraints for $3 \\alt tan β\\alt 10$, and, for some scenarios, also interesting bounds on high $tan β$ through $tbH^{\\pm}$ production. These bounds imply that simple Yukawa unifications may be confirmed or excluded. Implications for soft scalar mass determination and top squark parameters are also discussed. △ Less", "At the AMANDA South Pole site, four new holes were drilled to depths 2050 m to 2180 m and instrumented with 86 photomultipliers (PMTs) at depths 1520-2000 m. Of these PMTs 79 are working, with 4-ns timing resolution and noise rates 300 to 600 Hz. Various diagnostic devices were deployed and are working. An observed factor 60 increase in scattering length and a sharpening of the distribution of arrival times of laser pulses relative to measurements at 800-1000 m showed that air bubbles are absent below 1500 m. Absorption lengths are 100 to 150 m at wavelengths in the blue and UV to 337 nm. Muon coincidences are seen between the SPASE air shower array and the AMANDA PMTs at 800-1000 m and 1500-1900 m. The muon track rate is 30 Hz for 8-fold triggers and 10 Hz for 10-fold triggers. The present array is the nucleus for a future expanded array. The potential of AMANDA for SUSY dark matter search through the detection of high-energy neutrinos from the centre of the Sun or Earth is discussed. △ Less", "After briefly reviewing the nonperturbative dynamics of N=1 supersymmetric field theories, soft SUSY breaking mass terms are introduced into the SUSY gauge theories and their effects on gauge symmetry breaking pattern are studied. For $N_f<N_c$, we include the dynamics of the non-perturbative superpotential and use the original (s)quark and gauge fields. For $N_f>N_c+1$, we formulate the dynamics in terms of dual (s)quarks and a dual gauge group SU(N_f-N_c). The mass squared of squarks can be negative triggering the spontaneous breakdown of flavor and color symmetry. The general condition for the stability of the vacuum is derived. We determine the breaking pattern, derive the spectrum, and argue that the masses vary smoothly as one crosses from the Higgs phase into the confining phase exhibiting the complmentarity. △ Less", "Searches at the e-p collider HERA for supersymmetric partners of the Standard Model fermions are presented. Assuming R-parity conservation, selectrons and squarks of the Minimal Supersymmetric Standard Model are excluded for masses up to 65 GeV in a new region of the standard parameter space. Admitting in addition a R-parity violating Yukawa coupling $λ'$, squarks are sought through direct e-q fusion in a yet unexplored mass-coupling domain, taking into account all possible squark decays. Squark masses up to 240 GeV are excluded for $λ' \\gtrsim \\sqrt{4 πα_{em}}$, depending only weakly on the free model parameters. △ Less", "We have calculated the $O(α_{ew} M_t^2/M_W^2)$ supersymmetric electroweak corrections to single top quark production via $q\\bar q' \\to t\\bar b$ at the Fermilab Tevatron in the minimal supersymmetric model. The supersymmetric electroweak corrections to the cross section are a few percent for $tan β> 1$, and can exceed 10% for $tanβ<1$. The combined effects of SUSY electroweak corrections and the Yukawa corrections can exceed 10% for favorable parameter values, which might be observable at a high-luminosity Tevatron. △ Less", "The first part of this talk presents the general complexion of baryon and lepton number non-conservation that may arise in the context of quark-lepton unification. The second part presents the status of grand unification with and without supersymmetry and spells out the characteristic proton decay modes, which if seen, will clearly show supersymmetry. The main theme of this talk, that follows next, pertains to two issues: (i) the need to remove the mismatch between MSSM and string-unifications; and especially (ii) the need to resolve naturally the problem of rapid proton decay, that generically arises in SUSY unification. Seeking for a natural solution to this second problem, it is noted that SUSY GUTS, including SUSY SO(10) and E_6, can at best accommodate proton-stability by a suitable choice of the Higgs-multiplets and discrete symmetries, but not really explain it, because they do not possess the desired symmetries to suppress both d=4 and d=5 proton-decay operators. By contrast, following a recent work, I argue that a class of string-solutions, possessing three families, does possess the desired symmetries, which naturally safeguard proton-stability from all potential dangers. They also permit neutrinos to have desired light masses. This shows that, believing in supersymmetry, superstring is needed just to understand why the proton is so stable. △ Less", "We deduce the gluino contribution to the three-loop QCD βfunction within the minimal supersymmetric Standard Model (MSSM) from its standard QCD expression. The result is a first step in the computation of the full MSSM three-loop βfunction. In addition, in the case of a light gluino it provides the strong three-loop SUSY correction to the extrapolation of the strong coupling constant from the low energy regime to the Z region and up to the squark threshold. △ Less", "We present a self-consistent $χ^2$ analysis of several supersymmetric (SUSY) grand unified theories recently discussed in the literature. We obtain global fits to low energy data, including gauge couplings, fermion masses and mixing angles, gauge boson masses and $BR(b\\rightarrow sγ)$. One of the models studied provides an excellent fit to the low energy data with $χ^2\\sim 1$ for 3 degrees of freedom, in a large region of the experimentally allowed SUSY parameter space. We also discuss the consequences of our work for a general MSSM analysis at the $Z$ scale. △ Less", "A promising solution to the doublet-triplet splitting problem of SUSY GUT's is the Higgs as pseudo-Goldstone boson mechanism. We present two models which naturally implement this idea and extend one of them to include fermion masses. We examine the phenomenological consequences of this mechanism and present the favored parameter region. △ Less", "We describe briefly new program for SUSY masses calculations. The main distinction of our program is that we start to solve the renormalization group equations for soft SUSY breaking parameters for SU(5) SUSY GUT model from Planck scale $M_{PL} = 2.4\\cdot 10^{18}$ Gev. Our program works also for large $tan(β)$. We find that for $m_0 \\leq 0.5 \\cdot m_{1/2}$ the effects of the evolution from Planck scale to GUT scale are very essential. In particular, we find that neutralino even for small $m_0$ is always LSP. We also introduced in our program some parameter of non-universality of the gaugino masses at GUT scale. Playing with the non-universality of the gaugino masses at GUT scale it is possible to have the situation when leptonic modes are suppressed and the single SUSY signature is hadronic jets with missing energy. △ Less", "We show how an intermediate gauge symmetry breaking scale can be a source of lepton flavor violation and EDM of electron and neutron in SUSY GUTs. The Universal soft supersymmetry breaking operators can be introduced at the GUT scale or above. △ Less", "We analyze the one-loop renormalisation group equations for the parameters of the Higgs potential of a supersymmetric SU(5) model with first step of symmetry breaking involving an adjoint Higgs. In particular, we investigate the running of the parameters that decide the first step of symmetry breaking in an attempt to establish which symmetry-breaking scenarios would be most likely if the model is the effective low-energy description of some more fundamental theory. An infra-red fixed point is identified analytically. We show that it is located at the boundary between the region of Higgs parameter space corresponding to unbroken SU(5) and the region corresponding to the breaking of SU(5) to the Standard Model, and we elaborate on its implications. We also observe that certain forms of the Higgs potential discussed at tree level in the literature are not renormalisation group invariant. △ Less", "The supersymmetric extension of the standard model with an additional gauge singlet is analysed in detail in the light of the recent experimental bounds on supersymmetric particles. The useful part of the parameter space and the particle spectrum are displayed. We find that once the recent bounds on the chargino mass are imposed, all other new particles practically satisfy the present experimental limits. Special attention is given to particles to be searched for in the future experiments. The singlet fields tend to decouple and give rise to an effective MSSM, enlarging the validity of many phenomenological analyses based in the minimal field content. However, in some ranges of the parameters the singlino is the lightest neutralino, which modifies the signature for susy particles. Simple analytical approximations are developed that qualitatively explain the numerical results. △ Less", "A Fortran-program for the production cross-sections of squarks and gluinos at hadron colliders is described. It includes full next-to-leading order SUSY-QCD corrections to all possible final states ($\\squark\\squarkbar, \\gluino\\gluino, \\squark\\gluino, \\squark\\squark$). The program allows to calculate total cross-sections as well as differential distributions in the transverse momentum p_t and the rapidity y of one of the outgoing particles. In addition cuts in p_t and y can easily be implemented. △ Less", "We present the details of a global $χ^2$ analysis of electroweak data, including fermion masses and mixing angles, in SO(10) SUSY GUTs. Just as precision electroweak data is used to test the Standard Model, the well determined Standard Model parameters are the precision electroweak data for testing theories beyond the Standard Model. In this paper we use the latest experimentally measured values for these parameters. We study several models discussed in the literature. One of these models provides an excellent fit to the low energy data with $χ^2 \\sim 1$ for 3 degrees of freedom. We present graphs of constant $χ^2$ contours as functions of position in soft SUSY breaking parameter space, as well as our predictions for a few selected points in parameter space. We also study the sensitivity of our results to changes in various parameters. Finally, we discuss the consequences of our work in the context of a general MSSM analysis at the Z scale. △ Less", "If supersymmetry exists at the electroweak scale, then it should be discovered at the LHC. Determining masses, of supersymmetric particles however, is more difficult. In this paper, methods are discussed to determine combinations of masses and of branching ratios precisely from experimentally observable distributions. In many cases such measurements alone can greatly constrain the particular supersymmetric model and determine its parameters with an accuracy of a few percent. Most of the results shown correspond to one year of running at LHC at ``low luminosity'. △ Less", "We demonstrate that supersymmetric decays, as typified by the predictions of several GUT-scale boundary condition choices, do not prevent detection of $Z^* \\to H^0A^0,H^+H^-$, at a $1-4$ TeV $e^+e^-$ or $μ^+μ^-$ collider operating at anticipated luminosity. For much of parameter space the relative branching ratios for various SUSY and non-SUSY decays can be measured with sufficient accuracy that different GUT-scale boundary condition choices can be distinguished from one another at a very high confidence level. △ Less", "A review is given of nucleon instability in SUSY models. The minimal SU(5) model is discussed in detail. △ Less", "I first emphasize the importance of searching for nucleon decay in the context of supersymmetric models. The status of minimal SUSY SU(5) model is reviewed, which can be definitively ruled out by a combination of superKamiokande and LEP-2 experiments. Non-minimal models may provide some suppression in the nucleon decay rates, but there is still a good chance for superKamiokande. I point out that the operators suppressed even by the Planck-scale are too large. We need a suppression mechanism for the operators at the level of $10^{-7}$, and the mechanism, I argue, may well be a flavor symmetry. A particular example predicts $p \\rightarrow K^0 e^+$ to be the dominant mode which does not arise in GUT models. △ Less", "The proton decay in supersymmetric (SUSY) Grand Unified Theories (GUTs), where the special mechanism provides the natural suppression of the dimension 5 ($d=5$) operators, was studied. Due to this mechanism, $d=5$ operator induced proton decay takes place only through the mixing of light generation fermions with those from third generation and crucially depends on the structure of fermion mass matrices. We show that in general proton decay is strongly suppressed relative to the standard SUSY GUT situation and for wide class of fermion mass matrices the SUSY parameter space practically has no restrictions. △ Less", "It is by now well known that symmetries may be broken at high temperature. However,in renormalizable supersymmetric theories any internal symmetry gets always restored. In nonrenormalizable theories the situation is far less simple. We review here some recent work which seems to indicate that renormalizability is not essential for the restoration of internal symmetries in supersymmetry. △ Less", "We quantify the ability of B-Factories to observe supersymmetric contributions to the rare decays B -> X_s γand B -> X_s l+ l-. A global fit to the Wilson coefficients which contribute to these decays is performed from Monte Carlo generated data on B(B -> X_s γ) and the kinematic distributions associated with the final state lepton pair in B -> X_s l+ l-. This fit is then compared to supersymmetric predictions. Evaluation of the Wilson coefficients is carried out with several different patterns of the superpartner spectrum. We find that the B-Factories will be able to probe regions of the SUSY parameter space not accessible to LEPII, the Tevatron, and perhaps the LHC. We also employ the recent NLO calculation of the matrix elements for B -> X_s γand find the bound mH+ > 300 GeV in two-Higgs-doublet models using present data. △ Less", "The partial widths are determined for stop decays to top quarks and gluinos, and gluino decays to stop particles and top quarks (depending on the masses of the particles involved). The widths are calculated including one-loop SUSY-QCD corrections. The radiative corrections for these strong-interaction decays are compared with the SUSY-QCD corrections for electroweak stop decays to quarks and neutralinos/charginos and top-quark decays to stops and neutralinos. △ Less", "CP violation, fermion masses and mixing angles including that of neutrinos are studied in an SUSY SO(10)$\\times Δ(48) \\times$ U(1) model with small $tan β$. It is amazing that the model can provide a successful prediction on twenty three observables by only using four parameters. The renormalization group (RG) effects containing those above the GUT scale are considered. Fifteen relations among the low energy parameters are found with nine of them free from RG modifications. They could be tested directly by low energy experiments. △ Less", "In this paper, we calculate neutron and proton decay rates and branching ratios in a predictive SO(10) SUSY GUT which agrees well with low energy data. We show that the nucleon lifetimes are consistent with the experimental bounds. The nucleon decay rates are calculated using all one-loop chargino and gluino dressed diagrams regardless of their chiral structure. We show that the four-fermion operator $C_{jk} (u_R {d_j}_R)({d_k}_L {ν_τ}_L)$, commonly neglected in previous nucleon decay calculations, not only contributes significantly to nucleon decay, but, for many values of the initial GUT parameters and for large $\\tanβ$, actually dominates the decay rate. As a consequence, we find that $τ_p/τ_n$ is often substantially larger than the prediction obtained in small $\\tanβ$ models. We also find that gluino-dressed diagrams, often neglected in nucleon decay calculations, contribute significantly to nucleon decay. In addition we find that the branching ratios obtained from this realistic SO(10) SUSY GUT differ significantly from the predictions obtained from ``generic\" SU(5) SUSY GUTS. Thus nucleon decay branching ratios, when observed, can be used to test theories of fermion masses. △ Less", "We study the properties of color-singlet Reggeon compound states in multicolor high-energy QCD in four dimensions. Their spectrum is governed by completely integrable (1+1)-dimensional effective QCD Hamiltonian whose diagonalization within the Bethe Ansatz leads to the Baxter equation for the Heisenberg spin magnet. We show that nonlinear WKB solution of the Baxter equation gives rise to the same integrable structures as appeared in the Seiberg-Witten solution for $N=2$ SUSY QCD and in the finite-gap solutions of the soliton equations. We explain the origin of hyperelliptic Riemann surfaces out of QCD in the Regge limit and discuss the meaning of the Whitham dynamics on the moduli space of quantum numbers of the Reggeon compound states, QCD Pomerons and Odderons. △ Less", "In supersymmetric models without $R$-parity neutrinos naturally become massive and mix with each other. We explore the predictions of a very restricted model with only three free parameters and find that this model naturally yields masses and mixing angles compatible with experimental results from solar and atmospheric neutrino experiments. Furthermore, there is a tiny region in parameter space where the solution to the solar neutrino puzzle is compatible with either the LSND result or the existence of significant hot dark matter neutrinos. △ Less", "This work examines the confining-deconfining phase transition in a hidden Yang Mills sector with scale $Λ\\sim 10^{14}$ GeV appropriate to dilaton stabilization and SUSY-breaking via formation of a gaugino consensate. If the transition is assumed to take place through homogenous nucleation, then under reasonable assumptions it is found that a critical bubble, formed at a temperature which provides enough supercooling, is not large enough to accommodate an adequate number $(\\gsim 100)$ of quanta of the confined phase (`hidden hadrons') to allow a consistent thermodynamic description. Thus, a first order transition in the hidden sector may not be possible in the expanding universe. △ Less", "We propose a mechanism for hiding the primordial baryon asymmetry from interactions that could wash it out. It requires the introduction of a baryon number carrying singlet which is in equilibrium in the early universe and shares any existing baryon asymmetry. It decouples from the Standard Model particles before all the interactions required to wash out the asymmetry are in equilibrium ($T \\simeq 10$ TeV), and decays after the electroweak phase transition, but before nucleosynthesis. This mechanism can conserve a baryon asymmetry in models (a) with $B-L = 0$, such as many $SU(5)$ GUTs, or (b) with $B-L$ violating interactions in thermal equilibrium, such as SUSY with broken $R$-parity. As a result, cosmological constraints on $R$-parity violating operators are relaxed considerably. △ Less", "We outline several well-motivated models in which GUT boundary conditions for SUSY breaking are non-universal. The diverse phenomenological implications of the non-universality for SUSY discovery at LEP2, the Tevatron, the LHC and the NLC are sketched. △ Less", "Top quark is extremely sensitive to non-standard CP violating phases. General strategies for exposing different types of phases at the NLC are outlined. SUSY phase(s) cause PRA in $t\\to Wb$. The transverse polarization of the $τ$ in the reaction $t\\to bτν$ is extremely sensitive to a phase from the charged Higgs sector. Phase(s) from the neutral Higgs sector cause appreciable dipole moment effects and lead to sizable asymmetries in $e^+e^-\\to t\\bar tH^0$ and $e^+e^-\\to t\\bar tν_e\\barν_e$.}] △ Less", "It is shown that if the sneutrino is the second lightest SUSY particle, then the decay products of squarks and gluinos produced at the TEVATRON collider tend to have i) more leptons, ii) smaller number of jets and iii) two or more carriers of missing E_T. This may relax the existing limits on the squark and gluino masses. This effect is likely to be even more striking as these limits improve with accumulation of data. Numerical results for signal cross sections are presented and compared with the ones obtained without a light sneutrino. The possibilities of accommodating this scenario in models motivated by N = 1 SUGRA are discussed. △ Less", "We present an overview of the loop corrections to the mass difference $Δm_{B_d^0}/ m_{B_d^0}$ within the minimal supersymmetric standard model. We include the complete mixing matrices of the charginos and neutralinos as well as of the scalar partners of the left and right handed third generation quarks. We show that the SUSY contribution to the mass difference in the $B_d^0$ system is comparable to the Standard Model one and can be even larger for the charged Higgs contribution and for a certain supersymmetric parameter space. △ Less", "B physics represents a privileged place to look for supersymmetry (SUSY) through its virtual effects. Here we discuss rare B decays ($b \\to s γ$, $b \\to s g$, $b \\to s l^{+} l^{-}$) and $B-\\bar{B}$ oscillations in the context of low-energy SUSY. We outline the variety of predictions that arise according to the choice of the SUSY extension ranging from what we call the ``minimal\" version of the MSSM to models without flavour universality or with broken R-parity. In particular, we provide a model-independent parameterization of the SUSY FCNC effects which is useful in tackling the problem in generic low-energy SUSY. We show how rare B physics may be complementary to direct SUSY searches at colliders, in particular for what concerns extensions of the most restrictive version of the MSSM. △ Less", "Some possible methods to determine at the LHC masses of SUSY particles are discussed. △ Less", "The generalization of the \"custodial symmetry\" mechanism which leads to the natural (without fine tuning) explanation of the doublet-triplet hierarchy is suggested in the frames of extended $SU(N\\geq 8)$ SUSY GUTs. It is shown also that such type of SUSY GUT can predict the value of strong gauge coupling constant $α_S(M_Z)$ consistent with present experimental data. △ Less", "The horizontal symmetry $U(3)_H$ can greatly help in solving the flavor problems in the supersymmetric grand unification. We consider the $SU(5)\\times U(3)_H$ model and show that it leads to the remarkable relations between the fermion mass matrices and the soft SUSY breaking terms. Dangerous supersymmetric contributions to the flavor-changing phenomena are naturally suppressed. The possible extensions to the $SO(10)\\times U(3)_H$ model are also outlined. △ Less", "We briefly report about a possible settlement of the still ongoing dispute concerning the existence of SUSY signals in 4jet events at LEP1. We base our arguments on a simple selection strategy exploiting secondary vertex tagging and kinematical constraints, which could allow one to access or exclude gluino events for a broad range of masses and lifetimes. △ Less", "We present a theoretical review of the possibilities offered by heavy flavour tagging in testing QCD features in 4-jet events at LEP1. Attention is focused mainly on the properties of the angular variables which are used in the experimental analyses to measure the colour factors of the strong interactions. We also comment on a possible settlement of the ongoing controversy about the existence in LEP1 data of SUSY events involving light gluinos. Integrated and differential rates of interest to phenomenological analyses are given and various tagging procedures are discussed. △ Less", "The crucial problem of how the dilaton field is stabilized at a phenomenologically acceptable value in string theories remains essentially unsolved. We show that the usual scenario of assuming that the dilaton is fixed by the (SUSY breaking) dynamics of just the dilaton itself (dilaton dominance scenario) is {\\em inconsistent} unless the Kähler potential receives very important perturbative or non-perturbative contributions. Then, the usual predictions about soft breaking terms are lost, but still is possible to derive model-independent predictions for them. △ Less", "We construct realistic supergravity models where supersymmetry breaking arises from the $D$-terms of an anomalous $U(1)$ gauge symmetry broken at the Planck scale. The model has the attractive feature that the gaugino masses, the $A$ and $B$ terms and the mass splittings between the like-charged squarks of the first two generations compared to their average masses are all suppressed. As a result, the electric dipole moment of the neutron as well as the flavor changing neutral current effects are predicted to be naturally small. These models predict naturally the expected value of the $μ$-term and also have the potential to qualitatively explain the observed mass hierarchy among quarks and leptons. △ Less", "Superstring phenomenology aims at achieving two goals. The first is to reproduce the observed physics of the Standard Model. The second is to identify experimental signatures of superstring unification which, if observed, will provide further evidence for the validity of superstring theory. I discuss such potential signatures of superstring unification. I propose that proton lifetime constraints imply that the Standard Model gauge group must be obtained directly at the string level. In this case the unifying gauge group, for example $SO(10)$, is broken to the Standard Model gauge group by ``Wilson lines''. The symmetry breaking by ``Wilson line'' has important implications. It gives rise to exotic massless states which cannot fit into multiplets of the original unifying gauge group. This is an important feature because it results in conservation laws which forbid the interaction of the exotic ``Wilsonian'' states with the Standard Model states. The ``Wilsonian'' matter states then have important phenomenological implications. I discuss two such implications: exotic ``Wilsonian'' states as dark matter candidates and ``Wilsonian'' matter as the messenger sector in gauge mediated dynamical SUSY breaking scenarios. △ Less", "I review the bounds on the $R$-parity-violating supersymmetric Yukawa couplings from the considerations of proton stability, $n$--$\\bar{n}$ oscillation, $ν_e$-Majorana mass, neutrino-less double $β$ decay, charged-current universality, $e$--$μ$--$τ$ universality, $ν_μ$--$e$ scattering, atomic parity violation, $ν_μ$ deep-inelastic scattering, $K^{+}$-decays, $τ$-decays, $D$-decays and from the precision LEP electroweak observables. I also mention about the sparticle bounds at colliders when the assumption of $R$-parity-conservation is relaxed. Finally, I mention how $R$-parity-violating models have been invoked in an attempt to explain the reported excess in ALEPH 4-jet events. △ Less", "One way to generate an intermediate scale being consistent with gauge coupling unification is to add new Higgs scalars above the intermediate scale. We classify such scenarios according to their degree of departure from minimal supersymmetric standard model. Thereafter, we summarize the results of a two-loop renormalization group analysis of the gauge and the Yukawa sectors of such scenarios, and their sensitivity to the {\\it input} $α_3(m_Z)$. The presence of an adjoint color octet above the intermediate scale can raise the gauge coupling unification scale to the $string$ scale, acommodate a suitable intermediate scale, provide a left-handed $τ$-neutrino$ mass of the order of few electron volts and also have the right prediction of the ratio of $m_b /m_τ$. △ Less", "The discrete R-parity ($R_P$) usually imposed on the Supersymmetric (SUSY) models is expected to be broken at least gravitationally. If the neutralino is a dark matter particle its decay channels into positrons, antiprotons and neutrinos are severely constrained from astrophysical observations. These constraints are shown to be violated even for Planck-mass-suppressed dimension-five interactions arising from gravitational effects. We perform a general analysis of gravitationally induced $R_P$ violation and identify two plausible and astrophysically consistent scenarios for achieving the required suppression. △ Less", "The planed HERA upgrade will increase the integrated luminosity by two orders of magnitude.A new program of electron-nucleus collisions at HERA is under discussion now.In this connection we present prospects for the study of a light neutral Higgs boson, SUSY-particle, hadrons and leptons productionin the two-photon coherent eA collisions at HERA energies. △ Less", "We present the predictions for the mass $M_h$ of the lightest Higgs boson in models with gauge-mediated supersymmetry breaking as a function of the SUSY-breaking scale. We include all radiative corrections up to two loops and point out that if the CDF e+ e- two-photon event is interpreted in terms of these models, then the lightest Higgs boson should be lighter than 110 GeV. △ Less", "We present a global $χ^2$ analysis of electroweak data, including fermion masses and mixing angles, in SO(10) SUSY GUTs. Just as precision electroweak data is used to test the Standard Model, the well determined Standard Model parameters are the precision electroweak data for testing theories beyond the Standard Model. In this talk we use the latest experimentally measured values for these parameters. We study several models discussed in the literature. One of these models provides an excellent fit to the low energy data with $χ^2 \\sim 1$ for 3 degrees of freedom. We present our predictions for a few selected points in parameter space. △ Less", "We discuss an optimal $R$-parity breaking SUSY solution to the $R_b$ excess as well as the ALEPH 4-jet anomaly. The latter arises from the pair production of stop via chargino decay at LEP1.5, followed by its $R$--violating decay into a light quark pair. The model satisfies top quark and $Z$--boson decay constraints along with gaugino mass unification. △ Less", "We should be taking advantage of recent gains in our nonperturbative understanding of supersymmetric gauge theories to find the ``standard'' model of of dynamical supersymmetry breaking, and possibly of flavor as well. As an illustration of the possibilities for understanding the flavor hierarchy, I describe a realistic, renormalizable, supersymmetric model with a compositeness scale of $\\sim 1-3$ TeV for the top quark, the left handed bottom quark, and the up-type Higgs. The top-Higgs Yukawa coupling is a dynamically generated strong interaction effect, and is naturally large, while the other Yukawa couplings are suppressed. △ Less", "I report on a systematic analysis of the MSSM parameter space to obtain the best SUSY solution to the $R_b$ anomaly within the constraint of top quark decay. Phenomenological implications for top decay and direct stop production at the Tevatron collider are discussed. △ Less", "We consider the origin of new phases in supersymmetric grand unification model, and show how significant new contributions arise from the gluino mediated diagram. We then present a more general model independent analysis of various modes of B-decays suggested previously for measurement of the CKM phases and point out what they really measure. It is in principle possible to separate out all the phases. △ Less", "The breaking of supersymmetry is usually assumed to occur in a hidden sector. Two natural candidates for the supersymmetry breaking transmission from the hidden to the observable sector are gravity and the gauge interactions. Only the second one allows for supersymmetry breaking at low energies. I show how the two candidates deal with the flavor and the $μ$-problem; I also briefly comment on the doublet-triplet and dark matter problem. △ Less", "If $R$-parity is not conserved, the lightest supersymmetric particle (LSP) could decay via lepton number violating or baryon number violating interactions. The latter case is particularly insidious since it leads to a reduction of the $\\eslt$ as well as leptonic signals for supersymmetry. We evaluate cross sections for jets plus $\\eslt$, 1$\\ell$, $2\\ell$ (same-sign and opposite sign) and $3\\ell$ event topologies that result from the simultaneous production of all sparticles at the CERN Large Hadron Collider (LHC), assuming that the lightest supersymmetric particle $\\tz_1$ decays hadronically inside the detector via $R$-parity violating interactions. We assume that these interactions do not affect the production rates or decays of other sparticles. We examine the SUSY reach of the LHC for this ``pessimistic'' scenario, and show that experiments at the LHC will still be able to search for gluinos and squarks as heavy as 1 TeV, given just 10 fb$^{-1}$ of integrated luminosity, even with cuts designed to explore the canonical SUSY framework with a {\\it conserved} $R$-parity. △ Less", "We study supersymmetric Sp(2N) gauge theories with matter in the antisymmetric tensor representation and F fundamentals. For F=6 we solve the theory exactly in terms of confined degrees of freedom and a superpotential. By adding mass terms we obtain the theories with F<6 which we find to exhibit a host of interesting non-perturbative phenomena: quantum deformed moduli spaces with N constraints, instanton-induced superpotentials and non-equivalent disjoint branches of moduli spaces. We find a simple dual for F=8 and no superpotential. We show how the F=4 and F=2 theories can be modified to break supersymmetry spontaneously and point out that the Sp(6) theory with F=6 may be very interesting for model builders. △ Less", "We investigate the confining phase vacua of supersymmetric $Sp(2\\NC)$ gauge theories that contain matter in both fundamental and antisymmetric representations. The moduli spaces of such models with $\\NF=3$ quark flavors and $\\NA=1$ antisymmetric field are analogous to that of SUSY QCD with $\\NF=\\NC+1$ flavors. In particular, the forms of their quantum superpotentials are fixed by classical constraints. When mass terms are coupled to $W_{(\\NF=3,\\NA=1)}$ and heavy fields are integrated out, complete towers of dynamically generated superpotentials for low energy theories with fewer numbers of matter fields can be derived. Following this approach, we deduce exact superpotentials in $Sp(4)$ and $Sp(6)$ theories which cannot be determined by symmetry considerations or integrating in techniques. Building upon these simple symplectic group results, we also examine the ground state structures of several $Sp(4) \\times Sp(4)$ and $Sp(6) \\times Sp(2)$ models. We emphasize that the top-down approach may be used to methodically find dynamical superpotentials in many other confining supersymmetric gauge theories. △ Less", "We analyze the one-loop effects (strong and electroweak) on the unconventional top quark decay mode $t\\rightarrow H^{+} b$ within the MSSM. The results are presented in the on-shell renormalization scheme with a physically well motivated definition of $\\tanβ$. The study of this process at the quantum level is useful to unravel the potential supersymmetric nature of the charged Higgs emerging from that decay. As compared with the standard mode $t\\rightarrow W^{+} b$, the corrections to $t\\rightarrow H^{+} b$ are large, slowly decoupling and persist at a sizeable level even for all sparticle masses well above the LEP 200 discovery range. As a matter of fact, the potential size of the SUSY effects, which amount to corrections of several ten percent, could counterbalance the standard QCD corrections and even make them to appear with the ``wrong'' sign. Therefore, if the charged Higgs decay of the top quark is kinematically allowed -a possibility which is not excluded by the recent measurements of the branching ratio $BR(t\\rightarrow W^{+} b)$ at the Tevatron - it could be an invaluable laboratory to search for ``virtual'' supersymmetry. While a first significant test of these effects could possibly be performed at the upgraded Tevatron, a more precise verification would most likely be carried out in future experiments at the LHC. △ Less", "The possibilities for an underlying theory behind an effective supersymmetric Nambu--Jona-Lasinio like model of electroweak symmetry breaking with propagating Higgs boundstates (e.g. supersymmetric topcondensation) are investigated. The concept of a renormalizable underlying theory turns out not to be appropriate. We argue that the new theory should come from the Planck scale and be connected to supergravity. Such a model can be constructed but necessarily implies a nonlinear definition of the full Lagrangian. △ Less", "If sleptons are produced at LEP II or the Next Linear Collider, lepton flavor violation can be probed at a level significantly below the current bounds from rare processes, such as $μ\\to eγ$. Polarizable $e^-$ beams and the $e^-e^-$ mode at the NLC are found to be powerful options. △ Less", "The paper addresses the problem of suppressing naturally the unsafe d=4 as well as the color-triplet mediated and/or gravity-linked d=5 proton-decay operators, which generically arise in SUSY-unification. It also attempts to give light masses to the neutrinos, of the type suggested by current experiments. It is noted that neither the symmetries in $SO(10)$, nor those in $E_6$, suffice for the purpose -- especially in the matter of suppressing naturally the d=5 proton-decay operators. By contrast, it is shown that a certain {\\it string-derived symmetry}, which cannot arise within conventional grand unification, but which does arise within a class of three-generation string-solutions, suffices, in conjuction with $B-L$, to safeguard proton-stability from all potential dangers, including those which may arise through higher dimensional operators and the color-triplets in the infinite tower of states. At the same time, the symmetry in question permits neutrinos to acquire appropriate masses. This shows that {\\it string theory plays an essential role in ensuring natural consistency of SUSY-unification with two low-energy observations -- proton-stability and light masses for the neutrinos}. The correlation between the masses of the extra $Z'$-boson (or bosons), which arise in these models, and proton-decay rate is noted. △ Less", "We present the study of the possibility to have R-parity breaking interactions in minimal SU(5). An interesting scenario emerges in which the R-parity breaking coupling $λ'_{333}$ is large, and its size is related to the value of the tau neutrino mass, assuming that supersymmetry is broken according to low energy supergravity framework. This scenario may also have implications on the issue of $b-τ$ unification. △ Less", "It is known that a Higgs $μ$ term can be naturally generated through the Kähler potential in orbifold string models in which one of the three compactified complex planes has order two. In this class of models explicit expressions for both the $μ$ parameter and the soft SUSY-breaking parameters can be obtained under the assumption that the goldstino is an arbitrary linear combination of the fermionic partners of the dilaton $S$ and all the moduli $T_i,U_i$. We apply this picture to the MSSM and explore the consistency of the obtained boundary conditions with radiative gauge symmetry breaking. We find that consistency with the measured value of the top-quark mass can only be achieved if the goldstino has a negligible dilatino component and relevant components along the $T_3,U_3$ moduli associated to the order-two complex plane. △ Less", "The concept of non-abelian horizontal symmetry $SU(3)_H$ can greatly help in understanding the fermion and sfermion flavour structures in supersymmetric grand unification. For the sake of demonstration the $SU(5)\\times SU(3)_H$ model, suggested earlier in ref. \\cite{PLB85}, is revisited. We show that under very simple and natural assumption it links the sfermion mass pattern to those of fermions in a remarkable way. All dangerous supersymmetric flavour-changing contributions are naturally suppressed in a general case, independently of the concrete texture for fermion mass matrices. Nevertheless, within this framework we present an example of predictive model for fermion masses and mixing, which leads to 7 consistent predictions for the low energy observables. [Based on talks given at Int. Workshop {\\em `SUSY 96'}, Univ. of Maryland, 29 May - 1 June 1996 (to appear on Proceedings), and II US-Polish Workshop {\\em `Physics from Planck Scale to Electroweak Scale'}, Warsaw, 28-30 March 1996.] △ Less", "We present the cross-sections for the hadroproduction of squarks and gluinos in next-to-leading order of supersymmetric QCD. The four possible final states squark-antisquark, squark-squark, gluino-gluino and squark-gluino are analysed for the hadron colliders Tevatron and LHC. The dependence of the cross-sections on the renormalization and factorization scale is reduced significantly. The shape of the transverse-momentum and rapidity distributions remains nearly unchanged when the next-to-leading order SUSY-QCD contributions are included. The size of the corrections at the central scale, given by the average mass of the produced particles, varies between $+5\\%$ and $+90\\%$. △ Less", "We consider an extended gauge group for the electroweak interaction: SU(2)_1 \\times SU(2)_2 \\times U(1)_Y where the first and second generations of fermions couple to SU(2)_1 while the third generation couples to SU(2)_2. Bounds based on precision observables and heavy gauge boson searchesare placed on the new parameters of the theory, and the potential of the theory to explain R_b and R_c is explored. We investigate processes that could produce observable signals at the LHC and NLC. △ Less", "The simplest interpretation of the global success of the Standard Model is that new physics decouples well above the electroweak scale. Supersymmetric extension of the Standard Model offers the possibility of light chargino and the right-handed stop (with masses below $M_Z$), and still maintaining the successful predictions of the Standard Model. The value of $R_b$ can then be enhanced up to $\\sim 0.218$ (the Standard Model value is $\\sim 0.216$). Light chargino and stop give important contribution to rare processes such as $b\\rightarrow s γ$, $\\overline K^0-K^0$ and $\\overline B^0-B^0$ mixing but consistency with experimental results is maintained in a large region of the parameter space. The exotic four-jet events reported by ALEPH (if confirmed) may constitute a signal for supersymmetry with such a light spectrum and with explicitly broken $R-$parity. Their interpretation as pair production of charginos with $m_C\\sim 60$ GeV, with subsequent decay $C\\rightarrow \\tilde t_R b \\rightarrow dsb$ (where $m_{\\tilde t}\\sim 55$ GeV) leads to signatures very close to the experimental observations. △ Less", "I present a supersymmetric theory of flavor based on the discrete flavor group $(S_3)^3$. The model can account for the masses and mixing angles of the standard model, while maintaining sufficient sfermion degeneracy to evade the supersymmetric flavor problem. I demonstrate that the model has a viable phenomenology and makes one very striking prediction: the nucleon decays predominantly to $K l$ where $l$ is a {\\em first} generation lepton. I show that the modes $n \\rightarrow K^0 \\barν_e$, $p\\rightarrow K^+ \\barν_e$, and $p\\rightarrow K^0 e^+$ occur at comparable rates, and could well be discovered simultaneously at the SuperKamiokande experiment. △ Less", "WPHACT (W W and Higgs Physics with PHACT) is a MC program and unweighted event generator which computes all Standard Model processes with four fermion in the final state at $e^+ e^-$ colliders. It is based on an helicity amplitude method which allows precise and fast evaluations of the matrix elements both for massless and massive fermions. Fermion masses for $b$ quarks are exactly taken into account. QED initial state and Coulomb corrections are evaluated, while QCD final state corrections are included in an approximate formulation. Cuts can be easily introduced and distributions for any variable at parton level can be implemented. The contributions to the processes of neutral Standard Model or Susy Higgs can be included. Anomalous couplings effects for the triple coupling can be computed. An interface to hadronization is provided and Jetset can be directly called from the program. △ Less", "We discuss the production of lepton flavor violation and EDMs and the viability of the $b-τ$ unification hypothesis in SUSY grand unification with an intermediate gauge symmetry breaking scale. △ Less", "Recently there has been a resurgence of interest in gauge mediated dynamical supersymmetry breaking scenarios. I investigate how low energy dynamical SUSY breaking may arise from superstring models. In a three generation string derived model I propose that the unbroken hidden non--Abelian gauge group at the string scale is $SU(3)_H$ with matter multiplets. Due to the small gauge content of the hidden gauge group the supersymmetry breaking scale may be consistent with the dynamical SUSY breaking scenarios. The messenger states are obtained in the superstring model from sectors which arise due to the ``Wilson--line'' breaking of the unifying non--Abelian gauge symmetry. An important property of the string motivated messenger states is the absence of superpotential terms with the Standard Model states. The stringy symmetries therefore forbid the flavor changing processes which may arise due to couplings between the messenger sector states and the Standard Model states. Motivated from the problem of string gauge coupling unification I contemplate a scenario in which the messenger sector consists solely of color triplets. This hypothesis predicts a chargino mass below the $W$--boson mass. Imposing the current limits from the LEP1 and LEP1.5 experiments the lightest supersymmetric particles predicted by this hypothesis are in the mass ranges $M_{χ^\\pm}\\approx55-65$ GeV, $M_{χ^0}\\approx35-50$ GeV and $M_{\\tildeν}\\approx45-60$ GeV which will be tested in the forthcoming LEP2 experiments. △ Less", "The scalar potential of theories with broken supersymmetry can have a number of local minima characterized by different gauge groups. Symmetry properties of the physical vacuum constrain the parameters of the MSSM. We discuss these constraints, in particular those that result from the vacuum stability with respect to quantum tunneling. △ Less", "We combine experimental bounds on the electric dipole moments of the neutron and electron with cosmological limits on the relic density of a gaugino-type LSP neutralino to constrain certain CP-violating phases appearing in the MSSM. We find that in the Constrained MSSM, the phase |θ_μ| < π/10, while the phase θ_A remains essentially unconstrained. △ Less", "The distortions in the thermal energy spectra for neutrinos produced in a supernova when a resonant oscillation, MSW effect, occurs are determined. In order to show this effect for some relevant and representative examples of unified gauge models, we have chosen $SO(10)$, and $SU(5)_{SUSY}$, $SO(10)_{SUSY}$ with a particular scheme for fermion masses (DHR model). The analysis has been performed for two choices of neutrinos parameters, predicted by the above models, and capable to explain the solar neutrino problem. In both cases one observes a strong distortion in the electron neutrino energy spectrum. This effect, computed for a wide range of $SO(10)_{SUSY}$ models has produced the same results of the previous supersymmetric ones. △ Less", "Indirect limits on the mass of the lightest neutralino are derived from the results of searches for charginos, neutralinos, and sleptons performed with data taken by the ALEPH Collaboration at centre-of-mass energies near the Z peak and at 130 and 136 GeV. Within the context of the Minimal Supersymmetric Standard Model and when $M_{\\tildeν}\\ge 200$ GeV/c^2, the bound $M_χ>12.8$ GeV/c^2 at the 95\\% confidence level applies for any $\\tanβ$. The impact of lighter sneutrinos is presented in the framework of SUSY grand unified theories; a massless neutralino is allowed only for a narrow range of $\\tanβ$, $μ$, and the scalar mass parameter $m_0$. Finally, by including Higgs mass constraints and requiring that radiative electroweak symmetry breaking occur, more stringent bounds on $M_χ$ as a function of $\\tanβ$ are derived. △ Less", "By examining multi-instantons in N=2 supersymmetric SU(2) gauge theory, we derive, on very general grounds, and to all orders in the instanton number, a relationship between the prepotential F(Phi), and the coordinate on the quantum moduli space u=<Tr Phi^2>. This relation was previously obtained by Matone in the context of the explicit Seiberg-Witten low-energy solution of the model. Our findings can be viewed as a multi-instanton check of the proposed exact results in supersymmetric gauge theory. △ Less", "We discuss the renormalization group flow, duality, and supersymmetry breaking in N = 1 supersymmetric SU(N)xSU(M) gauge theories. △ Less", "BPS monopoles in N=2 SUSY theories may lead to monopole condensation and confinement. We have found that supersymmetric black holes with non-vanishing area of the horizon may stabilize the moduli in theories where the potential is proportional to the square of the graviphoton central charge. In particular, in known models of spontaneous breaking of N=2 to N=1 SUSY theories, the parameters of the electric and magnetic Fayet--Iliopoulos terms can be considered proportional to electric and magnetic charges of the dyonic black holes. Upon such identification the potential is found to be proportional to the square of the black hole mass. The fixed values of the moduli near the black hole horizon correspond exactly to the minimum of this potential. The value of the potential at the minimum is proportional to the black hole entropy. △ Less", "Previously, in the context of the minimal supersymmetric standard model (without {\\em a priori} assumptions of parameter unification), we studied the constraints on weak-scale SUSY parameters from chargino production at LEP II, using as observables $\\mch$, $\\mLSP$, the cross section and the leptonic branching fraction. Here, exploiting the high degree of polarization in chargino production, we add to our earlier work the forward-backward asymmetries of the visible hadrons and leptons in chargino decays. For a chargino that is mostly gaugino, the parameter space can now be restricted to a small region; $\\tanb$ is constrained, the soft electroweak gaugino and electron sneutrino masses are determined to about 10\\%, and the sign of $μ$ may be determined. Constraints for a chargino that is mostly Higgsino are much weaker, but still disfavor the hypothesis that the chargino is mostly gaugino. For a chargino which is a roughly equal mixture of Higgsino and gaugino, we find intermediate results. △ Less", "Slepton mass matrices have been analyzed in an SO(10) SUSY-GUT, with soft-breaking terms generated at Planck scale. Higher dimensional operators consistent with 4-d string constructions are used in order to generate a Georgi-Jarlskog (G-J) Yukawa texture at \\mgut. Radiative corrections between \\mpl\\ and \\mgut\\ generate a substantial non-universality in the $\\tildeμ-\\tilde e$ sector. This non-universality originates in the flavor dependence of the Higgs assignments required for the G-J texture, and is unrelated to the large top Yukawa. The resulting branching ratio for mu->e could make this process observable for large sectors of the MSSM parameter space, with a factor of 10 improvement in statistics. △ Less", "Usually one expectes the inflaton field to be coupled to some gauge-charged particles allowing for its decay during reheating. Such particles then play a role of the messengers for the gauge-mediated supersymmetry breaking during and (shortly) after the inflation and radiatively induce soft masses to all other $D$-flat directions. We show that during the preheating stage this gauge-mediated soft masses are typically much greater than the Hubble parameter during inflation. The dramatic role is played by the supersymmetry (SUSY) breaking due to the parametric resonance effect, which ensures that the inflaton predominantly decays into the bosons and not the fermions. Difference in the Fermi-Bose occupation numbers results in the large gauge-mediated soft masses, which determine the post-inflationary evolution of the flat directions, suggesting that nonthermal phase transitions mediated by gauge messengers may play a crucial role in the Affelck-Dine mechanism for the generation of the baryon asymmetry. △ Less", "In the context of explaining the experimental deviations in R_b and R_c from their Standard Model predictions, a new type of U(1) interaction is proposed which couples only to quarks. Special attention will be paid to the supersymmetric η-model coming from E_6 which, due to kinetic mixing effects, may play the role of the leptophobic U(1). This talk summarizes work done with K.S. Babu and J. March-Russell in hep-ph/9603212. △ Less", "Sleptons can easily be found at future linear e+e- colliders if kinematically accessible. Measurements of their masses and decay distributions would then determine MSSM parameters. This paper presents a detailed MC study of the production and decay of the lighter scalar tau lepton, stau1. We found that mstau1 and the left-right mixing angle of stau would be measured within an error of a few percent. tanbeta is determinable in some region of the parameter space through simultaneous studies of stau1-and selectron-pair production: the polarization measurement of the tau leptons from stau1 decays and the M1, mchi1 determination using selectron pair production and decay. We also point out the possibility to determine bino-selectron-e coupling through the measurement of the angular distribution of the selectron-pair production. The error on the coupling is expected to be comparable to its typical SUSY radiative correction, which is proportional to log(msquark/mslepton). The radiative correction affects M1 and tanbeta determination, necessitating the full 1-loop radiative correction to the selectron production processes. The implication of these measurements of the MSSM parameters on selecting models of the origin of supersymmetry breaking is also discussed. △ Less", "We investigate the Higgs sector of a nonlinear supersymmetric standard model at LEP 1 and LEP 2, as well as at future linear $e^+ e^-$ colliders with $\\sqrt s = 500$, 1000, and 2000 GeV. The LEP 1 data do not put any constraints on the parameters of the model, and allow a massless Higgs boson in particular. For LEP 2, there are remarkable differences between the Higgs productions at $\\sqrt s = 175$ GeV on the one hand and that at $\\sqrt s = 192$ GeV and 205 GeV on the other hand. The case for $\\sqrt s = 175$ GeV is similar to LEP 2, whereas those for $\\sqrt s = 192$ GeV and 205 GeV will be able to give experimental constraints on the parameters. Finally the $e^+ e^-$ colliders with $\\sqrt s = 500$, 1000, and 2000 GeV are most probably able to test the model conclusively. △ Less", "In this talk I present a detailed SUSY QCD calculation of the decay rate of the lightest Higgs boson $H^0_2$\\ into two gluons, where all quarks and scalar quarks are taken within the relevant loop diagrams. I include the mixing of all the three generations of the scalar partners of the left and right handed quarks and show that their contribution is comparable to the quark contribution in the MSSM for small values of the soft SUSY breaking parameter $m_S$. Furthermore in the MSSM the contribution from the bottom quark becomes as large as the top quark contribution for large $\\tanβ$\\ and large Higgs masses. As a result, the two gluon decay rate of $H_2^0$\\ is much larger than the two gluon decay rate of an equal mass standard model Higgs boson. I further compare the decay mode of $H^0_2\\rightarrow gg$\\ to the similar decay modes of $H^0_2\\rightarrow c\\overline c$\\ including one loop QCD corrections and show that in some cases $Γ(H^0_2\\rightarrow gg)$\\ is even higher than $Γ(H^0_2\\rightarrow c\\overline c)$. △ Less", "We examine various aspects of supersymmetric particle production at linear $e^+e^-$ colliders operating at a centre of mass energy of $\\sqrt{s}=500$ GeV, and integrated luminosity of $\\int {\\cal L}dt=20-50$ fb$^{-1}$. Working within the framework of the minimal supergravity model with gauge coupling unification and radiative electroweak symmetry breaking (SUGRA), we study various signatures for detection of sparticles, taking into account their cascade decays, and map out the regions of parameter space where these are observable. We also examine strategies to isolate different SUSY processes from another. In addition, we perform four detailed SUGRA case studies and examine the detectability of sparticles when several SUSY processes are simultaneously occuring. We show that precision mass measurements of neutralinos, sneutrinos and top-squarks are possible, in addition to previously studied precision mass measurements of sleptons and charginos. △ Less", "A status report is given of the calculations of next-to-leading-order ($N=1$) supersymmetric QCD corrections to the production of squarks and gluinos in $p\\bar{p}/pp$ collisions. The implementation of these SUSY-QCD corrections leads to more stable theoretical predictions and to a substantial increase of the production cross-sections. In addition we give a discussion of the use of the $\\overline{MS}$ scheme for renormalizing the coupling constants in the QCD sector of ($N=1$) supersymmetric theories. △ Less", "The invention of supersymmetry, almost exactly 25 years ago, changed the face of high-energy physics. The idea that the observed low-energy gauge groups appear due to the process of spontaneous breaking of a single unifying group $G$ is also quite popular. The synthesis of these two elements results in supersymmetric grand unification. I present (perturbatively) exact results regarding the supersymmetric evolution of the gauge couplings from the scale of their unification to lower scales. In particular, it is shown how the heavy mass thresholds can be properly taken into account to all orders. △ Less", "We performed a combined analysis of the parameter space of the Minimal Supersymmetric Standard Model (MSSM) taking into account cosmological and accelerator constraints including those from the radiative $b\\rightarrow sγ$ decay measured by the CLEO collaboration. Special attention is paid to the event rate, $R$, of direct dark matter neutralino detection. We have found domains of the parameter space with $R\\simeq 5-10$~events/kg/day. This would be within the reach of current dark matter experiments. The $b\\rightarrow sγ$ data do not essentially reduce these large event rate domains of the MSSM parameter space. △ Less", "In a class of supersymmetric models with R-parity breaking the lightest stop can have new decay modes into third generation fermions, $\\tilde{t}_1 \\rightarrow b + τ$. We show that this decay may be dominant or at least comparable to the ordinary R-parity conserving mode $\\tilde{t}_1 \\rightarrow c + \\tildeχ_1^0$, where $\\tildeχ_1^0$ denotes the lightest neutralino. The new R-parity violating decay mode could provide new signatures for stop production at LEP. △ Less", "The commonly accepted notion of a weak unified coupling $α_X \\approx 0.04$, based on the assumption of the MSSM--spectrum, is questioned. It is suggested that the four--dimensional unified string coupling should very likely have an intermediate value $(\\sim 0.2-0.3$, say) so that it may be large enough to stabilize the dilaton but not so large as to disturb the coupling--unification relations. Bearing this in mind, as well as the smallness of the MSSM unification scale $M_X$ compared to the string scale, the consequences of a previously suggested extension of the MSSM spectrum are explored. The extension contains two vector--like families of quarks and leptons with relatively light masses of order 1 TeV, having the quantum numbers of ${\\bf 16}+{\\bf \\overline{16}}$ of $SO(10)$. It is observed that such an extension provides certain unique advantages. These include: (a) removing the stated mismatch between MSSM and string unifications with regard to $α_X$ and to some extent $M_X$ as well, (b) achieving coupling unification with a relatively low value of $α_3(m_Z)$, in accord with its world average value, and (c) following earlier works, providing a simple explanation of the observed inter--family mass--hierarchy. The extension provides scope for exciting new discoveries, beyond those of SUSY and Higgs particles, at future colliders, including the LHC and the NLC. △ Less", "We investigate low-energy models of supersymmetry (SUSY) breaking by means of vector-like gauge theories for dynamical SUSY breaking. It is not necessary to introduce messenger gauge interactions utilized so far to mediate the SUSY breaking to the standard-model sector, which reduces complication in the model building. We also consider various other ways of SUSY-breaking transmission. △ Less", "We study the non-perturbative behavior of some N=1 supersymmetric product-group gauge theories with the help of duality. As a test case we investigate an SU(2)xSU(2) theory in detail. Various dual theories are constructed using known simple-group duality for one group or both groups in succession. Several stringent tests show that the low-energy behavior of the dual theories agrees with that of the electric theory. When the theory is in the confining phase we calculate the exact superpotential. Our results strongly suggest that, in general, dual theories for product groups can be constructed in this manner, by using simple-group duality for both groups. Turning to a class of theories with SU(N)xSU(M) gauge symmetry we study the renormalization group flows in the space of the two gauge couplings and show that they are consistent with the absence of phase transitions. Finally, we show that a subset of these theories, with SU(N)xSU(N-1) symmetry break supersymmetry dynamically. △ Less", "Stop contributions to radiative corrections to R_b and the top quark decay are analysed over the relevant MSSM parameter space. One sees a 30 % increase in the former along with a similar drop in the latter in going from the higgsino dominated to the mixed region. Consequently one can get a viable SUSY contribution to R_b within the constraint of the top quark data only in the mixed region, corresponding to a photino dominated LSP. We discuss the phenomenological implications of this model for top quark decay and direct stop production, which can be tested with the Tevatron data. △ Less", "Supersymmetric theories often include the non-compact directions in the field space along which the tree level potential grows only up to a certain limited value (determined by the mass scale of the theory) and then stays constant for the arbitrarily large expectation value of the field parametrizing the direction. Above the critical value, the tree-level curvature is large and positive in the other directions. Such plateaux are natural candidates for the hybrid inflaton. The non-zero F-term density along the plateau spontaneously breaks SUSY and induces the one-loop logarithmic slope for the inflaton potential. The coupling of the inflaton to the Higgs fields in the complex representations of the gauge group, may result in a radiatively induced Fayet--Iliopoulos D-term during inflation, which destabilizes some of the squark and slepton flat directions. Corresponding soft masses can be larger than the Hubble parameter and thus, play a crucial role for the Affleck--Dine baryogenesis. △ Less", "We analyse the contribution of new heavy virtual fermions to the $e^+e^- \\rightarrow W^+W^-$ cross section. We find that there exists a relevant interplay between trilinear and bilinear oblique corrections. The result strongly depends on the chiral or vector--like nature of the new fermions. As for the chiral case we consider sequential fermions: one obtains substantial deviation from the Standard model prediction, making the effect possibly detectable at $\\sqrt{s}=500$ or $1000$ GeV linear colliders. As an example for the vector--like case we take a SUSY extension with heavy charginos and neutralinos: due to cancellation, the final effect turns out to be negligible. △ Less", "We introduce a new method to treat Majorana fermions and interactions with fermion-number violation on the GRACE system which has been developed for the automatic computation of the matrix elements for the processes of the standard model. Thus we have constructed a system for the automatic computation of cross-sections for the processes of the minimal SUSY standard model (MSSM). △ Less", "We calculate the supersymmetric QCD corrections in order $α_s$ to the decays $\\squark_i \\to q' \\chargino_j$ (i,j = 1,2) and $\\squark_i \\to q \\neutralino_k$ (k = 1,...4) within the Minimal Supersymmetric Standard Model. In particular we consider the decays of squarks of the third generation, $\\stop_i$ and $\\sbottom_i$ (i = 1,2), where the left--right mixing must be taken into account. The corrections turn out to be of about 10\\%, except for higgsino--like charginos or neutralinos, where they can go up to 40\\%. △ Less", "We show that an intermediate gauge symmetry breaking scale can be a significant source of electric dipole moments for the electron and neutron in supersymmetric grand unified theories. New phases, similar to that of the CKM matrix, appear which do not arise from the supersymmetry (SUSY) breaking operators. To illustrate, we choose some grand unified SUSY models having an intermediate gauge symmetry breaking scale with some attractive features. We also show how well the $b-τ$ unification hypothesis works in this class of models. △ Less", "The production mechanisms and decay modes of the heavy neutral and charged Higgs bosons in the Minimal Supersymmetric Standard Model are investigated at future $e^+ e^-$ colliders in the TeV energy regime. We generate supersymmetric particle spectra by requiring the MSSM Higgs potential to produce correct radiative electroweak symmetry breaking, and we assume a common scalar mass $m_0$, gaugino mass $m_{1/2}$ and trilinear coupling $A$, as well as gauge and Yukawa coupling unification at the Grand Unification scale. Particular emphasis is put on the low $\\tb$ solution in this scenario where decays of the Higgs bosons to Standard Model particles compete with decays to supersymmetric charginos/neutralinos as well as sfermions. In the high $\\tb$ case, the supersymmetric spectrum is either too heavy or the supersymmetric decay modes are suppressed, since the Higgs bosons decay almost exclusively into $b$ and $τ$ pairs. The main production mechanisms for the heavy Higgs particles are the associated $AH$ production and $H^+H^-$ pair production with cross sections of the order of a few fb. △ Less", "We analyze constraints on low-energy flavour-changing sfermion mass terms, coming from FCNC and CP violating processes, in the model-independent framework of the mass insertion method. We discuss the relevance of these constraints as tests of supersymmetric extensions of the standard model; in particular, we consider grand-unified models and models with non-universal soft breaking terms. △ Less", "We discuss spontaneous supersymmetry breaking in $N=2$ globally supersymmetric theories describing abelian vector multiplets. The most general form of the action admits, in addition to the usual Fayet-Iliopoulos term, a magnetic Fayet-Iliopoulos term for the auxiliary components of dual vector multiplets. In a generic case, this leads to a spontaneous breakdown of one of the two supersymmetries. In some cases however, dyon condensation restores $N=2$ SUSY vacuum. This talk is based on the work done in collaboration with H. Partouche \\cite{apt}. △ Less", "We analyze the minimal supersymmetric left-right model with non-re\\-nor\\-malizable interactions induced by higher scale physics and study its {\\it CP} violating properties. We show that it: (i) solves the strong {\\it CP} problem; (ii) predicts the neutron electric dipole moment well within experimental limits (thus solving the usual SUSY {\\it CP} problem). In addition, it automatically conserves {\\it R}-parity. The key points are that the parity symmetry forces the Yukawa couplings to be hermitean, while supersymmetry ensures that the scalar potential has a minimum with real higgs doublet vacuum expectation values. Gluino and B-L gaugino masses are automatically real. The observed {\\it CP} violation in the kaon system comes, as in the Standard Model, from the Kobayashi-Maskawa-type phases. These solutions are valid for any value of the right-handed breaking scale $M_R$, as long as the effective theory below $M_R$ has only two Higgs doublets that couple fully to fermions. ({\\it i.e.} the theory below $M_R$ is MSSM-like.) The potentially dangerous $SU(2)_L$ gaugino one-loop contributions to $\\barΘ$ below $M_R$ can be avoided if the left-right symmetry originates from a unified theory in which the $SU(2)_{L,R}$ gaugino masses are real. As an example, we show how the left-right symmetry can be embedded in an SO(10) theory. △ Less", "We analyze the full set of constraints on gluino- and photino-mediated SUSY contributions to FCNC and CP violating phenomena. We use the mass insertion method, hence providing a model-independent parameterization which can be readily applied in testing extensions of the MSSM. In addition to clarifying controversial points in the literature, we provide a more exhaustive analysis of the CP constraints, in particular concerning $\\varepsilon^\\prime/\\varepsilon$. As physically meaningful applications of our analysis, we study the implications in SUSY-GUT's and effective supergravities with flavour non-universality. This allows us to detail the domain of applicability and the correct procedure of implementation of the FC mass insertion approach. △ Less", "CP violating dipole moments of leptons vanish at least to three loop order and are estimated to be $({m_l\\over Mev})\\times 1.6\\times 10^{- 40}$ e-cm in the standard model (SM), where $m_l$ is the mass of the lepton. However they can receive potentially large contributions in some beyond SM scenarios and this makes them very sensitive probes of new physics. In this article we show that a non universal interaction, involving leptoquarks to the quark-lepton pair of the third generation through helicity unsuppressed couplings of the order of ordinary gauge couplings, can generate electric and weak dipole moments of the order of $10^{-19}$ e-cm for the tau lepton. This is greater than pure supersymmetric (SUSY) and left-right (L-R) contributions by almost three orders of magnitude. It is also greater than mirror fermionic contribution by an order of magnitude. The measurements of $\\dzt$ and $\\dgt$ at LEP, SLC and TCF are expected to reach sensitivities of $10^{-18}$ e-cm and $10^{-19}$ e-cm respectively in near future. The observation of a non vanishing dipole moment of tau at these facilities would therefore strongly favour superstring inspired light leptoquark mediated interactions, over pure SUSY or L-R interactions and perhaps also mirror generated mixings without some sort of quark-lepton unification as its origin. △ Less", "'Dual' is a promising key word in the particle physics at present. The string theory is dual in any sense. The observed sector and the hidden sector are dual on the 10-dim. $E_8\\times E_8$ heterotic string. We find $Z_6$ orbifold models preserving the duality under a torus compactification and realizing $SO(10)$ SUSY GUT in the obserbed sector under a twist division. △ Less", "In the electroweak phase transition there arises the problem of baryon number washout by sphaleron transitions, which can be avoided if the phase transition is strongly enough first order. The phase transition in the Standard Model or in the Minimal Supersymmetric Standard Model seems to be too weak to suppress the sphaleron transitions sufficiently. We report here on an investigation of the Next to Minimal Supersymmetric Standard Model, NMSSM, which contains a Higgs singlet N in addition to the two Higgs doublets of the minimal SUSY model. This next to minimal model has the helpful new feature that the Higgs potential contains a tree level trilinear field term. We consider the most general form of the Higgs potential without imposing a discrete symmetry; in particular we allow the presence of a mu-term in the superpotential. We find that electroweak baryon preservation is compatible with the NMSSM. △ Less", "We illustrate the sensitivities of LEP experiments to leptonic signals associated to models where supersymmetry (SUSY) is realized with spontaneous breaking of R-parity. We focus on missing transverse momentum plus acoplanar muon events arising from lightest neutralino single production $χν$ as well as pair production $χχ$, followed by $χ$ decays, where $χ$ denotes the lightest neutralino. We show that the integrated luminosity achieved at LEP already starts probing the basic parameters of the theory. We discuss the significance of these constraints for the simplest spontaneous R-parity breaking models and their relevance for future searches of SUSY particles. △ Less", "Flavor structure of soft supersymmetry breaking parameters is studied in a certain type of effective supergravity theory derived from moduli/dilaton dominated supersymmetry breaking. Some interesting sum rules for soft scalar masses are presented. They constrain their flavor structure and predict some interesting patterns appeared in soft scalar masses in the non-universal case. We also study the alignment phenomena in the flavor space of soft breaking parameters due to Yukawa couplings and discuss their phenomenological consequences. △ Less", "We analyze in detail the moduli space of vacua of N=2 SUSY QCD with n_c colors and n_f flavors. The Coulomb branch has submanifolds with non-Abelian gauge symmetry. The massless quarks and gluons at these vacua are smoothly connected to the underlying elementary quarks and gluons. Upon breaking N=2 by an N=1 preserving mass term for the adjoint field the theory flows to N=1 SUSY QCD. Some of the massless quarks and gluons on the moduli space of the N=2 theory become the magnetic quarks and gluons of the N=1 theory. In this way we derive the duality in N=1 SUSY QCD by identifying its crucial building blocks---the magnetic degrees of freedom---using only semiclassical physics and the non-renormalization theorem. △ Less", "We study the phenomenology of the neutral Higgs sector of a non-SUSY non-minimal Standard Model. Models with more than one Higgs doublet are possible, and may contain neutral Higgs scalars with branching ratios significantly different to those of the Minimal Standard Model Higgs boson. We show how these differences may be exploited at LEP2 in order to distinguish the non-minimal Standard Model from the minimal version. △ Less", "We survey all possible supersymmetric three-body decays of the top quark in the framework of the MSSM and present detailed numerical analyses of the most relevant cases. Although the two-body channels are generally dominant, it is not inconceivable that some or all of our most favourite two-body SUSY candidates could be suppressed. In this event there is still the possibility that some of the available three-body SUSY modes might exhibit a substantial branching fraction and/or carry exotic signatures that would facilitate their identification. Furthermore, in view of the projected inclusive measurement of the top-quark width $Γ_t$ in future colliders, one should have at one's disposal the full second order correction (electroweak and strong) to the value of that parameter in the MSSM. Our analysis confirms that some supersymmetric three-body decays could be relevant and thus contribute to $Γ_t$ at a level comparable to the largest one loop supersymmetric effects on two-body modes recently computed in the literature. △ Less", "Within the context of a viable and economical SUSY preon model, two vector--like families $Q_{L,R} = (U,D,N,E)_{L,R}$ and $Q^\\prime_{L,R} = (U^\\prime,D^\\prime,N^\\prime,E^\\prime)_{L,R}$ with masses of order 1 TeV, one of which is a doublet of $SU(2)_L$ and the other a doublet of $SU(2)_R$, have been predicted to exist together with the three observed chiral families. The existence of these two vector--like families turns out to be crucial especially for an explanation of the inter--family mass--hierarchy and therefore for the SUSY preon model itself. This paper is devoted to a detailed study of the expected masses, mixings and decay modes of the vector--like fermions. Including QCD renormalization--effects, the masses of the vector--like quarks are expected to lie in the range of 500 GeV to about 2.5 TeV, while those of the vector--like leptons are expected to be in the range of 200 GeV to 1 TeV. △ Less", "We calculate the two-loop QCD corrections to the production of the neutral supersymmetric Higgs bosons via the gluon fusion mechanism at hadron colliders, including the contributions of squark loops. To a good approximation, these additional contributions lead to the same QCD corrections as in the case where only top and bottom quark loops are taken into account. The QCD corrections are large and increase the Higgs production cross sections significantly. △ Less", "Recent interest in horizontal symmetry model building has been driven mainly by the large top mass and hence strong hierarchy in quark masses, and the possibility of appropriately constrained soft squark mass matrices, in place of an assumed universality condition, for satisfying the relevant FCNC constraints. Here we present the first successful SUSY-$SU(5)$ model that has such a feature. The horizontal symmetry is a gauged $(Q_{12} \\times U(1))_H$ ($\\subset (SU(2) \\times U(1))_H$). All nonrenormalizable terms compatible with the symmetry are allowed in the mass matrix constructions. Charged lepton masses can also be accommodated. △ Less", "Among the possible decay modes of Higgs particles into supersymmetric states, neutralino and chargino decays play a prominent rôle. The experimental opportunities of observing such decay modes at LEP2 and at future e+e- linear colliders are analyzed within the frame of the Minimal Supersymmetric extension of the Standard Model. For heavy Higgs particles, the chargino/neutralino decay modes can be very important, while only a small window is open for the lightest CP-even Higgs particle. If charginos/neutralinos are found at LEP2, such decay modes can be searched for in a small area of the parameter space, and invisible decays may reduce the exclusion limits of the lightest CP-even Higgs particle slightly; if charginos/neutralinos are not found at LEP2 in direct searches, the Higgs search will not be affected by the SUSY particle sector. △ Less", "Assuming universality of Yukawa coupling of the superpotential and maximal spontaneous CP violation, fermion masses and mixing angles including that of neutrinos are studied in an SUSY SO(10)$\\times Δ(48)\\times$ U(1) model with small $\\tan β$. The low energy parameters of the standard model are determined solely by the Clebsch factors of the symmetry group and the structure of the physical vacuum. Thirteen parameters involving masses and mixing angles in the quark and charged lepton sector are successfully predicted by only four parameters with three of them determined by the scales of U(1)$\\times Δ(48)$, SO(10), SU(5) and SU(2)$_{L}$ symmetry breakings. An interesting prediction on ten parameters concerning the neutrino sector is also made by using the same four parameters. An additional parameter is added to obtain the mass and mixing of a sterile neutrino. It is found that the LSND $\\barν_μ \\rightarrow \\barν_{e}$ events, atmospheric neutrino deficit and the mass limit put by hot dark matter can be naturally explained. Solar neutrino puzzle can be solved only by introducing a sterile neutrino. $(ν_{e} - ν_τ)$ oscillation is found to have the same sensitive region as the $(ν_{e} - ν_μ)$ oscillation. The hadronic parameters $B_{K}$ and $f_{B}\\sqrt{B}$ are extracted from the observed $K^{0}$-$\\bar{K}^{0}$ and $B^{0}$-$\\bar{B}^{0}$ mixings respectively. The direct CP violation ($\\varepsilon'/\\varepsilon$) in kaon decays and the three angles $α$, $β$ and $γ$ of the unitarity triangle in the CKM matrix are also presented. More precise measurements of $α_{s}(M_{Z})$, $|V_{cb}|$, $|V_{ub}/V_{cb}|$, $m_{t}$, as well as various CP violation and neutrino oscillation experiments will provide crucial tests for the present model. △ Less", "When SUSY breaking produces only dimension-2 operators, gluino and photino masses are of order 1 GeV or less. The gluon-gluino bound state has mass 1.3-2.2 GeV and lifetime > 10^{-5} - 10^{-10} s. This range of mass and lifetime is largely unconstrained because missing energy and beam dump techniques are ineffective. With only small modifications, upcoming K^0 decay experiments can study most of the interesting range. The lightest gluino-containing baryon (uds-gluino) is long-lived or stable; experiments to find it and the uud-gluino are also discussed. △ Less", "The like sign dileptons provide the most promising signature for superparticle search in a large category of $R$-parity violating SUSY models. We estimate the like sign dilepton signals at the Tevatron collider, predicted by these models, over a wide region of the MSSM parameter space. One expects an unambiguous signal upto a gluino mass of $200 - 300$ GeV ($\\geq 500$ GeV) with the present (proposed) accumulated luminosity of $\\sim 0.1~(1)~{\\rm fb}^{-1}$. △ Less", "We calculate the supersymmetric QCD corrections in order $α_s$ to the cross section $e^+ e^- \\to \\sq_i \\bar\\sq_j$ $(i,j = 1, 2)$ within the Minimal Supersymmetric Standard Model. We pay particular attention to the case of the left--right squark mixing and to the renormalization of the mixing angle. The corrections due to gluino exchange turn out to be smaller than those due to gluon exchange, but they can be significant at higher energies even for a gluino mass of a few hundred GeV. △ Less", "We show that in some SU(N) type GUTs with the complementary pairs of the conjugated fermion multiplets there naturally appear the relatively light ($M\\ll M_{GUT}$) vectorlike fermions which considerably modify the desert physics. In the non-SUSY case they can provide for the unification of the standard coupling constant $α_1$, $α_2$ and $α_S$ whereas in the SUSY case they can increase the unification point up to the string unification limit and decrease $α_S(M_Z)$ down to the value predicted from the low energy physics. △ Less", "The partial widths are determined for squark decays to gluinos and quarks, and gluino decays to squarks and quarks, respectively. The widths are calculated including one-loop SUSY-QCD corrections. The corrections amount to $+$30\\% to $+$50\\% for squark decays and $-$10\\% to $+$10\\% for gluino decays. We have derived the results in the \\DR ~and \\MS ~renormalization schemes, and we have demonstrated explicitly that the one-loop effective $qqg$ and $q\\sq\\gl$ couplings are equal in the limit of exact supersymmetry. △ Less", "SUSY events in which a light stop decays to a chargino may manage to pass the cuts designed for top counting experiments at the Tevatron with no significant diminution of signal. Events in which a top decays via stop are detected with fair efficiency compared to SM top events when $\\stop\\into b\\wino$. More importantly, direct pair production of light stops contributes significantly to the cut samples. Many SUSY models with stops lighter than 100 GeV are viable even for $Γ(t\\into\\stop) \\approx Γ(t\\into bW)$. △ Less", "The problem of fermion masses and mixings is discussed in the context of supersymmetric grand unification theories. Some predictive frameworks based on the $SU(5)$, $SO(10)$ and $SU(6)$ models are reviewed. [Based on lectures delivered at the ICTP Summer School on `High Energy Physics and Cosmology', Trieste, Italy, 3-28 July 1995 (to appear on Proceedings), and XIX Int. Conference on {\\em Particle Physics and Astrophysics in the Standard Model and Beyond}, Bystra, Poland, 19-26 September 1995] △ Less", "We study the influence of messenger Yukawa couplings and top, bottom and $τ$ Yukawa couplings on the proton lifetime in SU(5) Supersymmetric GUT with dynamical supersymmetry breaking mechanism due to Dine and Nelson. △ Less", "We study the one-loop radiative corrections to the SU(2) breaking mass splittings between sfermions in SU(2) doublets in the Minimal Supersymmetric Standard Model. At tree-level, the differences of mass squared $m_{\\tilde{f}_{1L}}^2-m_{\\tilde{f}_{2L}}^2$ of SU(2) doublet sfermions $(\\tilde{f}_1, \\tilde{f}_2)_L$ in the first two generations are determined by $\\tanβ$, and are universal to sleptons and squarks. The radiative correction, however, breaks this relation. The typical deviation from the universality between sleptons and squarks is within $\\pm0.05$ in terms of the ``effective $\\cos2β$''. We also study the SUSY parameter dependence of the deviation. For very heavy sfermions, the relative corrections become large. △ Less", "We report on an investigation of CP violation in (un)polarized $e^+e^-\\to{\\bar t}t$ resulting from an extended neutral Higgs sector or from the minimal SUSY extension of the Standard Model (SM). We consider c.m. energies from the ${\\bar t}t$ threshold to the TeV range. In addition sensitivity estimates for CP-violating form factors of the top quark are made. Further we discuss the prospects of probing Higgs sector CP violationin $γγ\\to{\\bar t}t$. △ Less", "We construct SUSY $SU(3) \\otimes SU(2)_{L} \\otimes U(1)$ electroweak models with superweak R-parity. The scale of R-parity violation in one of the models is determined by the Majorana mass of neutrino and it is very small that leads to the existence of longlived ($ T \\geq O(10^{-4}sec$) lightest superparticle. If lightest superparticle is righthanded charged slepton that can be realized within gaugino dominated scenario then the phenomenology of such model differs in a drastic way from the standard SUSY phenomenology, in particular, longlived charged sleptons can form bound states with ordinary matter - quasistable supermatter (SUSY analogs of mu-atoms and muonium). We discuss possible manifestations of the existence of such longlived charged particle at LEP2, TEVATRON and LHC. We also construct $SU(3) \\otimes SU(2)_{L} \\otimes SU(2)_{R} \\otimes U(1)$ model with Majorana mass and superweak R-parity violation. △ Less", "Though the mass of Higgs particle is the parameter determined by the experiment in the standard model (SM), SUSY models have rather predictive power for the lightest Higgs mass, and its upper bound in some SUSY models are close to the observable region in LEP2. The upper bound of the lightest Higgs mass is analysed systematically on the basis of the $CP$ violation in the minimal and the next minimal supersymmetric standard model (MSSM and NMSSM). In the explicit $CP$ violation case, the mass bound is large around $130 \\sim 160$ GeV in both models. In the spontaneous $CP$ violation case induced by the radiative effects, the lightest Higgs mass upper bound is about $52$ GeV and sum of two light neutral Higgs should be around $O$(100 GeV) in the NMSSM in contrast to the one in the MSSM which implies about 6 GeV. This model gives the interesting predictions for the neutron electric dipole moment. △ Less", "We study the possibility of an intermediate scale existing in supersymmetric E$_6$ grand unified theories. The intermediate scale is demanded to be around $10^{12}$ GeV so that neutrinos can obtain masses suitable for explaining the experimental data on the deficit of solar neutrinos with the Mikheev-Smirnov-Wolfenstein solution and the existence of hot dark matter. We require that at the intermediate scale, a certain symmetry breakdown to the Standard Model symmetry. We show that only a few E$_6$ subgroups are likely to be realized as the intermediate symmetry, though there are many candidates for the intermediate symmetry in E$_6$ GUT. △ Less", "Review of prospects for discovery of new physics signals at LEP2. The areas covered include SUSY, exotic fermions, BESS models, leptoquarks, virtual effects and CP violating observables. △ Less", "Review of Monte Carlo event generators for signals of new particles at LEP2. The areas covered include SUSY, HIGGS and Leptoquarks. △ Less", "We study effects of SUSY particle decouplings on a quasi fixed point (QFP) of Yukawa coupling. From renormalization group analysis it is shown that if the SUSY breaking scale $M_S$ is large ($\\simg 1$TeV), effects of decoupling of Higgsinos and squarks raise the top Yukawa QFP. This tendency is enhanced in most cases of non-universal SUSY breaking. For the case of $M_S\\siml 1$TeV, the decoupling of gluinos lowers $m_t^{\\rm QFP}$. We checked some parameter dependencies for the top Yukawa QFP. The bottom-top Yukawa unified case is also studied. When top quark mass is measured more precisely, some patterns of soft mass spectra could be excluded if rather large initial top Yukawa coupling is realized by underlying theory. △ Less", "If supersymmetry is dynamically broken at a low scale ($M_{susy}$), within a few orders of magnitude of the weak scale, then the lightest supersymmetric partner is the gravitino and the next to lightest supersymmetric partner is a neutralino $χ^0_1$ with mass $m_{χ^0_1}$, which can decay into a photon ($γ$) plus a gravitino ($\\widetilde{G}$). We study the detection of $e^{-}e^{+}\\rightarrow χ^0_1 χ^0_1 \\rightarrow γ\\widetilde{G}γ\\widetilde{G}$ at the proposed Linear Collider, and find the range of the parameters $M_{susy}$ and $m_{χ^0_1}$ that can be accessible with a right-hand polarized electron beam at $\\sqrt{S}=500$\\,GeV, with 50\\,${\\rm fb}^{-1}$ integrated luminosity. We also discuss briefly the accessible range for current electron and hadron colliders. △ Less", "Within the supersymmetric SO(10) GUT we explore the possibility of the light Higgs doublet being a member of the 16-dimensional spinorial representation. This fact is ultimately related with the assumption that the light matter (at least partially) resides in some of the tensor representations as well. Several interesting features emerge. First, provided that the same 16-plet is responsible for the breaking $SO(10) \\rightarrow SU(5)$, the heaviness of the top can automatically follow from the field content at $M_{GUT}$, without need of any flavour symmetries. Secondly, the doublet--triplet splitting problem receives a new natural solution. In addition, a dimension=5 (Higgsino mediated) proton decay can be naturally suppressed. We construct explicit SO(10) models with the above properties, with most general superpotentials under the symmetries. △ Less", "We study the structure of the soft SUSY-breaking terms obtained from 4-D Strings under the assumption of dilaton/moduli dominance in the process of SUSY breaking. We first analyze in detail the dilaton-dominated limit because of its finiteness properties and phenomenological predictivity, and second, we consider the new features appearing when several moduli fields contribute to SUSY breaking. In particular, we discuss in detail the case of symmetric Abelian orbifolds. Although some qualitative features indeed change in the multimoduli case with respect to the dilaton dominance one, the most natural mass relations at low-energy, $m_l < m_q \\simeq M_g$, are still similar. Only in some very specific limits these relations might be reversed. We also study the presence of tachyons pointing out that their possible existence may be, in some cases, an interesting advantage in order to break extra gauge symmetries. Finally, we compute explicitly the $μ$ and $B$ parameters in the context of the mechanism for generating a ``$μ$-term'' by the Kähler potential, as naturally implemented in orbifolds. It leads to the prediction $|tgβ|=1$ at the String scale, independently of the Goldstino direction. It is worth noticing that in this squeme the dilaton-dominated case, where there is no free parameters, is excluded since it is not consistent with the measured value of the top-quark mass. In this connection, low-energy charge and color breaking minima are also discussed. △ Less", "We show that one loop GUT scale threshold corrections to gauge couplings are a significant constraint on the GUT symmetry breaking sector of the theory. The one loop threshold corrections relate the prediction for $α_s(M_Z)$ to the proton lifetime. We have calculated these corrections in a new complete SO(10) SUSY GUT. The results are consistent with the low energy measurement of $α_s(M_Z)$. We have also calculated the proton lifetime and branching ratios in this model. We show that proton decay rates provide a powerful test for theories of fermion masses. △ Less", "The production of invisible pairs of lightest neutralinos accompanied by a large-angle hard photon in the reaction $e^+ e^- \\to χ^0_1 χ^0_1 γ$ is studied at LEP2 energies. The most general gaugino/higgsino composition of the $χ^0_1$ within the Minimal Supersymmetric Standard Model is assumed. The spectrum of the observed photon is derived within the framework of the $p_t$-dependent structure-function approach, whose accuracy is assessed to be within the foreseen experimental accuracy at LEP2. Higher-order QED corrections due to undetected initial-state radiation are also included. A comparison with the Standard Model main background from $e^+ e^- \\to ν\\bar νγ$ is performed for optimized photon kinematical cuts. Quantitative conclusions on the signal/background ratio are given for a wide range of values of the SUSY parameters. △ Less", "The basic ingredients of the Spontaneous Symmetry Breaking Phenomenon and of the Higgs Mechanism are reviewed in these lectures of pedagogical character. Some relevant topics related with the breaking $\\gs \\rightarrow U(1)_{\\rm em}$ are selected and discussed here. A brief survey of the experimental Higgs particle searches and the theoretical limits on $\\mh$ are also presented. The main features of the most popular models of symmetry breaking beyond the Standard Model are briefly considered. It includes a short summary of the Higgs Sector in the Minimal SUSY Model, the basic ideas of Technicolor models and a brief introduction to Strongly Interacting Scalar sectors and to the Effective Chiral Lagrangian Approach to the Electroweak Theory. △ Less", "In the framework of a particular supergravity model which provides a natural solution to the $μ$--problem we show how the discovery of a chargino at LEP2 and the measurement of its mass and production cross--section, together with the measurement of the mass of the lightest neutralino, would determine the entire Higgs and SUSY spectrum. We give detailed predictions for the Higgs and SUSY spectrum as a function of the chargino production cross--section, for constant values of the lightest chargino and gluino masses. △ Less", "Recent work on flavour changing neutral current effects in supersymmetric models is reviewed. The emphasis is put on new issues related to solutions to the flavour problem through new symmetries: GUTs, horizontal symmetries, modular invariances. △ Less", "The most important hint of physics beyond the Standard Model (SM) from the 1995 precision electroweak data is that the most precisely measured quantities, the total, leptonic and hadronic decay widths of the $Z$ and the effective weak mixing angle, $\\sin^2θ_W$, measured at LEP and SLC, and the quark-lepton universality of the weak charged currents measured at low energies, all agree with the predictions of the SM at a few $\\times 10^{-3}$ level. By taking into account the above constraints I examine implications of three possible disagreements between experiments and the SM predictions. It is difficult to interpret the 11\\% (2.5-$σ$) deficit of the $Z$-partial-width ratio $R_c=Γ_c/Γ_h$, since it either implies an unacceptably large $α_s$ or a subtle cancellation among hadronic $Z$ decay widths in order to keep all the other successful predictions of the SM. The 2\\% (3-$σ$) excess of the ratio $R_b=Γ_b/Γ_h$ may indicate the presence of a new rather strong interaction, such as the top-quark Yukawa coupling in the supersymmetric (SUSY) SM or a new interaction responsible for the large top-quark mass in the Technicolor scenario of dynamical electroweak symmetry breaking. Another interpretation may be additional tree-level gauge interactions that couple only to the third generation of fermions. A common consequence of these attempts is a rather small $α_s$, $α_s(\\mz )_{\\msbar}=0.104\\pm 0.08$. The 0.17\\% (1-$σ$) deficit ... △ Less", "Gauge-Yukawa Unification (GYU) relates the gauge and Yukawa couplings, thereby going beyond the usual GUTs, and it is assumed that the GYU in the third fermion generation implies that its Yukawa couplings are of the same order as the unified gauge coupling at the GUT scale. We re-examine carefully the recent observation that the top-bottom mass hierarchy can be explained to a certain extent in supersymmetric GYU models. It is found that there are equiv-top-mass-lines in the boundary conditions of the Yukawa couplings so that two different GYU models on the same line can not be distinguished by the top mass $M_t$ alone. If they are on different lines, they could be distinguished by $M_t$ in principle, provided that the predicted $M_t$'s are well below the infrared value $M_t$ (IR). We find that the ratio $M_t ({\\rm IR})/\\sinβ$ depends on $\\tanβ$ for large $\\tanβ$ and the lowest value of $M_t ({\\rm IR})$ is $\\sim 188$ GeV. We focus our attention on the existing $SU(5)$ GYU models which are obtained by requiring finiteness and reduction of couplings. They, respectively, predict $M_t= (183+δ^{\\rm MSSM} M_t\\pm 5)$ GeV and $(181+δ^{\\rm MSSM} M_t\\pm 3)$ GeV, where $δ^{\\rm MSSM} M_t$ stands for the MSSM threshold correction and is $\\sim -2$ GeV for the case that all the MSSM superpartners have the same mass $M_{\\rm SUSY}$ with $μ_H/M_{\\rm SUSY} <<1$. △ Less", "In supersymmetric SO(10) grand unified models, we examine the lepton flavor violation process $μ\\rightarrow eγ$ from having the SU(2)$_R\\times $U(1)$_{B-L}$ gauge symmetry broken at an intermediate scale $M_I$ below the SO(10) grand unification scale $M_G$. Even in the case that supersymmetry is broken by universal soft terms introduced at the scale $M_G$, we find significant rates for $μ\\rightarrow eγ$ with $M_I \\sim 10^{12}$ GeV or less. These rates are further enhanced if the universal soft terms appear at a scale greater than $M_G$. △ Less", "In the context of the standard SUSY GUT scenario, we present a detailed analysis of the softly broken finite supersymmetric grand unified theory. The model, albeit non-minimal, remains very rigid due to the requirement of finiteness. It is based on the $SU(5)$ gauge group and is UV finite to all orders of perturbation theory. It contains three generations of the matter fields together with four pairs of Higgses. The requirement of UV finiteness fixes all the Yukawa couplings at the GUT scale. Imposing the condition of universality on the soft couplings at the Planck scale and then extending the condition of finiteness to them, one gets a completely finite unified theory above $M_{GUT}.$ This makes the fine-tuning procedure more meaningful and leads to the usual Minimal Supersymmetric Standard Model below $M_{GUT}$. All the masses of the ordinary particles including Higgses are obtained due to the Higgs mechanism at the electro-weak scale. The hierarchy of quark and lepton masses is related to that of v.e.v.'s of the Higgs fields and is governed by the Higgs mixing matrix in the generation space. Superpartners develop their masses according to the RG equations starting from the soft terms at the Planck scale. The suggestion of complete finiteness and maximal simplicity of the unified theory leads to the connection between the initial values of soft SUSY breaking parameters, namely $m_0^2=1/3m_{1/2}^2,\\ A_t=A_b=A_τ=-m_{1/2}, \\ B=-m_{1/2}$, so that the number of free parameters is less than that of the MSSM. △ Less", "We analyze the correlation of QCD one-loop effects on the partial widths of the three neutral Higgs bosons of the MSSM decaying into quark-antiquark pairs. The SUSY-QCD effects turn out to be comparable or even larger than the standard QCD effects and are slowly decoupling in a wide window of the parameter space. Our study is aimed at elucidating the possible supersymmetric nature of the neutral Higgs bosons that might be discovered in the near future at the Tevatron and/or at the LHC. In particular, we point out the presence of potentially large SUSY corrections to the various neutral Higgs production cross-sections. △ Less", "Fermion masses and mixing angles are studied in an SUSY $SO(10)\\times Δ(48)\\times U(1)$ model with small $\\tanβ$. Thirteen parameters involving masses and mixing angles in the quark and charged lepton sector are successfully predicted by a single Yukawa coupling and three ratios of VEVs caused by necessary symmetry breaking. Ten relations among the low energy parameters have been found with four of them free from renormalization modifications. They could be tested directly by low energy experiments. △ Less", "We analyse the electric dipole moment of the neutron in the MSSM, induced by the renormalisation of the soft-susy breaking terms. We run the RGEs using two-loop expressions for gauge and Yukawa couplings and retaining family dependence. The $μ$ and $B$ parameters were determined by minimising the full one-loop Higgs potential, and we find that the neutron EDM lies in the range $10^{-33}<|d_n| < 10^{-29} {\\; e\\;\\mbox{cm}} $. △ Less", "In minimal SUSY GUT models the $R$-parity breaking terms are severely constrained by SU(5) gauge invariance. We consider the particular case where the explicit $R$-parity breaking occurs only via dimension 2 terms of the superpotential. This model possesses only three R-parity breaking parameters. We have studied the predictions of this model for the neutrino masses and mixing angles at the one-loop level within the framework of a radiatively broken unified supergravity model. We find that this model naturally yields masses and mixing angles that can explain the solar and atmospheric neutrino problems. In addition, there are regions in parameter space where the solution to the solar neutrino puzzle is compatible with either the LSND result or the existence of significant hot dark matter neutrinos. △ Less", "We study the structure of the soft SUSY-breaking terms obtained from some classes of 4-D strings under the assumption of dilaton/moduli dominance in the process of SUSY-breaking. We generalize previous analysis in several ways and in particular consider the new features appearing when several moduli fields contribute to SUSY breaking (instead of an overall modulus $T$). Some qualitative features indeed change in the multimoduli case.A general discussion for symmetric Abelian orbifolds as well as explicit examples are given. Certain general sum-rules involving soft terms of different particles are shown to apply to large classes of models. Unlike in the overall modulus $T$ case, gauginos may be lighter than scalars even at the tree-level. However, if one insists in getting that pattern of soft terms, these sum rules force some of the scalars to get negative mass$^2$. These tachyonic masses could be a problem for standard model 4-D strings but an advantage in the case of string-GUTs.We also discuss the possible effects of off-diagonal metrics for the matter fields which may give rise to flavour-changing neutral currents. Different sources for the bilinear $B$ soft term are studied. It is found that the Giudice-Masiero mechanism for generating a ``$μ$-term'', as naturally implemented in orbifolds, leads to the prediction $|tgβ|=1$ at the string scale, independently of the Goldstino direction. △ Less", "In a SUSY GUT having an extra reverse doublet-triplet splitting near the GUT scale, where the mass of an extra doublet is greater than the mass of an extra triplet by two orders of magnitude, a low prediction of $α_s$ can be achieved through threshold corrections via the heavy scalars in the fundamental representations, making the prediction consistent with the values being suggested by low energy measurements. We implement this mechanism in a SUSY SU(5) GUT minimally extended to suppress Higgsino mediated proton decay. We also point out that as a consequence of this extension a natural scenario arises with a large hierarchy in Yukawa couplings ($ λ_t / λ_b \\sim 40$). An experimental low value of $α_s(m_Z)$ along with the non-observation of dimension-five proton decay modes at SuperKamiokande detector will favor such an extension of the SUSY SU(5) GUT over the minimal case. △ Less"]