["I consider N=1 supersymmetric SU(N_c) gauge theories with matter fields consisting of one antisymmetric representation, five flavors, and enough anti-fundamental representations to cancel the gauge anomaly. Previous analyses are extended to the case of even N_c with no superpotential. Using holomorphy I show that the theory has an interacting infrared fixed point for sufficiently large N_c. These theories are interesting due to the fact that in going from five to four flavors the theory goes from a non-trivial infrared fixed point to confinement, in contradistinction to SUSY QCD, but in analogy to the behavior expected in non-SUSY QCD. △ Less", "The low energy structures of N=1 supersymmetric models with E_6, F_4 and E_7 gauge groups and fundamental irrep matter contents are studied herein. We identify sets of gauge invariant composites which label all flat directions in the confining/Higgs phases of these theories. The impossibility of mapping several of these primary operators rules out previously conjectured exceptional self duals reported in the literature. △ Less", "In R-parity violating SUSY models sleptons can be produced singly in e+e- and qqbar collisions. The formation of slepton resonances at LEP2 or Tevatron at current energies is an exciting possibility. Existing LEP2 and Tevatron data can be exploited to look for sleptons and, if unsuccessful, to derive bounds on the Yukawa couplings of sleptons to quark and lepton pairs. △ Less", "We discuss some phenomenological issues of the effective quark-lepton operators emerging from the bilinear lepton-Higgs couplings in the superpotential and in the soft supersymmetry (SUSY) breaking sector of the supersymmetric models without R-parity. The contribution of these operators to the neutrinoless double beta decay is derived. The corresponding nuclear matrix elements are calculated within the renormalized quasiparticle random phase approximation, which includes the Pauli effect of fermion pairs and does not collapse for the physical values of the nuclear force strength. On this basis we extract from the experimental data new stringent limits on the 1st generation mass parameter characterized the lepton-Higgs bilinear coupling and on the electron sneutrino vacuum expectation value. △ Less", "Lepton flavor violation may be a signature of \"GUT scale\" physics, if the messenger scale for SUSY breaking is above the \"GUT scale.\" We elaborate on the details of this simple statement in the following talk. △ Less", "We present the results of a detailed investigation into the consequences of adding specific string motivated non-perturbative corrections to the usual tree level Kahler potential in dilaton dominated scenarios. The success of the model is judged through our ability to obtain a realistic VEV for the dilaton < Re S > ~ 2, corresponding to the true minima of the scalar potential and being associated with a reasonable value for the SUSY breaking scale via the gravitino mass. The status of the so-called moduli problem is also reviewed in each of the ansatze studied. Those include previous proposals made in the context of both the chiral and the linear multiplet formalisms to describe gaugino condensation, and a new ansatz which shows explicitly the equivalence between the two. △ Less", "In recent analyses the existence of $SU(2)_L\\times\\SU(2)_R\\times\\SU(4)_C(g_{2L}\\ne g_{2R})$ intermediate gauge symmetry has been ruled out in SUSY SO(10) model at one-loop level, although the left-right symmetric intermediate gauge group has been shown to exist with certain light scalar superfields near 1 TeV.We show,how the asymmetric gauge group is allowed with an intermediate scale $M_I=10^10- 10^13$ GeV by including two-loop and threshold effects. △ Less", "In N=1 Supersymmetric gauge theories, we can calculate non-perturbative effects in the superpotential. It is interesting to apply this effect to the phenomenology. We show two models here. One is the low energy supersymmetry (SUSY) breaking scenario without messenger sector, and the second is the composite model generating Yukawa interaction dynamically. △ Less", "Methods to make precision measurements of SUSY masses and parameters at the CERN Large Hadron Collider are described. △ Less", "We study the inclusive production of the next-to-lightest neutralino chi2, decaying directly, or via slepton, into two leptons and the lightest neutralino. The dilepton invariant mass spectrum in these decays has a characteristic sharp edge near the kinematical upper limit. We propose to exploit this feature as a search strategy for the chi2, and thereby for SUSY. The possibilities to determine neutralinos and slepton masses are also discussed. △ Less", "The CP violating electric and weak dipole moment form factors of the top quark, $\\dgs$ and $\\dzs$, appear in the process \\mbox{$e^{+}e^{-} \\to t \\bar{t}$}. We present a complete analysis of these dipole moment formfactors within the Minimal Supersymmetric Standard Model with complex parameters. We include gluino, chargino, and neutralino exchange in the loop of the \\mbox{$γt\\bar{t}$} and \\mbox{$Z t\\bar{t}$} vertex. We give analytic expressions and present numerical results for the asymmetries that measure these formfactors. △ Less", "In models of spontaneously broken supersymmetry, certain light gravitino processes are governed by the coupling of its Goldstino components. The rules for constructing SUSY and gauge invariant actions involving the Goldstino couplings to matter and gauge fields are presented. The explicit operator construction is found to be at variance with some previously reported claims. A phenomenological consequence arising from light gravitino interactions in supernova is reexamined and scrutinized. △ Less", "We give a brief overview of 20 open theoretical questions in supersymmetric particle physics. The 20 questions we have chosen range from the GeV scale to the Planck scale, and include issues pertaining to the Minimal Supersymmetric Standard Model and its extensions, SUSY-breaking, cosmology, grand unified theories, and string theory. Throughout, our goal is to address those topics in which supersymmetry plays a fundamental role, and which are areas of active research in the field. This survey is written at an introductory level and is aimed at people who are not necessarily experts in the field. (To appear as an Overview Chapter in the review volume \"Perspectives on Supersymmetry\", edited by G. Kane, to be published by World Scientific.) △ Less", "Study of the MSSM in large tan$β$ regime has to include correlations between the constraints presented by the low energy values of the b quark mass and BR($b \\to sγ$). Both quantities receive SUSY contributions enhanced by tan$β$ and have a major impact on the MSSM analysis. Here we summarize the results of such a study constrained by a complete SO(10) model. The dominant effects to the analysis come from third generation Yukawa couplings and a GUT threshold to $α_s$. We show that a small negative GUT correction to $α_s$ accommodates $α_s(M_Z) \\leq 0.118$ and $δm_b^{SUSY} > 0$. The latter quantity being positive then opens up two options to fit the measured rate for $b \\to sγ$. The two distinct fits differ by the overall sign of the amplitude for this process. They work equally well in complementary regions of the allowed SUSY parameter space. We show plots of the partial contributions to the coefficient $C_7(M_Z)$ in the ($m_0,M_{1/2}$) plane in each of these best fits. We conclude that an attractive SO(10)-derived regime of the MSSM remains a viable option. △ Less", "A $χ^2$ analysis of several SUSY GUTs recently discussed in the literature is presented. We obtain global fits to electroweak data, which include gauge couplings, gauge boson masses, BR($b\\to sγ$) and masses of fermions of all three generations and their mixing angles. Thus we are able to test gauge unification, radiative electroweak symmetry breaking, SUSY sector (- in the context of supergravity induced SUSY breaking) and the Yukawa sector in each particular model self-consistently. One of the models studied provides a very good fit with $χ^2 \\sim 1$ for 3 degrees of freedom, in a large region of the allowed SUSY parameter space. The Yukawa sector works so well in this case that the analysis ends up testing the MSSM constrained by unification. Adopting this point of view, in the second part of this talk we focus on the details of the fit for BR($b\\to sγ$) and discuss the correlations among $δm_b^{SUSY}$, $α_s(M_Z)$ and a GUT threshold to $α_s(M_G)$. We conclude that an attractive SO(10)-derived regime of the MSSM remains a viable option. △ Less", "In gauge-mediated SUSY breaking models, messengers transmit SUSY breaking from a partially hidden sector to the standard model sector via common standard model gauge interactions. The minimal set of messengers has quantum numbers of a $5 + \\bar 5$ of SU(5); identical to the quantum numbers of the minimal Higgs sector of an SU(5) GUT. We show in a simple model with messenger masses of order the GUT scale that Higgs - messenger mixing quite naturally leads to a low energy MSSM with gluinos as the lightest supersymmetric particles [LSP]. We study the phenomenological consequences of such a model. △ Less", "The two-loop QCD corrections to the $ρ$ parameter are derived in the Minimal Supersymmetric Standard Model. They turn out to be sizable and modify the one-loop result by up to 30%. Furthermore exact results for the gluonic corrections to $Δr$ are presented and compared with the leading contribution entering via the $ρ$ parameter. △ Less", "We study the decays of the Higgs bosons $H^{\\pm}$, $H^0$, and $A^0$ within the Minimal Supersymmetric Standard Model. For decays into quarks and squarks we include the supersymmetric QCD radiative corrections. We find that the corrections are significant and can go up to 50%. The supersymmetric decay modes $H^+ \\to \\tilde t \\bar{\\tilde b}$ and $H^0 (A^0) \\to \\tilde t \\bar{\\tilde t}$ can be dominant in a wide range of the model parameters due to the large Yukawa couplings and mixings of $\\tilde t$ and $\\tilde b$. △ Less", "We propose a generalization of the Veneziano-Yankielowicz effective low-energy action for N=1 SUSY Yang-Mills theory which includes composite operators interpolating pure gluonic bound states. The chiral supermultiplet of anomalies is embedded in a larger three-form multiplet and an extra term in the effective action is introduced. The mass spectrum and mixing of the lowest-spin bound states are studied within the effective Lagrangian approach. The physical mass eigenstates form two multiplets, each containing a scalar, pseudoscalar and Weyl fermion. The multiplet containing the states which are most closely related to glueballs is the lighter one. △ Less", "We discuss the supersymmetric O(alpha_s) QCD corrections to e+ e- -> squark_i + antisquark_j (i,j = 1,2) and to squark_i -> q' + chargino_j, q + neutralino_k (i,j = 1,2; k = 1...4) within the Minimal Supersymmetric Standard Model. In particular we consider the squarks of the third generation stop_i and sbottom_i including the left-right mixing. In the on-shell scheme also the mixing angle has to be renormalized. We use dimensional reduction (which preserves supersymmetry) and compare it with the conventional dimensional regularization. A detailed numerical analysis is also presented. △ Less", "We propose the Fritzsch-Branco-Silva-Marcos type fermion mass matrix, which is a typical texture in the nearest-neighbor interaction form, in SU(5) GUT. By evolution of the mass matrices with SU(5) GUT relations in the minimal SUSY standard model, we obtain predictions for the unitarity triangle of CP violation as well as the quark flavor mixing angles, which are consistent with experimental data, in the case of \\tanβ\\simeq 3. △ Less", "SUSYGEN is a Monte Carlo program designed for computing distributions and generating events for MSSM sparticle production in e+ e- collisions. The Supersymmetric (SUSY) mass spectrum may either be supplied by the user, or can alternatively be calculated in two different models of SUSY Breaking: gravity mediated supersymmetry breaking (SUGRA), and gauge mediated supersymmetry breaking (GMSB). The program incorporates the most important production processes and decay modes, including the full set of R-parity violating decays, and the decays to the gravitino in GMSB models. Initial state radiation corrections take into account pT/pL effects in the Structure Function formalism, and an optimised hadronisation interface to JETSET 7.4 including final state radiation is also provided. △ Less", "The theoretical status of squark and gluino production at present and future hadron colliders is reviewed. I shall concentrate on the evaluation of SUSY-QCD corrections to the production cross sections and their phenomenological implications. △ Less", "We analyse the events with two same-flavour, opposite-sign leptons + $E_T^{miss}$ + (jets) as expected in pp collisions at LHC within the framework of the minimal Supergravity Model. The objective is the determination of the parameters m_0 and m_{1/2} of this model (for a given value of $\\tanβ$). The signature $l^+ l^- + E_T^{miss}$ + (jets) selects the leptonic decays of $\\tildeχ^0_2$, $\\tildeχ^0_2 \\to \\tildeχ^0_1 l^+ l^- $, $\\tildeχ^0_2 \\to \\tilde{l}_{L,R}^{\\pm} l^{\\mp} \\to \\tildeχ^0_1 l^+ l^-$. We exploit the fact that the invariant dilepton mass distribution has a pronounced structure with a sharp edge at the kinematical endpoint even in such an inclusive final state over a significant part of parameter space. We determine the domain of parameter space where the edge is expected to be visible. We show that a measurement of this edge already constrains the model parameters essentially to three lines in the ($m_0, m_{1/2}$) parameter plane. We work out a strategy to discriminate between the three-body leptonic decays of $\\tildeχ^0_2$ and the decays into sleptons $\\tilde{l}_{L,R}$. This procedure may make it possible to get information on SUSY particle masses already with low luminosity, L_{int}=10^3 pb^{-1}. △ Less", "The atmospheric neutrino anomaly reported by the super-Kamiokande collaboration suggests existence of a large flavour violating Yukawa coupling in the lepton sector. We discuss lepton-flavour violation at low energies in the framework of the supersymmetric SU(5)_{GUT} model with right-handed neutrinos. We find that for a wide range of parameter space suggested from the atmospheric neutrino anomaly, if the tau-neutrino Yukawa coupling is as large as that of top quark, lower bounds of the branching ratios of mu -> e gamma, tau -> mu gamma, and the mu-e conversion rate on $^{48}_{22}Ti$ become around 10^{-14}, 10^{-9}, and 10^{-16}, respectively. These reaction rates may be in the region accessible by near future experiments. △ Less", "We examine the pion exchange mode of neutrinoless double beta decay induced by the R-parity violating quark-lepton operators of the supersymmetric (SUSY) extensions of the standard model of the electroweak interactions. The corresponding nuclear matrix elements are evaluated within the renormalized quasiparticle random phase approximation with proton-neutron pairing, which includes the Pauli effect of fermion pairs and does not collapse for a physical value of the nuclear force strength. It is argued that the pion-exchange mode of neutrinoless double beta decay dominates over the conventional two-nucleon mode in the case of the SUSY mechanism. As a result sensitivity of neutrinoless double beta decay to the SUSY contribution turns out to be significantly better that previously expected from the two-nucleon mode calculations. An upper limit on the R-parity violating coupling $λ'_{111}$ is derived from non-observation of neutrinoless double beta decay. This limit is much stronger than that expected from the near future accelerator experiments. △ Less", "We investigate the microphysics of cosmic strings in Nonabelian gauge theories with N=1 supersymmetry. We give the vortex solutions in a specific example and demonstrate that fermionic superconductivity arises because of the couplings and interactions dictated by supersymmetry. We then use supersymmetry transformations to obtain the relevant fermionic zero modes and investigate the role of soft supersymmetry breaking on the existence and properties of the superconducting strings. △ Less", "\\susy23 is a Monte-Carlo package for generating supersymmetric (SUSY) processes at $e^+e^-$ colliders. Twenty-three types of SUSY processes with 2 or 3 final state particles at tree level are included in version 2.0. {\\susy23} addresses event simulation requirements at $e^+e^-$ colliders such as LEP. Matrix elements are generated by GRACE with the helicity amplitude method for processes involving massive fermions. The phase space integration of the matrix element gives the total and differential cross sections, then unweighted events are generated. Sparticle widths and decay branching ratios are calculated. Each final state particle may then decay according to these probabilities. Spin correlations are taken into account in the decays of sparticles. Corrections of initial state radiation (ISR) are implemented in two ways, one is based on the electron structure function formalism and the second uses the parton shower algorithm called QEDPS. Parton shower and hadronization of the final quarks are performed through an interface to JETSET. △ Less", "We study the Next-to-Minimal Supersymmetric Standard Model (NMSSM) as the simplest candidate solution to the $μ$-problem in the context of the gauge mediation of supersymmetry breaking (GMSB). We first review various proposals to solve the $μ$-problem in models with the GMSB. We find none of them entirely satisfactory and point out that many of the scenarios still lack quantitative studies, and motivate the NMSSM as the simplest possible solution. We then study the situation in the Minimal Supersymmetric Standard Model (MSSM) with the GMSB and find that an order 10% cancellation is necessary between the $μ$-parameter and the soft SUSY-breaking parameters to correctly reproduce $M_Z$. Unfortunately, the NMSSM does not to give a phenomenologically viable solution to the $μ$-problem. We present quantitative arguments which apply both for the low-energy and high-energy GMSB and prove that the NMSSM does not work for either case. Possible modifications to the NMSSM are then discussed. The NMSSM with additional vector-like quarks works phenomenologically, but requires an order a few percent cancellation among parameters. We point out that this cancellation has the same origin as the cancellation required in the MSSM. △ Less", "A review of the current status of the Cabibbo-Kobayashi-Maskawa matrix ($V_{CKM}$) is presented and a special emphasis is put on the determination of the $ρ$ and $η$ parameters. From this study it follows that, in the Standard Model, the $B^0_s$-$\\bar{B^0_s}$ oscillation frequency, $Δm_s$, has to lie, with 68% C.L., between 6.5 ps$^{-1}$ and 15 ps$^{-1}$, and is below 21 ps$^{-1}$ at 95% C.L. If the interest of measuring $Δm_s$ is underlined, the importance of a precise determination of the B meson decay constant, $f_B$, is also stressed. It is proposed to obtain a precise value for this parameter from an accurate measurement of $f_D$, the D meson decay constant, using results from lattice QCD to relate D and B hadrons. A future Tau-Charm factory could accomplish this task. It is also shown that from the present measurements, assuming the validity of the Standard Model, an already accurate value of $sin 2β~=~ 0.67 ^{+0.12}_{-0.13}$ is obtained. Sofar no constraint can be obtained on $sin 2α$. The interest of having a direct measurement of $sin 2α$ and $sin 2β$ at B-factories or at other facilities is reminded. Finally constraints on SUSY parameters, in the framework of a given model, obtained from a precise measurement of the CKM matrix elements are analyzed. △ Less", "Taking into account uncertainties related with the initial coupling constants and threshold corrections at low and high scales we find that in standard supersymmetric SU(5) model the supersymmetry breaking scale could be up to $10^8$ GeV. In the extensions of the standard supersymmetric SU(5) model the supersymmetry breaking scale could be up to $O(10^{12})$ GeV. In standard SU(5) supersymmetric model it is possible to increase the GUT scale up to $5 \\cdot 10^{17}$ GeV provided that the masses of chiral superoctets and supertriplets are $m_{3,8} \\sim O(10^{13})$ GeV. For SU(5) supersymmetric model with $10^6$ GeV $\\leq M_{SUSY} \\leq 10^8$ GeV the Higgs boson mass is predicted to be 120 GeV $\\leq m_h \\leq $ 150 GeV. △ Less", "Implications of the effects of non-universalities of the soft SUSY breaking parameters on dark matter and on physics at colliders is discussed. △ Less", "We present the calculation of the supersymmetric QCD correction to $W γ$ production process in polarized proton-antiproton collisions at the TeV energy region. We find that the correction can reach 1.2% at parton level with favorable mass values of squarks and gluino, which is comparable with the virtual correction part of the conventional QCD. The production rates for different polarized $p \\bar{p}$ collisions are also compared. △ Less", "I discuss the effects of QCD radiative corrections in Supersymmetric theories. After summarizing the SUSY--QCD lagrangian in the Minimal Supersymmetric extension of the Standard Model, I will discuss the new features introduced by SUSY, and the main complications compared to standard QCD corrections. I will then discuss a few examples of QCD calculations in SUSY theories, for standard processes and for processes involving SUSY particles including the extended Higgs sector. [Talk given at \"QCD 97\", Montpellier 3-9 July 1997.] △ Less", "The weak charge $Q_W$ measured in atomic parity violation experiments can receive compensating contributions from more than one new physics source. We show explicitly that the $ΔQ_W$ contribution from the exchange of an extra Z-boson can cancel that from the $s$-channel scalar top or scalar charm exchange in R-parity violating SUSY models proposed to explain the HERA high-$Q^2$ anomaly. △ Less", "Using radiative correction and seesaw mechanism,we derive analytic formulas for neutrino masses in SUSY unified theories exhibiting, for the first time, a new hierarchial relation among them.The new hierarchy is found to be quite significant especially for smaller values of $\\tanβ$. △ Less", "We calculate the supersymmetric ${\\cal O}(α_s)$ QCD corrections to stop and sbottom decays into vector bosons within the Minimal Supersymmetric Standard Model. We give analytic formulae and perform a numerical analysis of these decays. We find that SUSY-QCD corrections to the decay widths are typically -5% to -10% depending on the squark masses, squark mixing angles, and the gluino mass. △ Less", "We compute the partial width of the FCNC top quark decay t->c h in the framework of the Minimal Supersymmetric Standard Model, where h = h0, H0, A0 is any of the neutral Higgs of the MSSM. We include the SUSY electroweak, Higgs, and SUSY-QCD contributions. Our results substantially improve previous estimations on the subject, and we find that there is a possibility that they can be measured at LHC. △ Less", "The effect of non-universal SUSY soft breaking on predictions of dark matter detector event rates are surveyed for supergravity models with gravity mediated soft breaking. For universal soft breaking in the first two generations and tan(beta)<=20, non-universal effects can be characterized by four parameters (two for Higgs and two for third generation squarks) in addition to those of the minimal model (MSGM). These can increase or decrease event rates by a factor of 10-100 in the domain m_{χ_1^0}<60 GeV (χ_1^0= lightest neutralino) but produce generally small effects at higher masses. The value of the top mass and b->s+γbranching ratio eliminates most of the parameter space for μ<0, causing event rates for μ<0 to be a factor approximately 100 smaller than for mu>0. A correlation between large (small) event rates and small (large) b-> s+γbranching ratio is observed. The effect of future satellite (MAP and PLANCK) precision determinations of cosmological parameters on predicted event rates is examined for examples of the ΛCDM and νCDM models. It is seen that these could sharpen the event rate predictions and also restrict the allowed gaugino mass ranges, thus influencing predictions for accelerator SUSY searches. △ Less", "This talk is a short overview of the physics potential of the LHC with emphasis on Higgs search and SUSY search. First I review why LHC with the ATLAS and CMS detectors is expected to give a decisive test of the electroweak symmetry breaking mechanism of the Standard Model. Then I consider the Higgs sector of the Standard Model (SM). Finally the search for supersymmetry is discussed within the framework of various implementation of the Minimal Supersymmetric Standard Model (MSSM). △ Less", "Much use has been made of the techniques of supersymmetric quantum mechanics (SUSY QM) for studying bound-state problems characterized by a superpotential $φ(x)$. Under the analytic continuation $φ(x) \\to iφ(x)$, a pair of superpartner bound-state problems is transformed into a two-state level-crossing problem in the continuum. The description of matter-enhanced neutrino flavor oscillations involves a level-crossing problem. We treat this with the techniques of supersymmetric quantum mechanics. For the benefit of those not familiar with neutrino oscillations and their description, enough details are given to make the rest of the paper understandable. Many other level-crossing problems in physics are of exactly the same form. Particular attention is given to the fact that different semiclassical techniques yield different results. The best result is obtained with a uniform approximation that explicitly recognizes the supersymmetric nature of the system. △ Less", "We calculate the one loop corrections to the chromomagnetic dipole moment of the top quark in the framework of the Standard Model, the two Higgs doublet model and the Minimal Supersymmetric Standard Model. In the Standard Model we consider the QCD and the electroweak corrections generated by gluon and Higgs boson exchanges, respectively. In the Minimal Supersymmetric Standard Model, we calculate the SUSY- QCD corrections, including the mixing effects between the stop coming from the left- and right-handed sectors. We obtain that the Standard Model contribution is of the order of -0.004< delta kappa_g^t < -0.001, and the values for diferents scenarios are of the order of -0.001 < δκ_g^t < -0.01. △ Less", "Recently proposed relations between the renormalization group functions of the soft supersymmetry breaking terms and those of a rigid theory allow one to consider a possibility of constructing a totally all loop finite N=1 SUSY gauge theory, including the soft SUSY breaking terms. The requirement of finiteness, which can be satisfied in previously constructed finite SUSY GUTs, imposes some constraints on the SUSY breaking parameters which, in the leading order, coincide with those originating from the supergravity and superstring-inspired models. Explicit relations between the soft terms, which lead to a completely finite theory in any loop order, are given. △ Less", "The minimal supersymmetric extension of the Standard Model (MSSM) is reviewed. In the most general framework with minimal field content and R-parity conservation, the MSSM is a 124-parameter model (henceforth called MSSM-124). An acceptable phenomenology occurs only at exceptional points (and small perturbations around these points) of MSSM-124 parameter space. Among the topics addressed in this review are: gauge coupling unification, precision electroweak data, phenomenology of the MSSM Higgs sector, and supersymmetry searches at present and future colliders. The implications of approaches beyond the MSSM are briefly addressed. △ Less", "The supergraph technique for calculations in supersymmetric gauge theories where supersymmetry is broken in a \"soft\" way (without introducing quadratic divergencies) is reviewed. By introducing an external spurion field the set of Feynman rules is formulated and explicit connections between the UV counterterms of a softly broken and rigid SUSY theories are found. It is shown that the renormalization constants of softly broken SUSY gauge theory also become external superfields depending on the spurion field. Their explicit form repeats that of the constants of a rigid theory with the redefinition of the couplings. The method allows us to reproduce all known results on the renormalization of soft couplings and masses in a softly broken theory. As an example the renormalization group functions for soft couplings and masses in the Minimal Supersymmetric Standard Model up to the three-loop level are calculated. △ Less", "We propose a simple class of nonrenormalizable models of gauge mediated dynamical supersymmetry breaking. The models do not have gauge singlet fields. The Standard Model gauge group is embedded in the global symmetry of the SUSY breaking sector. At the renormalizable level the models possess a set of classical flat directions. Only one of those flat directions is unlifted by quantum effects, and requires nonrenormalizable term to stabilize the potential for the corresponding modulus. Large vacuum expectation value of this modulus at the minimum of the potential generates mass terms for the messenger fields. There are no light messengers, thus this class of models evades difficulties encountered in earlier constructions using nonrenormalizable models. △ Less", "Searches for new physics in the first year of running of LEP2, at energies of 161 and 172 GeV, are summarized. After a short review of WW results and their implications on new physics, searches for the Higgs boson and SUSY particles, analyses of four-jet final states and constraints on possible explanations for the HERA high Q**2 anomaly are discussed in turn. △ Less", "It is shown, that the presently accepted value for b-quark mass can be obtained from the requirement of the exact b-$τ$ unification in the both non-SUSY and SUSY non-chiral extended GUTs. △ Less", "Charge and color breaking minima in SUSY theories might make the standard vacuum unstable. In this talk a brief review of this issue is performed. When a complete analysis of all the potentially dangerous directions in the field space of the theory is carried out, imposing that the standard vacuum should be the global minimum, the corresponding constraints turn out to be very strong and, in fact, there are extensive regions in the parameter space of soft SUSY--breaking terms that become forbidden. For instance, in the context of the MSSM with universal soft terms, this produces important bounds, not only on the value of A, but also on the values of B, M and m. In specific SUSY scenarios, as fixed point models, no-scale supergravity, gauge-mediated SUSY breaking and superstrings, the charge and color breaking constraints are also very important. For example, if the dilaton is the source of SUSY breaking in four-dimensional superstrings, the whole parameter space (m_{3/2},B) is excluded on these grounds. Cosmological analyses are also briefly reviewed. △ Less", "In this talk, as requested, I begin with a overview and with some basic reminders about how evidence for supersymmetry in nature might appear -- in particular, how SUSY signatures are never clear so it is difficult to search for them without major theoretical input. Models can be usefully categorized phenomenologically by naming their LSP -- that is, once the LSP is approximately fixed so is the behavior of the observables, and the resulting behavior is generally very different for different LSPs. Next I compare the three main LSP-models (gravitino, bino, higgsino). Hints from data suggest taking the higgsino-LSP world very seriously, so I focus on it, and describe its successful prediction of reported events from the 1996 LEP runs. SUSY signatures in the $\\tilde h$ LSP world are very different from those that are usually studied. Then I briefly discuss how to measure the parameters of the effective Lagrangian from collider and decay data. Finally I turn to how data will test and help extract the implications of string theories. △ Less", "We present a detailed study of the decays of the Higgs bosons $H^+$, $H^0$, and $A^0$ within the Minimal Supersymmetric Standard Model including SUSY--QCD corrections. We find that the supersymmetric modes $\\tilde t \\bar{\\tilde b}$ ($\\tilde t \\bar{\\tilde t}$, and for large $\\tanβ$ $\\tilde b \\bar{\\tilde b}$) can dominate the $H^+$ ($H^0$, $A^0$) decays in a wide range of the model parameters due to the large Yukawa couplings and mixings of $\\tilde t$ and $\\tilde b$. Compared to the conventional modes $H^+ \\to τ^+ ν_τ, t \\bar b$, and $H^0, A^0 \\to t \\bar t, b \\bar b$, the supersymmetric modes can have an important impact on the Higgs boson searches at future colliders. △ Less", "We present numerical predictions for the decay branching ratios of the heavier stop and sbottom mass eigenstates. We estimate the precision to be expected for the determination of the underlying supersymmetry parameters of the stop and sbottom systems. △ Less", "In this talk we discuss rare B decays (b -> s gamma, b -> s g, b -> s l^+ l^-), B-\\bar{B} oscillations and CP violation in B physics in the context of low-energy SUSY. We outline the variety of predictions that arise according to the choice of the SUSY extension ranging from what we call the \"minimal\" version of the MSSM to models without flavour universality or with broken R-parity. In particular, we provide a model-independent parameterization of the SUSY FCNC and CP-violating effects which is useful in tackling the problem in generic low-energy SUSY. We show how rare B decays and CP violation in B-decay amplitudes may be complementary to direct SUSY searches at colliders, in particular for what concerns extensions of the most restrictive version of the MSSM. △ Less", "We discuss CP violation in the context of the minimal SUSY extension of the standard model as well as in a generic low-energy SUSY model. After analyzing the SUSY contributions to the observed CP violation in the kaon system, we emphasize the prospects for disentangling SUSY loop contributions from pure SM effects in B physics. △ Less", "We present a composite model that is based on non-perturbative effects of N=1 supersymmetric SU(N_C) gauge theory with N_f=N_C+1 flavors. In this model, we consider N_C=7, where all matter fields in the supersymmetric standard model, that is, quarks, leptons and Higgs particles are bound states of preons and anti-preons. When SU(7)_H hyper-color coupling becomes strong, Yukawa couplings of quarks and leptons are generated dynamically. We show one generation model at first, and next we show models of three generations. △ Less", "The Higgs mechanism is the favourite cure for the main problem with electroweak unification, namely how to reconcile a gauge theory with the need for massive gauge bosons. This problem does not exist in preon models for quark and lepton substructure with composite $Z^0$ and $W$s, which, consequently, also avoid all other theoretical complications and paradoxes with the Higgs mechanism. We present a new, minimal preon model, which explains the family structure, and predicts several new, heavy quarks, leptons and vector bosons. Our preons obey a phenomenological supersymmetry, but without so-called squarks and sleptons, since this SUSY is effective only on the composite scale. △ Less", "One of the main motivations of experiments at the LHC is to search for SUSY particles. The talk is based on recent analyses, performed by CMS Collaboration, within the framework of the Supergravity motivated minimal SUSY extension of the Standard Model. The emphasis is put on leptonic channels. The strategies for obtaining experimental signatures for strongly and weakly interacting sparticles productions, as well as examples of determination of SUSY masses and model parameters are discussed. The domain of parameter space where SUSY can be discovered is investigated. Results show, that if SUSY is of relevance at Electro-Weak scale it could hardly escape detection at LHC. △ Less", "We analyse the formation of cosmic structures in models where the dark matter is dominated by light gravitinos with mass of $ 100$ eV -- 1 keV, as predicted by gauge-mediated supersymmetry (SUSY) breaking models. After evaluating the number of degrees of freedom at the gravitinos decoupling ($g_*$), we compute the transfer function for matter fluctuations and show that gravitinos behave like warm dark matter (WDM) with free-streaming scale comparable to the galaxy mass scale. We consider different low-density variants of the WDM model, both with and without cosmological constant, and compare the predictions on the abundances of neutral hydrogen within high-redshift damped Ly--$α$ systems and on the number density of local galaxy clusters with the corresponding observational constraints. We find that none of the models satisfies both constraints at the same time, unless a rather small $Ω_0$ value ($\\mincir 0.4$) and a rather large Hubble parameter ($\\magcir 0.9$) is assumed. Furthermore, in a model with warm + hot dark matter, with hot component provided by massive neutrinos, the strong suppression of fluctuation on scales of $\\sim 1\\hm$ precludes the formation of high-redshift objects, when the low--$z$ cluster abundance is required. We conclude that all different variants of a light gravitino DM dominated model show strong difficulties for what concerns cosmic structure formation. This gives a severe cosmological constraint on the gauge-mediated SUSY breaking scheme. △ Less", "We discuss the supersymmetric quantum effects on top quark decays within the MSSM. It turns out that t-> H+ b is the most promising candidate for carrying large quantum SUSY signatures. As a result, the recent (tan(beta) M_H) exclusion plots presented by the CDF Collaboration should be thoroughly revised in the light of the MSSM. △ Less", "We'll review our study of the constraints on the scales in the supersymmetric left-right model (SUSYLR). The conservation of color and electromagnetism in the ground state of the theory implies a relation between right-handed gauge boson mass and soft squark mass. Furthermore, in general for heavy $W_R$, $\\tanα$ is larger than one, and the right-handed sneutrino VEV, responsible for spontaneous R-parity breaking, is at most of the order $M_{SUSY}/h_{Δ_R}$, where $M_{SUSY}$ is supersymmetry breaking scale and $h_{Δ_R}$ is the Yukawa coupling in Majorana mass term for right-handed neutrinos. △ Less", "We review the consequences of spontaneously broken R-parity in present and planned lepton-lepton colliders. In the left-right models the R-parity, $R=(-1)^{3(B-L)+2S}$, is preserved due to the gauge symmetry, but it must be spontaneously broken in order to the scalar spectrum to be physically consistent. The spontaneous breaking is generated via a non-vanishing VEV of at least one of the sneutrinos, which necessarily means non-conservation of lepton number $L$. The R-parity violating couplings are parametrized in terms of mixing angles, whose values depend on model parameters. Combined with the constraints derived from low-energy measurements this yields allowed ranges for various R-parity breaking couplings. The R-parity breaking allows for the processes in which a single chargino or neutralino is produced, subsequently decaying at the interaction point to non-supersymmetric particles. △ Less", "In supersymmetric theories with R-parity breaking, sleptons could be produced singly in $e^+e^-$ collisions at LEP2 and in $q\\bar{q}$ annihilation at the Tevatron through interactions in which two quark or two lepton fields are coupled to a slepton field. At LEP they could manifest themselves in Bhabha scattering, and in the annihilation to $μ^+μ^-$, \\taus, and $q\\bar{q}$ pairs. The formation of sneutrinos, $e^+e^-\\ra \\tiν$, and their signals for a mass within the reach of this machine, is an exciting speculation which can be investigated in the coming LEP2 runs with energies close to $\\sqrt{s}=200$ GeV. At the Tevatron the sleptons can be searched for as resonances in $p\\bar{p}\\to \\tildeν \\to \\ell^+\\ell^-$ and $\\tilde{\\ell}\\to \\ellν$ final states. Existing LEP2 and Tevatron data can be exploited to derive bounds on the Yukawa couplings of sleptons to quark and lepton pairs. △ Less", "A review of the current status of nucleon stability in SUSY unified models is given. The review includes analysis of nucleon stability in the minimal SU(5) supergravity model, and in extensions of the minimal model such as SO(10) models, and models including textures. Implications of the simultaneous constraint of the experimental limit on the proton lifetime and the constraint that dark matter not overclose the universe are also discussed. △ Less", "An analysis of the neutron EDM and of the electron EDM in minimal N=1 supergravity unification with two CP violating phases is given. For the neutron the analysis includes the complete one loop gluino, chargino, and neutralino exchange diagrams for the electric dipole and the chromoelectric dipole operators, and also the contribution of the purely gluonic dimension six operator. It is shown that there exist significant regions in the six dimensional parameter space of the model where cancellations between the gluino and the chargino exchanges reduce the electric and the chromoelectric contributions, and further cancellations among the electric, the chromoelectric, and the purely gluonic parts lead to a dramatic lowering of the neutron EDM sometimes below the electron EDM value. This phenomenon gives a new mechanism, i.e., that of internal cancellations, for the suppression of the neutron EDM in supersymmetric theories. The cancellation mechanism can significantly reduce the severe fine tuning problem associated with CP violating phases in SUSY and SUGRA unified models. △ Less", "Much curent theoretical analysis is based on the hypothesis that the physics beyond the Standard Model is a consequence of new principles that occur at the Planck scale. The question arises whether such principles can ever be directly tested. We show here that for a significant class of models, hypotheses made at the string or Planck scale can indeed be directly tested to a relatively high degree of precision by linear colliders. Three classes of models are examined: those with universal SUSY soft breaking at the string scale, those with a horizontal symmetry at the string or Planck scale, and simple Calabi-Yau superstring models with dilaton and moduli SUSY breaking. (Invited talk at Orbis97.) △ Less", "The prospects for Higgs boson discovery and study at present and future colliders are reviewed, with emphasis on the Minimal Supersymmetric Standard Model (MSSM) states. The expected experimental coverages with different production and decay modes are outlined. Particular attention is given to the Higgs couplings predicted when the top quark Yukawa coupling has an infrared fixed point. Characteristic Higgs boson mass spectra from the minimal supergravity (mSUGRA) model are considered and the decoupling/non-decoupling regimes of the lightest Higgs boson are discussed. General tests are described to ascertain whether a discovered light Higgs boson is a SM or MSSM state and to diagnose its fundamental properties. The constraints on the Higgs mass spectra implied by an interesting cosmological relic density of the lightest supersymmetric particle are described. △ Less", "We show that it is possible to achieve one step gauge coupling unification in a general class of non supersymmetric models which at low energies have only the standard particle content and extra Higgs fields doublets. The constraints are the experimental values of $α_{em}$, $α_s$ and $\\sin^2θ_W$ at $10^2 GeVs$, and the lower bounds for FCNC and proton decay rates. Specific example are pointed out. △ Less", "I present a concise review of the possible evidence for new physics at HERA and of the recent work towards a theoretical interpretation of the signal. It is not clear yet if the excess observed at large Q^2 is a resonance or a continuum (this tells much about the quality of the signal). I discuss both possibilities. For the continuum case one considers either modifications of the quark structure functions or contact terms. In the case of a resonance, a leptoquark, the most attractive possibility that is being studied is in terms of s-quarks with R-parity violation. In writing this script I updated the available information to include the new data and the literature presented up to August 1, 1997. △ Less", "The recent GUT (x SUSY) models which can predict the neutrino properties are reviewed. △ Less", "The production of charged Higgs boson pairs from gluon-gluon fusion is studied in the minimal supersymmetric model(MSSM) at proton-proton colliders. We find that the contribution of the scalar quark loops to the subprocess production rate is substantial and consequently the production rate in proton-proton colliders is enhanced in the MSSM if there exist scalar quarks with favorable masses. The results show that this cross section may reach a few femptobarn in the future LHC collider with plausible values of the parameters. △ Less", "We discuss the general framework for the construction of new models containing a single, fermion number zero scalar leptoquark of mass $\\simeq 200-220$ GeV which can both satisfy the D0/CDF search constraints as well as low energy data, and can lead to both neutral and charged current-like final states at HERA. The class of models of this kind necessarily contain new vector-like fermions with masses at the TeV scale which mix with those of the Standard Model after symmetry breaking. In this paper we classify all models of this type and examine their phenomenological implications as well as their potential embedding into SUSY and non-SUSY GUT scenarios. The general coupling parameter space allowed by low energy as well as collider data for these models is described and requires no fine-tuning of the parameters. △ Less", "We analyze the structure of the vacuum and supersymmetry breaking pattern in Fayet-Iliopoulos models with dynamical gauge coupling and planck-scale value of the F-I parameter. We show that in this class of models supersymmetry is generically broken, but the mere presence of the D-term is not sufficient to stop the running away of the modulus responsible for the value of the gauge coupling - the dilaton. To stabilize the dilaton, one has to include an additional dilaton-dependent part in the superpotential. The presence of the large D-term gives rise to the mixed dilaton/D-term dominated scenarios of susy breaking, which allow horizontal hierarchy generation. Models which can serve as secluded sectors in gauge mediation scenarios are discussed. It is shown that when the F-I parameter and the gauge coupling are dynamical variables, the D-term dominated Universe does not allow for an inflationary period. △ Less", "We discuss the results of a global fit to precision data in supersymmetric models. We consider both gravity- and gauge-mediated models. As the superpartner spectrum becomes light, the global fit to the data typically results in larger values of chi^2. We indicate the regions of parameter space which are excluded by the data. We discuss the additional effect of the B(B --> X_sγ) measurement. Our analysis excludes chargino masses below MZ in the simplest gauge-mediated model with mu>0, with stronger constraints for larger values of tan beta. △ Less", "If supersymmetry is discovered at future colliders, what can we learn? While our appreciation of the variety of possible supersymmetric models has grown tremendously in recent years, most attempts to answer this question have been in the context of some simple and highly restrictive framework, such as minimal supergravity. In this talk I describe new probes of phenomena that are generic in models beyond the minimal framework. These include tests of supersymmetric flavor and CP violation and probes of kinematically inaccessible superparticle sectors through ``super-oblique corrections.'' Such probes have wide applicability to distinguishing models, from gravity- and gauge-mediated theories to hybrid models and models with flavor symmetries. Examples of measurements at LEP II, the LHC, and the NLC are given. △ Less", "We consider dynamical models of supersymmetry breaking which naturally incorporate cosmological inflation. The inflaton plays an inevitable role in dynamical SUSY breaking and the hierarchical scales of inflation and SUSY breaking are simultaneously realized through a single dynamics. △ Less", "We review the extraction of fundamental supersymmetric parameters from experimental observables related to the detection of charginos and selectrons at $e^+e^-$ colliders. We consider supergravity models with universal scalar and gaugino masses and radiatively broken electroweak symmetry. Two scenarios are considered: (a) The lightest chargino is light enough to be produced at LEP2, and (b) the right handed selectron is light enough to be produced at LEP2. We show how the validity of supergravity models can be tested even if experimental errors are large. Interesting differences between the spectrum in the two scenarios are pointed out. △ Less", "In R parity conserving supersymmetric theories the lightest superpartner (LSP) is stable. The LSPs may comprise a large fraction of the energy density of the current universe, which would lead to dramatic astrophysical consequences. In this talk, I discuss some of the main lessons we have learned about supersymmetric models from relic abundance considerations of the LSP. △ Less", "In supersymmetric theories with R-parity breaking, sleptons can be produced in quark-antiquark annihilation at the Tevatron through interactions in which two quark fields are coupled to a slepton field. If at the same time trilinear slepton-lepton-lepton couplings are present, the sleptons can be searched for as resonances in $p\\bar{p}\\to \\tildeν \\to l^+l^-$ and $\\tildeτ\\to lν$ final states. Existing Tevatron data can be exploited to derive bounds on the Yukawa couplings of sleptons to quark and lepton pairs. Similar bounds can also be obtained from $e^+e^-$ annihilation to hadrons at LEP2. △ Less", "In models where supersymmetry breaking is communicated into the visible sector via gauge interactions the lightest supersymmetric particle is typically the gravitino which is too light to account for cold dark matter. We point out that the lightest messenger sneutrinos with mass in the range of one to three TeV may serve as cold dark matter over most of the parameter space due to one-loop electroweak radiative corrections. However, in the minimal model this mass range has been excluded by the direct dark matter searches. We propose a solution to this problem by introducing terms that explicitly violate the messenger number. This results in low detection rate for both direct and indirect searches and allows messenger sneutrinos to be a valid dark matter candidate in a wide region of SUSY parameter space. △ Less", "Dark matter detection rates for supergravity models with R parity where supersymmetry is broken at a scale >~M_G are discussed. Non-universal soft breaking masses in both the Higgs and squark sectors are considered, and it is seen that these can effect rates by a factor of 10-100 when m_X <~ 65 GeV (X=lightest neutralino) but otherwise make relatively small corrections. The b->s+γbranching ratio is seen to correlate with detector event rates, large (small) branching ratios corresponding to small (large) event rates. Effects of precision determinations of cosmological parameters or event rate predictions by future satellite experiments are discussed for the LCDM and the vCDM models. △ Less", "A review of the current status of SUSY/SUGRA/String phenomenology is given. △ Less", "CP violation, fermion masses and mixing angles including that of neutrinos are studied in an SUSY SO(10)$\\times Δ(48)\\times$ U(1) model with small $\\tan β$. The family symmetry $Δ(48)$ associated with a simple scheme of U(1) charge assignment on various fields concerned in superpotential leads to unique Yukawa coupling matrices with zero textures. Thirteen parameters involving masses and mixing angles in the quark and charged lepton sector are successfully predicted by only four parameters. The masses and mixing angles for the neutrino sector can also be predicted without involving new parameters. It is found that the atmospheric neutrino deficit, the mass limit put by hot dark matter and the LSND $\\barν_μ \\to \\barν_{e}$ events can be naturally explained. Solar neutrino puzzle can be solved only by introducing a sterile neutrino. An additional parameter is added to obtain the mass and mixing of the sterile neutrino. The hadronic parameters $B_{K}$ and $f_{B}\\sqrt{B}$ are extracted from the observed $K^{0}$-$\\bar{K}^{0}$ and $B^{0}$-$\\bar{B}^{0}$ mixings respectively. The direct CP violation ($ε'/ε$) in kaon decays and the three angles $α$, $β$ and $γ$ of the unitarity triangle in the CKM matrix are also presented. More precise measurements of $α_{s}(M_{Z})$, $|V_{cb}|$, $|V_{ub}/V_{cb}|$, $m_{t}$, as well as various CP violation and neutrino oscillation experiments will provide an important test for the present model and guide us to a more fundamental theory. △ Less", "We briefly discuss the status of three-family grand unified string models. △ Less", "The inclusive branching ratio $B \\to X_sγ$ and the anomalous magnetic moment $g_μ-2$ of the muon are accurately calculated within a minimal gauge-mediated SUSY-breaking model which naturally generates a large $\\tanβ$. The predictions are in somewhat better agreement with current experiments, and new data will soon critically test these predictions. Predictions for $B \\to X_s\\ell^+\\ell^-$ branching ratios and asymmetries, to be tested at future colliders, are also presented. △ Less", "In this paper two things are done. First, we propose a simple model of dynamical gauge-mediated SUSY breaking. This model incorporates a dynamical relaxation mechanism which solves the μ-problem with no light fields beyond those of the MSSM. In the second part of the paper we show how this mechanism is generalized and give two more examples in which it is incorporated. △ Less", "The supersymmetric left-right (SUSYLR) models solve several of the unnaturalness problems of the MSSM such as the R-parity and SUSY CP problems. If further the $W_R$ mass is in the TeV range, then it also provides a solution to the strong CP problem without the need for an axion. A crucial prediction of this model is the electric dipole moment of the neutron $\\simeq 10^{-25}-10^{-26}$ ecm arising from the one loop contribution to the strong CP parameter $\\bar{theta}$. Other predictions of the model are a light doubly charged Higgs boson and its fermionic partner with masses in the several hundred GeV range. We then show this model can be extended to include the leptoquarks that can explain the HERA high $Q^2$ anomaly without giving up R-parity conservation. △ Less", "We examine the prospects for determining $\\tanβ$ from heavy Higgs scalar production in the minimal supersymmetric standard model at a future $e^+e^-$ collider. Our analysis is independent of assumptions of parameter unification, and we consider general radiative corrections in the Higgs sector. Bounds are presented for $\\sqrt{s} = 500$ GeV and 1 TeV, several Higgs masses, and a variety of integrated luminosities. For all cases considered, it is possible to distinguish low, moderate, and high $\\tanβ$. In addition, we find stringent constraints for $3\\lesssim\\tanβ\\lesssim 10$, and, for some scenarios, also interesting bounds on high $\\tanβ$ through $tbH^{\\pm}$ production. Such measurements may provide strong tests of the Yukawa unifications in grand unified theories and make possible highly precise determinations of soft SUSY breaking mass parameters. △ Less", "We calculate the weak magnetic dipole moment of different fermions in the MSSM. In particular, we consider in detail the predictions for the WMDM of the tau lepton and bottom quark. We compare the purely SUSY contributions with two Higss doublet models and SM predictions. For the tau lepton, we show that chargino diagrams give the main SUSY contribution, which for tan beta=50 can be one order of magnitude bigger than the SM prediction. For the b quark, gluino diagrams provide the main SUSY contribution to its weak anomalous dipole moment, which is still dominated by gluon contributions. We also study how the universality assumption in the slepton sector induces correlations between the SUSY contributions to the tau WMDM and to (g-2) of the muon. △ Less", "We investigate the ability of single top quark production via qq'-> squark->tb and q \\bar q'->slepton->t\\bar b at the LHC and Tevatron to probe the strength of R-parity violating couplings in the minimal supersymmetric model. We found that given the existing bounds on R-parity violating couplings, single top quark production may be greatly enhanced over that predicted by the standard model, and that both colliders can either discover R-parity violating SUSY or set strong constraints on the relevant R-parity violating couplings. We further found that the LHC is much more powerful than the Tevatron in probing the squark couplings, but the two colliders have comparable sensitivity for the slepton couplings. △ Less", "The prototype hybrid SUSY SU(5) inflation models, while well motivated from particle physics, and while allowing an acceptable inflationary phase with little or no fine tuning, are shown to have two fundamental phenomenological problems. (1) They inevitably result in the wrong vacuum after inflation is over; and (2) they do not solve the monopole problem. In order to get around the first problem the level of complexity of these models must be increased. One can also avoid the second problem in this way. We also demonstate another possibility by proposing a new general mechanism to avoid the monopole problem with, or without inflation. △ Less", "Experiment shows that the top quark is far heavier than the other elementary fermions. This finding has stimulated research on theories of electroweak and flavor symmetry breaking that include physics beyond the standard model. Efforts to accommodate a heavy top quark within existing frameworks have revealed constraints on model-building. Other investigations have started from the premise that a large top quark mass could signal a qualitative difference between the top quark and other fermions, perhaps in the form of new interactions peculiar to the top quark. Such new dynamics may also help answer existing questions about electroweak and flavor physics. This talk explores the implications of the heavy top quark in the context of weakly-coupled (e.g. SUSY) and strongly-coupled (e.g. technicolor) theories of electroweak symmetry breaking. △ Less", "Recent progress in the gauge-mediated supersymmetry breaking is reviewed, with emphasis on the theoretical problems which gauge-mediated models so successfully solve, as well as those problems which are endemic to the models themselves and still beguile theorists today. △ Less", "Algorithm of constructing Feynman amplitudes in the framework of minimal supersymmetic extension of the standard model is presented, which can be easily implemented in GRACE, the program of automatic generation of Feynman amplitudes. The equivalence of our method with the prescription given by Denner et al. is proved. △ Less", "We consider the idea of combining the supersymmetry breaking and messenger sectors in models of gauge-mediated supersymmetry breaking. We discuss the advantages and problems of such models, and present an existence proof by constructing an explicit example. We explore in some detail the low-energy supersymmetry-breaking dynamics and the generation of supersymmetry-breaking soft masses of the standard model superpartners, and discuss many features which are likely to be shared by more realistic models with dynamical messengers. △ Less", "We discuss the feasibility of spontaneous CP violation being induced by radiative corrections in 2HDM's, emphasizing on a consistent treatment at 1-loop level. Specifically, we analyze the cases of gaugino/higgsino effect on MSSM, and a new model proposed here with an extra, exotic, quark doublet. The latter model is phenomenologically interesting. One conclusion is that some fine tuning is in general needed for the scenario to work. The case for the new model requires a tree level mass mixing between the two Higgses, which fits in the standard SUSY picture. The fine tuning requires is then very moderate in magnitude and in a way natural. △ Less", "A review of the basic principles of baryogenesis is given. Baryogenesis in heavy particle decays as well as electroweak, SUSY-condensate, and spontaneous baryogenesis are discussed. The models of abundant creation of antimatter in the universe are briefly reviewed. △ Less", "After briefly reviewing some arguments in favor of high scale and low scale supersymmetry breaking, I discuss a possible solution of the $μ$-problem of gauge mediated models. △ Less", "A complete one loop analysis of the chromoelectric dipole contribution to the electric dipole moment (edm) of the quarks and of the neutron in N=1 supergravity including the gluino, chargino and neutralino exchange contributions and exhibiting the dependence on the two CP violating phases allowed in the soft SUSY breaking sector of minimal supergravity models is given. It is found that in significant parts of the supergravity parameter space the chromoelectric dipole contribution to the neutron edm is comparable to the contribution from the electric dipole term and can exceed the contribution of the electric dipole term in certain regions of the parameter space. An analysis of the contribution of Weinberg's purely gluonic CP violating dimension six operator within supergravity unification is also given. It is found that this contribution can also be comparable to the contribution from the electric dipole term in certain regions of the supergravity parameter space. △ Less", "A variant of hybrid inflation which is applicable in a wide class of supersymmetric grand unified models and reproduces the observed temperature perturbations of cosmic background radiation with natural values of the parameters is presented. The theory is consistent with the unification of the minimal supersymmetric standard model gauge couplings as measured at LEP. The termination of inflation is smooth and does not produce any topological defects. Numerical investigation of the cosmological evolution of the system shows that for almost all initial values of the fields we do get an adequate amount of inflation. Finally, the \"reheating\" process following inflation and the production of the baryon asymmetry of the universe via a primordial lepton asymmetry are briefly discussed and some important implications for right handed neutrino Majorana masses are investigated. △ Less", "We investigate the effect of SUSY phases ($θ_A$ and $θ_μ$) on the $B^0_d - \\bar{B}^0_d$ mixing in the minimal supergravity model. It is known that the complex phase $θ_A$ $=$ arg($A$) ($A$ is the universal coefficient of the trilinear scalar couplings) is essentially unconstrained by the electric dipole moment experiment, while the phase $θ_μ$ $=$ arg($μ$) ($μ$ is the supersymmetric Higgsino mass) is strongly constrained to zero. We found that $θ_A$ does not affect the phase of the $B^0_d - \\bar{B}^0_d$ mixing matrix element $M_{12}(B)$ by numerical analysis of the renormalization group equations. This means that the measurement of the $B^0_d - \\bar{B}^0_d$ mixing at the future B-factory could give the direct information on the parameters of the CKM matrix even in the framework of the minimal supergravity model with the SUSY phase $θ_A$. △ Less", "Q-balls are generically present in models with softly broken low-energy supersymmetry. We discuss the properties of these non-topological solitons, which can precipitate a new kind of first-order phase transition in the early Universe and have other important implications for cosmology and experiment. △ Less", "The favoured R-parity violating SUSY scenarios for the anomalous HERA events correspond to top and charm squark production via the $λ'_{131}$ and $λ'_{121}$ couplings. In both cases the corresponding electronic branching fractions of the squarks are expected to be $\\ll 1$. Consequently the canonical leptoquark signature is incapable of probing these scenarios at the Tevatron collider over most of the MSSM parameter space. We suggest alternative signatures for probing them at Tevatron, which seem to be viable over the entire range of MSSM parameters. △ Less", "We consider the application of the Multiple Point Criticality Principle to the Standard Model and its extension to the anti-grand gauge group $SMG^3 \\otimes U(1)_f$ at the Planck scale. In particular we discuss the predictions for the fine structure constants: $α^{-1}(0) = 137 \\pm 9$, $α^{-1}_{1}(M_Z) =99 \\pm 5$, $α^{-1}_{2}(M_Z) =29 \\pm 6$, $α^{-1}_{3}(M_Z) =12 \\pm 6$. We also present our Standard Model predictions for the top quark and Higgs masses and a $SMG^3 \\otimes U(1)_f$ fit of the quark-lepton masses and mixing angles. We characterise $SMG^3 \\otimes U(1)_f$ as the largest possible extension of the Standard Model gauge group satisfying some relatively simple assumptions. The resolution of some other fine-tuning problems ($Λ_{cosmological}$, $Θ_{QCD}$, $M_{Higgs}$) by the multiple point requirement of degenerate vacua is briefly discussed. △ Less", "We consider contributions of R-parity conserving softly broken supersymmetry (SUSY) to neutrinoless double beta ($\\znbb$) decay via the (B-L)-violating sneutrino mass term. The latter is a generic ingredient of any weak-scale SUSY model with a Majorana neutrino mass. The new R-parity conserving SUSY contributions to $\\znbb$ are realized at the level of box diagrams. We derive the effective Lagrangian describing the SUSY-box mechanism of $\\znbb$-decay and the corresponding nuclear matrix elements. The 1-loop sneutrino contribution to the Majorana neutrino mass is also derived. Given the data on the $\\znbb$-decay half-life of $^{76}$Ge and the neutrino mass we obtain constraints on the (B-L)-violating sneutrino mass. These constraints leave room for accelerator searches for certain manifestations of the 2nd and 3rd generation (B-L)-violating sneutrino mass term, but are most probably too tight for first generation (B-L)-violating sneutrino masses to be searched for directly. △ Less", "We study Yukawa unification in string models with moduli-dominant SUSY breaking. This type of SUSY breaking in general leads to non-universal soft masses, i.e., soft scalar masses and gaugino masses. Such non-universality is important for phenomenological aspects of Yukawa unification, i.e., successful electroweak breaking, SUSY corrections to the bottom mass and the branching ratio of $b \\to s γ$. We show three regions in the whole parameter space which lead to successful electroweak breaking and allow small SUSY corrections to the bottom mass. For these three regions we investigate the $b \\to s γ$ decay and mass spectra. △ Less", "We evaluate the supersymmetric QCD corrections to single top quark production via $q \\bar q'\\to t \\bar b$ at the Fermilab Tevatron in the minimal supersymmetric model. We find that within the allowed range of squark and gluino masses the supersymmetric QCD corrections can enhance the cross section by a few percent. The combined effects of SUSY QCD, SUSY EW, and the Yukawa couplings can exceed 10% for the smallest allowed $\\tanβ~ (\\simeq 0.25)$ but are only a few percent for $\\tanβ>1$. △ Less", "Measurements of the total hadronic cross section in e+e- annihilation are shown to be capable of severely limiting the possibility that gauginos have negligible tree level masses. A combined analysis of 1997 and earlier LEP data, considering simultaneously conventional SUSY signatures and purely hadronic final states, should achieve a 95% cl sensitivity to the case that the SU(2) and U(1) gauginos are massless. If integrated luminosity targets are achieved, it should also be possible to exclude the case that the wino or wino and gluino are light while the bino is heavy, except possibly for a small region of mu, tan beta. The analysis applies whether or not R-parity is conserved, and can also be used to reduce the model-dependence of conventional SUSY searches. △ Less", "Two-loop four-gluon N=4 susy amplitudes are evaluated via cutting techniques as a testing ground for QCD. A conjecture for four-point amplitudes to all loop orders is described. We also present a new conjecture for the leading-color part of the two-loop five-gluon amplitudes. △ Less", "Prospects are examined for the detection of a slow decay of the lightest neutralino (or any other longlived particles) at the CERN LHC and at Very Large Hadron Collider (VLHC). We first point out that such hadron colliders will become the ``neutralino factory'' producing 10^6--10^9 neutralinos/yr, if gluinos and/or squarks actually exist below O(1) TeV. The lightest neutralino (\\neu), usually assumed to be stable, will be unstable if lighter superparticles such as the gravitino (\\gra) or axino (\\axi) exist, or R-parity is not conserved. The decay signal would, however, be missed in usual collider experiments, particularly when the decay mostly occurs outside the detector. In order to search for such a slow decay of \\neu, we propose a dedicated experiment where the collision products are dumped by a thick shield, which is followed by a long decay tunnel. The decay product of \\neu can be detected by a detector located at the end of the tunnel. The slow arrival time and the large off angle (to the direction of the interaction point) of the decay product will provide a clear signature of slowly decaying \\neu's. One can explore the decay length (cτ) in a wide range, i.e., 0.2 m to 1x10^5 km for \\mneu=25 GeV and 1 m to 2 km for \\mneu=200 GeV at the LHC. This corresponds to the range of the SUSY breaking scale \\rtF=2x10^5 to 2x10^7 GeV in case of the \\neu\\toγ\\gra decay predicted in gauge-mediated SUSY breaking models. At VLHC, one can extend the explorable range of \\mneu up to 1000 GeV, and that of \\rtF up to 1x10^8 GeV. In case of the \\neu\\toγ\\axi decay, the Peccei- Quinn symmetry breaking scale F_a can be explored up to 5x10^11 GeV. The mass of the decaying particle can be determined by using the correlation between the energy and the arrival time of the decay product. △ Less", "RH rotations of the fermionic mass matrices are not observable in the standard model, but dictate the details of the proton decay in GUTs. $P_{LR}$ symmetry in the two light families leads to a full RH mixing. We give two versions of suitable broken $P_{LR}$ invariant SO(10) which leads to nucleon decay modes similar to those of SUSY-GUTs with rates in the range of observability of superKamiokande and ICARUS. △ Less", "In these Lectures, we present a pedagogical introduction to weak scale supersymmetry phenomenology. A basic understanding of the Standard Model and of the ideas behind Grand Unification, but no prior knowledge of supersymmetry, is assumed. Topics covered include: What is supersymmetry and why do we bother with it? Working with a supersymmetric theory: A toy example Construction of supersymmetric Lagrangians The Minimal Supersymmetric Model The mSUGRA Model: A paradigm for SUSY phenomenology Decays of supersymmetric particles Production of supersymmetric particles at colliders Observational constraints on supersymmetry Supersymmetry searches at future colliders Constraining supersymmetry models at future colliders R-parity violation Gauge-mediated supersymmetry breaking △ Less", "Some implications of flavour unification in supersymmetric Grand Unified Theories are briefly reviewed. We argue that the gauge hierarchy phenomenon properly interpreted in terms of the natural missing VEV solution for the adjoint scalar in general SU(N) SUSY GUT could give insight into both of the basic features of low-energy physics accommodated in MSSM just as some strict colour-flavour (or colour-family) interrelation, so the SU(2) symmetry structure of weak interactions. There, apart from the ordinary triple matter of MSSM, just three families of the pseudo-Goldstone states appear in the minimal SU(8) theory to be of necessity detected at a TeV scale. △ Less", "We examine the low energy structure of N=1 supersymmetric SO(10) gauge theory with matter chiral superfields in N_Q spinor and N_f vector representations. We construct a dual to this model based upon an SU(N_f+2N_Q-7) x Sp(2N_Q-2) gauge group without utilizing deconfinement methods. This product theory generalizes all previously known Pouliot-type duals to SO(N_c) models with spinor and vector matter. It also yields large numbers of new dual pairs along various flat directions. The dual description of the SO(10) theory satisfies multiple consistency checks including an intricate renormalization group flow analysis which links it with Seiberg's duality transformations. We discuss its implications for building grand unified theories that contain all Standard Model fields as composite degrees of freedom. △ Less", "We study the contribution of charginos and neutralinos of the Minimal SUSY extension of the Standard model (MSSM) to the 1-loop vertices ZAA, ZZA, ZZZ, and examine the related cancellation of anomalies. It is found that when the SUSY parameter μsatisfies |μ| >> M,M', m_W, the couplings of charginos and neutralinos with the gauge bosons become purely vectorial, and then their contribution to the amplitudes for ZAA, ZZA and ZZZ vanish, which implies that this sector of the MSSM does not generate a Wess-Zumino term. We evaluate also the contribution of charginos and neutralinos to the ρparameter, and find that ρ=0 in the large-μlimit. △ Less", "We analyze finite supersymmetric SU(5) GUT taking into account the problem in the Higgs potential and threshold corrections to gauge and Yukawa couplings at GUT and SUSY scales which is important in case of large $\\tan β$ model. We find that even with these finiteness conditions, which are very restrictive, there are parameter regions where low-energy experimental values are consistently reproduced and the Higgs potential actually realizes both constraints for large $\\tan β$ and radiative electroweak symmetry breaking, provided that a free parameter is introduced in the boundary condition of the Higgs mixing mass parameter. △ Less", "The electric dipole moment of an electron (EDME) is investigated in the supersymmetric extra U(1) models. Neutralino sector is generally extended in these models and then the neutralino contribution will be important for the analysis of the EDME. Kinetic term mixings of abelian gauginos are taken into account in our analysis. Numerical results for the extra U(1) models show that the EDME can be affected by the extra U(1) in a certain range of soft supersymmetry breaking parameters even if the extra U(1) gauge boson is heavy. The EDME may be a clue to find an extended gauge structure in the supersymmetric models. △ Less", "The determination of the full SUSY QCD corrections to the production of squarks and gluinos at hadron colliders is reviewed. The inclusion of the NLO corrections stabilizes the theoretical predictions of the various production cross sections significantly and leads to sizeable enhancements of the most relevant cross sections. We discuss the phenomenological consequences of the results on present and future experimental analyses. Finally we investigate the impact of the corrections on the transverse momentum and rapidity distributions. △ Less", "Although no individual piece of experimental evidence for supersymmetry is compelling so far, several are about as good as they can be with present errors. Most important, all pieces of evidence imply the same values for common parameters --- a necessary condition, and one unlikely to hold if the hints from data are misleading. The parameters are sparticle or soft-breaking masses and $ tan β.$ For the parameter ranges reported here, there are so far no signals that should have occurred but did not. Given those parameters a number of predictions can test whether the evidence is real. It turns out that the predictions are mostly different from the conventional supersymmetry ones, and might have been difficult to recognize as signals of superpartners. They are testable at LEP2, where neutralinos and charginos will appear mainly as $γγ+$ large $\\slashchar{E}$ events, $γ+$ very large $\\slashchar{E}$ events, and very soft lepton pairs of same or mixed flavor. The results demonstrate that we understand a lot about how to extract an effective SUSY Lagrangian from limited data, and that we can reasonably hope to learn about the theory near the Planck scale from the data at the electroweak scale. △ Less", "A D-parity violated SUSY SU(4) x SU(2) _ L x SU(2)_R gauge model with the Higgs sector 2{(4,1,2)+(4-bar,1, 2)}+(1,2,2)+some(1,1,1)'s is shown to have the following advantages: (i) It is the simplest and almost unique solution that satisfies M_X = M_{string} ~0.6 x 10^{18} GeV and M_{INT} ~ 5 x10^{11} GeV in superstring derived SUSY SO(10) GUTs. (ii) The proton is stable enough by the automatic \"doublet-triplet splitting\" closely connected with the D-parity violation. (iii) The minimization of SUSY one-loop effective potential in a toy model suggests that the SO(10) gauge theory tends to break dynamically down to the SU(4) x SU(2)_ L x SU(2)_R model. △ Less", "It is shown that the doublet-triplet splitting problem can be solved in SO(10) using the Dimopoulos-Wilczek mechanism with a very economical Higgs content and simple structure. Only one adjoint Higgs field is required, together with spinor and vector fields. The successful SUSY GUT prediction of gauge coupling unification is preserved. Higgsino-mediated proton decay can be suppressed below (but not far below) present limits without fine-tuning. △ Less", "The chargino pair production in $e^-e^-$ collisions with their subsequent decays are considered within SUSY models with R-parity violation and with lepton number non-conservation. The production process ($\\sqrt{s}=1$ TeV) is predicted to be large in a wide range of both sneutrino and chargino masses. The influence of all virtual sneutrino states and their mixings with electrons are taken into account. Some specific situations are pointed out when significant suppressions of the cross section can take place. The chargino decays are discussed for either the chargino as LSP or the chargino as heavier sparticle. In both cases unique signals are possible with up to six charged fermions and without missing energy. △ Less", "Electroweak precision tests of the SM and MSSM as well as searches for Supersymmetric Particles and Higgs bosons at LEP II and their significance within the MSSM are discussed. Invited talk presented at the EPIPHANY Conf. in Cracow, Jan. 3-7, 1997. △ Less", "We systematically construct gauge-mediated supersymmetry(SUSY)-breaking models with direct transmission of SUSY-breaking effects to the standard-model sector. We obtain a natural model with the gravitino mass $m_{3/2}$ smaller than 1 keV as required from the standard cosmology. If all Yukawa coupling constants are of order one,the SUSY-breaking scale $m_{SUSY}$ transmitted into the standard-model sector is given by $m_{SUSY} \\simeq 0.1 α_i/(4π) Λ$ where $Λ$ is the original dynamical SUSY-breaking scale. Imposing $m_{SUSY} \\simeq (10^2-10^3)$ GeV, we get $Λ\\simeq (10^5-10^6)$ GeV, which yields the gravitino mass $m_{3/2}\\simeq (10^{-2}-1)$ keV. △ Less", "If the parameter $tan β$ of the minimal supersymmetric model is large, then $b$ and $τ$ Yukawa interactions are important. These can significantly modify the masses and decays of sparticles. We describe new calculations which allow a reliable exploration of large $tan β$ values, and discuss implications for collider experiments. For large values of $tan β$, charginos and neutralinos may dominantly decay to $τ$-leptons or $b$-quarks. The usual cross sections for multilepton signatures may be greatly reduced, but SUSY may be detectable via new signals involving $τ$'s or $b$'s in the final state. △ Less", "There is a class of supersymmetric models which is well-motivated by hints of evidence for SUSY and consistent with all existing data. It is important to study the predictions of these models. They are characterized by M(N3) > M(C1) > M(snu) > M(N1) (where Ni and Ci are neutralino and chargino mass eigenstates), |mu| ~< M1 ~< M2 ~= M(Z), mu < 0, and tan(beta) near 1. Their LEP signatures are mostly unusual. Most produced superpartners are invisible! A good signature is two photons plus large missing energy. There are also excess events at large recoil mass in the single photon plus nothing channel. We list the main signatures for charginos, stops, etc., which are also likely to be unconventional. This class of models will be definitively tested at LEP194 with 100 pb^{-1} per detector, and almost definitively tested at LEP184. △ Less", "The excess of high Q^2 events at HERA has been the subject of recent extensive studies in the framework of several models related to new physics. Here, we would like to concentrate on the most promising, from our point of view, model describing HERA anomaly. We investigate HERA events within the R-parity broken SUSY model and check its relation to LEP and TEVATRON colliders. This study shows that if a squark resonance really takes place at HERA, supersymmetry with broken R-parity can be revealed at either LEP200 or TEVATRON. △ Less", "Motivated by the recent HERA events which are consistent with a possible leptoquark interpretation, we discuss the prospects for including additional light colour triplets and anti-triplets in the spectrum of supersymmetric unified theories. We focus on a particular string-inspired Pati-Salam model, and propose a simple mechanism by which a light colour triplet of charge -1/3 plus anti-triplet of charge 1/3, may have a mass of order 200 GeV, with one of the new states having leptoquark couplings and with proton decay suppressed. We also discuss possible scenarios for gauge unification in such a model. △ Less", "Several supersymmetry breaking mechanisms do not produce dimension-3 operators. I show here that this scenario is consistent with present observations and has several significant virtues: i) When there are no dimension-3 SUSY-breaking operators there is no SUSY-CP problem. ii) SUSY-breaking need not occur through gauge singlets, so that the cosmological problems often encountered in hidden sector SUSY-breaking can be avoided. iii) Photino and gluino and $R$-hadron masses are naturally consistent with relic photinos providing the required dark matter density. Requiring spontaneous electroweak symmetry implies that scalar masses are mostly in the $\\sim 100$ GeV range. The gluino and photino are massless at tree level. At 1-loop, the gluino and photino masses at the ew scale are predicted to be $m_{\\gluino}\\sim 10 - 600$ MeV and $m_{\\photino} \\sim 100 - 1400$ MeV. New hadrons with mass $\\sim 1 \\frac{1}{2}$ GeV are predicted and described. The ``extra'' flavor singlet pseudoscalar in the $ι(1440)$ region which has been observed in several experiments is naturally interpreted as the mainly-$\\gluino \\gluino$ bound state which gets its mass via the QCD anomaly. Its superpartner, a gluon-gluino bound state, would be the lightest $R$-hadron. For the most interesting portions of parameter space the $R^0$ lifetime is $10^{-6} - 10^{-10}$ sec, so existing searches would not have been sensitive to it. Search strategies and other consequences of the scenario are briefly mentioned. △ Less", "An attractive class of SUSY-breaking mechanisms predicts a photino mass of order 1 GeV. Relic photinos can naturally account for the observed dark matter. Detection of these light photinos is discussed and contrasted with conventional WIMPs. In this scenario the gluino mass is about 100 MeV. The lightest gluino-containing baryon could account for the recently observed ultra-high energy cosmic rays, which violate the GZK bound. △ Less", "We present a detailed and complete calculation of the gluino and scalar quarks contribution to the flavour-changing top quark decay into a charm quark and a photon, gluon, or a Z boson within the minimal supersymmetric standard model including flavour changing gluino-quarks-scalar quarks couplings in the right-handed sector. We compare the results with the ones presented in an earlier paper where we considered flavour changing couplings only in the left-handed sector. We show that these new couplings have important consequences leading to a large enhancement when the mixing of the scalar partners of the left- and right-handed top quark is included. Furthermore CP violation in the flavour changing top quark decay will occur when a SUSY phase is taken into account. △ Less", "We study the uncertainties of the Standard Model (SM) predictions for CP violating B decays and investigate where and how supersymmetric (SUSY) contributions may be disentangled. The first task is accomplished by letting the relevant matrix elements of the effective Hamiltonian vary within certain ranges. The SUSY analysis makes use of a formalism which allows to obtain model-independent results. We show that in some cases it is possible a) to measure the CP B-\\bar{B} mixing phase and b) to discriminate the SM and SUSY contributions to the CP decay phases. The golden-plated decays to this purpose are the B \\to φK_S and B \\to K_S π^0 channels. △ Less", "In the Standard Model (SM) the photon in radiative $\\bar B^0$ and $\\bar B_s$ decays is predominantly left-handed. Thus, mixing induced CP asymmetries in $b\\to sγ$ and $b\\to dγ$ are suppressed by $m_s/m_b$ and $m_d/m_b$, respectively, and are very small. In many extensions of the SM, such as the left-right symmetric model (LRSM), SU(2)xU(1) models with exotic fermions and SUSY, the amplitude of right-handed photons grows proportional to the virtual heavy fermion mass, which can lead to large asymmetries. As an example, in the LRSM, asymmetries larger than 50% are possible even when radiative decay rate measurements agree with SM predictions. △ Less", "We discuss single top quark production via u^i+\\bar d^j \\to t+\\bar b at the Fermilab Tevatron in the minimal supersymmetric model with R-parity violation. We find that within the allowed range of coupling constants, the lepton-number violating couplings can give rise to observable effects when the slepton mass lies in a specific narrow range. For the baryon-number violating couplings, the contribution to the production rate can be quite large in the presently allowed range of the coupling constants. We show that the measurement of single top production at the upgraded Tevatron can be used to constrain a linear combination of products of the R-parity violating couplings. △ Less", "Flavour changing top decays $t \\to c Z^0, t \\to c g$ and $t \\to c γ$ are predicted with invisible rates within the standard model and may represent a window on new physics. We consider these processes in supersymmetric extensions of the standard model and we show that observable rates can be obtained only if the SUSY breaking is non universal and flavour dependent. △ Less", "The missing VEV solution to the doublet-triplet splitting problem in general SU(N) SUSY GUTs is found. Remarkably enough, it requires a strict equality of numbers of the fundamental colours and flavours in SU(N) and for the even-order groups (N=2k) gives the predominant breaking channel $SU(N) \\to SU(k-1)_c\\otimes SU(k-1)_f\\otimes SU(2)_w\\otimes U(1)\\otimes U(1)'$ in the parameter natural area. The flavour subsymmetry breaking owing to some generic string inspired extra symmetries of the Higgs superpotential appears not to affect markedly the basic adjoint vacuum configuration in the model. Thus the both salient features of SM just as an interplay between colours and flavours (or families for due assignment of quarks and leptons) so the doublet structure of the weak interactions could be properly understood and accommodated in the framework of the minimal SU(8) model. Among its predictions the most crucial one belongs to the existence on the TeV scale just three families of pseudo-Goldstone bosons and their superpartners 3(5+\\bar 5) + SU(5)-singlets which noticeably improve the unification picture of MSSM. △ Less", "We investigate the dark matter constraints for the nonminimal SUSY standard model (NMSSM). The cosmologically restricted mass spectra of the NMSSM are compared to the minimal SUSY standard model (MSSM). The differences of the two models concerning the neutralino, sfermion and Higgs sector are discussed. The dark matter condition leads to cosmologically allowed mass ranges for the SUSY particles in the NMSSM: m_{\\tildeχ^0_1} < 300 GeV, m_{\\tilde{e}_R} < 300 GeV, 300 GeV < m_{\\tilde{u}_R} < 1900 GeV, 200 GeV < m_{\\tilde{t}_1} < 1500 GeV, 350 GeV < m_{\\tilde{g}} < 2100 GeV and for the mass of the lightest scalar Higgs m_{S_1} < 140 GeV. △ Less", "In supersymmetric theories the charged sleptons of different generations may oscillate amongst themselves while they decay. In the case of three generation oscillations, superpartner production at the LHC and NLC may lead to an observable $CP$-violating signal $N(e^+μ^-) - N(μ^+e^-)$. This signal is proportional to a $CP$-violating invariant of the slepton mass matrix, $\\widetilde{J}$, which is not constrained by searches for the electric dipole moment of the electron. The sensitivity of the LHC and NLC to this signal is highly dependent on superpartner masses, but $\\widetilde{J}$ may be probed to a level of $10^{-3}$. Observation of the $CP$-violating signal would imply a definite structure for the slepton mass matrices and have strong implications for models of flavor and SUSY breaking. △ Less", "We consider Flavour Changing Neutral Current processes in the framework of the supersymmetric extension of the Standard Model. FCNC constraints on the structure of sfermion mass matrices are reviewed. Furthermore, we analyze supersymmetric contributions to FCNC transitions which remain in the limit of flavour-conserving sfermion mass matrices. Implications of the FCNC constraints on the structure of sfermion mass matrices for SUSY breaking and sfermion mass generation are discussed. We conclude that the supersymmetric flavour problem is intriguing but perhaps not as severe as it is commonly believed. △ Less", "We briefly review the GIFT (Goltstones instead of Fine Tuning) mechanism which provides a promising solution to the doublet-triplet splitting problem and some other puzzles of the supersymmetric grand unification as are the $μ$-problem, the fermion mass problem, etc. It can be naturally implemented by extending the minimal SUSY SU(5) model to the gauge SU(6) theory. △ Less", "Recent theoretical progress in the evaluation of Higgs boson production at the LHC within the Standard Model and its minimal supersymmetric extension is reviewed. In particular the two-loop QCD corrections to the squark loop contributions to scalar Higgs production in the MSSM and soft gluon resummation effects in Standard and SUSY Higgs production via the gluon fusion mechanism are discussed. △ Less", "We study the potential of the LEP200 collider for chargino production and the possibility of the determination of some fundamental SUSY parameters through the relation with this study. Total cross sections for two basic signatures of pair chargino production and for main backgrounds are calculated. The set of kinematic cuts is proposed for the effective background suppression and extraction of the signal. Calculations and the MC simulation performed give the limits on chargino and neutralino masses that could be obtained at LEP200 with $\\sqrt s =$ 200 GeV. △ Less", "We study moduli-dominated SUSY breaking within the framework of string models. This type of SUSY breaking in general leads to non-universal soft masses, i.e. soft scalar masses and gaugino masses. Further gauginos are lighter than sfermions. This non-universality has phenomenologically important implications. We investigate radiative electroweak symmetry breaking in the mass spectrum derived from moduli-dominated SUSY breaking, where the lightest chargino and neutralino are almost gauginos. Moreover, constraints from the branching ratio of $b \\to s γ$ and the relic abundance of the LSP are also considered. The mass spectrum of moduli-dominated SUSY breaking is favorable to the experimental bound of the $b \\to s γ$ decay decreasing its branching ratio. We obtain an upper bound for the gravitino mass from the cosmological constraint. △ Less", "I discuss the decay modes of the neutral and charged Higgs bosons in the minimal supersymmetric extension of the Standard Model. Special emphasis will be put on the the QCD corrections to the hadronic decay modes, the below threshold -three body- decays and the decays into supersymmetric particles, charginos, neutralinos and sfermions. A Fortran code calculating the various Higgs decay branching ratios is then briefly presented. [Talk given at the Ringberg Workshop The Higgs Puzzle, Ringberg Castle, Tegernsee, Germany, December 8-13 1996; to appear in the proceedings.] △ Less", "An analysis of supersymmetric contributions to R_b in supergravity grand unification with non-universal boundary conditions on soft SUSY breaking in the scalar sector is given. Effects on R_b of Planck scale corrections on gaugino masses are also analysed. It is found that there exist regions of the parameter space where positive corrections to R_b of size $\\sim 1 σ$ can be gotten. The region of the parameter space where enhancement of R_b occurs is identified. Prediction of the full sparticle spectrum for the maximal R_b case is given. The analysis has implications for the discovery of supersymmetric particles at colliders. △ Less", "In supersymmetric theories, the decays of the neutral CP-even and CP-odd as well as the charged Higgs bosons into scalar quarks, in particular into top and bottom squarks, can be dominant if they are kinematically allowed. We calculate the QCD corrections to these decay modes in the minimal supersymmetric extension of the Standard Model, including all quark mass terms and squark mixing. These corrections turn out to be rather large, altering the decay widths by an amount which can be larger than 50%. The corrections can be either positive or negative, and depend strongly on the mass of the gluino. We also discuss the QCD corrections to the decays of heavy scalar quarks into light scalar quarks and Higgs bosons. △ Less", "We obtain a relation between right-handed gauge boson mass and soft squark mass in naturally R-parity conserving general supersymmetric left-right models. This relation implies that either ${W_R}$ is lighter than twice the soft squark mass, or a ratio of vacuum expectation values (VEVs) in the model, denoted by $\\tanα$, is close to its value of unity in the limit of vanishing D-terms. Generally, we find that for heavy $W_R$ $\\tanα$ is larger than one, and that the right-handed sneutrino VEV, responsible for spontaneous R-parity breaking, is at most of the order $M_{SUSY}/h_{Δ_R}$, where $M_{SUSY}$ is supersymmetry breaking scale and $h_{Δ_R}$ is the Yukawa coupling in Majorana mass term for right-handed neutrinos. These constraints follow from $SU(3)_c$ and $U(1)_{em}$ gauge invariance of the ground state of the theory. △ Less", "We have studied the predictions for the LSP decay within the framework of a radiatively broken unified supergravity model without R-parity. Assuming that Higgs/slepton mixing is the only source of R-parity breaking and responsible for the observed neutrino oscillations we obtain predictons for the LSP life-time and branching fractions. △ Less", "I present an updated discussion of the one-loop corrections to the standard top quark decay, t-> W^+ b, and to the charged Higgs mode, t-> H^+ b, within the framework of the MSSM. These higher order contributions to the top width are compared with the direct top decays into 2 and 3 real SUSY particles. It turns out that whereas the SUSY effects on t-> W^+ b add up to those from standard QCD, they tend most likely to erase the conventional QCD corrections to t-> H+ b. However, in the latter case the full (strong plus electroweak) SUSY quantum effects are generally so large that the QCD corrections effectively come out with the ``wrong sign''. A qualitatively distinct, and quantitatively significant, ``quantum signature'' of that type might constitute a most sought-after imprint of ``virtual'' Supersymmetry, which remains sizeable enough even in the absence of any direct top decay into SUSY particles. Similar considerations are made for the hadronic partial widths of the Higgs bosons of the MSSM. While a first valuable test of these effects could possibly be performed at the upgraded Tevatron, a more precise verification would most probably be carried out in future experiments at the LHC. △ Less", "Gauge-mediated SUSY breaking with a messenger scale of order $10^{15}$ GeV has some interesting features. It can solve the flavor changing neutral current problem of supersymmetric models with predictions for superpartner masses which are identical to those of minimal supergravity models. It can however also lead to theories with novel experimental signatures. For example, we present a model in which the gluino is the lightest supersymmetric particle. We also review the present experimental status of a stable gluino. △ Less", "We have found that supersymmetry (SUSY) in curved space is broken softly. It is also found that Pauli-Villars regularization preserves the remaining symmetry, softly broken SUSY. Using it we computed the one-loop effective potential along a (classical) flat direction in a Wess-Zumino model in de Sitter space. The analysis is relevant to the Affleck-Dine mechanism for baryogenesis. The effective potential is unbounded from below: $V_{eff}(φ)\\to -3g^2H^2φ^2 ln φ^2 /16π^2$, where $φ$ is the scalar field along the flat direction, g is a typical coupling constant, and H is the Hubble parameter. This is identical with the effective potential which is obtained by using proper-time cutoff regularization. Since proper-time cutoff regularization is exact even at the large curvature region, the effective potential possesses softly broken SUSY and reliability in the large curvature region. △ Less", "We investigate the confining phase vacuum structure of supersymmetric SO(11) gauge theories with one spinor matter field and Nf \\le 6 vectors. We describe several useful tricks and tools that facilitate the analysis of these chiral models and many other theories of similar type. The forms of the Nf=5 and Nf=6 quantum moduli spaces are deduced by requiring that they reproduce known results for SU(5) SUSY QCD along the spinor flat direction. After adding mass terms for vector fields and integrating out heavy degrees of freedom, we also determine the dynamically generated superpotentials in the Nf \\le 4 quantum theories. We close with some remarks regarding magnetic duals to the Nf \\ge 7 electric SO(11) theories. △ Less", "We review the prospects for dark matter (DM) in two classes of supersymmetric (SUSY) models which are characterized by the different mechanism of SUSY breaking, namely the more common supergravity models with very large scale of SUSY breaking and the recent schemes where SUSY is broken at a relatively low scale and gravitinos are likely to be the lightest SUSY particle. We point out that the former scheme is in general associated with the cold dark matter (CDM) scenario, while the latter predicts a warm dark matter (WDM) dominated Universe. △ Less", "We compute the O(alpha_s) SUSY-QCD corrections to the W and charged Higgs mediated inclusive semi-tauonic B-decay, B->tau antineutrino_tau X. Combining the SUSY contribution with the SM result obtained from the heavy quark effective field theory, plus ordinary QCD corrections, we find that the allowed region in the (tan(beta),M_H^\\pm)-plane could be significantly modified by the short-distance supersymmetric effects. Since the sensitivity to the SUSY parameters other than mu (the higgsino mixing mass) is rather low, the following effective bound emerges for mu<0 at the 2 sigma level: tan(beta)~< 0.43 (M_H^\\pm/GeV). Remarkably, for mu>0 there could be no bound at all. Finally, we provide a combined (tan(beta,M_H^\\pm) exclusion plot using our B-meson results together with the recent data from top quark decays. △ Less", "Consider a gauge singlet superfield S coupled to a pair of adjoint fields in a SUSY-GUT. If the tree-level vacuum is flat in S, the vev <S> which defines the GUT scale will be determined via dimensional transmutation at a scale M where the soft-breaking (mass)^2 vanishes as a result of running from $M_{Pl} = (8 πG_N)^{-1/2}$. Because of the large number of adjoint fields $N_A$ coupled to S, one finds that M can be generically close to $M_{GUT} = 2 \\times 10^{16} GeV$: $M \\simeq M_{Pl} \\exp[-16 π^2 \\log(3/2) / (N_A+4) λ^2]$, where $λ$ is a Yukawa $\\sim$ 0.7. This work examines the symmetries and dynamical constraints required in a SUSY-GUT in order that the desired flatness in S is achieved, and that this flatness may survive in a supergravity framework. △ Less", "We evaluate the supersymmetric (SUSY) electroweak corrections to the effect of parity nonconservation in $q {\\bar q} \\to t {\\bar t}$ production at the Fermilab Tevatron predicted by the Minimal Supersymmetric Model (MSSM). We find that the parity nonconserving asymmetry from the SUSY electroweak and SUSY Yukawa loop corrections predicted by the minimal supergravity (mSUGRA) model and the MSSM models with scenarios motivated by current data is about one percent. It will be challenging to observe such a small asymmetry at the Tevatron with 10 fb^{-1} of luminosity. It could however be observable if both the top- and bottom-squarks are light and $\\tan β$ is smaller than 1, though theses parameters are not favored by mSUGRA. △ Less", "Talk is given at the YITP International Workshop -- `Recent Developments in QCD and Hadron Physics'. Recent CDF data of the inclusive jet cross section shows anomalous deviation around large transverse momentum $p_{T}(j)\\approx 200 \\sim 350$ GeV. Is it possible to interpret the anomaly in terms of virtual SUSY effects. The answer is `NO', because we find that the virtual SUSY loop interference effects are too small to explain the CDF data. △ Less", "An analysis is given of the effects of non-universal soft SUSY breaking masses in the Higgs sector and in the third generation squark sector, and it is shown that they are highly coupled. Analytic expressions are obtained for their effects on the parameters $μ,m_A$ and on the third generation squark masses. Non-universality effects on dark matter event rates in neutralino-nucleus scattering are analysed. It is found that the effects are maximal in the range $m_{\\tildeχ_1}\\leq 65$~GeV where the relic density is governed by the Z and Higgs poles. In this range the minimum event rates can be increased or decreased by factors of O(10) depending on the sign of non-universality. Above this range Landau pole effects arising from the heavy top mass tend to suppress the non-universality effects. The effect of more precise measurements of cosmological parameters on event rates, which is expected to occur in the next round of COBE like sattelite experiments, is also investigated. Implications for the analysis for dark matter searches are discussed. △ Less", "We show that the effective theory of a supersymmetric model can violate SUSY at the level of dimension six operators and higher. This phenomenon occurs in gauge theories which involve heavy vector-superfields and different mass scales. It appears in SUSY GUT theories and is important in models of propagating Higgs boundstates. △ Less", "We prove a general low-energy theorem establishing a generic relation between the neutrino Majorana mass and the superpartner sneutrino B-L-violating \"Majorana\"-like mass term. The theorem states that, if one of these two quantities is non-zero the other one is also non-zero and, vice versa, if one of them vanishes the other vanishes, too. The theorem is a consequence of the underlying supersymmetry (SUSY) and valid for any realistic gauge model with weak scale softly broken SUSY. △ Less", "We calculate LSP-nucleus elastic scattering cross sections using some representative input in the restricted SUSY parameter space. The coherent matrix elements are computed throughout the periodic table while the spin matrix elements for the proposed $^{207}Pb$ target which has a rather simple nuclear structure. The results are compared to those given from other cold dark matter detection targets. △ Less", "The momentum transfer dependence of the total cross section for elastic scattering of cold dark matter candidates, i.e. lightest supersymmetric particle (LSP), with nuclei is examined. The presented calculations of the event rates refer to a number of representative nuclear targets throughout the periodic table and have been obtained in a relatively wide phenomenologically allowed SUSY parameter space. For the coherent cross sections it is shown that, since the momentum transfer can be quite big for large mass of the LSP and heavy nuclei even though the energy transfer is small ($\\le 100 KeV$), the total cross section can in such instances be reduced by a factor of about five. For the spin induced cross section of odd-A nuclear targets, as is the case of $^{207}Pb$ studied in this work, we found that the reduction is less pronounced, since the high multipoles tend to enhance the cross section as the momentum transfer increases (for LSP $mass < 200 GeV$) and partially cancell the momentum retardation. The effect of the Earth's revolution around the sun on these event rates is also studied by folding with a Maxwellian LSP-velocity distribution which is consistent with its density in the halos. We thus found that the convoluted event rates do not appreciably change compared to those obtained with an average velocity. The event rates increase with A and, in the SUSY parameter space considered, they can reach values up to 140 $y^{-1}Kg^{-1}$ for Pb. The modulation effect, however, was found to be small (less than $\\pm 5%$). △ Less", "The momentum transfer dependence of the LSP-nucleus elastic scattering cross sections is studied. New imput SUSY parameters obtained in a phenomenologically allowed parameter space are used to calculate the coherent rate for various nuclear systems and the spin matrix elements for the proposed $^{207}Pb$ target. The results are compared to those obtained from other cold dark matter detection targets. △ Less", "We develop a systematic approach to confinement in N=1 supersymmetric theories. We identify simple necessary conditions for theories to confine without chiral symmetry breaking and to generate a superpotential non-perturbatively (s-confine). Applying these conditions we identify all N=1 theories with a single gauge group and no tree-level superpotential which s-confine. We give a complete list of the confined spectra and superpotentials. Some of these theories are of great interest for model building. We give several new examples of models which break supersymmetry dynamically. △ Less", "We explore some topics in the phenomenology of gauge-mediated SUSY-breaking scenarios having a large hierarchy of Higgs VEVs, $v_U/v_D = tanβ\\gg 1$. Some motivation for this scenario is first presented. We then use a systematic, analytic expansion (including some threshold corrections) to calculate the $μ$ parameter needed for proper electroweak breaking and the radiative corrections to the B parameter, which fortuitously cancel at leading order. If B = 0 at the messenger scale then $tanβ$ is naturally large and calculable; we calculate it. We then confront this prediction with classical and quantum vacuum stability constraints arising from the Higgs-slepton potential, and indicate the preferred values of the top quark mass and messenger scale(s). The possibility of vacuum instability in a different direction yields an upper bound on the messenger mass scale complementary to the familiar bound from gravitino relic abundance. Next, we calculate the rate for $b\\to sγ$ and show the possibility of large deviations (in the direction currently favored by experiment) from standard-model and small $tanβ$ predictions. Finally, we discuss the implications of these findings and their applicability to future, broader and more detailed investigations. △ Less", "Introductory lectures on the phenomenology of the minimal supersymmetric Standard Model. The emphasis is on general signatures for supersymmetry and on the motivation for constructing supersymmetric models. These lectures are intended for experimental graduate students. △ Less", "Recent CDF data of the inclusive jet cross section shows threshold-like structured deviation, around transverse momentum $E_T(j)\\approx 200 \\sim 350$ GeV. If this data is real, not just some statistical fluctuation, is it possible to interpret the anomaly in terms of virtual SUSY effects? The purpose of this note is to address this question. However, we find that virtual SUSY loop interference effects [near the threshold] are too small to explain the CDF data. Our main conclusion seems to be on the right track if we assume that the recent global analysis of improved parton distributions by Lai et al. is correct. PACS number(s): 14.65.Ha, 12.38.Bx, 12.60.Jv, 13.85.-t △ Less", "The most general Lagrangian for a model with two U(1) gauge symmetries contains a renormalizable operator which mixes their gauge kinetic terms. Such kinetic mixing can be generated at arbitrarily high scales but will not be suppressed by large masses. In models whose supersymmetry (SUSY)-breaking hidden sectors contain U(1) gauge factors, we show that such terms will generically arise and communicate SUSY-breaking to the visible sector through mixing with hypercharge. In the context of the usual supergravity- or gauge-mediated communication scenarios with D-terms of order the fundamental scale of SUSY-breaking, this effect can destabilize the gauge hierarchy. Even in models for which kinetic mixing is suppressed or the D-terms are arranged to be small, this effect is a potentially large correction to the soft scalar masses and therefore introduces a new measurable low-energy parameter. We calculate the size of kinetic mixing both in field theory and in string theory, and argue that appreciable kinetic mixing is a generic feature of string models. We conclude that the possibility of kinetic mixing effects cannot be ignored in model-building and in phenomenological studies of the low-energy SUSY spectra. △ Less", "A solution of the doublet-triplet splitting problem in the supersymmetric $SU(6)$ gauge theory is suggested. The `missing doublet' multiplet -- 175-plet of the $SU(6)$ group as well as the custodial $SU(2)_{cus}$ global symmetry play crucial role for achieving the doublet-triplet hierarchy. Two examples in which the doublet-triplet splitting occurs naturally are presented. △ Less", "The radiative decay of the next-to-lightest neutralino into a lightest neutralino and a photon is analyzed in the MSSM. We find that significant regions of the supersymmetric parameter space with large radiative BR's (up to about 100%) do exist. The radiative channel turns out to be enhanced when the neutralino tree-level decays are suppressed either \"kinematically\" or \"dynamically\". In general, in the regions allowed by LEP data and not characterized by asymptotic values of the SuSy parameters, the radiative enhancement requires tan beta ~= 1 and/or M_1 ~= M_2, and negative values of μ. We present typical specific scenarios where these \"necessary\" conditions are fulfilled, relaxing the usual relation M_1=(5/3)*tan^2(th_W)*M_2. The influence of varying the stop masses and mixing angle when the radiative decay is enhanced is also considered. Some phenomenological consequences of the above picture are discussed. △ Less", "Many of the ingredients are explored which are needed to develop a super- symmetric SO(10) x U(1)_F grand unified model based on the Yukawa structure of a model previously constructed in collaboration with S. Nandi to explain the quark and lepton masses and mixings in a particular neutrino scenario. The U(1)_F family symmetry can be made anomaly-free with the introduction of one conjugate pair of SO(10)-singlet neutrinos with the same U(1)_F charge. Due to a plethora of conjugate pairs of supermultiplets, the model develops a Landau singularity within a factor of 1.5 above the GUT scale. With the imposition of a Z_2 discrete symmetry and under certain conditions, all higgsino triplets can be made superheavy while just one pair of higgsino doublets remains light and results in mass matrix textures previously obtained from the bottom-up approach. Diametrically opposite splitting of the first and third family scalar quark and lepton masses away from the second family ones results from the nonuniversal D-term contributions. △ Less", "Recently one of the authors proposed a dual theory of a Supersymmetric Standard Model (SSM), in which it is naturally understood that at least one quark (the top quark) should be heavy, i.e., almost the same order as the weak scale, and the supersymmetric Higgs mass parameter $μ$ can naturally be expected to be small. However, the model cannot have Yukawa couplings of the lepton sector. In this paper, we examine a dual theory of a Supersymmetric Model with the Pati-Salam gauge group $SU(4)_{PS}\\times SU(2)_L\\times SU(2)_R $ with respect to the gauge group $SU(4)_{PS}$. In this scenario, Yukawa couplings of the lepton sector can be induced. In this model the Pati-Salam breaking scale should be around the SUSY breaking scale. △ Less"]