["The non-perturbative renormalization group (NPRG) is applied to analysis of tunnelling in quantum mechanics. The vacuum energy and the energy gap of anharmonic oscillators are evaluated by solving the local potential approximated Wegner-Houghton equation (LPA W-H eqn.). We find that our results are very good in a strong coupling region, but not in a very weak coupling region, where the dilute gas instanton calculation works very well. So it seems that in analysis of quantum tunnelling, the dilute gas instanton and LPA W-H eqn. play complementary roles to each other. We also analyze the supersymmetric quantum mechanics and see if the dynamical supersymmetry (SUSY) breaking is described by NPRG method. △ Less", "We analyze constraints on the parameters of the R-parity violating supersymmetry which can be extracted from non-observation of the neutrinoless nuclear double beta decay ($0νββ$) at a given half-life lower bound. Our analysis covers a large class of phenomenologically viable R-parity violating SUSY models. We introduce special characteristics: the SUSY sensitivity of a $ββ$ decaying isotope and the SUSY reach of a $0νββ$ experiment. The former provides a physical criterion for a selection of the most promising isotopes for SUSY searches and the latter gives a measure of success for a $0νββ$ experiment in exploring the R-parity violating SUSY parameter space. On this basis we discuss prospects for exploration of supersymmetry in various $0νββ$ experiments. △ Less", "We demonstrate that soft SUSY breaking introduced via replacement of the couplings of a rigid theory by spurion superfields has far reaching consequences. Substituting these modified couplings into renormalization constants, RG equations, solutions to these equations, fixed points, finiteness conditions, etc., one can get corresponding relations for the soft terms by a simple Taylor expansion over the Grassmannian variables. This way one can get new solutions of the RG equations. Some examples including the MSSM, SUSY GUTs and the N=2 Seiberg-Witten model are given. △ Less", "The determination of the full SUSY QCD corrections to the production of squarks, gluinos and gauginos at hadron colliders is reviewed. The NLO corrections stabilize the theoretical predictions of the various production cross sections significantly and lead to sizeable enhancements of the most relevant cross sections. We discuss the phenomenological consequences of the results on present and future experimental analyses. △ Less", "We explore in a model independent way the possibility of achieving the non supersymmetric gauge coupling unification within left-right symmetric models, with the minimal particle content at the left-right mass scale which could be as low as 1 TeV in a variety of models, and with a unification scale M in the range $10^5$ GeV $< M< 10^{17.7}$ GeV. △ Less", "By an explicit calculation we show that in ordinary SU(5) logarithmic divergence in the amplitude of $μ\\to eγ$ cancels among diagrams and remaining finite part is suppressed by at least $1/M_{GUT}^2$. In SUSY SU(5), when the effect of flavour changing wave function renormalization is taken into account such logarithmic correction disappears, provided a condition is met among SUSY breaking masses. In SUGRA-inspired SUSY GUT the remaining logarithmic effect is argued not to be taken as a prediction of the theory. △ Less", "In most supersymmetric theories, charginos $\\tildeχ^\\pm_{1,2}$, mixtures of charged color-neutral gauginos and higgsinos, belong to the class of the lightest supersymmetric particles. They are easy to observe at $e^+e^-$ colliders. By measuring the total cross sections and the left-right asymmetries with polarized electron beams in $e^+e^-\\to\\tildeχ_i^-\\tildeχ_j^+ [i,j=1,2]$, the chargino masses and the gaugino-higgsino mixing angles can be determined. From these observables the fundamental SUSY parameters can be derived: the SU(2) gaugino mass $M_2$, the modulus $|μ|$ and $\\cos Φ_μ$ of the higgsino mass parameter, and $\\tanβ= v_2/v_1$, the ratio of the vacuum expectation values of the two neutral Higgs doublet fields. The solutions are unique; the CP-violating phase $Φ_μ$ can be determined uniquely by analyzing effects due to the normal polarization of the charginos. △ Less", "Characteristic examples are presented of scenarios of particle production and decay in supersymmetry models in which the supersymmetry breaking is transmitted to the observable world via gauge interactions. The cases are chosen to illustrate the main classes of LHC phenomenology that can arise in these models. A new technique is illustrated that allows the full reconstruction of supersymmetry events despite the presence of two unobserved particles. This technique enables superparticle masses to be measured directly rather than being inferred from kinematic distributions. It is demonstrated that the LHC is capable of making sufficient measurements so as to severely over-constrain the model and determine the parameters with great precision △ Less", "A worldsheet approach to the study of non-abelian D-particle dynamics is presented based on viewing matrix-valued D-brane coordinate fields as coupling constants of a deformed sigma-model which defines a logarithmic conformal field theory. The short-distance structure of spacetime is shown to be naturally captured by the Zamolodchikov metric on the corresponding moduli space which encodes the geometry of the string interactions between D-particles. Spacetime quantization is induced directly by the string genus expansion and leads to new forms of uncertainty relations which imply that general relativity at very short-distance scales is intrinsically described by a non-commutative geometry. The indeterminancies exhibit decoherence effects suggesting the natural incorporation of quantum gravity by short-distance D-particle probes. Some potential experimental tests are briefly described. △ Less", "Three topics on phenomenology in supersymmetric models are reviewed, namely, the Higgs sector in the supersymmetric model, B and K meson decay in the supergravity model and lepton flavor violation processes in supersymmetric grand unified theory. △ Less", "Lepton-flavour violating processes, such as $μ\\to eγ$, are studied in ordinary (non-SUSY) SU(5) and SUSY SU(5) grand unified theories. First given are some introductory argument on the mechanism of U.V. divergence cancellation in flavour changing neutral current processes and on the decoupling of particles with GUT scale masses . We next see that such general argument is confirmed by an explicit calculation of the amplitude of $μ\\to eγ$ in ordinary SU(5), which shows that logarithmic divergence really cancels among diagrams and remaining finite part are suppressed by at least $1/M_{GUT}^2$. In SUSY SU(5), flavour changing slepton mass-squared term get a logarithmic correction, as recently claimed. However, when the effect of flavour changing wave function renormalization is also taken into account such logarithmic correction turns out to disappear, provided a condition is met among SUSY breaking soft masses. In SUGRA-inspired SUSY GUT, such condition is not satisfied. But the remaining logarithmic effect is argued not to be taken as a prediction of the theory associated with an irrelevant operator. We find that the log-correction should not exist in models with gauge mediated SUSY breaking. △ Less", "We study the observability of the squarks and gluinos in CMS at LHC. Classical E_T^miss + jets final state as well as a number of additional multilepton signatures (0 leptons, 1 lepton, 2 leptons of the same sign, 2 leptons of the opposite sign and 3 leptons) are investigated . The detection of these sparticles relies on the observation of an excess of events over Standard Model background expectations. The study is made in the framework of a minimal SU(5) mSUGRA model as a function of m_0, m_1/2 for 4 sets of model parameters : tan(beta) = 2 or 35 and sign(mu) = +/- 1 and for fixed value of A_0 = 0. The CMS detector response is modelled using CMSJET 4.51 fast MC code (non-GEANT). The results obtained are presented as 5 sigma detection contours in the m_0, m_1/2 planes and with optimized selection cuts in various regions of the parameter space. The result of these investigations is that with integrated luminosity L=10^5 pb^-1 the squark and gluino mass reach is about 2.5 TeV and covers most of the interesting parts of parameter space according to neutralino relic density expectations. The influence of signal and background cross-section uncertainties on the reach contours is estimated. The effect of pile-up on signal and background is also discussed. This effect is found to be insignificant for E_T^miss and single lepton signatures, whilst only a minor deterioration is seen for multilepton final states. △ Less", "Abelian non-topological solitons with Baryon and/or Lepton quantum numbers naturally appear in the spectrum of the minimal supersymmetric standard model. They arise as a consequence of the existence of flat directions in the potential lifted by non renormalizable operators and SUSY breaking. We examine the conditions that these operators should satisfy in order to ensure proton stability and present a realistic string model which fulfils these requirements. We further identify a generic U(1) breaking term in the scalar potential and discuss its effect of rendering Q-balls unstable. △ Less", "We calculate stop stop Higgs production at the linear collider. Combining the measurements from the pair production of the lightest stop and that of the mass of the Higgs we show how, in a scenario where only the lightest stop and the lightest Higgs were accessible, one could extract the mass of the heavier stop and infer some useful information on the SUSY parameters. △ Less", "A U(2) flavor symmetry can successfully describe the charged fermion masses and mixings, and supress SUSY FCNC processes, making it a viable candidate for a theory of flavor. We show that a direct application of this U(2) flavor symmetry automatically predicts a mixing of 45 degrees for nu_mu to nu_s, where nu_s is a light, right-handed state. The introduction of an additional flavor symmetry acting on the right-handed neutrinos makes the model phenomenologically viable, explaining the solar neutrino deficit as well as the atmospheric neutrino anomaly, while giving a potential hot dark matter candidate and retaining the theory's predictivity in the quark sector. △ Less", "Supersymmetric flat directions allow a generic counterexample to the phenomenon of symmetry restoration at high temperatures. We show that (exponentially) large VEVs can be developed along these directions through temperature-induced `dimensional transmutation'. A minimum with broken gauge charges (e.g. electric charge) can exist at arbitrarily high temperatures. In such a scenario magnetic monopoles are never formed, independent of whether inflation occurs before or after the GUT phase transition, or whether it occurs at all. △ Less", "The SUSY CP problem in the framework of gauge mediated SUSY breaking model is considered. We first discuss the electric dipole moments of the electron and neutron, which are likely to be larger than the experimental upper bound if all the phases in the Lagrangian are O(1). We derive a constraint on the phases in the so-called $μ$- and $B_μ$-parameters and gaugino masses. Then, we discuss a model in which the CP violating phase can be adequately suppressed. If the $μ$- and $B_μ$-parameters originate from the same superpotential interaction as the SUSY breaking field, the CP violating phase vanishes. However, in this class of models, the ratio $B_μ/μ$ becomes too large, and we discuss a possible scenario to fix this problem. △ Less", "A possibility to measure the spin and spin-spin correlations of a chargino pair is investigated in the process electron positron -> chargino_1 anti-chargino_1 -> (neutralino_1 quark anti-quark) (neutralino_1 quark anti-quark) at future linear-collider energies. The total and the differential cross sections are calculated by the GRACE system which allows for the full spin correlation. Experimental sensitivity of the measurements are examined by assuming the limited detector resolution, the initial state radiation and the beam-beam effect (beamstrahlung). It is found that generally the spin-spin correlation can only be measured with a lower sensitivity than the chargino spin itself. The dependence of the correlation measurements on the relevant SUSY parameters can be seen for a light sneutrino case, but the situation becomes worse for a heavier sneutrino. △ Less", "Considering that the soft SUSY breaking scalar masses come from a vacuum expectation value of the D-term for an external gauge multiplet, the renormalization of the scalar masses is related to the gauge anomaly. Then, if the external gauge symmetry is anomaly-free and has no kinetic mixing with the other U(1) gauge symmetries, the scalar masses are non-renormalized at all orders assuming that the gaugino masses are negligibly small compared with the scalar masses. Motivated by this, we construct models where the sfermion masses for the first-two generations are much heavier than the other superparticles in the minimal SUSY standard model in a framework of the anomalous U(1) mediated SUSY breaking. In these models we have to introduce extra chiral multiplets with the masses as large as those for the first-two generation sfermions. We find that phenomenologically desirable patterns for the soft SUSY breaking terms can be obtained in the models. △ Less", "I review selected topics in supersymmetry, including: effects of non-universality, high $\\tanb$ and phases on SUSY signals; a heavy gluino as the LSP; gauge-mediated SUSY signals involving delayed decays; R-parity violation and the very worst case for SUSY discovery; some topics regarding Higgs bosons in supersymmetry; and doubly-charged Higgs and higgsinos in supersymmetric left-right symmetric models. I emphasize scenarios in which detectionof supersymmetric particles and/or the SUSY Higgs bosons might require special experimental and/or analysis techniques. △ Less", "Supersymmetry implies that the trilinear couplings between gauge bosons and gauginos are equal to all orders in perturbation theory. However if SUSY is broken and some of the superpartners have large SUSY breaking masses then they can induce non-decoupling deviations in this relation through radiative corrections. In this article we show that the deviation in the ratio of triple gauge to gaugino couplings from unity can be around 2.3% (3.3%) in heavy QCD models (2-1 models). Precision measurements of triple gaugino couplings at furture high energy colliders can therefore probe such violations and the existence of heavy superparticles in the multi Tev region which would otherwise be inaccessible. △ Less", "The lightest neutralino in supersymmetric models with conserved R-parity is an attractive candidate for non-luminous matter in the universe. If relic neutralinos are indeed present as dark matter in our galaxy, they can be directly detected in scattering experiments. This could serve as an independent search channel for supersymmetry complementary to collider experiments. I compare the sensitivity of direct detection experiments with the reach for supersymmetry at collider facilities in the framework of the minimal supergravity model. △ Less", "In collaboration with G.D. Moore, the electroweak phase transition in the minimal supersymmetric standard model is studied using the two-loop effective potential. We make a comprehensive search of the MSSM parameter space consistent with electroweak baryogenesis, taking into account various factors: the latest experimental constraints on the Higgs boson mass and the rho parameter, the possibility of significant squark and Higgs boson mixing, and the exact rate of bubble nucleation and sphaleron transitions. Most of the baryogenesis-allowed regions of parameter space will be probed by LEP 200, hence the Higgs boson is likely to be discovered soon if the baryon asymmetry was indeed created during the electroweak phase transition. △ Less", "We analyze the constraints that a correct phenomenology and the absence of dangerous charge and color breaking (CCB) minima or unbounded from below (UFB) directions impose on the parameter space of different superstring and M-theory scenarios. Namely, we analyze in detail the case where supersymmetry (SUSY) breaking is driven by non-vanishing dilaton and/or moduli F-terms in weakly and strongly coupled strings, and the specific case where the mechanism of SUSY breaking is gaugino condensation with or without the participation of non-perturbative contributions to the K{ä}hler potential. The results indicate that, only in some small windows of the parameter space all the previous tests are succesfully passed. We also discuss the impact of non-universality of the soft breaking terms on CCB/UFB bounds. △ Less", "The MSSM with a light right-handed stop and supersymmetric models with a singlet whose vev is comparable to that of the SU(2)_W Higgs allow for a strongly first-order electroweak phase transition even for a mass of the lightest Higgs around 100 GeV. After a short review of the standard model situation we discuss these supersymmetric models. We also compare perturbative calculations based on the dimensionally reduced 3-dimensional action with lattice results and present an analytic procedure based on an analogue of the stochastic vacuum model of QCD to estimate the nonperturbative contributions. △ Less", "We examine charge/colour breaking along directions in supersymmetric field space which are F and D-flat. We catalogue the dangerous directions and include some new ones which have not previously been considered. Analytic expressions for the resulting constraints are provided which are valid for all patterns of supersymmetry breaking. As an example we consider a recently proposed pattern of supersymmetry breaking derived in Horava-Witten M-theory, and show that there is no choice of parameters for which the physical vacuum is a global minimum. △ Less", "It is shown that softly broken theory is equivalent to a rigid theory in external spurion superfield. The singular part of effective action in a broken theory follows from a rigid one by a simple redefinition of the couplings. This gives an explicit relation between the soft and rigid couplings renormalizations. As an illustration the renormalization group functions in the MSSM have been calculated. The method opens a possibility to construct a totally all loop finite N=1 SUSY gauge theory, including the soft SUSY breaking terms. Explicit relations between the soft terms, which lead to a completely finite theory in any loop order, are given. △ Less", "Recent developments in prospects of searching for Higgs particles and testing their properties at the LHC and at TeV e+e- linear colliders are summarized. The discovery limits of supersymmetric particles at the LHC are presented and the accuracy is explored with which the fundamental SUSY parameters in the context of supergravity models can be determined at high-luminosity linear colliders. Finally, new discovery limits for gauge bosons in left-right symmetric models at the LHC are presented. △ Less", "Padé-improvement of four-loop beta-functions in massive phi^4 scalar field theory is shown to predict the known five-loop contribution with astonishing (0.2%) accuracy, supporting the applicability of Pade-summations for approximating all-orders MS-bar QCD beta-functions, as suggested by Ellis, Karliner, and Samuel. Surprisingly, the most general set of [2|2] approximants consistent with known two-, three-, and four-loop contributions to the QCD beta-function with up to six flavours fail to exhibit any zeros that could be interpreted as positive infrared fixed points, regardless of the unknown five-loop term. When they occur, positive zeros of such [2|2] approximants are preceded by singularities, leading to a double-valued beta-function that is decoupled entirely from the infrared region, similar to the beta-function of SUSY gluodynamics. △ Less", "A new superstring-motivated framework for a treatment of SU(N) SUSY GUTs is argued. We show that all the present difficulties of the minimal supersymmetric SU(5) model can successfully be overcome with a new renormalizable reflection-invariant superpotential with two-adjoint scalars, one of which is interpreted as a massive string mode essentially decoupled from the low-energy particle spectra. This superpotential is proved to properly fix a mass ratio of the basic adjoint scalar moduli, while its gauge-type reflection symmetry essentially protects the model from gravitational smearing. The significant heavy threshold effect related with the generic mass splitting of adjoint moduli is shown to alter appropriately the running of gauge couplings towards the realistic string-scale grand unification. Furthermore, the extension of the superpotential to some SU(N) GUTs gives rise to, among many degenerate vacua, the missing VEV vacuum configuration for the basic adjoint scalar, thus providing a further clue to a doublet-triplet splitting problem, on the one hand, and a family symmetry $SU(N-5)_F$ for quarks and leptons, on the other. We predict the existence on a TeV scale two or three families of pseudo-Goldstone bosons of type ($5+\\bar{5}$) + SU(5)-singlets depending on SU(7) or SU(8) GUT selected. △ Less", "We present a model in which the same modulus field breaks both SUSY and a simple GUT gauge group down to the SM gauge group. The modulus is stabilized by the inverted hierarchy mechanism in a perturbative region so that the model is calculable. This is the first example of this kind in the literature. All mass scales (other than the Planck scale) are generated dynamically. In one of the models doublet-triplet splitting is achieved naturally by the sliding singlet mechanism while another model requires fine tuning. The gauge mediation contribution to the right handed slepton (mass)$^2$ is negative. But, for the modulus vacuum expectation value close to the GUT scale, the supergravity contribution to the slepton (mass)$^2$ is comparable to the gauge mediation contribution and thus a realistic spectrum can be attained. △ Less", "The spectrum of MSSM admits solitons carrying baryonic charge, or B-balls. In an inflationary universe they can be produced in significant numbers by a break-up of a scalar condensate along the flat directions. It is shown that if SUSY breaking is mediated to the observable sector by gravity, B-balls are unstable but decay to baryons and LSPs typically well below the electroweak phase transition. It is argued that B-balls could be the source of most baryons and cold dark matter in the universe, with their number densities related by $n_{LSP}\\simeq 3n_{B}$. For B-balls to survive thermalization, the reheating temperature after inflation should be less than about $10^{3}$ GeV. △ Less", "The sources of lepton flavour and lepton number violation in the left-right symmetric models are reviewed and the most sensitive processes to these violations are discussed. Both the non-SUSY and SUSY versions of the theories are considered. Present and future experimental constraints at low as well as at high energies are discussed. Some emphasis has been put on the doubly charged particle production at future colliders. △ Less", "We examine whether parameters related to the Higgs sector of the minimal supersymmetric standard model can be determined by detailed study of the production cross section and decay branching ratios of the Higgs boson. Assuming that only the light Higgs boson will be observed at a future $e^+e^-$ linear collider with $\\sqrt{s}=300\\sim500$ GeV, we show that values of $m_{susy}$ and $\\tanβ$ are restricted within a narrow region in the $m_{susy}$ versus $\\tanβ$ plane by the combined analysis of the light Higgs properties. It is also pointed out that, in some case, $\\tanβ$ may be restricted to a relatively small value, $\\tanβ=1\\sim5$. △ Less", "The most general QCD-NLO Anomalous-Dimension Matrix of all four-fermion dimension six Delta F=2 operators is presented. Two applications of this Anomalous-Dimension Matrix to the study of SUSY contribution to K- Kbar mixing are also discussed. △ Less", "In the minimal SU(5) SUSY GUT $d =5$ operators lead to $p\\to K^+ ν$ decay with the proton life time of the order of $10^{28}$ years for the natural choice of the parameters of the theory. This value is in strong contradiction with experimental bound $τ_{p\\to Kν} > 10^{32}$ years. $d=5$ operators are induced by colored Higgsino exchanges and are closely (through SU(5) and super symmetry) related to another wrong prediction of SU(5) SUSY GUT: $m_d /m_s = m_e /m_μ$. We demonstrate how in the model where reasonable pattern of quark and lepton masses and CKM mixing angles are obtained proton decay can be suppressed and proton life time can be close to the present experimental bound. △ Less", "Phenomenological aspects of flavor changing processes are considered in the context of the supergravity model.Various flavor changing neutral current processes in B and K decays are calculated in such models. For lepton flavor violating processes the $μ^+ \\to e γ$ branching ratio and the T odd triple vector correlation for the $μ^+ \\to e^+ e^+ e^-$ process are investigated in the SU(5) SUSY GUT. Possibility to find SUSY effects through these Flavor changing processes in future experiments are also discussed. △ Less", "We study the low-energy spectrum of SUSY gluodynamics using the generating functional for Green's functions of composite fields. Two dual formulations of the generating functional approach are given. Masses of the bound states are calculated and mixing patterns are discussed. Mass splittings of pure gluonic states, in the case when supersymmetry is softly broken, are consistent with predictions of conventional Yang-Mills theory. The results can be tested in lattice simulations of the SUSY Yang-Mills model. △ Less", "The theoretical status of MSSM particle production at the hadron colliders Tevatron and LHC is reviewed, including next-to-leading order supersymmetric QCD corrections. The higher-order corrections significantly reduce the theoretical uncertainty and lead to a rise of the lower bounds on supersymmetric particle masses, as demonstrated for the case of top-squark and gaugino pair production at the Tevatron. △ Less", "For large values of the minimal supergravity model parameter $\\tanβ$, the tau lepton and the bottom quark Yukawa couplings become large, leading to reduced masses of $τ$-sleptons and $b$-squarks relative to their first and second generation counterparts, and to enhanced decays of charginos and neutralinos to $τ$-leptons and $b$-quarks. We evaluate the reach of the CERN LHC $pp$ collider for supersymmetry in the mSUGRA model parameter space. We find that values of $m_{\\tg}\\sim 1500-2000$ GeV can be probed with just 10 fb$^{-1}$ of integrated luminosity for $\\tanβ$ values as high as 45, so that mSUGRA cannot escape the scrutiny of LHC experiments by virtue of having a large value of $\\tanβ$. We also perform a case study of an mSUGRA model at $\\tanβ=45$ where $\\tz_2\\to τ\\ttau_1$ and $\\tw_1\\to \\ttau_1ν_τ$ with $\\sim 100%$ branching fraction. In this case, at least within our simplistic study, we show that a di-tau mass edge, which determines the value of $m_{\\tz_2}-m_{\\tz_1}$, can still be reconstructed. This information can be used as a starting point for reconstructing SUSY cascade decays on an event-by-event basis, and can provide a strong constraint in determining the underlying model parameters. Finally, we show that for large $\\tanβ$ there can be an observable excess of $τ$ leptons, and argue that $τ$ signals might serve to provide new information about the underlying model framework. △ Less", "The physics at the planned $e^+e^-$ colliders is discussed around three main topics corresponding to different manifestations of symmetry breaking: $W$ physics in the no Higgs scenario, studies of the properties of the Higgs and precision tests of SUSY. A comparison with the LHC is made for all these cases. The $γγ$ mode of the linear collider will also be reviewed. △ Less", "We present the first lattice measurement, using Non Perturbative Renormalization Method, of the B-parameters of the dimension-six four-fermion operators relevant for the supersymmetric corrections to the $ΔS=2$ transitions. △ Less", "An overview of hints for new physics outside the Standard Model and the status of sparticle and Higgs searches is given. The present limits on Higgs bosons of about 90 GeV as well as the $\\bsg$ rate and cosmological constraints severely restrict the available parameter space of the MSSM. △ Less", "The magnitude of R-parity violating coupling constants depends on which direction in the space of weak doublets with hypercharge = -2 corresponds to the Higgs. To address this ``basis dependence'', one can construct combinations of coupling constants that are invariant under these basis transformations, and which parametrise how much R parity violation is present in the Lagrangian (analogous to Jarlskog invariants for CP violation). This has previously been done for the Higgs vev and the R parity violating couplings constants in the superpotential. In this letter, I build invariants that include soft SUSY breaking interactions, and briefly discuss their relation to invariants involving the Higgs vev. This completes the construction of invariants based on the MSSM with baryon parity. △ Less", "We explore the possibility of achieving one--step unification of the standard model coupling constants within non supersymmetric and supersymmetric gauge models, which at low energies have only the standard particle content. The constraints are the experimental values of $α_{em}$, $α_s$ and $\\sin^2θ_W$ at $10^2 GeV$, and the lower bounds for FCNC and proton decay rates. The analysis is done in a model independent way. △ Less", "The Higgs sector of the minimal supersymmetric standard model (MSSM) consists of five physical Higgs bosons, which offer a variety of channels for their experimental search. The present study aims to further our understanding of the Tevatron reach for MSSM Higgs bosons, addressing relevant theoretical issues related to the SUSY parameter space, with special emphasis on the radiative corrections to the down--quark and lepton couplings to the Higgs bosons for large $\\tanβ$. We performed a computation of the signal and backgrounds for the production processes $Wφ$ and $b \\bar{b} φ$ at the upgraded Tevatron, with $φ$ being the neutral MSSM Higgs bosons. Detailed experimental information and further higher order calculations are demanded to confirm/refine these predictions. △ Less", "We discuss neutrino masses in the framework of a minimal extension of the minimal supersymmetric standard model (MSSM) consisting of an additional single right-handed neutrino superfield $N$ with a heavy Majorana mass $M$, which induces a single light see-saw mass $m_{ν_3}$ leaving two neutrinos massless at tree-level. This trivial extension to the MSSM may account for the atomospheric neutrino data via $ν_μ\\to ν_τ$ oscillations by assuming a near maximal mixing angle $θ_{23}\\sim π/4$ and taking $Δm_{23}^2 \\sim m_{ν_3}^2 \\sim 2.5\\times 10^{-3} eV^2$. In order to account for the solar neutrino data we appeal to one-loop radiative corrections involving internal loops of SUSY particles, which we show can naturally generate an additional light neutrino mass $m_{ν_{2}}\\sim 10^{-5} eV$ again with near maximal mixing angle $θ_{12}\\sim π/4$. The resulting scheme corresponds to so-called ``bi-maximal'' neutrino mixing involving ``just-so'' solar oscillations. △ Less", "Neutrinoless double beta decay is a sensitive probe of the patterns of neutrino masses and mixings if the neutrinos are Majorana particles as well as other new physics scenarios beyond the standard model. In this talk, the present experimental lower bound on the lifetime for $ββ_{0ν}$ is used to constrain the neutrino mixings and set limits on the parameters of the new physics scenarios such as the left-right symmetric models, R-parity violating SUSY models etc which lead to this process. We also discuss proposed high precision searches for $ββ_{0ν}$ decay that can provide extremely valuable insight not only into the nature of neutrino mixings and masses but also put constraints on (or even rule out) new physics scenarios. △ Less", "If supersymmetry is spontaneously at a low energy scale then the resulting gravitino would be very light. The interaction strength of the longitudinal components of such a light gravitino to electron-selectron pair then becomes comparable to that of electroweak interactions. Such a light gravitino could modify the cross-section for $e^_L e^_R-->\\tilde {e}_L\\tilde {e}_R$ from its MSSM value. Precision measurement of this cross-section could therefore be used to probe the low energy SUSY breaking scale. △ Less", "We study the $p\\bar p$ production and decay of exotic quarks that are predicted by the SU(3)$\\times$U(1) extension of the Standard Model. We show that recent experimental searches for SUSY particles at the Tevatron limit the mass of these quarks to be above 250 GeV. Run II will extend the reach to 320 GeV. This is one example of SUSY search signatures that apply directly to another, quite different, new physics model. △ Less", "The interplay between gaugino condensation and an anomalous Fayet-Iliopoulos term in string theories is not trivial and has important consequences concerning the size and type of the soft SUSY breaking terms. In this paper we examine this issue, generalizing previous work to the supergravity context. This allows, in particular, to properly implement the cancellation of the cosmological constant, which is crucial for a correct treatment of the soft breaking terms. We obtain that the D-term contribution to the soft masses is expected to be larger than the F-term one. Moreover gaugino masses must be much smaller than scalar masses. We illustrate these results with explicit examples. All this has relevant phenomenological consequences, amending previous results in the literature. △ Less", "We discussed neutrino masses and mixings in SUSY SO(10) model where quarks and leptons have Yukawa couplings to at least two 10 and one $\\bar{126}$ Higgs scalars. In this model, the Dirac and the right-handed Majorana mass terms are expressed by linear combinations of quark and charged lepton mass matrices, which then determine the neutrino mass matrix by the see-saw mechanism. We show that there are various solutions to reproduce a large mixing angle for $ν_μ-ν_τ$ and a small mixing angle for $ν_e-ν_μ$, as well as the hierarchical mass spectrum of neutrinos. △ Less", "Supersymmetric standard model with softly broken lepton symmetry provides a suitable framework to accommodate the solar and atmospheric neutrino anomalies. This model contains a natural explanation for large mixing and hierarchal masses without fine tuning of the parameters. Neutrino spectrum is particularly constrained in the minimal messenger model (MMM) of gauge mediated SUSY breaking, since all SUSY breaking effects are controlled in MMM by a single parameter. We study the structure of neutrino masses and mixing both in MMM and in simple extensions of it in the context of solar and atmospheric neutrino anomalies. △ Less", "A preliminary combined mass limit of about 90 GeV has been reported for the Minimal Standard Model Higgs boson from the 183 GeV data taken in 1997, with a total luminosity of about 200 pb-1. Similar mass limits have been reported from the individual LEP experiments based on the first 1998 data at 189 GeV with up to 40 pb-1 each. For the first time the LEP experiments have made a common effort to derive preliminary combined limits in the Minimal Supersymmetric extension of the Standard Model. For three MSSM benchmark parameter sets, mass limits for the lighter scalar of 77 GeV and for the pseudoscalar of 78 GeV have been derived. In a more general parameter scan unexcluded mass regions have been revealed. An independent variation of the SUSY parameters results in cancellation effects of production cross sections and thus some parameter regions are not excluded in this more general framework. Direct and indirect limits from other SUSY particle searches have been taken into account. △ Less", "We present some results of the calculation of MSSM one-loop contributions to strong $t \\bar t$ production in hadronic collisions. Here we concentrate on the MSSM electroweak-like O(α) and SQCD O(α_s) corrections to the main production mechanism at the Fermilab Tevatron $p \\bar p$ collider, $q\\bar q\\to g \\to t \\bar t$. We give results for the total $t \\bar t$ production rate and for parity violating asymmetries in the production of left and right handed top quark pairs. △ Less", "The excess of high $Q^2$ events at HERA reported in the early 1997 by H1 and ZEUS collaborations has become the subject of extensive studies in the framework of several models related to new physics. Here we concentrate on the most promising, from our point of view, model describing HERA anomaly. We update our previous analysis and take into account new HERA statistics of the 1997 year. HERA events are considered within the R-parity broken SUSY model for a specific scenario with several non-zero couplings. R-parity broken SUSY with several non-zero couplings could explain both high $Q^2 e^+ + jets$ and $μ^+ + jets$ observed at HERA. The consequence of such a particular scenario is the excess of high $Q^2$ di- or tri-jet events at HERA. The relation of this scenario for LEP and TEVATRON colliders is considered. This study shows that if a squark resonance does take place at HERA, supersymmetry with broken R-parity can be revealed at either LEP200 or TEVATRON in the near future. △ Less", "We survey strategies generally employed for SUSY discovery at colliders and then discuss how these may have to be altered for SUSY searches at the Tevatron if $\\tanβ$ is large. We also discuss the reach of the Tevatron and the LHC in gauge-mediated SUSY breaking scenarios, assuming that the NLSP decays into photons. Finally, we briefly recapitulate measurements (which serve to guide us to the underlying theory) that might be possible at future colliders if supersymmetry is discovered. △ Less", "In this talk, we summarize our recent proposal for lowering the scale of grand unification to the TeV range though the appearance of extra spacetime dimensions. Particular emphasis is placed on the perturbativity and predictivity of our scenario, as well as its sensitivity to unification-scale effects. (Proceedings of invited talks given by KRD at PASCOS '98; by TG at the European Network Meeting ``From the Planck Scale to the Electroweak Scale''; and by KRD and TG at SUSY '98.) △ Less", "We consider tree-level corrections to hypercharge changing semileptonic decays of certain baryons induced by a minimal supersymmetric standard model with explicitly broken R-parity via $L$-violation. This study leads to a new set of constraints on the products of couplings arising from the LQd$^c$ operator of the superpotential. △ Less", "Study of the MSSM in large tan$β$ regime has to include correlations between the constraints presented by the low energy values of the b quark mass and $BR(b\\to sγ)$. Both quantities receive SUSY contributions enhanced by tan$β$ and have a major impact on the MSSM analysis. Here we summarize the results of such a study constrained by minimal SO(10) unification. We show the best fits, in the $(m_0,M_{1/2})$ plane, obtained in the global analysis spanned over the gauge, Yukawa and SUSY parameter space at the unification scale. Two distinct fits describe the available low-energy data very well. The fits differ by the overall sign of the $b\\to sγ$ decay amplitude. We conclude that an attractive SO(10)-derived regime of the MSSM remains a viable option. △ Less", "In the supersymmetric models with nontrivial flavour structure in the soft-breaking sector the exchange of neutral Higgses mediates $ΔF=2$ transitions. This mechanism is studied for $ΔS, ΔB=2$ processes and for a generic form of the soft-breaking terms. We find that Higgs-mediated FCNC amplitudes increase very rapidly with $\\tanβ$ and can exceed $SUSY$ box contribution by up to two orders of magnitude when $\\tanβ\\sim m_t/m_b$. △ Less", "The characteristic property of the $Z_2\\times Z_2$ orbifold is its cyclic permutation symmetry. It is argued that this property may be instrumental in explaining simultaneously the fermion mass hierarchy and the squark mass degeneracy. Detailed studies in free fermionic models that preserve the cyclic permutation symmetry of anomalous U(1) charges of the three generations are discussed. △ Less", "Formation of the $s$-channel slepton resonances at LEP2 or Tevatron at current energies is an exciting possibility in R-parity violating SUSY models. Existing LEP2 and Tevatron data can be exploited to look for sleptons, or to derive bounds on the Yukawa couplings of sleptons to quark and lepton pairs. △ Less", "In this paper we study the experimental consequences of a theory which naturally has a heavy, stable (or almost stable) gluino. We define the boundary conditions at a messenger scale $M \\sim 10^{14}$ GeV which lead to this alternative phenomenologically acceptable version of the minimal supersymmetric standard model. In this theory, either the gluino or the gravitino is the lightest supersymmetric particle [LSP]. If the gravitino is the LSP, then the gluino is the next-to-LSP with a lifetime on the order of 100 years. In either case, the gluino is (for all practical purposes) a stable particle with respect to experiments at high energy accelerators. Thus the standard missing energy signature for SUSY fails. A stable gluino forms a color singlet hadron, the lightest of which is assumed to be an isoscalar gluino-gluon bound state ($R_0$). The $R_0$ has strong interactions and will interact in a hadronic calorimeter; depositing some fraction of its kinetic energy. Finally, in the case the gravitino is the LSP, bounds from searches for stable heavy isotopes of hydrogen or oxygen do not apply to the metastable $R_0$. △ Less", "We discuss the prospects for searches of low-energy supersymmetry in the time interval separating us from the advent of LHC. In this period of time \"indirect\" searches may play a very relevant role. We refer to manifestations of supersymmetry in flavour changing neutral current and CP violating phenomena and to signals of the lightest supersymmetric particle in searches of dark matter. In the first part of the talk we critically review the status of the minimal supersymmetric model to discuss the chances that direct and indirect supersymmetric searches may have before the LHC start. In the second part we point out what we consider to be the most promising grounds where departures from the standard model prediction may signal the presence of new physics, possibly of supersymmetric nature. We argue that the often invoked complementarity of direct and indirect searches of low-energy supersymmetry is becoming even more true in the pre-LHC era. △ Less", "Recently, an interesting class of the direct gauge mediation supersymmetry (SUSY) breaking models are proposed, in which the minimum of the potential of the SUSY breaking field is determined by the inverted hierarchy mechanism. We consider their cosmological implications. In this class of models, SUSY breaking field has a very flat potential, which may have a cosmological importance. Assuming the initial amplitude of the SUSY breaking field to be of the order of the Planck scale, it can be a source of a large entropy production. A special attention is paid to the cosmological moduli problem, and we will see the cosmological mass density of the moduli field can be significantly reduced. △ Less", "Luminosity upgrades of the Fermilab Tevatron pbar-p collider have been shown to allow experimental detection of a Standard Model (SM) Higgs boson up to $m_{H_{SM}}\\sim 120$ GeV via $WH_{SM} \\to \\ellνb\\bar{b}$ events. This limit nearly saturates the parameter space for many models of weak scale supersymmetry (SUSY) with a minimal particle content. It is therefore interesting to examine the SUSY Higgs reach of future Tevatron experiments. Contours are presented of Higgs boson reach for CERN LEP2 and Tevatron luminosity upgrades for three models of weak scale SUSY: the Minimal Supersymmetric Standard Model (MSSM), the minimal Supergravity model (mSUGRA) and a simple Gauge Mediated SUSY Breaking Model (GMSB). In each case we find a substantial gain in reach at the Tevatron with integrated luminosity increasing from 10 fb^{-1} to 25-30 fb^{-1}. With the larger integrated luminosity, a Higgs search at the Tevatron should be able to probe essentially the entire parameter space of these models. While a discovery would be very exciting, a negative result would severely constrain our ideas about how weak scale supersymmetry is realized. △ Less", "In the search for phenomenological evidence of supersymmetry through the indirect method of quantum signatures, it is useful to seek correlations of the non-standard quantum effects in low and high energy proceses, such as those involving on one hand the properties of the B-mesons and on the other hand the physics of the top quark and of the Higgs bosons. There are regions of the MSSM parameter space where the potential quantum SUSY signatures in the two energy regimes are strongly interwoven and therefore the eventual detection of these correlated quantum effects would strongly point towards the existence of underlying supersymmetric dynamics. △ Less", "We describe in detail how perturbations due to the planets can cause a sub-population of WIMPs captured by scattering in surface layers of the Sun to evolve to have orbits which no longer intersect the Sun. We argue that such WIMPs, if their orbit has a semi-major axis less than 1/2 of Jupiter's, can persist in the solar system for cosmological timescales. This leads to a new, previously unanticipated WIMP population intersecting the Earth's orbit. The WIMP-nucleon cross sections required for this population to be significant are precisely those in the range predicted for SUSY dark matter, lying near the present limits obtained by direct underground dark matter searches using cyrogenic detectors. Thus, if a WIMP signal is observed in the next generation of detectors, a potentially measurable signal due to this new population must exist. This signal, lying in the keV range for Germanium detectors, would be complementary to that of galactic halo WIMPs. A comparison of event rates, anisotropies, and annual modulations would not only yield additional confirmation that any claimed signal is indeed WIMP-based, but would also allow one to gain information on the nature of the underlying dark matter model. △ Less", "We study the spectrum of the softly broken generalized Veneziano-Yankielowicz effective action for N=1 SUSY Yang-Mills theory. Two dual formulations of the effective action are given. The spurion method is used for the soft SUSY breaking. Masses of the bound states are calculated and mixing patterns are discussed. Mass splittings of pure gluonic states are consistent with predictions of conventional Yang-Mills theory. The results can be tested in lattice simulations of the SUSY Yang-Mills model. △ Less", "We investigate the low energy structure of the Kahler potential in SUSY QCD with Nf=Nc+1 quark flavors. Since this theory's moduli space is everywhere smooth, a systematic power series expansion of its Kahler potential can be developed in terms of confined meson and baryon fields. Perturbation theory in the supersymmetric sigma model based upon a momentum expansion consistent with naive dimensional analysis and 1/Nf power counting exhibits some similarities with ordinary QCD chiral perturbation theory along with several key differences. We compute meson and baryon wavefunction renormalization as well as Kahler potential operator mixing to leading nontrivial order. We also deduce the asymptotic dependence of the lowest dimension operators' coefficients upon moduli space location along flat directions where the theory is Higgsed down to Nf-1=(Nc-1)+1 SUSY QCD. Although an exact form for the confining phase Kahler potential remains unknown, we find that some detailed Kahler sector information can nevertheless be derived from first principles. △ Less", "A R-parity breaking SUSY model characterized by an effective bilinear violation with only $τ$-lepton number breaking in the superpotential is outlined. The CP-odd Higgs boson masses and those of charged Higgs bosons are discussed. In the model, several interesting mass mixings else such as the mixing between $τ$ lepton and charginos etc in the model are discussed too. Being one of example, we have computed the mixing production $e^{+} e^{-} \\to τ^{\\mp} \\tildeκ^{\\pm}_{i} (i=1,2)$ in e^+ e^- colliders, where $τ^{\\mp}, \\tildeκ^{\\pm}_{i}(i=1,2)$ denote the physical $τ$ lepton and charginos. △ Less", "We follow a minimalistic approach to neutrino masses, by introducing a single heavy singlet $N$ into the standard model (or supersymmetric standard model) with a heavy Majorana mass $M$, which couples as a single right-handed neutrino in a Dirac fashion to leptons, and induces a single light see-saw mass $m_ν\\sim 5\\times 10^{-2} eV$, leaving two neutrinos massless. This trivial extension to the standard model may account for the atomospheric neutrino data via $ν_μ\\to ν_τ$ oscillations with near maximal mixing angle $θ_{23}\\sim π/4$ and $Δm_{μτ}^2 \\sim 2.5\\times 10^{-3} eV^2$. In order to account for the solar neutrino data the model is extended to SUSY GUT/ string-inspired type models which can naturally yield an additional light tau neutrino mass $m_{ν_τ}\\sim few \\times 10^{-3} eV$ leading to $ν_{e L}\\to (\\cos θ_{23}ν_{μL} -\\sin θ_{23}ν_{τL})$ oscillations with $Δm_{e1}^2\\sim 10^{-5} eV^2$ and a mixing angle $\\sin^2 2 θ_1 \\approx 10^{-2}$ in the correct range for the small angle MSW solution to the solar neutrino problem. The model predicts $ν_{e L}\\to (\\sin θ_{23}ν_{μL} +\\cos θ_{23}ν_{τL})$ oscillations with a similar angle but a larger splitting $Δm_{e2}^2 \\sim 2.5\\times 10^{-3} eV^2 $. △ Less", "This work summarizes and puts in an overall perspective studies done within CMS concerning the discovery potential for squarks and gluinos, sleptons, charginos and neutralinos, SUSY dark matter, lightest Higgs, sparticle mass determination methods and the detector design optimisation in view of SUSY searches. It represents the status of our understanding of these subjects as of Summer 1997. As a benchmark model we used the minimal supergravity-inspired super- symmetric standard model (mSUGRA) with a stable LSP. Discovery of SUSY at the LHC should be relatively straightforward. It may occur through the observation of a large excesses of events in missing E_T + jets, or with one or more isolated leptons. An excess of trilepton events or of isolated dileptons with E_T^miss, exhibiting a characteristic signature in the l^+l^- invariant mass distribution could also be the first manifestation of SUSY production. Squark and gluino production may represent a copious source of Higgs bosons through cascade decays. The lightest SUSY Higgs h->bbbar may be reconstructed with a signal/background ratio of order 1. The lightest supersymmetric particle of SUSY models with conserved R-parity represents a very good candidate for the cosmological dark matter. The region of parameter space where this is true is well-covered by our searches, at least for tan(beta)=2. If supersymmetry exists at electroweak scale it could hardly escape detection in CMS, and the study of supersymmetry will form a central part of our physics program. △ Less", "Being strictly forbidden in the standard model, experimental detection of the lepton flavor violating decays $B(\\bar B)\\toτ^+μ^-$ and $b(\\bar b)\\to Xτ^+μ^-$ would constitute an unmistakable indication of new physics. We study these decays in supersymmetric models without R-parity and without lepton number. In order to derive order of magnitude predictions for the branching ratios, we assume a horizontal U(1) symmetry with horizontal charges chosen to explain the magnitude of fermion masses and quark mixing angles. We find that the branching ratios for decays with a $τμ$ pair in the final state are not particularly suppressed with respect to the lepton flavor conserving channels. In general in these models ${\\rm B}[b\\toμ^+μ^-(X)]\\lsim {\\rm B}[b(\\bar b)\\toτ^+μ^-(X)] \\lsim {\\rm B}[b\\toτ^+τ^-(X)]$. While in some cases the rates for final states $τ^+τ^-$ can be up to one order of magnitude larger than the lepton flavor violating channel, due to better efficiencies for muon detection and to the absence of standard model contributions, decays into $τμ$ final states appear to be better suited to reveal this kind of new physics. △ Less", "Recently, models proposing superheavy particles $X$ as source of ultrahigh energy cosmic rays have attracted some interest. The $X$-particles are either metastable relic particles from the early Universe or are released by topological defects. In these models, the detected air-showers are produced by primaries originating from the fragmentation of the $X$-particles. We present the fragmentation spectrum of superheavy particles calculated in SUSY-QCD. Then we discuss the status of the lightest supersymmetric particle as possible ultrahigh energy primary. △ Less", "In the context of the Minimal Supersymmetric extension of the Standard Model, I discuss the effects of relatively light top and bottom scalar quarks on the main production mechanism of the lightest SUSY neutral Higgs boson $h$ at the LHC, the gluon--gluon fusion mechanism $gg \\to h$, and on the most promising discovery channel, the two--photon decay mode $h \\to γγ$. In some areas of the parameter space, the top and bottom squark contributions can strongly reduce the production cross section times the branching ratio. △ Less", "We calculate the order(α_s) SUSY-QCD corrections to the widths of stop and sbottom decays into Higgs bosons within the Minimal Supersymmetric Standard Model. We give the complete analytical formulae paying particular attention to the on-shell renormalization of the soft SUSY-breaking parameters. We also perform a detailed numerical analysis of both stop and sbottom decays into all Higgs bosons h^0, H^0, A^0, and H^\\pm. We find that the SUSY-QCD corrections are significant, mostly negative and of the order of a few ten percent. △ Less", "Charginos $χ_1^\\pm$ are expected to be the lightest observable supersymmetric particles in many supersymmetric models. We present a procedure which will allow to determine the chargino mixing angles and, subsequently, the fundamental SUSY parameters $M_2, μ$ and $\\tanβ$ by measurements of the total cross section and the spin correlations in $e^+e^-$ annihilation to $χ_1^+ χ_1^-$ chargino pairs. △ Less", "In this work, we find the expressions of continuum HQET four-fermion operators in terms of lattice operators in perturbation theory. To do so, we calculate the one--loop continuum--lattice HQET matching for the complete basis of $ΔB=2$ and $ΔB=0$ operators (excluding penguin diagrams), extending and completing previous studies. We have also corrected some errors in previous evaluations of the matching for the operator $O_{LL}$. Our results are relevant to the lattice computation of the values of unknown hadronic matrix elements which enter in many very important theoretical predictions in $B$--meson phenomenology: $B^{0}$-$\\bar{B}^{0}$ mixing, $τ_{B}$ and $τ_{B_{s}}$ lifetimes, SUSY effects in $ΔB=2$ transitions and the $B_{s}$ width difference $ΔΓ_{B_{s}}$. We have reanalyzed our lattice data for the $B_{B}$ parameter of the $B^{0}$-$\\bar{B}^{0}$ mixing on 600 lattices of size $24^{3}\\times 40$ at $β=6.0$ computed with the SW-Clover and HQET lattice actions. We have used the correct lattice--continuum matching factors and boosted perturbation theory with tadpole improved heavy--light operators to reduce the systematic error in the evaluation of the renormalization constants. Our best estimate of the renormalization scale independent $B$--parameter is $\\hat{B}_{B} = 1.29 \\pm 0.08 \\pm 0.06$, where the first error is statistical and the second is systematic coming from the uncertainty in the determination of the renormalization constants. Our result is in good agreement with previous results obtained by extrapolating Wilson data. As a byproduct, we also obtain the complete one--loop anomalous dimension matrix for four--fermion operators in the HQET. △ Less", "We present a detailed description of a search for anomalous production of missing E_T ($\\mett$), jets, leptons ($e, μ, τ$), b-quarks, or additional photons in events containing two isolated, central ($|η|<1.0$) photons with $\\Et > 12$ GeV}. The results are consistent with standard model expectations, with the possible exception of one event that has in addition to the two photons a central electron, a high-E_T electromagnetic cluster, and large $\\mett$. We set limits using two specific SUSY scenarios for production of diphoton events with $\\mett$. △ Less", "In quasi-realistic string models that contain an anomalous U(1) the non-zero Fayet-Iliopoulos term triggers the shifting of the original vacuum to a new one along some flat direction, so that SUSY is preserved but the gauge group is partially broken. The phenomenological study of these models thus requires as a first step the mapping of the space of flat directions. We investigate F- and D-flat directions in several three-generation SU(3)_C x SU(2)_L x U(1)_Y free-fermionic string models and discuss the typical scenarios that generically arise. When they exist, we systematically construct the flat directions that preserve hypercharge, only break Abelian group factors, and can be proven to remain F-flat to all orders in the non-renormalizable superpotential. △ Less", "The supersymmetric version of the Nambu-Jona-Lasinio model is investigated in connection with the chiral symmetry breaking induced by a soft SUSY breaking term. It is found that the broken chiral symmetry due to the soft breaking term is restored at suitably high temperature and the symmetry restoration occurs as first-order phase transitions. The critical temperature at which the chiral symmetry is restored is determined as a function of the strength of the soft breaking term and the field coupling constant. The dynamical fermion mass is calculated at finite temperature. Some possible applications to the breaking scenario of unified field theories are discussed. △ Less", "We try to construct a model in which supersymmetry and grand unified gauge symmetry are dynamically broken at the same time. In this model SUSY breaking is mediated mainly by massive vector multiplet, and a new solution for the mu problem is proposed. △ Less", "We study constraints on additional $Z'$ bosons predicted in the supersymmetric (SUSY) $E_6$ models by using the updated results of electroweak experiments -- $Z$-pole experiments, $m_W$ measurements and low-energy neutral current (LENC) experiments. We find that the effects of $Z$-$Z'$ mixing are parametrized by (i) a tree-level contribution to the $T$-parameter, (ii) the effective $Z$-$Z'$ mass mixing angle $\\xibar$. In addition, the effect of the direct exchange of the heavier mass eigenstate $Z_2$ in the LENC processes is parametrized by (iii) a contact term $\\contact$. We give the theoretical predictions for the observables in the electroweak experiments together with the standard model radiative corrections. Constraints on $T_{\\rm new}$ and $\\xibar$ from the $Z$-pole and $m_W$ experiments and those on $\\contact$ from the LENC experiments are separately shown. Impacts of the kinetic mixing between the ${\\rm U(1)}_Y$ and ${\\rm U(1)'}$ gauge bosons on the $χ^2$-analysis are studied. We show the 95% CL lower mass limit of $Z_2$ as a function of the effective $Z$-$Z'$ mixing parameter $ζ$, a combination of the mass and kinetic mixings. Theoretical prediction on $ζ$ and $g_E$ is found for the $χ, ψ, η$ and $ν$ models by assuming the minimal particle content of the SUSY $E_6$ models. In a certain region of the parameter space, the $Z_2$ boson mass in the detectable range of LHC is still allowed. △ Less", "We make a comparison of the predicted effective weak mixing angle, the Z-on resonance asymmetries and the W-boson mass to the LEP and SLD data at their present status. We find that the predicted MSSM values for the effective weak mixing angle are in agreement with the LEP+SLD average value for a ``heavy'' SUSY breaking scale while we observe an agreement with SLD data in the case of a ``light'' SUSY breaking scale. The resulting values for the W-boson mass and for the electron left-right asymmetries are compatible with CDF,UA2,DO and LEP data respectively. Unexpectedly we find that the supersymmetric QCD contributions to the Z-observables tend to vanish everywhere in the M1/2-M0 plane. Furthermore, values of M1/2 which are greater than 500 GeV are favoured by the MSSM if one considers the current experimental value for the strong coupling. △ Less", "We study the limits on the mass of the lightest Higgs in supersymmetric models extended with a gauge singlet when perturbative unification is required. We find that when maximum intermediate matter is added, the different evolution of the gauge couplings raises the mass bound from 135 GeV to 155 GeV. In these models perturbative unification of the gauge couplings is achieved in a natural way. △ Less", "I offer some computational details and useful and concise formulae to calculate the effective potential for a general abelian supersymmetric model at high temperature and density. It will be shown that such cases are very good candidates for symmetry nonrestoration at high temperature, providing large densities are present. △ Less", "We study phenomenological aspects of supersymmetric SO(10) GUTs with sum rules among soft SUSY breaking parameters. In particular, the sum rule related to the stau mass leads to the constraints from the requirements of successful electroweak breaking and the positivity of stau mass squared. The bottom quark mass is also estimated. △ Less", "In this paper we present a dynamical model of SUSY breaking with a hybrid messenger sector. SUSY is broken dynamically at a scale of order $10^9$ GeV via strong SU(2) gauge interactions. SUSY breaking is then transmitted to the observable sector via two distinct sources: (1) messengers, carrying Standard Model gauge quantum numbers, with the messenger mass of order $10^{15}$ GeV, and (2) the D term of an anomalous U(1)$_X$. The model is quite constrained. The messenger scale is fixed by the Fayet-Iliopoulos term for the anomalous U(1)$_X$ interaction. In addition, we show that the D term SUSY breaking contributions to squark and slepton masses are \"naturally\" the same order as those coming from the messengers. △ Less", "We present new upper limits on the light Higgs boson mass mh in supersymmetric models. We consider two gravity-mediated models (with and without universal scalar masses) and two gauge-mediated models (with a 5+5 or 10+10 messenger sector). We impose standard phenomenological constraints, as well as SU(5) Yukawa coupling unification. Requiring that the bottom and tau Yukawa couplings meet at the unification scale to within 15%, we find the upper limit mh<114 GeV in the universal supergravity model. This reverts to the usual upper bound of 125 GeV with a particular nonuniversality in the scalar spectrum. In the 5+5 gauge-mediated model we find mh<97 GeV for small tan beta and mh = 116 GeV for large tan beta, and in the 10+10 model we find mh<94 GeV. We discuss the implications for upcoming searches at LEP-II and the Tevatron. △ Less", "We present a compendium of results for ADHM multi-instantons in SU(N) SUSY gauge theories, followed by applications to N=2 supersymmetric models. Extending recent SU(2) work, and treating the N=1 and N=2 cases in parallel, we construct: (i) the ADHM supermultiplet, (ii) the multi-instanton action, and (iii) the collective coordinate integration measure. Specializing to N=2, we then give a closed formula for F_k, the k-instanton contribution to the prepotential, as a finite-dimensional collective coordinate integral. This amounts to a weak-coupling solution, in quadratures, of the low-energy dynamics of N=2 SQCD, without appeal to duality. As an application, we calculate F_1 for all SU(N) and any number of flavors N_F; for N_F<2N-2 and N_F=2N-1 we confirm previous instanton calculations and agree with the proposed hyper-elliptic curve solutions. For N_F=2N-2 and N_F=2N with N>3 we obtain new results, which in the latter case we do not understand how to reconcile with the curves. △ Less", "We present a new, improved model of gauge mediation of dynamical SUSY Breaking: the model does not have gauge messengers or $\\sim 10$ TeV scalars charged under the Standard Model (SM), thus avoiding the problem of negative (mass)$^2$ for supersymmetric SM (SSM) scalars faced by some earlier models. The gauge mediation is direct, i.e., the messengers which communicate SUSY breaking to the SSM fields carry quantum numbers of the gauge group which breaks SUSY. These messenger fields couple to a modulus field. The model has a very simple particle content: the modulus and the messengers are the only chiral superfields (other than the SSM fields) in the model. The inverted hierarchy mechanism is used to generate a local SUSY breaking minimum for the modulus field in a perturbative regime thus making the model calculable. △ Less", "We analyze the symmetry-breaking patterns of grand unified theories from the point of view of a recently-proposed criterion of renormalization-group naturalness. We perform the analysis on simple non-SUSY SU(5) and SO(10) and SUSY SU(5) GUTs. We find that the naturalness criterion can favor spontaneous-symmetry-breaking in the direction of the smallest of the maximal little groups. Some differences between theories with and without supersymmetry are also emphasized. △ Less", "We discuss dilaton and Moduli dominant SUSY breaking scenarios in M-theory. In addition, for the nonperturbative superpotential from gaugino condensation, we discuss the soft terms in the simplest model (only S and T moduli fields) and in the $T^6/Z_{12}$ model from M-theory. From the phenomenology consideration, we suggest massless scalar SUSY breaking scenario. △ Less", "We consider states in the adjoint representation of the Standard Model gauge group as messengers for mediation of supersymmetry (SUSY) breaking. These new messengers can shift the gauge coupling unification to the string scale at O(5x10^{17} GeV) if their masses are at O(10^{14} GeV). The predicted SUSY mass spectrum at the electroweak scale is significantly different from those in other gauge-mediated or supergravity models, resulting in robust mass relations. The gravitino mass is predicted to be about 1-10 GeV. The heavy messenger sector could provide a superheavy dark matter candidate. △ Less", "The supersymmetric generalization of the limiting and Gaussian QCD spectra is obtained. These spectra are valid for $x \\ll 1$, when the main contribution to the parton cascade is given by gluons and gluinos. The derived spectra are applied to decaying superheavy particles with masses up to the GUT scale. These particles can be relics from the Big Bang or produced by topological defects and could give rise to the observed ultrahigh energy cosmic rays. General formulae for the fluxes of protons, photons and neutrinos due to decays of superheavy particles are obtained. △ Less", "Large top quark mass is responsible for the enhancement of the oblique radiative corrections in SUSY models. We present the analytical formulas for these corrections to the $W$-boson mass $m_W$ and to $Z$ $l^+ l^-$ coupling constants. The comparison with the result of the Standard Model fit is made. △ Less", "We examine the infra-red structure of soft supersymmetry breaking masses of the squarks and sleptons in supersymmetric (SUSY) strong unification schemes where $α_{GUT}\\sim 0.2-1$. We show that combinations of soft masses approach fixed points which leads to very simple predictions for soft masses at the intermediate scale. The assumption that the high energy gaugino mass $M_{1/2}$ dominates over the soft scalar masses leads to a strong suppression of flavour changing neutral currents, and a low energy SUSY spectrum which is simply predicted in terms of two parameters, namely $α_{GUT}$ and $M_{1/2}$. Due to the quickly falling gauge couplings beneath the high energy scale, the low energy spectrum has a characteristic ``scalar dominated'' signature quite unlike the standard gaugino dominated MSSM where the right-handed sleptons are predicted to be rather light. We also examine the new sources of flavour changing expected in such models, and in particular show that the flavour violation coming from the D-term of a $U(1)_X$ gauged family symmetry may be reduced to an acceptable level. △ Less", "A fresh analysis of Left right symmetric supersymmetric models in the generic case where the scale of right handed symmetry breaking $M_R >> M_{SUSY}\\sim M_W$ is presented. We conclude that the low energy effective theory for such models is essentially the MSSM with R parity (and therefore B,L symmetry) but the spectrum includes heavy conjugate neutrino supermultiplets that permit a seesaw mechanism and several characteristic charged supermultiplets over and above those of the MSSM. △ Less", "We calculate the inclusive branching ratio for B--> X_s gamma, the inclusive branching ratios and asymmetries for B--> X_s l+ l- and the anomalous magnetic moment g-2 of the muon, within a minimal gauge-mediated SUSY-breaking model which naturally generates a large ratio tan(beta) of Higgs field vacuum expectation values. These predictions are highly correlated with each other, depending on only two fundamental parameters: the superpartner mass scale and the logarithm of a common messenger mass. The predictions for B--> X_s gamma decay and g-2 are in somewhat better agreement with current experiments than the standard model, but a much sharper comparison will soon be possible using new measurements now in progress or under analysis. Moreover we predict large deviations in B--> X_s e+ e- and B--> X_s mu+ mu- asymmetries, and somewhat smaller ones in B--> X_s e+ e- and B--> X_s tau+ tau- branching ratios, which will be detectable in hadronic colliders. △ Less", "I start with a brief introduction to Higgs mechanism and supersymmetry. Then I discuss the theoretical expectations, current limits and search strategies for Higgs boson(s) at LHC --- first in the SM and then in the MSSM. Finally I discuss the signatures and search strategies for the superparticles. △ Less", "I report here on the systematic analysis at Tevatron of the R-parity violating SUSY signals which correspond to the possible solution of anomalous HERA events. △ Less", "The phenomenology of neutral Higgs bosons from non--SUSY, extended Higgs sectors is studied in the context of the LHC, with particular attention given to the case of a fermiophobic Higgs. It is found that enhanced branching ratios to $γγ$ and $τ^+τ^-$ are possible and can provide clear signatures, while detection of a fermiophobic Higgs will be problematic beyond a mass of 130 GeV. △ Less", "We examine the stop production scenario for the anomalous excess of high $Q^2$ events observed at HERA, by taking into account the constraints coming from the leptoquark search at Tevatron and the atomic parity violation experiments. This scenario is shown to survive persistently even under the severe constraints from the other experiments. In the analysis, the branching ratios $B_{\\stp_j}$ of the decay modes $\\stp_j\\to ed$ $(j=1,2)$ are found to be useful parameters, representing a number of unknown parameters in the SUSY models. By expressing the stop contribution to the cross section of deep inelastic $ep$ scattering $σ(ep\\to eX)$ in terms of $B_{\\stp_1}$ and $B_{\\stp_2}$, the allowed region is successfully identified in the parameter space of $B_{\\stp_1}$ and $B_{\\stp_2}$. △ Less", "We generalize the large N_c Di Vecchia-Veneziano-Witten (VVW) effective chiral Lagrangian to the case of finite N_c by constructing the anomalous effective Lagrangian for QCD. The latter is similar to its SUSY counterpart, and has a holomorphic structure. The VVW construction is then recovered, along with 1/N_c corrections, after integrating out the heavy \"glueball\" fields. A new mass formula for eta' meson in terms of QCD condensates is obtained. The picture of theta dependence in QCD for finite N_c is more complicated than the one predicted by the large N_c approach. △ Less", "We study the possibility of spontaneous CP violation (SCPV) at the tree level in models with an extended Higgs sector. We show that the minimum equations for the complex phases of the vacuum expectation values (VEVs) have always a geometrical interpretation in terms of triangles. To illustrate our method we analyze the minimal supersymmetric (SUSY) model with R-parity violating couplings and sneutrino VEVs, where there is no SCPV. Then we study SUSY models with extra Higgs doublets and/or gauge singlets, and find that the simplest scenario with SCPV must include at least two singlet fields. △ Less", "The phase structure of SUSY gauge theories can be very different from their nonsupersymmetric counterparts. Nonetheless, there is interesting information which might be gleaned from detailed investigation of these theories. In particular, we study the precise meaning of the strong interaction scale $Λ$. We ask whether one can meaningfully apply naive dimensional analysis and also ask whether the study of supersymmetric theories can shed light on the apparent discrepancy between the perturbative scale $Λ_{QCD}$ and the ``chiral lagrangian'' scale $Λ_χ$. We show that in N=1 supersymmetric Yang Mills theory, ``naive dimensional analysis'' seems to work well, with $Λ_χ$ consistently equal to the scale at which the perturbatively evolved physical coupling becomes of order $4 π$. We turn to N=2 theories to understand better the effect of instantons in accounting for the QCD discrepancy between scales. In N=2 supersymmetric SU(2) the instanton corrections are known to all orders from the Seiberg-Witten solution and give rise to a finite scale ratio between the scale at which the perturbatively evolved and ``nonperturbatively evolved'' couplings blow up. Correspondingly, instanton effects are important even when the associated perturbatively evolved gauge coupling only gives $α$ of order 1 (rather than $4 π$). We compare the N=2 result to instanton-induced corrections in QCD, evaluated using lattice data and the instanton liquid model, and find a remarkably similar behavior. △ Less", "We examine the pion realization of the short ranged supersymmetric (SUSY) mechanism of neutrinoless double beta decay. It originates from the R-parity violating quark-lepton interactions of the SUSY extensions of the standard model of the electroweak interactions. We argue that pions are dominant SUSY mediators in neutrinoless double beta decay. The corresponding nuclear matrix elements for various isotopes are calculated within the proton-neutron renormalized quasiparticle random phase approximation. We define those isotopes which are most sensitive to the SUSY signal and outlook the present experimental situation with the double beta decay searches for the SUSY. Upper limits on the R-parity violating 1st generation Yukawa coupling are derived from various double beta decay experiments. △ Less", "Supersymmetric N=1, D=4 string vacua are known to be finite in perturbation theory. However, the effective low energy D=4, N=1 field theory lagrangian does not yield in general finite theories. In this note we present the first (to our knowledge) such an example. It may be constructed in three dual ways: i) as a $Z_3$, SO(32) heterotic orbifold; ii) as a Type -IIB, $Z_3$ orientifold with only ninebranes and a Wilson line or iii) as a Type-IIB, $Z_6$ orientifold with only fivebranes. The gauge group is $SU(4)^3$ with three chiral generations. Although chiral, a subsector of the model is continuosly connected to a model with global N=4 supersymmetry. From the $Z_6$, Type IIB orientifold point of view the above connection may be understood as a transition of four dynamical fivebranes from a fixed point to the bulk. The N=1 model is thus also expected to be S-dual. We also remark that, using the untwisted dilaton and moduli fields of these constructions as spurion fields, yields soft SUSY-breaking terms which preserve finiteness even for N=0. △ Less", "The Yukawa couplings of the tau lepton and the bottom quark become comparable to, or even exceed, electroweak gauge couplings for large values of the SUSY parameter $\\tanβ$. As a result, the lightest tau slepton $\\ttau_1$ and bottom squark $\\tb_1$ can be significantly lighter than corresponding sleptons and squarks of the first two generations. Gluino, chargino and neutralino decays to third generation particles are significantly enhanced when $\\tanβ$ is large. This affects projections for collider experiment reach for supersymmetric particles. In this paper, we evaluate the reach of the Fermilab Tevatron $p\\bar p$ collider for supersymmetric signals in the framework of the mSUGRA model. We find that the reach via signatures with multiple isolated leptons ($e$ and $μ$) is considerably reduced. For very large $\\tanβ$, the greatest reach is attained in the multi-jet$+\\eslt$ signature. Some significant extra regions may be probed by requiring the presence of an identified $b$-jet in jets$+\\eslt$ events, or by requiring one of the identified leptons in clean trilepton events to actually be a hadronic 1 or 3 charged prong tau. In an appendix, we present formulae for chargino, neutralino and gluino three body decays which are valid at large $\\tanβ$. △ Less", "We estimate the production rates of supersymmetric particles in central heavy-ion collisions at LHC. The parton cascade model is used to seek for possible collective phenomena which enlarge the production probability of very heavy particles. Even if there is some indication of such cooperative effects, higher energy and higher luminosity of proton beams at LHC disfavor heavy-ion reactions in the search for supersymmetric particles. △ Less", "We categorize general messenger and matter interactions in gauge-mediated SUSY breaking models by an R-parity for the messengers and study their phenomenological consequences. The new interactions may induce baryon- and lepton-number violating processes as well as flavor-changing neutral currents. Bounds on the couplings from low-energy data are generally weak due to the large messenger mass suppression, except for the constraint from proton decay. The soft masses for the scalar particles receive negative corrections from the new interactions. Consequently, in certain region of SUSY parameter space the μ-parameter is greatly reduced. The pattern of radiative electroweak symmetry breaking, SUSY particle mass spectrum and decay channels are also affected, leading to observable experimental signature at the current and future colliders. △ Less", "We compare the standard top quark decay and the charged Higgs decay of the top quark, t --> W+ b and t --> H+ b, at the quantum level in the MSSM. While the SUSY loop corrections to the standard top quark decay are only of a few percent, it turns out that t --> H+ b is a most promising candidate for carrying large quantum SUSY signatures. As a result, the (tan(beta), M_{H+-}) exclusion plots presented by the CDF Collaboration should be thoroughly revised in the light of the MSSM. △ Less", "Inflation arises in supersymmetric grand unified theories (susy GUTs) without fine tuning and cosmic strings usually form at the end of inflation. Hence both strings and inflation contribute to the density perturbations in the very early universe which lead to structure formation and to CMB anisotropies. This may give us a hint as to the $B-L$ breaking scale. △ Less", "This talk summarizes our recent work which studied the impact of resonant neutrino conversion induced by some non-standard neutrino properties beyond mass and mixing, such as neutrino magnetic moment, lepton-flavor non-universality as well as flavor changing neutral current interactions in SUSY models with broken R parity, on supernova physics. △ Less", "The direct detection rate for supersymmetric cold dark matter (CDM) particles is calculated for a number of suitable nuclear targets. Both the coherent and spin contributions are considered. By considering representative phenomenologically acceptable input in the restricted SUSY parameter space, detectable rates are predicted for some choices of the parameters. The modulation effect, due to the Earth's annual motion, has also been considered and found to be $\\le 4%$. Its precise value depends on the mass of CDM particles (LSP) and the structure of the target. △ Less", "We examine whether parameters related to Higgs sector of the minimal supersymmetric standard model can be determined by detailed study of production cross section and decay branching ratios of the Higgs boson. Assuming that only the light Higgs boson is observed at a future $e^+e^-$ linear collider with $\\sqrt{s}=300\\sim500$GeV, we show that values of $m_{susy}$ and $\\tanβ$ are restricted within a narrow limits in the $m_{susy}$ versus $\\tanβ$ plane by the combined analysis of the light Higgs properties. It is also pointed out that, in some case, the value of $\\tb$ may be restricted within a relatively low value, $\\tb=1\\sim5$. △ Less", "Nuclear double beta decay provides an extraordinarily broad potential to search for beyond Standard Model physics, probing already now the TeV scale, on which new physics should manifest itself. These possibilities are reviewed here. First, the results of present generation experiments are presented. The most sensitive one of them -- the Heidelberg-Moscow experiment in the Gran Sasso -- probes the electron mass now in the sub eV region and will reach a limit of $\\sim$ 0.1 eV in a few years. Basing to a large extent on the theoretical work of the Heidelberg Double Beta Group in the last two years, results are obtained also for SUSY models (R-parity breaking, sneutrino mass), leptoquarks (leptoquark-Higgs coupling), compositeness, right-handed W boson mass and others. These results are comfortably competitive to corresponding results from high-energy accelerators like TEVATRON, HERA, etc. Second, future perspectives of $ββ$ research are discussed. A new Heidelberg experimental proposal (GENIUS) is presented which would allow to increase the sensitivity for Majorana neutrino masses from the present level of at best 0.1 eV down to 0.01 or even 0.001 eV. Its physical potential would be a breakthrough into the multi-TeV range for many beyond standard models. Its sensitivity for neutrino oscillation parameters would be larger than of all present terrestrial neutrino oscillation experiments and of those planned for the future. It could probe directly the atmospheric neutrino problem and even the large angle solution of the solar neutrino problem. It would further, already in a first step, cover almost the full MSSM parameter space for prediction of neutralinos as cold dark matter, making the experiment competitive to LHC in the search for supersymmetry. △ Less", "Keeping N=1 supersymmetry in 4-dimension and in the leading order, we disuss the various orbifold compactifications of M-theory suggested by Horava and Witten on $T^6/Z_3$, $T^6/Z_6$, $T^6/Z_{12}$, and the compactification by keeping singlets under $SU(2)\\times U(1)$ symmetry, then the compactification on $S^1/Z_2$. We also discuss the next to leading order Kähler potential, superpotential, and gauge kinetic function in the $Z_{12}$ case. In addition, we calculate the SUSY breaking soft terms and find out that the universality of the scalar masses will be violated, but the violation might be very small. △ Less", "In a SUSY GUT model responsible for generating symmetric quark mass matrices at the GUT scale (mu = Lamda) we assume that the top-Yukawa coupling, lamda_t, becomes infinite at that scale. As a consequence, the MSSM renormalization group equations for quark Yukawa couplings exhibit hierarchical solutions which lead to a pattern of texture zeroes in quark mass matrices at mu = Lamda similar to one of the solutions of Ramond, Roberts, and Ross. The evolution in energy scale to low energies shows excellent agreement between the measured quantities involving the scale-independent ratios of CKM matrix elements and their predicted values in terms of quark mass ratios. It is noted that the tt-bar condensate model of Bardeen, et al. predicts an infinite lamda_t at mu = Lamda implying, for our model, that at mu = Lamda, both the symmetry of Yukawa matrices and condensate dynamics may have a common origin. △ Less", "Future sattelite (MAP and Planck) balloon and ground based experiments will the determine the basic cosmological parameters within a few percent. We examine here the effect of this on constraining the SUSY parameter space for supergravity R-parity conserving models (with tanbeta < 25) for the cases of nuCDM and LambdaCDM cosmological models. For the nuCDM (LambdaCDM) models, the gluino mass is restricted by m_g~ < 720(540)GeV. In both cases, the cosmological constraints are sensitive to non-universal SUSY soft breaking producing a lower bound m_g~ > 400GeV in some regions and for the nuCDM model, gaps in the allowed m_g~ range for other regions. For gluino (neutralino) masses greater than 450(65)GeV, m_0 is constrained to be small making the quark and slepton mass light generally light and detrmined mostly by m_g~. △ Less", "After a brief review of the Minimal Supersymmetric Standard Model (MSSM) and specifically the Minimal Supergravity Model (SUGRA), the prospects for discovering and studying SUSY at the CERN Large Hadron Collider are reviewed. The possible role for a future Lepton Collider --- whether $μ^+μ^-$ or $e^+e^-$ --- is also discussed. △ Less", "Charginos are expected to be the lightest observable supersymmetric particles in many of the supersymmetric models. In the scenario that lighter charginios are pair-produced at CERN LEP II, we present a straightforward procedure for determining the SUSY parameters, $\\tanβ$, $M_2$, $μ$, and the electron sneutrino mass $m_{\\tildeν}$ up to a four-fold discrete ambiguity, although a large number of unknown SUSY parameters are involved in chargino decays. △ Less", "A brief review of non-universalities in the soft SUSY breaking sector of supergravity grand unification is given. The effects of these non-universalities on the analysis of event rates in neutralino nucleus scattering are discussed. An analysis is also given of the implications of the simultaneous imposition of proton stability and dark matter constraints. One finds that these constraints put an upper limit on the gluino mass. △ Less", "These lectures, given at the 1997 TASI Summer School, describe the prospects for discovering supersymmetry (SUSY) and for studying its properties at the Large Hadron Collider (LHC) at CERN. If SUSY exists at a mass scale less than 1--2 TeV, then it should be easy to observe characteristic deviations from the Standard Model at the LHC. It is more difficult to determine SUSY masses because in most models there are two missing particles \\tildeχ_1^0 in every event. However, it is possible to use various kinematic distributions to make precision measurements of combinations of SUSY masses and other quantities related to SUSY physics. In favorable cases such measurements at the LHC can determine the parameters of the underlying SUSY model with good accuracy. △ Less", "In supersymmetric models with R-parity violation, sneutrinos may be produced as s-channel resonances at muon colliders. We demonstrate that, for R-parity violating couplings as low as 10^-4, sneutrino resonances may be observed and may be exploited to yield high precision SUSY parameter measurements. The excellent beam energy resolution of muon colliders may also be used to resolve MeV level splittings between CP-even and CP-odd sneutrino mass eigenstates. △ Less", "It is shown that the combined constraints on the amount of cold dark matter and of proton stability produce a stringent upper limit on the gluino mass $m_{\\tilde g}$ (and hence on the lightest neutralino mass $m_{χ_1^0}\\simeq m_{\\tilde g}/7$) for a large class of gravity mediated supergravity unified models. One finds that for the minimal SU(5) model current data (Kamiokande) restricts $m_{\\tilde g}\\leq 400$ GeV for a scalar soft breaking mass $m_0\\leq 1$ TeV. Expected future data from Super Kamionkande and ICARUS will be sensitive to the entire range of gluino mass for $m_0\\leq 1$ TeV, and be able to exclude the region $m_{\\tilde g}\\geq 500$ GeV for $m_0\\leq 5$ TeV. Effects of quark mass textures are studied and one finds that the bound $m_{\\tilde g}\\leq 500$ GeV holds when the experimental proton lifetime for the $p\\to \\bar νK^+$ mode becomes $\\geq 5\\times 10^{32}$ yr.Implications of these results for a test of these models at the Tevatron and at the LHC are discussed. The effects of non-universal soft breaking in the Higgs and the third generation squark sectors are also examined, and it is found that the proton lifetime is sensitive to these non-universal effects. The current data already eliminates some regions of non-universalities. The constraints of proton stability on the direct detection of dark matter are seen to reduce the maximum event rates by as much as a factor of $10^3$. △ Less", "We identify several mass patterns, within the framework of N=1 SUGRA with nonuniversal soft breaking masses for the sfermions, which may significantly alter SUSY signals and the current squark-gluino mass limits from the Tevatron. These effects are illustrated in a SO(10) SUSY GUT with an intermediate mass scale, but the conclusions are also valid in SUSY SO(10) models with grand deserts. △ Less", "These lectures begin with a brief introduction to the minimal supersymmetric standard model (MSSM) and the various mechanisms for hidden sector supersymmetry breaking and go on to provide a pedagogical discussion of the various kinds of supersymmetric unified theories beyond the MSSM including SUSY GUTs. Their implications for proton decay, R-parity violation, doublet triplet splitting etc. are discussed. Exhaustive discussion of SU(5) and SO(10) models is given. Other GUT models such as those based on $E_6$, $SU(5)\\times SU(5)$, flipped SU(5) and SU(6) are also presented. △ Less", "Measurements of supersymmetric particle couplings provide important verification of supersymmetry. If some of the superpartners are at the multi-TeV scale, they will escape direct detection at planned future colliders. However, such particles induce nondecoupling corrections in processes involving the accessible superparticles through violations of the supersymmetric equivalence between gauge boson and gaugino couplings. These violations are analogous to the oblique corrections in the electroweak sector of the standard model, and can be parametrized in terms of super-oblique parameters. The $e^- e^-$ collision mode of a future linear collider is shown to be an excellent environment for such high precision measurements of these SUSY parameters, which will provide an important probe of superparticles beyond reachable energies. △ Less", "We have searched for anomalous production of missing E$_{\\rm T}$ ($\\mett$), jets, leptons ($e, μ, τ$), $b$-quarks, or additional photons in events containing two isolated, central \\mbox{($|η|<1.0$)} photons with \\mbox{$\\Et>12$~GeV}. The results are consistent with standard model expectations, with the possible exception of one event that has in addition to the two photons a central electron, a high-E$_{\\rm T}$ electromagnetic cluster, and large $\\mett$. We set limits using two specific SUSY scenarios for production of diphoton events with $\\mett$. △ Less", "Depending on their masses, Supersymmetric particles can affect various measurements in Z decay. Among these are the total width (or consequent extracted value of $α_s$), enhancement or suppression of various flavors, and left-right and forward-backward asymmetries. The latter depend on squark mass splittings and are, therefore, a possible test of the Supergravity related predictions. We calculate leading order corrections for these quantities considering in particular the case of light photino and gluino where the SUSY effects are enhanced. In this limit the effect on $α_s$ is appreciable, the effect on $R_b$ is small, and the effect on the asymmetries is extremely small. △ Less", "We present a model independent analysis of new-physics contributions to the decays K^+ \\to π^+ ν\\bar νand K_L \\to π^0 ν\\bar ν. We parameterize the effects of new physics in these decays by two parameters: r_K and θ_K, with r_K=1 and θ_K=0 in the Standard Model (SM). We show how these parameters can be extracted from future data. This analysis offers some insight in a possible violation of a \"golden relation\" between K \\to πν\\bar νdecays and the CP asymmetry in B \\to ψK_S in the SM pointed out some time ago. We illustrate these ideas by considering a general class of supersymmetric models. We find that in the \"constrained\" MSSM, in which θ_K=0, the measurements of Br(K^+ \\to π^+ ν\\bar ν) and Br(K_L \\to π^0 ν\\bar ν) directly determine the angle β. Moreover, the \"golden relation\" remains unaffected. On the other hand, in general SUSY models with unbroken R-parity the present experimental constraints still allow for substantial deviations from r_K=1 and θ_K=0. Typically 0.5 < r_K < 1.3 and -25^0 < θ_K < 25^0. Consequently, in these models the violation of the \"golden relation\" is possible and values for Br(K^+ \\to π^+ ν\\bar ν) and Br(K_L \\to π^0 ν\\bar ν) departing from the SM expectations by factors 2-3 cannot be excluded. Our conclusions differ in certain aspects from the ones reached in previous analyses. In particular, we stress the possible importance of left-right flavour-violating mass insertions that were not considered before. △ Less", "We present new theories of dynamical SUSY breaking in which the strong interactions that break SUSY also give rise to composite quarks and leptons with naturally small Yukawa couplings. In these models, SUSY breaking is communicated directly to the composite fields without ``messenger'' interactions. The compositeness scale can be anywhere between 10 TeV and the Planck scale. These models can naturally solve the supersymmetric flavor problem, and generically predict sfermion mass unification independent from gauge unification. △ Less", "We show that Q-balls naturally exist in the Minimal Supersymmetric Standard Model (MSSM) with soft SUSY breaking terms of the minimal N=1 SUGRA type. These are associated with the F- and D-flat directions of the scalar potential once radiative corrections are taken into account. We consider two distinct cases, corresponding to the \"H_u L\" (slepton) direction with L-balls and the \"udd\" and \"uude\" (squark) directions with B-balls. The L-ball always has a small charge, typically of the order of 1000, whilst the B-ball can have an arbitrarily large charge, which, when created cosmologically by the collapse of an unstable Affleck-Dine condensate, is likely to be greater that 10^14. The B-balls typically decay at temperatures less than that of the electroweak phase transition, leading to a novel version of Affleck-Dine baryogenesis, in which the B asymmetry comes from Q-ball decay rather than condensate decay. This mechanism can work even in the presence of additional L violating interactions or B-L conservation, which would rule out conventional Affleck-Dine baryogenesis. △ Less", "A minimal supersymmetric version of the Standard Model with complex parameters allows contributions to the weak-electric dipole moments of fermions at the one-loop level. Assuming generation-diagonal trilinear soft-susy-breaking terms and the usual GUT constraint, a set of CP-violating physical phases can be introduced. In this paper the general expressions for the one-loop contribution to the WEDM in a generic renormalizable theory are given and the size of the WEDM of the tau lepton and the b quark in such a supersymmetric model is discussed. △ Less", "In the framework of gauge-mediated supersymmetry breaking models pair production of the lightest neutralinos, scalar leptons, or charginos at LEPII gives rise to interesting signals involving multilepton final states and missing energy. In the parameter space where the scalar tau, $\\tildeτ_1$, is the next-to-lightest supersymmetric particle, we identify three interesting regions, which give rise to distinctly different final states: (i) 2 $τ$-leptons plus missing energy, (ii) 4 charged leptons plus missing energy where in some regions all four are $τ$-leptons, or (iii) six charged leptons, of which four are $τ$-leptons and the other two are electrons or muons, plus missing energy. We study in detail the size of these regions in the parameter space of gauge-mediated models and give cross section contours in these regions for various LEPII energies. We also discuss the possibility of chargino-pair production at LEPII. △ Less", "We present approximations to tree level multiparton scattering amplitudes which are appropriate when two partons are unresolved. These approximations are required for the analytic isolation of infrared singularities of n+2 parton scattering processes contributing to the next-to-next-to-leading order corrections to n jet cross sections. In each case the colour ordered matrix elements factorise and yield a function containing the singular factors multiplying the n parton amplitudes. When the unresolved particles are not colour connected, the approximations are simple products of the familar eikonal and Altarelli-Parisi splitting functions used to describe single unresolved emission. However, when the unresolved particles are colour connected the factorisation is more complicated and we introduce new and general functions to describe the triple collinear and soft/collinear limits in addition to the known double soft gluon limits of Berends and Giele. As expected the triple collinear splitting functions obey an N=1 SUSY identity. To illustrate the use of these double unresolved approximations, we have examined the singular limits of the tree level matrix elements for e+e- to 5 partons when only three partons are resolved. When integrated over the unresolved regions of phase space, these expressions will be of use in evaluating the O(alpha_s^3) corrections to the three jet rate in electron positron annihilation. △ Less", "In the supersymmetry (SUSY) models, because of the mass difference between the left- and right-top squarks, the supersymmetric QCD interactions can generate parity violating effects in the production of $ t \\bar t$ pairs. We show that SUSY QCD radiative corrections to the parity violating asymmetry in the production rates of the left- and right-handed top quarks via the $q \\bar q \\ra t \\bar t$ process can reach about 3% at the Fermilab Tevatron with $\\sqrt{s}=2$ TeV. This could be observable with an integrated luminosity larger than $2 fb^{-1}$. We also show that in these models the SUSY QCD radiative corrections to the $t \\bar t$ production rate are small unless gluinos are very light, of the order of 1 GeV. △ Less", "We determine the allowed parameter space and the particle spectra of the minimal SUSY standard model (MSSM) and nonminimal SUSY standard model (NMSSM) imposing correct electroweak gauge-symmetry breaking and recent experimental constraints. The parameters of the models are evolved with the SUSY RGEs assuming universality at the GUT scale. Applying the new unbounded from below (UFB) constraints we can exclude the LSP singlinos and light scalar and pseudoscalar Higgs singlets of the NMSSM. This exclusion removes the experimental possibility to distinguish between the MSSM and NMSSM via the recently proposed search for an additional cascade produced in the decay of the bino into the LSP singlino. Furthermore the effects of the dark matter condition for the MSSM and NMSSM are investigated and the differences concerning the parameter space, the SUSY particle and Higgs sector are discussed. △ Less", "We analyze a direct-transmission model of dynamical SUSY breaking previously proposed. In the model the gravitino mass is naturally smaller than $1~\\KEV$, which is required from the standard cosmology. We find that there are many distinguishable features from in other models: for example the so-called GUT relation among the gaugino masses does not hold even if we consider the GUT models. Furthermore, the gauginos are always lighter than the sfermions since the gaugino masses have extra suppression factors. We also discuss a collider signature ``$γγ+$ missing energy'' in the present model. △ Less", "The explanation of a 200 GeV R-parity violating squark to the HERA high-$Q^2$ anomaly would have an important impact on supersymmetry-breaking models. Here we show that a squark of mass around 200 GeV is disallowed in the minimal gauge-mediated SUSY-breaking models in the parameter space constrained by the radiative electroweak-symmetry breaking and the experimental lower limits on supersymmetric particles, even after including the large R-parity violating couplings. Supergravity motivated models can, on the other hand, give rise to these scalar quarks in a wide range of parameter space. △ Less", "I present a set of theories which display non-trivial `t Hooft anomaly matching for QCD with $F$ flavors. The matching theories are non-Abelian gauge theories with \"dual\" quarks and baryons, rather than the purely confining theories of baryons that `t Hooft originally searched for. The matching gauge groups are required to have an $F\\pm 6$ dimensional representation. Such a correspondence is reminiscent of Seiberg's duality for supersymmetric (SUSY) QCD, and these theories are candidates for non-SUSY duality. However anomaly matching by itself is not sufficiently restrictive, and duality for QCD cannot be established at present. At the very least, the existence of multiple anomaly matching solutions should provide a note of caution regarding conjectured non-SUSY dualities. △ Less", "We present an example of the gauge mediated SUSY breaking flipped SU(5) model. The messengers of the SUSY breaking are either only colour triplets which belong to the minimal content of the scalar supermultiplets or together with triplets as a messengers emerge the ordinary Higgs doublets. In both cases the model predicts light gauginos in respect of the squarks and sleptons, which could be tested in the nearest LEP experiments. In both cases ''all order`` solution of the doublet-triplet splitting problem is obtained, the $μ$-term of the order of 100 GeV is generated and the left handed neutrino masses are suppressed. △ Less", "We address intermediate scales within a class of string models. The intermediate scales occur due to the SM singlets S_i acquiring non-zero VEVs due to radiative breaking; the mass-square (m_i)^2 of S_i is driven negative at mu_{RAD} due to order(1) Yukawa couplings of S_i to exotic particles (calculable in a class of string models). The actual VEV of S_i depends on the relative magnitude of the non-renormalizable terms of the type (S_i)^{K+3}/M^K in the superpotential. We mainly consider the case in which the S_i are charged under an additional non-anomalous U(1) gauge symmetry and the VEVs occur along F- and D-flat directions. We explore various scenarios in detail, depending on the type of Yukawa couplings to the exotic particles and on the initial boundary values of the soft SUSY breaking parameters. We then address the implications of these scenarios for the mu parameter and the fermionic masses of the standard model. △ Less", "We consider gauge-mediated models of supersymmetry (SUSY) breaking with strongly coupled nonabelian messenger gauge theory. After integrating out the SUSY-breaking and messenger sectors, we directly see that the effective Kahler potential transmits the SUSY breaking to the standard model sector. △ Less", "CP violation in the decays $t \\to \\ell^+νb$ and $\\bar t \\to \\ell^-\\barν\\bar b$ from the production process $e^-e^+ \\to \\ttbar$ is discussed. Since the asymmetry proposed as a measure of CP violation vanishes even at the one-loop level in the Standard Model (SM), it may be a useful tool to search for sources of CP violation outside of the SM. As an illustration the asymmetry has been computed within supersymmetric extensions of the SM. Prospects for its measurement at future high-energy linear colliders are discussed. △ Less"]