["Our concept of the basic constituents of matter has undergone two revolutionary changes -- from atoms to proton & neutron and then onto quarks & leptons. Indeed all these quarks and leptons have been seen by now along with the carriers of their interactions, the gauge bosons. But the story is not complete yet. A consistent theory of mass requires the presence of Higgs bosons along with SUSY particles, which are yet to be seen. This is a turn of the century account of what has been achieved so far and what lies ahead. △ Less", "We show that large SUSY phases have no significant effect on the relic density of the lightest supersymmetric particle (LSP). However, they are very significant for the detection rates. We emphasise that the phase of the trilinear coupling increase the direct and indirect detection rates. △ Less", "We show that the best fits of the MSSM constrained by a simple SO(10) SUSY GUT are consistent with the present data on the muon anomalous magnetic moment. The best fits assume rather large values of tan$β\\approx 50$, and in our analysis they are not {\\em a priori} correlated in any way, directly or indirectly, with the experimental limit on $a_μ$. Regions in the SUSY parameter space, which are currently ruled out because of too large $a_μ^{SUSY}$, are already excluded in the global fit by excessive corrections to $m_b$, unacceptable $BR(b\\to sγ)$, or direct experimental limits on sparticle masses. However, our results indicate that the accuracy expected in the ongoing E821 experiment at BNL will eventually turn the muon anomalous magnetic moment into a major constraint for this regime of the MSSM. △ Less", "We obtain general analytical forms for the solutions of the one-loop renormalization group equations in the top/bottom/$τ$ sector of the MSSM. These solutions are valid for any value of $\\tan β$ as well as any non-universal initial conditions for the soft SUSY breaking parameters and non-unification of the Yukawa couplings. We establish analytically a generic screening effect of non-universality, in the vicinity of the infrared quasi fixed point, which allows to determine sector-wise a hierarchy of sensitivity to initial conditions. We give also various numerical illustrations of this effect away from the quasi fixed point and assess the sensitivity of the Higgs and sfermion spectra to the non-universality of the various soft breaking sectors. As a by-product, a typical anomaly-mediated non-universality of the gaugino sector would have marginal influence on the scalar spectrum. △ Less", "We study junctions of supersymmetric domain walls in N=1 supergravity theories in four dimensions, coupled to a chiral superfield with quartic superpotential having $Z_3$ symmetry. After deriving a BPS equation of the domain wall junction, we consider a stable hexagonal configuration of network of brane junctions, which are only approximately locally BPS. We propose a model for a mechanism of supersymmetry breaking without loss of stability, where a messenger for the SUSY breaking comes from the neighboring anti-BPS junction world, propagating along the domain walls connection them. △ Less", "The existence of extra chiral generations with all fermions heavier than M_Z is strongly disfavoured by the precision electroweak data. However the data are fitted nicely even by a few extra generations, if one allows neutral leptons to have masses close to 50 GeV. The data allow inclusion of one additional generation of heavy fermions in SUSY extension of Standard Model if chargino and neutralino have masses close to 60 GeV with Δm =~ 1 GeV. △ Less", "An analysis of the CP violating asymmetry in $K^\\pm \\to (3π)^\\pm$ decays in the Standard Model and, by means of the mass insertion approximation, in a wide class of possible supersymmetric extensions, is presented. We find that the natural order of magnitude for this asymmetry is $\\cO(10^{-5})$ in both cases. Within supersymmetric models effects as large as $\\cO(10^{-4})$ are possible, but only in a restricted range of the relevant parameters. △ Less", "I summarise the virtual effects of the new particles predicted by supersymmetric extensions of the Standard Model on the high-precision electroweak observables measured at LEP/SLC, the Tevatron and CLEO. I will then discuss in some details the two-loop SUSY-QCD corrections to the $ρ$ parameter. △ Less", "Recently the semileptonic decays $B\\to X_s e^+ e^-$, $B\\to X_s μ^+ μ^-$ in generic supersymmetric extensions of the Standard Model have been studied in ref.~\\cite{noi}. In this talk I review the main points of this analysis. SUSY effects are parameterized using the mass insertion approximation formalism and differences with MSSM results are pointed out. Constraints on SUSY contributions coming from other processes ({\\it e.g.} $b\\to s \\g$) are taken into account. Chargino and gluino contributions to photon and Z-mediated decays are computed and non-perturbative corrections are considered. We find that the integrated branching ratios and the asymmetries can be strongly modified. Moreover, the behavior of the differential Forward-Backward asymmetry remarkably changes with respect to the Standard Model expectation. △ Less", "I review the NLO QCD calculations of the branching ratio for B--> X_s gamma in the SM. Including the leading electromagnetic corrections, one obtaines BR(B-> X_s gamma)=(3.32 +- 0.30)*10^{-4}. Confronting theory with the newest data, an updated value for |V_{ts}| is obtained: |V_{ts}|=0.037 +- 0.007. Theoretical progress on the photon energy spectrum is also discussed. The inclusive FCNC semileptonic decays in the SM are briefly summarized. Furthermore, B--> X_s gamma is considered in 2HDMs and in different SUSY scenarios. QCD corrections are shown to be crucial. △ Less", "We discuss how realistic supersymmetric models can be constructed by employing an anomalous ${\\cal U}(1)$ flavor symmetry which also mediates supersymmetry breaking. A judicious choice of ${\\cal U}(1)$ charges enables the first two squark families to be sufficiently heavy ($\\stackrel{>}{_\\sim}10$ TeV), so that flavor changing neutral currents as well as dimension five nucleon decay are adequately suppressed. Using the SU(5) example, the charged fermion mass hierarchies, magnitudes of the CKM matrix elements, as well as the observed neutrino oscillations are simultaneously accommodated. We estimate the proton lifetime to be $τ_p\\sim 10^3\\cdot τ_p[{\\rm minimal} SU(5)]$, with the decay mode $p\\to Kμ$ being comparable to $p\\to Kν_{μ, τ}$. △ Less", "Recent solar & atmospheric nu-data strongly indicate need for physics beyond the Standard Model. I review the ways of reconciling them in terms of 3-nu oscillations. Though not implied by data, bi-maximal nu-mixing models emerge as a possibility. SUSY with broken R-parity provides an attractive way to incorporate it, opening the possibility of testing nu-anomalies at high- energy colliders such as the LHC or at the upcoming long-baseline or nu- factory experiments. Reconciling, in addition, the LSND hint requires a fourth, light sterile neutrino, nus. The simplest are the most symmetric scenarios, in which 2 of the 4 neutrinos are maximally-mixed and lie at the LSND scale, while the others are at the solar scale. The lightness of nus, the nearly maximal atmospheric mixing, and the solar/atmospheric splittings all follow naturally from the assumed lepton-number symmetry and its breaking. These basic schemes can be distinguished at neutral-current-sensitive solar & atmospheric neutrino experiments such as SNO. However underground experiments have not yet proven neutrino masses, as there are many alternatives. For example flavour changing interactions can play an important role in the explanation of solar and contained atmospheric data and could be tested e.g through μ\\to e + γ, μ-e conversion in nuclei, unaccompanied by neutrino-less double beta decay. Conversely, a short-lived numu might play a role in the explanation of the atmospheric data. Finally, in the presence of a nus, a long-lived heavy nutau could delay the time at which the matter and radiation contributions to the energy density of the Universe become equal, reducing density fluctuations on smaller scales, thus saving the standard CDM scenario, while the light nue, numu and nus would explain the solar & atmospheric data. △ Less", "The event characteristics of chargino pair production at e+e- collisions are explored to determine gaugino-higgsino mixing angles. We demonstrate that by measuring total cross sections and left-right asymmetries with polarized beams or angular correlations among chargino decay products the fundamental SUSY parameters M_2, μand tan(beta) can be uniquely determined in a model independent way. △ Less", "A case study will be presented to determine the particle masses and parameters of a specific mSUGRA model at the TESLA Linear Collider with high precision. △ Less", "On the basis of the universal seesaw mass matrix model, which is a promising model of the unified description of the quark and lepton mass matrices, the behaviors of the gauge coupling constants and intermediate energy scales in the SO(10)_L \\times SO(10)_R model are investigated related to the neutrino mass generation scenarios. The non-SUSY model cannot give favorable values of the intermediate energy scales to explain the smallness of the neutrino masses, while the SUSY model can give the plausible values if the number n_φof the weak doublet Higgs scalars is n_φ\\geq 3. △ Less", "In most supersymmetric theories, charginos $\\tildeχ^\\pm_{1,2}$ belong to the class of the lightest supersymmetric particles and they are easy to observe at e^+e^- colliders. By measuring the total cross sections and the left-right asymmetries with polarized beams as well as the angular correlations of the decay products of the charginos in $e^+e^-\\to\\tildeχ^-_i\\tildeχ^+_j [i,j=1,2]$, the chargino masses and the gaugino-higgsino mixing angles can be determined. From these observables the relevant fundamental SUSY parameters can be derived: M_2, $|μ|$, $\\cosΦ_μ$, and $\\tanβ=v_2/v_1$. The solutions are unique. △ Less", "We evaluate the lepton flavour violating (LFV) decays of HIggs bosons H->li+lj in several extensions of the SM, including both the effective lagrangian approach and several specific models. For the effective lagrangian case, we focus on dimension-six operators that induce LFV vertices for the Higgs and or Z bosons. For those operators whose coefficients can not be constrained by present data, LFV Higgs decays can have a B.R. of order 0.1-0.01. Those cases when current bounds apply, induce strong bounds for e-mu transitions, and the b.r. for H->e mu is of order 10^-9; however H->tau mu, tau e, can have B.R. of order 0.1. In the case of the two-higgs doublet model III, we obtain a similar B.R. for H-> tau mu, tau e, whereas in the SM with massive neutrinos and the minimal SUSY-SM the corresponding B.R. are very suppressed. △ Less", "Using improved theoretical calculations of the decay form factors in the Light Cone-QCD sum rule approach, we investigate the decay rates, dilepton invariant mass spectra and the forward-backward (FB) asymmetry in the decays $B \\to (K,K^*) \\ell^+ \\ell^-$ ($\\ell^\\pm =e^\\pm,μ^\\pm,τ^\\pm$) in the standard model (SM) and a number of popular variants of the supersymmetric (SUSY) models. Theoretical precision on the differential decay rates and FB-asymmetry is estimated in these theories taking into account various parametric uncertainties. We show that existing data on $B \\to X_s γ$ and the experimental upper limit on the branching ratio ${\\cal B}(B \\to K^* μ^+ μ^-)$ provide interesting bounds on the coefficients of the underlying effective theory. We argue that the FB-asymmetry in $B \\to K^* \\ell^+ \\ell^-$ constitutes a precision test of the SM and its measurement in forthcoming experiments may reveal new physics. In particular, the presently allowed large-$\\tan β$ solutions in SUGRA models, as well as more general flavor-violating SUSY models, yield FB-asymmetries which are characteristically different from the corresponding ones in the SM. △ Less", "We introduce a new parameterization of four-fermion operator matrix elements which does not involve quark masses and thus allows a reduction of systematic uncertainties. In order to simplify the matching between lattice and continuum renormalization schemes, we express our results in terms of renormalization group invariant B-parameters which are renormalization-scheme and scale independent. As an application of our proposal, matrix elements of DI=3/2 and SUSY DS =2 operators have been computed. The calculations have been performed using the tree-level improved Clover lattice action at two different values of the strong coupling constant (beta=6/g^2=6.0 and 6.2), in the quenched approximation. Renormalization constants and mixing coefficients of lattice operators have been obtained non-perturbatively. Using lowest order ChiPT, we also obtain <Pi Pi| O_7|K >^{NDR}_{I=2} = (0.11\\pm 0.02) GeV^4 and <Pi Pi| O_8|K >^{NDR}_{I=2} = (0.51\\pm 0.05) GeV^4 at mu=2 GeV. △ Less", "We construct D=4 Type I vacua with massless content remarkably close to that of the standard model of particle physics. They are tachyon-free non-supersymmetric models which are obtained starting with a standard D=4, N=1 compact Type IIB orientifold and adding the same number of Dp-branes and anti-Dp-branes distributed at different points of the underlying orbifold. Supersymmetry-breaking is felt by the observable world either directly, by gravity mediation or gauge mediation, depending on the brane configuration. We construct several simple three generation examples with the gauge group of the standard model or its left-right symmetric extensions. The models contain a number of U(1) gauge groups whose anomalies are cancelled by a generalized Green-Schwarz mechanism. These U(1)'s are broken but may survive as global symmetries providing for a flavour structure to the models. The value of the string scale may be lowered down to the intermediate scale (as required in the gravity mediation case) or down to 1-100 TeV for the non-SUSY models. Thus the present models are the first semirealistic string vacua realizing the possibility of a low string scale. The unbalanced force between the pairs of Dp- and anti-Dp-branes provides for an effect which tends to compactify some of the extra dimensions but no others. This could provide a new mechanism for radius stabilization. △ Less", "We study neutral and charged Higgs boson production in association with stop and sbottom squarks at the Large Hadron Collider (LHC), within the so-called M-SUGRA scenario, i.e., the Supergravity (SUGRA) inspired Minimal Supersymmetric Standard Model (MSSM). For low values of \\tanβonly the cases \\tilde{t}_1\\tilde{t}_1^* H, \\tilde{t}_1\\tilde{t}_1^* h and \\tilde{t}_1\\tilde{t}_2^* h give detectable rates while for \\tanβgreater than 30 a variety of signals involving all Higgs bosons can be accessed, at high collider luminosity. The dependence of these reactions on the M-SUGRA parameters might further allow one to pin down the actual structure of the underlying Supersymmetric (SUSY) model. △ Less", "We studied the one-loop contributions of the gaugino-Higgsino-sector to the process of top-pair production via $γγ$ fusion at NLC in frame of the Minimal Supersymmetric Model(MSSM). We find that the corrections to $γγ\\to t\\bar{t}$ and $e^+ e^- \\to γγ\\to t\\bar{t}$ are found to be significant and can approach to a few percent and one percent, respectively. Furthermore, the dependences of the corrections on the supersymmetric parameters are also investigated. The corrections are not sensitive to $M_{SU(2)}$ (or $|μ|$) when $M_{SU(2)}~>>~|μ|$ (or $|μ|~>>~M_{SU(2)}$) and are weakly dependent on the $\\tanβ$ with $M_Q$ (or $|μ|$) being large enough. But they are sensitive to the c.m.s. energy of the incoming photons. △ Less", "In a supersymmetric model where R-Parity and lepton number are violated bilinearly in the superpotential, which can explain the solar and atmospheric neutrino problems, we study the unification of gauge and Yukawa couplings at the GUT scale. We show that bottom-tau Yukawa coupling unification can be achieved at any value of $\\tanβ$, and that the strong coupling constant prediction from unification of gauge couplings is closer to the experimental value compared with the MSSM. We also study the predictions for $V_{cb}$ in a Yukawa texture ansätze. △ Less", "We show that in the context of large extra dimensions enough CP violation can be obtained from the spontaneous breaking in a simple non-SUSY model, which is usually considered not to cause the spontaneous CP violation. We estimate ε_{K} in our scenario to be of order 10^{-3} consistent with the experimental value. We also propose a modification to the see-saw mechanism and axion scenario to match with our model. △ Less", "In the minimal supersymmetric standard model (MSSM), the $μ-$parameter and the trilinear coupling $A_t$ may be generically complex and can affect various observables at B factories. Working in the effective SUSY models and imposing the edm constraints from Chang-Keung-Pilaftsis (CKP) mechanism, we find that (i) there is no new large phase shift in the $B^0 - \\bar{B^0}$ mixing from the A_t and $μ$ phases, (ii) CP violating dilepton asymmetry is smaller than 0.1%, (iii) the direct CP violation in $B\\to X_s γ$ can be as large as $\\sim \\pm 16 %$, (iv) the ${\\rm Br} (B\\to X_s l^+ l^-)$ can be enhanced by upto $\\sim 85 %$ compared to the standard model (SM) prediction, and its correlation with ${\\rm Br} (B \\to X_s γ)$ is distinctly different from the minimal supergravity scenario. Also, we find $1 \\leq ε_K / ε_K^{SM} \\leq 1.4$, and $ε_K$ cannot be saturated by the A_t and $μ$ phases alone : namely, $|ε_K^{\\rm SUSY}| \\leq O(10^{-5})$ if the phases of $μ$ and A_t are the sole origin of CP violation. △ Less", "We discuss 2f production at LC energies (f \\neq t). This type of reaction has a big event number and may give interesting hints to the existence and perhaps to details of New Physics like susy, LQ, Z', etc. {For} any search the radiative corrections have to be controlled carefully. An interesting challenge for theoreticians could also be the Giga-Z option of the TESLA project. △ Less", "The gluon dipole operator, $O_{11}$, has received much attention recently because it can have a large coefficient in some SUSY extensions of the standard model. We find that the commonly used matrix element of $O_{11}$ of Bertolini, Eeg and Fabbrichesi is in rough (but accidental) numerical agreement with an estimate based on dimensional analysis. △ Less", "We present a phenomenological analysis of production and decays of stops, sbottoms, and staus in e+e- collisions with sqrt(s) = 500 - 800 GeV. We include SUSY-QCD and Yukawa coupling corrections as well as initial state radiation. We show that e- beam polarization is a powerful tool for a determination of the underlying SUSY parameters. Using in addition a polarized e+ beam improves the precision of the parameter determination by about 25%. △ Less", "Using the neutrino oscillations and neutrinoless double beta decay experimental data we reconstructed an upper limit for the three generation neutrino mass matrix. We compared this matrix with the predictions of the minimal supersymmetric(SUSY) model with R-parity violation(\\rp) and extracted stringent limits on trilinear \\rp coupling constants $λ_{i33}, λ'_{i33}$. Introducing an additional $U(1)_X$ flavor symmetry which had been successful in explaining to relate various \\rp parameters. In this model we found a unique scenario for the neutrino masses and the \\rp couplings compatible with the neutrino oscillation data. Then we derived predictions for certain experimentally interesting observables. △ Less", "We study the magnitudes of soft SUSY breaking parameters in heterotic string models with anomalous U(1) symmetry. In most cases, D-term contribution to soft scalar masses is expected to be comparable to or dominant over other contributions provided that supersymmetry breaking is mediated by the gravitational interaction and/or an anomalous U(1) symmetry and the magnitude of vacuum energy is not more than of order $m_{3/2}^2 M^2$. △ Less", "The supersymmetric flavor problem is elegantly solved by the decoupling scenario, where the first-two generation sfermions are much heavier than the third generation ones. However, such a mass spectrum is not stable against renormalization group evolution and causes extreme fine-tuning of the electroweak symmetry breaking. We present a mechanism which stabilizes the mass spectrum with such a large splitting, by introducing extra vector-like chiral multiplets of masses comparable to the first-two generation sfermions. The explicit models are constructed in a framework of the anomalous U(1) SUSY-breaking model. △ Less", "New data on neutrino masses is very exciting. It is the first evidence for physics beyond the standard model. In this talk we discuss this data and how it may (or may not) be used to constrain theories of charged fermion masses. The talk is divided into two parts. In part I, we briefly discuss the theoretical framework for fermion masses and mixing angles as well as some of the most salient data for neutrino oscillations. In part II, we define the framework of a \"predictive\" theory of fermion masses. We then consider a particular theory which makes significant testable predictions. △ Less", "We introduce a new parameterization of four-fermion matrix elements which does not involve quark masses and thus allows a reduction of systematic uncertainties in physical amplitudes. As a result the apparent quadratic dependence of e'/e on m_s is removed. To simplify the matching between lattice and continuum renormalization schemes, we express our results in terms of Renormalization Group Invariant B-parameters which are renormalization-scheme and scale independent. As an application of our proposal, matrix elements of DeltaI=3/2 and SUSY DeltaF=2 (F=S,C,B) four-fermion operators have been computed. △ Less", "We study the signature of $H^\\pm$ decay into $h^0W$ at the LHC in SUSY models. It has only marginal viability in the MSSM. But in the singlet extensions like the NMSSM one can have a spectacular signature for $H^\\pm$ decay into $(h^0,A^0)W$ over a significant domain of parameter space. △ Less", "The modern theories of Grand Unification (GUT) and supersymmetric (SUSY) extensions of standard model (SM) suppose that the conservation laws of the SM may be violated to some small degree. The nuclei are well-suited as a laboratory to test fundamental symmetries and fundamental interactions like lepton flavor (LF) and lepton number (LN) conservation. A prominent role between experiments looking for LF and total LN violation play yet not observed processes of neutrinoless double beta decay. The GUT's and SUSY models offer a variety of mechanisms which allow this process to occur. They are based on mixing of Majorana neutrinos and/or R-parity violation hypothesis. Although the neutrinoless double beta decay has not been seen it is possible to extract from the lower limits of the lifetime upper limits for the effective electron Majorana neutrino mass, effective right handed weak interaction parameters, the effective Majoron coupling constant, R-parity violating SUSY parameters etc. In this work the limits on the LN violating parameters extracted from current neutrinoless double beta decay experiments are listed. Studies in respect to future neutrinoless double beta decay experimental projects are also presented. △ Less", "We present results of reanalysis on proton decay in the minimal SU(5) SUSY GUT model. Unlike previous analyses, we take into account a Higgsino dressing diagram of dimension 5 operator with right-handed matter fields ($RRRR$ operator). It is shown that this diagram gives a significant contribution for $p \\to K^{+}\\barν_τ$. Constraints on the colored Higgs mass $M_C$ and the sfermion mass $m_{\\tilde{f}}$ from Super-Kamiokande limit become considerably stronger than those in the previous analyses: $M_C > 6.5\\times 10^{16} \\gev$ for $m_{\\tilde{f}} < 1 \\tev$. The minimal model with $m_{\\tilde{f}} \\lsim 2 \\tev$ is excluded if we require the validity of this model up to the Planck scale. △ Less", "We consider theories with one or more compact dimensions with size r > 1/M, where M is the fundamental Planck scale, with the visible and hidden sectors localized on spatially separated \"3-branes.\" We show that a bulk U(1) gauge field spontaneously broken on the hidden-sector 3-brane is an attractive candidate for the messenger of supersymmetry breaking. In this scenario scalar mass-squared terms are proportional to U(1) charges, and therefore naturally conserve flavor. Arbitrary flavor violation at the Planck scale gives rise to exponentially suppressed flavor violation at low energies. Gaugino masses can be generated if the standard gauge fields propagate in the bulk; μand Bμterms can be generated by the Giudice-Masiero or by the VEV of a singlet in the visible sector. The latter case naturally solves the SUSY CP problem. Realistic phenomenology can be obtained either if all microscopic parameters are order one in units of M, or if the theory is strongly coupled at the scale M. (For the latter case, we estimate parameters by extending \"naive dimensional analysis\" to higher-dimension theories with branes.) In either case, the only unexplained hierarchy is the \"large\" size of the extra dimensions in fundamental units, which need only be an order of magnitude. All soft masses are naturally within an order of magnitude of m_{3/2}, and trilinear scalar couplings are negligible. Squark and slepton masses can naturally unify even in the absence of grand unification. △ Less", "We study the helicity amplitudes of the process gamma gamma to ZZ in the Standard Model at high energy. These amplitudes receive contributions from the W and charged quark and lepton loops, analogous to those encountered in the gamma gamma to gamma gamma, gamma Z cases studied before. But gamma gamma to ZZ also receives contributions from the Higgs s-channel poles involving the effective Higgs-gamma gamma vertex. At energies of about 300 GeV, the amplitudes in all three processes are mainly helicity-conserving and almost purely imaginary; which renders them a very useful tool in searching for New Physics. As an example, a SUSY case is studied, and the signatures due to the virtual effects induced by a chargino-, charged slepton- or a lightest stop-loop in gamma gamma to ZZ, are explored. These signatures, combined with the analogous ones in gamma gamma to gamma gamma and gamma gamma to gamma Z, should help identifying the nature of possible New Physics particles. △ Less", "We study non-universal corrections to the gauge couplings due to higher dimensional operators in supersymmetric SU(5) grand unified theories. The corrections are, in general, parametrized by three components originating from {\\bf 24}, {\\bf 75} and {\\bf 200} representations. We consider the prediction of $α_3(M_Z)$ along each {\\bf 24}, {\\bf 75} and {\\bf 200} direction, and their linear combinations. The magnitude of GUT scale and its effects on proton decay are discussed. Non-SUSY case is also examined. △ Less", "The status of event generators for SUSY processes at future Linear Colliders is briefly reviewed. △ Less", "If SUSY exists at the TeV scale, finding it at the LHC should be quite easy. The more difficult problem is to separate the various SUSY channels and to measure masses and other parameters. Substantial progress on this has been made within the ATLAS and CMS Collaborations. △ Less", "Recent data point in the direction of a $Λ$ dominated universe. We briefly review ``Quintessence'' as a model for a dynamical cosmological term and analyse the role of Susy QCD as a possible particle physics candidate. The multiscalar content of the theory is fully taken into account and interaction with other cosmological fields is discussed. Finally, the possibility of constructing a unified scheme for quintessence and inflation is mentioned. △ Less", "If the soft Supersymmetry (SUSY) breaking masses and couplings are complex and cancelations do take place in the SUSY induced contributions to the fermionic Electric Dipole Moments (EDMs), then the CP-violating soft phases can drastically modify much of the known phenomenological pattern of the Minimal Supersymmetric Standard Model (MSSM). In particular, the squark loop content of the dominant Higgs production mechanism at the Large Hadron Collider (LHC), the gluon-gluon fusion mode, could be responsible of large corrections to the known cross sections. △ Less", "Flavor changing neutral current processes in B and K decays in the supergravity model are revisited taking into account the recent progress of Higgs boson search experiments at LEP. Possible deviations of B^0--$\\bar{B}^0$ mixing, the CP violating K^0--$\\bar{K}^0$ mixing parameter $ε_K$ from the standard model predictions are reduced significantly in a small $\\tanβ$ region due to the constraints on the SUSY parameter space imposed by the Higgs boson search. With the present bound on the Higgs boson mass, the magnitude of the B^0--$\\bar{B}^0$ mixing amplitude can be enhanced up to 12% for $\\tanb=3$ in the minimal supergravity. If we relax the strict universality of SUSY breaking scalar masses at the GUT scale, the deviation can be 25%. We also investigate SUSY contributions to the muon anomalous magnetic moment in the supergravity model and show that there is a correlation with the $b \\to s γ$ amplitude. The SUSY contribution to $a_μ= \\frac{(g-2)_μ}{2}$ can be (-30 -- $+80)\\times 10^{-10}$ for $\\tanβ=10$ and even larger for larger $\\tanβ$. The improved measurement of the muon anomalous magnetic moment in the on-going experiment at BNL will put a strong constraint on SUSY parameter space, especially for a large $\\tanβ$ region. △ Less", "We discuss proton decay induced by dimension--5 operators in supersymmetric models containing extra hypercharge-1/3 color-triplets. We derive a general formula relating dimension-5 operator to the color-triplet mass matrix. We show that certain zeros in the triplet mass-matrix together with some triplet coupling selection rules can lead to elimination of dimension-5 operators. We apply this mechanism to SU(5) and flipped SU(5) theories with extended Higgs sectors. △ Less", "U(1)-family symmetries have led to successful predictions of the fermion mass spectrum and the mixing angles of the hadronic sector. In the context of the supersymmetric unified theories, they further imply a non-trivial mass structure for the scalar partners, giving rise to new sources of flavour violation. While tau->mu gamma decays are mostly expected to arise at rates significantly smaller than the current experimental limits, the mu -> e gamma rare decays impose important bounds on the model parameters. Even if universal soft-terms are assumed at the GUT scale, when massive neutrinos are included in these theories, new mixings appear in the soft-terms. The predicted branching ratios for rare decays are in this case below the experimental bounds. △ Less", "We re-investigate the neutralino-nucleus elastic scattering as a promising dark matter detection mechanism including contributions from the scalar-pseudoscalar mixing of neutral Higgs states and the induced phase between two Higgs doublets due to the CP-violating phases of the scalar top and bottom sectors in the minimal supersymmetric standard model. The spin-dependent part of the cross section turns out to be hardly affected by the CP-violating induced phase due to a mutually destructive unavoidable suppression mechanism of various relevant supersymmetric parameters. On the other hand, although the phase $Φ_μ$ of the higgsino mass parameter is set to be zero, the spin-independent part, which can dominate over the spin-dependent part for heavy nuclei, can be strongly dependent on the CP-violating scalar-pseudoscalar mixing and the induced phase, in particular, for a large $|μ|$, a small charged Higgs boson mass, and a large trilinear term $|A|$ compared to the SUSY breaking scale. For a small $\\tanβ$ and a large $|μ|$, the spin-independent cross section is enhanced by an order of magnitude as the phase $Φ_A$ of the trilinear term increases up to $π$, while for a large $\\tanβ$ and a large $|μ|$ the spin-independent cross section is significantly suppressed for non-zero values of the phase $Φ_A$. △ Less", "Pair production of leptoquarks at future e+e- linear colliders is investigated for center-of-mass energies of 500 GeV and 800 GeV and an integrated luminosity of 500 fb^-1. Based on a Monte Carlo simulation we estimate the event rates for signal as well as background processes and evaluate the discovery potential. As an example of virtual effects we consider deviations from standard model predictions due to R-parity violating sneutrino exchange in purely leptonic processes. △ Less", "We consider the most general generation-independent U(1) gauge symmetry consistent with the presence of Yukawa couplings for all quarks and leptons in the SUSY version of the Standard Model. This U(1) has generically mixed anomalies with SM groups, which cannot be cancelled by the Green-Schwarz mechanism of heterotic D=4 strings. We argue that these anomalies can in principle be cancelled by the generalized Green-Schwarz mechanism present in field theories corresponding to D-branes at singularities. Moreover, unlike the heterotic case, once the U(1) symmetry is broken it may remain as an exact perturbative global symmetry in the low energy theory. Applying this scheme to the SUSY SM we find that gauging such a general U(1):1) B and L violating operators at least up to dim=3,4,5,6 are generically forbidden; 2)The $μ$-term is generically supressed. We also study the properties of a U(1) symmetry whose mixed anomalies with the different SM gauge groups are in the ratio of the beta function coefficients $β_a$. This relation has been shown to hold in certain orientifold models. In all cases the U(1) remains as a global symmetry at the orientifold singularity, the SM Higgs can break it at the electroweak scale, making possible to relate the blowing-up of the singularity with electroweak symmetry breaking. △ Less", "We investigate the possibility of a bosonic preheating in the simplest model of supersymmetric Hybridinflation (F-term inflation), which was considered first by Dvali et al. Here the inflationary superpotential is of the O'Raifertaigh-Witten type. The end of inflation is related to a non-thermal phase transition, which in the context of left-right symmetric models lowers the rank of the gauge group. Using the homogeneous classical field ansatz for the appearing condensates, our results indicate that the parametric creation of bosonic particles does not occure in the model under consideration. △ Less", "The multidimensional N=4 supersymmetric quantum mechanics (SUSY QM) is constructed using the superfield approach. As a result, the component form of the classical and quantum Lagrangian and Hamiltonian is obtained. In the considered SUSY QM both classical and quantum N=4 algebras include central charges, and this opens various possibilities for partial supersymmetry breaking. It is shown that quantum mechanical models with one quarter, one half and three quarters of unbroken(broken) supersymmetries can exist in the framework of the multidimensional N=4 SUSY QM, while the one-dimensional N=4 SUSY QM, constructed earlier, admits only one half or total supersymmetry breakdown. We illustrate the constructed general formalism, as well as all possible cases of the partial SUSY breaking taking as an example a direct multidimensional generalization of the one-dimensional N=4 superconformal quantum mechanical model. Some open questions and possible applications of the constructed multidimensional N=4 SUSY QM to the known exactly integrable systems and problems of quantum cosmology are briefly discussed. △ Less", "We investigate the leptogenesis via decays of heavy Majorana neutrinos which are produced non-thermally in inflaton decays. We make a comprehensive study on the leptogenesis assuming various supersymmetric (SUSY) models for hybrid, new and topological inflations. For an estimation of the lepton asymmetry we adopt the Froggatt-Nielsen mechanism for mass matrices of quarks and leptons. We find that all of these models are successful to produce the lepton asymmetry enough to explain the baryon number in the present universe. Here we impose low reheating temperatures such as $T_R \\lesssim 10^8$ GeV in order to suppress the abundance of gravitinos not to conflict with the big-bang nucleosynthesis. Furthermore, we find that the leptogenesis works very well even with $T_R \\simeq 10^{6}$ GeV in the SUSY hybrid or new inflation model. It is known that such a reheating temperature is low enough to suppress the abundance of gravitinos of mass $m_{3/2} \\simeq 100$ GeV--1 TeV. Thus, the leptogenesis is fully consistent with the big-bang nucleosynthesis in a wide region of the gravitino mass. △ Less", "In this talk, I review precision SUSY study at LHC and TeV scale e+e- linear colliders (LC). We discuss the study of the 3 body decay of the second lightest neutralino χ^0_2--> χ^0_1 ll or the 2 body decay χ^0_2-->\\tilde{l}l at LHC. In the former case, the whole m_{ll} distribution observed at LHC would constrain ino mixing and slepton masses. On the other hand, when \\tilde{l}l decay is open, the distribution of the asymmetry of the transverse momentum of lepton pair A_T= p_{T1}/p_{T2} peaks at A_E=p_{1}/p_{2} in χ^0_2 rest frame for m_{ll} << m^{max}_{ll} samples, providing another model independent information. The peak position and the edge of the m_{ll} distribution constrain m_{χ^0_2}, m_χ^0_1} and m_{\\tilde{l}}. Slepton mass universality may be checked within a few % in the early stage of the experiment. Finally I discuss the physics at TeVscale LC. The mass and couplings of sparticles will be measured withinO(1%) error, and measurement of the radiative correction to the ino-slepton-lepton coupling will determine the first generation squark mass scale even in decoupling scenarios. △ Less", "We determine the Tevatron's reach in supersymmetric parameter space in trilepton, like-sign dilepton, and dilepton plus tau-jet channels, taking all relevant backgrounds into account. We show results for the minimal supergravity model. With a standard set of cuts we find that the previously unaccounted for $Wγ^\\ast$ background is larger than all other backgrounds combined. We include cuts on the dilepton invariant mass and the $W$-boson transverse mass to reduce the $Wγ^\\ast$ background to a reasonable level. We optimize cuts at each point in supersymmetry parameter space in order to maximize signal-to-noise. △ Less", "We study signals for the production of superparticles at the Tevatron in supergravity scenarios based on the Grand Unified group SO(10). The breaking of this group introduces extra contributions to the masses of all scalars, described by a single new parameter. We find that varying this parameter can considerably change the size of various expected signals studied in the literature, with different numbers of jets and/or charged leptons in the final state. The ratios of these signal can thus serve as a diagnostic to detect or constrain deviations from the much--studied scenario where all scalar masses are universal at the GUT scale. Moreover, under favorable circumstances some of these signals, and/or new signals involving hard $b-$jets, should be observable at the next run of the Tevatron collider even if the average scalar mass lies well above the gluino mass. △ Less", "We analyze higher order decay modes of the lightest top squark $\\tilde{t}_1$ in the Minimal Supersymmetric extension of the Standard Model (MSSM), where the lightest SUSY particle (LSP) is assumed to be the neutralino $χ_1^0$. For small $\\tilde{t}_1$ masses accessible at LEP2 and the Tevatron, we show that the four-body decay mode into the LSP, a bottom quark and two massless fermions, $\\tilde{t}_1 \\ra b χ_1^0 f\\bar{f}'$, can dominate in a wide range of the MSSM parameter space over the loop-induced decay into a charm quark and the LSP, $\\tilde{t}_1 \\ra c χ_1^0$. This result might affect the experimental searches on this particle, since only the later signal has been considered so far. △ Less", "We consider phenomenological implications of susy models with spontaneously broken CP-symmetry. In particular, we analyze CP-asymmetries in B decays and find that the predictions of these models are vastly different from those of the SM. These features are common to NMSSM-like models with an arbitrary number of sterile superfields and the MSSM with broken R-parity. △ Less", "We present a study of charged lepton mass matrix diagonalization in R-parity violating SUSY. The case in which the bilinear couplings $μ_i$ have large values is given special attention. △ Less", "The emergence of free fermionic string models with solely the MSSM charged spectrum below the string scale provides further evidence to the assertion that the true string vacuum is connected to the Z_2 x Z_2 orbifold in the vicinity of the free fermionic point in the Narain moduli space. An important property of the Z_2 x Z_2 orbifold is the cyclic permutation symmetry between the three twisted sectors. If preserved in the three generations models the cyclic permutation symmetry results in a family universal anomalous U(1)_A, which is instrumental in explaining squark degeneracy, provided that the dominant component of supersymmetry breaking arises from the U(1)_A D-term. Interestingly, the contribution of the family--universal D_A-term to the squark masses may be intra-family non-universal, and may differ from the usual (universal) boundary conditions assumed in the MSSM. We contemplate how D_A--term spectroscopy may be instrumental in studying superstring models irrespective of our ignorance of the details of supersymmetry breaking. We examine the possible effect of the intra--family non--universality on the resulting SUSY spectrum and the values of the strong coupling, effective weak mixing angle and W-gauge boson mass, up to a two loop accuracy, in the two models (universal and non-universal). We find that non universality relaxes the constraint of color and charge breaking minima which appears in the universal case. In addition, it predicts a 3% smaller value of α_s due to different threshold masses obtained in the latter scenario. Finally, we present the experimentally allowed predictions of the two models in an M_0 and M_{1/2} parameter space. △ Less", "We study the semileptonic decays B -> Xs e+ e-, B -> Xs mu+ mu- in generic supersymmetric extensions of the Standard Model. SUSY effects are parameterized using the mass insertion approximation formalism and differences with MSSM results are pointed out. Constraints on SUSY contributions coming from other processes (e.g. b -> s gamma) are taken into account. Chargino and gluino contributions to photon and Z-mediated decays are computed and non-perturbative corrections are considered. We find that the integrated branching ratios and the asymmetries can be strongly modified. Moreover, the behavior of the differential Forward-Backward asymmetry remarkably changes with respect to the Standard Model expectation. △ Less", "The ${\\cal O}(α_s)$ QCD corrections to the three-body decay width of the charged Higgs $Γ$($H^+\\to W^+b\\bar{b}$) are discussed in the MSSM model. Our calculations indicate that the standard QCD corrections to the three-body decay mode raise the width by about 12% and the supersymmetric QCD corrections(due to $\\tilde{g}, \\tilde{t}, \\tilde{b}$ exchanges) can be comparable to or even larger than the standard QCD corrctions in some regions of the supersymmetric parameter space. This is mainly due to the effect of large left-right mixing of stop($\\tilde{t}$). It could significantly affect the phenomenology of the $H^+$ search. △ Less", "Neutrinoless double beta decay is a very important process both from the particle and nuclear physics point of view. Its observation will severely constrain the existing models and signal that the neutrinos are massive Majorana particles. From the elementary particle point of view it pops up in almost every model. In addition to the traditional mechanisms, like the neutrino mass, the admixture of right handed currents etc, it may occur due to the R-parity violating supersymmetric (SUSY) interactions. From the nuclear physics point of view it is challenging, because: 1) The relevant nuclei have complicated nuclear structure. 2) The energetically allowed transitions are exhaust a small part of all the strength. 3) One must cope with the short distance behavior of the transition operators, especially when the intermediate particles are heavy (eg in SUSY models). Thus novel effects, like the double beta decay of pions in flight between nucleons, have to be considered. 4) The intermediate momenta involved are about 100 MeV. Thus one has to take into account possible momentum dependent terms in the nucleon current. We find that, for the mass mechanism, such modifications of the nucleon current for light neutrinos reduce the nuclear matrix elements by about 25 per cent, almost regardless of the nuclear model. In the case of heavy neutrinos the effect is much larger and model dependent. Taking the above effects into account, the available nuclear matrix elements for the experimentally interesting nuclei A = 76, 82, 96, 100, 116, 128, 130, 136 and 150 and the experimental limits on the life times we have extracted new stringent limits on the average neutrino mass and on the R-parity violating coupling for various SUSY models. △ Less", "We present a first study of the channel H, A -> tau+tau -> h+ + h- + X in CMS at high m(A) values where no triggering difficulties are expected with QCD jets. At present the tau selection is based solely on the presence of a hard isolated track in the \"tau\" jet, but further refinements based on calorimeter collimation or impact parameter selections are obviously possible. The main irreducible background in these conditions is due to QCD jets with hard fragmentations. A large reduction of this background and improvement in the expected signal to background ratio is provided by Etmiss cuts. The expected high-mass reach in the m(A) tan(beta) parameter space for 3 x 10**4pb**-1 is shown. This H -> tau+tau channel provides the highest mass reach and the best mass resolution when compared to tau,tau -> lepton+hadron + Xand tau,tau -> electton + muon + X final states. To the extent that with further calorimetric and impact parameter based selection criteria the QCD background can be kept under control, i.e. below the irreducible Z,gamma* -> tau+tau background, we should strive to have a first level trigger allowing to explore the mass range down to ~ 150 - 200 GeV. △ Less", "We investigate squark and gluino pair production at LHC (CMS) with subsequent decays into quarks and LSP for the case of nonuniversal gaugino masses. Visibility of signal by an excess over SM background in (n > 1)jets + E^{miss}_T events depends rather strongly on the relation between LSP, gluino and squark masses and it decreases with the increase of LSP mass. For relatively heavy LSP mass closed to squark or gluino masses and for (m_{\\tilde{q}}, m_{\\tilde{g}}) > 1.5 TeV signal is too small to be observable. For the case when only third generation squarks and LSP are relatively light signal is not visible without b-tagging. △ Less", "In this paper we consider the violation of supersymmetric equvalence among the R parity violating couplings $lamabda_{ijk}$ caused by widely split chiral supermultiplets. We find that if $λ^{\\prime}_{2jk}=g$ and $λ^{\\prime}_{1jk}=e$ then the violation of SUSY equivalence is of the order of $5-6%$ in heavy SQCD models. On the other hand if $λ^{\\prime}_{3jk}=g$ and $λ_{ijk}=e$ then the violation of SUSY equivalence can be as large as 9.4% in 2-1 models. △ Less", "The cosmological moduli problem is discussed in the framework of sequestered sector/anomaly-mediated supersymmetry (SUSY) breaking. In this scheme, the gravitino mass (corresponding to the moduli masses) is naturally 10 - 100 TeV, and hence the lifetime of the moduli fields can be shorter than $\\sim 1 sec$. As a result, the cosmological moduli fields should decay before big-bang nucleosynthesis starts. Furthermore, in the anomaly-mediated scenario, the lightest superparticle (LSP) is the Wino-like neutralino. Although the large annihilation cross section means the thermal relic density of the Wino LSP is too small to be the dominant component of cold dark matter (CDM), moduli decays can produce Winos in sufficient abundance to constitute CDM. If Winos are indeed the dark matter, it will be highly advantageous from the point of view of detection. If the halo density is dominated by the Wino-like LSP, the detection rate of Wino CDM in Ge detectors can be as large as $0.1 - 0.01$ event/kg/day, which is within the reach of the future CDM detection with Ge detector. Furthermore, there is a significant positron signal from pair annihilation of Winos in our galaxy which should give a spectacular signal at AMS. △ Less", "In this Thesis we have investigated some effects appearing in top quark observables in the framework of the Minimal Supersymmetric Standard Model (MSSM). We have computed the radiative corrections to some top quark observables, using the on-shell renormalization scheme, and with a physically motivated definition of the tan(beta) parameter. Introductory chapters deal with the MSSM, its renormalization, and the on-shell prescription. In the next chapters we have computed the SUSY-EW corrections (and some SUSY-QCD corrections) to: the non-standard top quark decay partial width Γ(t->H+ b); the FCNC top quark decay width Γ(t-> c h) (h=h^0,H^0,A^0); and the non-standard top quark production through sbottom decays Γ(sbottom -> t χ^-). We have investigated the consequences of the corrections to Γ(t->H^+ b) in the interpretation of the present Tevatron data. Our general conclusion is that the supersymmetric strong and electroweak radiative corrections can be very important in the top/bottom-Higgs super-sector of the MSSM. Therefore, it is necessary to account for these corrections in the theoretical computation of the high energy physics observables, otherwise highly significant information on the potentially underlying SUSY dynamics could be missed. This is true, not only for the future experiments at the LHC and the LC, but also for the present Run I data (and the Run II data around the corner) at the Fermilab Tevatron collider. △ Less", "It is observed that the Hidden Local Symmetry (HLS) for the vector mesons in the ordinary QCD with smaller N_f plays the role of the \"Higgsed magnetic gauge symmetry\" for the Seiberg duality in the SUSY QCD. For large N_f where the conformal phase transition with chiral restoration and deconfinement is expected to take place, we find that the HLS model also exhibits the chiral restoration by the loop corrections (including the quadratic divergence) in a manner similar to that in the CP^{N-1} model, provided that the bare HLS Lagrangian respects the Georgi's vector limit at a certain N_f (\\approx 7). △ Less", "We introduce a variable useful for measuring masses of particles pair produced at hadron colliders, where each particle decays to one particle that is directly observable and another particle whose existence can only be inferred from missing transverse momenta. This variable is closely related to the transverse mass variable commonly used for measuring the $W$ mass at hadron colliders, and like the transverse mass our variable extracts masses in a reasonably model independent way. Without considering either backgrounds or measurement errors we consider how our variable would perform measuring the mass of selectrons in a mSUGRA SUSY model at the LHC. △ Less", "The lighter neutral scalar Higgs mass is examined in gauge-mediated supersymmetry-breaking models in which the messenger sector responsible for SUSY breaking is allowed to involve more general sets of $SU(3) \\otimes SU(2) \\otimes U(1)$ multiplets than those contained in the SU(5) $5 + \\bar{5}$ or $10 + \\bar{10}$ multiplets. The largest mass for the lighter scalar Higgs is found to be 132 GeV when the breaking parameter $Λ$ is taken to be 100 TeV\\@. Thus the predictions for the lightest Higgs mass can be tested at the upgraded Tevatron runs for these general classes of GMSB models. △ Less", "The phenomenology of a new economical SUSY model that utilizes dynamical SUSY breaking and gauge-mediation (GM) for the generation of the sparticle spectrum and the hierarchy of fermion masses is discussed. Similarities between the communication of SUSY breaking through a messenger sector, and the generation of flavor using the Froggatt-Nielsen (FN) mechanism are exploited, leading to the identification of vector-like messenger fields with FN fields, and the messenger U(1) as a flavor symmetry. An immediate consequence is that the first and second generation scalars acquire flavor-dependent masses, but do not violate FCNC bounds since their mass scale, consistent with effective SUSY, is of order 10 TeV. We define and advocate a minimal flavor-mediated model (MFMM), recently introduced in the literature, that successfully accommodates the small flavor-breaking parameters of the standard model using order one couplings and ratios of flavon field vevs. The mediation of SUSY breaking occurs via two-loop log-enhanced GM contributions, as well as several one-loop and two-loop Yukawa-mediated contributions for which we provide analytical expressions. The MFMM is parameterized by a small set of masses and couplings, with values restricted by several model constraints and experimental data. The next-to-lightest sparticle (NLSP) always has a decay length that is larger than the scale of a detector, and is either the lightest stau or the lightest neutralino. Similar to ordinary GM models, the best collider search strategies are, respectively, inclusive production of at least one highly ionizing track, or events with many taus plus missing energy. In addition, D^0 - \\bar{D}^0 mixing is also a generic low energy signal. Finally, the dynamical generation of the neutrino masses is briefly discussed. △ Less", "We study the inclusion of non-standard soft-breaking terms in the minimal SUSY extension of the SM, considering it as a model of weak-scale SUSY. These terms modify the sfermion mass matrices, which can induce new sources of flavour violation. Bounds on the new soft parameters can be estimated from current data. The results are then applied to evaluate FCNC top decay t -> c + hi (hi= h,H,A). Implications of complex soft parameters for CP violation are also addressed. △ Less", "We analyse the production of charginos/neutralinos and sleptons at the hadron colliders Tevatron and LHC in the direct channels: $p\\bar{p}/pp \\to \\tildeχ_i \\tildeχ_j + X$ and $\\tilde{\\ell} \\bar{\\tilde{\\ell}'} +X$. The cross sections for these reactions are given in next-to-leading order SUSY QCD. By including the higher-order corrections, the predictions become theoretically stable, being nearly independent of the factorization and renormalization scales. Since the corrections increase the cross sections, the discovery range for these particles is extended in the refined analysis. △ Less", "An SO(10) SUSY GUT model was previously presented based on a minimal set of Higgs fields. The quark and lepton mass matrices derived fitted the data extremely well and led to large mixing of muon- and tau-neutrinos in agreement with the atmospheric neutrino data and to the small-angle MSW solution for the solar neutrinos. Here we show how a slight modification leading to a non-zero up quark mass can result in bimaximal mixing for the atmospheric and solar neutrinos. The \"just-so\" vacuum solution is slightly favored over the large-angle MSW solution on the basis of the hierarchy required for the right-handed Majorana matrix and the more nearly-maximal mixing angles obtained. △ Less", "We study the semileptonic decays B -> Xs e+ e- and B -> Xs mu+ mu- in generic supersymmetric extensions of the Standard Model. SUSY effects are parameterized using the mass insertion approximation formalism and differences with the Constrained MSSM results are pointed out. Constraints on SUSY contributions coming from other processes (e.g. b -> s photon) are taken into account. Chargino and gluino contributions to photon and Z-mediated decays are computed and non-perturbative corrections are considered. We find that the integrated branching ratios and the asymmetries can be strongly modified. Moreover, the behavior of the differential Forward-Backward asymmetry remarkably changes with respect to the Standard Model expectation. △ Less", "For some choices of soft SUSY-breaking parameters, the LSP is a stable neutralino $\\cnone$, the NLSP is a chargino $\\cpmone$ almost degenerate in mass with the LSP ($\\dmchi\\equiv\\mcpmone-\\mcnone\\sim \\mpi-$few GeV), and all other sparticles are relatively heavy. In this case, detection of sparticles in the usual, mSUGRA-motivated signals will be difficult, since the decay products in $\\cpmone\\to\\cnone...$ will be very soft, and alternative signals must be considered. Here, we study the viability of signatures at the Tevatron based on highly-ionizing charged tracks, disappearing charged tracks, large impact parameters, missing transverse energy and a jet or a photon, and determine the mass reach of such signatures assuming that only the $\\cpmone$ and $\\cnone$ are light. We also consider the jet+$\\etmiss$ and $γ+\\etmiss$ signatures assuming that the gluino is also light with $\\mgl\\sim \\mcpmone$. We find that the mass reach is critically dependent upon $\\dmchi$ and $\\mgl-\\mcpmone$. If $\\dmchi$ is sufficiently big that $cτ(\\cpmone)\\lsim$few cm and $\\mgl$ is large, there is a significant possibility that the limits on $\\mcpmone$ based on LEP2 data cannot be extended at the Tevatron. If $cτ(\\cpmone)>$few cm, relatively background-free signals exist that will give a clear signal of $\\cpmone$ production (for some range of $\\mcpmone$) even if $\\mgl$ is very large. △ Less", "We study the FCNC top quark decays t -> c h in the framework of the MSSM, where h= h^0,H^0,A^0 is any of the supersymmetric neutral Higgs bosons. We include the leading set of SUSY-QCD and SUSY electroweak contributions. While the FCNC top quark decay into the SM Higgs boson has such a negligible rate that will not be accessible to any presently conceivable accelerator, we find that there is a chance that the potential rates in the MSSM can be measured at the high luminosity colliders round the corner, especially at the LHC and possibly at a future LC, but we deem it difficult at the upgraded Tevatron. In view of the large SUSY-QCD effects that we find in the Higgs channels, and due to some discrepancies in the literature, we have revisited the FCNC top quark decay into gluon, t -> c g, in our framework. We confirm that the possibility of sizeable rates does not necessarily require a general pattern of gluino-mediated FCNC interactions affecting both the LH and the RH sfermion sectors -- the LH one being sufficient. However, given the present bounds on sparticle masses, the gluon channel turns out to lie just below the expected experimental sensibility, so our general conclusion is that the Higgs channels t -> c h (especially the one for the light CP-even Higgs) have the largest potential top quark FCNC rates in the MSSM, namely of order 10^-4. △ Less", "We study the inclusive rare decay $B\\to X_d+γ$ in the supergravity inspired Minimal Supersymmetric Standard Model and compute the CP-asymmetry in the decay rates. We show that there exist two phenomenologically acceptable sets of SUSY parameters: for one set the CP-asymmetry has the same (positive) sign as in the Standard Model and lies in the range (5-45)% while for the other set it is negative with values within -(2-21)%. △ Less", "This is a short and simple introduction into perturbiners, that is, the solutions of field equations which are generating functions for tree amplitudes. The perturbiners have been constructed in Yang-Mills, in SUSY Yang-Mills, in gravity, and in sin(h)-Gordon. △ Less", "A procedure to determine the chargino mixing angles and, subsequently, the fundamental SUSY parameters M2, mu and tan(beta) by measurements of the total cross section and the spin correlations in e+e- annihilation to chi1^+ chi1^- chargino pairs is discussed. △ Less", "We investigate the probability to find a b or tau in SUSY production with the mSUGRA model. We find that in the entire parameter space the probability per event to find a b-jet of E_T^b > 50 GeV within CMS acceptance (eta < 2.4) is significant for all tan(beta), varying from a 10 % level to 90 % depending on the m_0, m_1/2 region. The probabilities per event to find a tau with the same kinematical cuts is also significant and it increases sharply with tan(beta). These findings point to the central role a microvertex device would play in case that SUSY (mSUGRA) is indeed realized in nature and found at the LHC. First investigations done in the context of the more general MSSM scenario confirm the findings based on mSUGRA. △ Less", "In superstring theories, there exist various dilaton and modulus fields which masses are expected to be of the order of the gravitino mass $m_{3/2}$. These fields lead to serious cosmological difficulties, so called ``cosmological moduli problem'', because a large number of moduli particles are produced as the coherent oscillations after the primordial inflation. We make a comprehensive study whether the thermal inflation can solve the cosmological moduli problem in the whole modulus mass region $m_φ\\sim 10 eV - 10^4 GeV$ predicted by both hidden sector supersymmetry (SUSY) breaking and gauge-mediated SUSY breaking models. In particular, we take into account the primordial inflation model whose reheating temperature is so low that its reheating process finishes after the thermal inflation ends. We find that the above mass region $m_φ(\\simeq m_{3/2}) \\sim 10 eV - 10^4 GeV$ survives from various cosmological constraints in the presence of the thermal inflation. △ Less", "We analyze CP violation in the supersymmetric standard model (MSSM) embedded minimally into a left-right symmetric gauge structure with the seesaw mechanism for neutrino masses. With the plausible assumption of universal scalar masses it is shown that CP violation in the hadron sector of the MSSM is described by a single phase residing in the supersymmetry breaking Lagrangian. This improves the CP properties of the MSSM by providing a natural solution to the SUSY CP problem. Furthermore, $ε'/ε$ vanishes in this model above the seesaw scale; extrapolation to the weak scale then leads to a prediction in agreement with the NA31 and the recent KTeV observations. The electric dipole moment of the neutron is naturally suppressed, we estimate its magnitude to be about $4 \\times 10^{-29}$ ecm. Additional predictions include a tightly constrained super particle spectrum and vanishingly small CP asymmetries in the $B$ meson system. △ Less", "We consider the phenomenology of a class of gauge-mediated supersymmetry (SUSY) breaking (GMSB) models at a e+e- Linear Collider (LC) with c.o.m. energy up to 500 GeV. In particular, we refer to a high-luminosity (L ~ 3 x 10^34 cm^-2 s^-1) machine, and use detailed simulation tools for a proposed detector. Among the GMSB-model building options, we define a simple framework and outline its predictions at the LC, under the assumption that no SUSY signal is detected at LEP or Tevatron. Our focus is on the case where a neutralino (N1) is the next-to-lightest SUSY particle (NLSP), for which we determine the relevant regions of the GMSB parameter space. Many observables are calculated and discussed, including production cross sections, NLSP decay widths, branching ratios and distributions, for dominant and rare channels. We sketch how to extract the messenger and electroweak scale model parameters from a spectrum measured via, e.g. threshold-scanning techniques. Several experimental methods to measure the NLSP mass and lifetime are proposed and simulated in detail. We show that these methods can cover most of the lifetime range allowed by perturbativity requirements and suggested by cosmology in GMSB models. Also, they are relevant for any general low-energy SUSY breaking scenario. Values of c*tau_N1 as short as 10's of microns and as long as 10's of metres can be measured with errors at the level of 10% or better after one year of LC running with high luminosity. We discuss how to determine a narrow range (<~ 5%) for the fundamental SUSY breaking scale sqrt(F), based on the measured m_N1, c*tau_N1. Finally, we suggest how to optimise the LC detector performance for this purpose. △ Less", "If neutrinos are to play a relevant cosmological role, they must be essentially degenerate with a mass matrix of the bimaximal mixing type. We study this scenario in the MSSM framework, finding that if neutrino masses are produced by a see-saw mechanism, the radiative corrections give rise to mass splittings and mixing angles that can accommodate the atmospheric and the (large angle MSW) solar neutrino oscillations. This provides a natural origin for the $Δm^2_{sol} << Δm^2_{atm}$ hierarchy. On the other hand, the vacuum oscillation solution to the solar neutrino problem is always excluded. We discuss also in the SUSY scenario other possible effects of radiative corrections involving the new neutrino Yukawa couplings, including implications for triviality limits on the Majorana mass, the infrared fixed point value of the top Yukawa coupling, and gauge coupling and bottom-tau unification. △ Less", "Recent data point in the direction of a cosmological constant dominated universe. We investigate the role of supersymmetric QCD with N_f < N_c as a possible candidate for dynamical cosmological constant (``quintessence''). When N_f > 1, the multiscalar dynamics is fully taken into account, showing that a certain degree of flavor symmetry in the initial conditions is necessary in order to attain the required late-time ``tracking'' attractor behavior. A possible solution to the problem of long-range interactions of gravitational strength is proposed. Finally we show how, as a consequence of the interaction with the Standard Model fields, the early cosmological evolution of the scalar fields may be dramatically altered, and the approach to the tracking behavior may become much more efficient. △ Less", "We study CP-violating effects in $B\\to ψK_{s}$ decay within minimal supersymmetric models with spontaneous CP-violation. We find that the CP-asymmetry predicted by the Standard Model in this decay, $\\sin 2β\\geq 0.4$, cannot be accommodated in these models without violating the bound on the neutron electric dipole moment. This result holds for NMSSM-like models with an arbitrary number of sterile superfields. Further implications of the scenario are discussed. △ Less", "We study the helicity amplitudes and the observables of the process $γγ\\to γZ$ at high energy. As in the case of the $γγ\\to γγ$ process studied before, the relevant diagrams in the standard model (SM) involve $W$, charged quark and lepton loops; while in SUSY we also have contributions from chargino, and charged sfermion or Higgs loop diagrams. Above 250 GeV, the dominant SM amplitudes are themselves dominated by the $W$ loop, and as for $γγ\\to γγ$, they are helicity conserving and almost purely imaginary. We discuss the complementary information provided by $γγ\\to γZ$ for the identification of possible non standard effects. This process, together with $γγ\\to γγ$, should provide very useful information on the nature of possible new physics particles, above the threshold of their direct production. △ Less", "In light of recent experimental results, we present updated bounds on the lightest Higgs boson mass in the Standard Model (SM) and in the Minimal Supersymmetric extension of the Standard Model (MSSM). The vacuum stability lower bound on the pure SM Higgs boson mass when the SM is taken to be valid up to the Planck scale lies above the MSSM lightest Higgs boson mass upper bound for a large amount of SUSY parameter space. If the lightest Higgs boson is detected with a mass M_{H} < 134 GeV (150 GeV) for a top quark mass M_{top} = 172 GeV (179 GeV), it may indicate the existence of a fourth generation of fermions. The region of inconsistency is removed and the MSSM is salvagable for such values of M_{H} if one postulates the existence of a fourth generation of leptons and quarks with isodoublet degenerate masses M_{L} and M_{Q} such that 60 GeV < M_{L} < 110 GeV and M_{Q} > 170 GeV. △ Less", "We present a study of sensitivity of the R-parity violating SUSY searches with the upgraded D0 detector in Run II of the Fermilab Tevatron, within a SUGRA framework. We considered the lightest neutralino as an LSP that decays into a lepton and slepton (R-parity violating decay), resulting in 2e + \\ge 4 jets or 2μ+ \\ge 4 jets final state. The analysis, based on scaling of the Run I results, shows that squarks and gluinos with masses up to about 0.6 TeV could be probed with 2 fb^-1 of Run II data. This work has been done in the context of the BTMSSM Working Group of the Run II SUSY/Higgs Workshop at Fermilab. △ Less", "We discuss possibilities of detecting neutral and charged long-lived particles with the upgraded D0 detector in Run II of the Fermilab Tevatron accelerator, using photon pointing, dE/dx, and time-of-flight techniques. Such particles appear in many SM extensions, e.g., Gauge Mediated SUSY. This work has been done in the context of the BTMSSM Working group of the Run II SUSY/Higgs Workshop at Fermilab. △ Less", "We examine a non-Abelian SUSY $SU(2) \\times U(1)$ gauge theory and a SUSY U(1) theory originally used to investigate the microphysics of cosmic strings in supersymmetric theories. We show that both theories automatically include hybrid inflation. In the latter theory we use a $D$ term to break the symmetry. SUSY is broken during inflation and restored afterwards. Cosmic strings are formed at the end of inflation. The temperature anisotropy is calculated and found to vary as $(M_{GUT}/M_P)^2$. △ Less", "In this talk I present a discussion of the theoretical bounds on the mass of the Higgs in the Standard Model (SM) as well as in the Minimal Supersymmetric Standard Model (MSSM). Then I will point out a few facts about the couplings of scalars that are relevant for its search at hadronic colliders. After that I discuss the search possibilities at the Tevatron and the LHC, paying special attention to the issue of how well one can establish the quantum numbers and the couplings of the Higgs, when (if) it is discovered. △ Less", "Simulating pp collisions at LHC energies in the framework of the SUGRA model and the detection of the produced leptons and jets by ATLAS we demonstrate that a clean signature of SUSY can be obtained over a large domain of the parameter space in the case of L-violating R parity breaking ($λ$ couplings). The obtained signal allows the reconstruction of the SUSY particles and thereby the precise determination of the model parameters $m_0, m_{1/2}, tanβ$ and sign $μ$. △ Less", "We revisit the effect of the large stop mixing on the decay and production of the lightest SUSY Higgs at the LHC. We stress that whenever the inclusive 2-photon signature is substantially reduced, associated production, $Wh$ and $t\\bar t h$, with the subsequent decay of the Higgs into photons is enhanced and becomes an even more important discovery channel. We also point out that these reductions in the inclusive channel do not occur for the smallest Higgs mass where the significance is known to be lowest. We show that in such scenarios the Higgs can be produced in the decay of the heaviest stop. For not too heavy masses of the pseudo-scalar Higgs where the inclusive channel is even further reduced, we show that large stop mixing also allows the production of the pseudo-scalar Higgs through stop decays. These large mixing scenarios therefore offer much better prospects than previously thought. As a by-product we have recalculated stop1-stop1-h production at the LHC and give a first evaluation of stop1-stop1-Z. △ Less", "In our subgroup, we focused on penguin physics from various different angles. Our discussions included: (1) A method to extract one of the angles of the unitarity triangle $φ_2$; (2) Methods to extract $φ_3$ from $B\\to Kπ$ decays; (3) Effects of non-minimal SUSY on B and K decays; (4) Understnding large branching ratios for $B\\to η'+K(K^*)$ decays; (5) New calculation for hadronic matrix elements which are needed to compute $ε'/ε$. △ Less", "We consider effects of CP violating phases in μand A_t parameters in the effective supersymmetric standard model on B\\to X_s l^+ l^- and ε_K. Scanning over the MSSM parameter space with experimental constraints including edm constraints from Chang-Keung-Pilaftsis (CKP) mechanism, we find that the Br(B\\to X_s l^+ l^-) can be enhanced by upto \\sim 85 % compared to the standard model (SM) prediction, and its correlation with Br(B \\to X_s γ) is distinctly different from the minimal supergravity scenario. Also we find 1 \\lesssim ε_K / ε_K^{SM} \\lesssim 1.4, and fully supersymmetric CP violation in K_L \\to ππis not possible. Namely, |ε_K^{\\rm SUSY}| \\lesssim O(10^{-5}) if the phases of μand A_t are the sole origin of CP violation. △ Less", "We determine the Tevatron's reach in supersymmetric parameter space in trilepton, like-sign dilepton, and two lepton one tau-jet channels. We critically study the standard model background processes. We find larger backgrounds and, hence, significantly smaller reach regions than recent analyses. We identify the major cause of the background discrepancy. We improve signal-to-noise by introducing an invariant mass cut which takes advantage of a sharp edge in the signal dilepton invariant mass distribution. Also, we independently vary the cuts at each point in SUSY parameter space to determine the set which yields the maximal reach. We find that this cut optimization can significantly enhance the Tevatron reach. △ Less", "We evaluate the contribution of SUSY-QCD to top-charm associated production at next generation linear colliders. Our results show that the production cross section of the process $e^+e^-\\to t\\bar c{or}\\bar t c$ could be as large as 0.1 fb, which is larger than the prediction of the SM by a factor of $10^8$. △ Less", "We study soft SUSY breaking parameters in M-theory with and without 5-brane moduli fields. We investigate successful electroweak symmetry breaking and the positivity of stau mass squared. We study mass spectra in allowed regions. △ Less", "We study phenomenological aspects of supersymmetric SU(5) grand unified theories with non-universal gaugino masses. For large tan beta, we investigate constraints from the requirement of successful electroweak symmetry breaking, the positivity of stau mass squared and the b to s gamma decay rate. In the allowed region, the nature of the lightest supersymmetric particle is determined. Examples of mass spectra are given. We also calculate loop corrections to the bottom mass due to superpartners. △ Less", "In minimal theories with extra spatial dimensions at scales mu_0 much lower than the conventional GUT scale, unification can give too-large predictions for alpha_3(M_Z) given alpha_1(M_Z) and alpha_2(M_Z) as empirical input. We systematically study the effects of adding extra states above the compactification scale on running of the gauge couplings and find several simple examples that give unification where all alpha_i(M_Z) are consistent with low-energy data. We study both the supersymmetric and nonsupersymmetric unification. △ Less", "We study unconventional decays of the top-quark in the framework of SUSY models with spontaneously broken R-parity. In particular we discuss an effective theory which consists of the MSSM plus bilinearly broken R-parity. We demonstrate that the decay modes t -> stau + b and t -> tau + sbottom can have large branching ratios even in scenarios where the tau-neutrino mass is very small. We show that existing Tevatron data already probe the theoretical parameters, with promising prospects for further improvement at the Run 2 of the Tevatron. △ Less", "We examine the cancellation mechanism between the different contributions to the electric dipole moment of the neutron in a model with dilaton-dominated SUSY breaking. We find these accidental cancellations occur at few points in parameter space. For a wide region of this space we must constrain the phase of $μ$ to be of order $10^{-1}$ and have the phases of $A$ and $μ$ strongly correlated in order to have small neutron EDM. Moreover, we consider the indirect CP violation parameter $ε$ in this region where the electric dipole moment is less than the experimental limit and find that we can generate $ε$ of order $10^{-6}$. △ Less", "We calculate within the MSSM the one-loop Yukawa coupling corrections to the processes e+ e- \\to stops, sbottoms, and staus in order of Yukawa coupling squared. These corrections are due to the exchange of charginos, neutralinos, charged and neutral Higgs bosons, and charged and neutral Higgs ghosts. We give the complete analytical formulae. We also perform a detailed numerical analysis of the Yukawa coupling corrections, including also the SUSY-QCD corrections. It turns out that for stop and sbottom production the Yukawa coupling corrections are typically +/- 10% of the tree-level cross section. For stau production they are about +/- 5%. △ Less", "We analyze the effects of CP-violating phases on the electric dipole moment (EDM) of electron and neutron in the constrained minimal supersymmetric model. We find that the phases phi_μ and phi_{A_0} have to be strongly correlated, in particular for small values of the SUSY mass parameters. We calculate the neutron EDM in two different models, the Quark-Parton Model and the Chiral Quark Model. It turns out that the predictions are quite sensitive to the model used. We show parameter regions in the M_0-M_1/2 plane which are excluded by considering simultaneously the experimental bounds of both electron and neutron EDM, assuming specific values for the phases phi_μ and phi_{A_0}. △ Less", "In the context of the Minimal Supersymmetric extension of the Standard Model, we discuss the impact of the decays of the neutral Higgs bosons into supersymmetric particles, charginos/neutralinos and sfermions. We show that these decay modes could be dominant, when they are kinematically accessible, thus strongly suppressing the branching ratios for the decay channels which are used to detect the Higgs bosons at hadron colliders. These SUSY decay modes should therefore not be overlooked in the search for the Higgs particles at the LHC. △ Less", "We explore the reach of luminosity upgrades of the Fermilab Tevatron collider for SU(5) supergravity models in which non-universal GUT-scale gaugino masses arise via a vacuum expectation value for the auxiliary component of a superfield that transforms as a 24, 75 or 200 dimensional representation of SU(5). This results in a different pattern of sparticle masses and mixing angles from what is expected in the minimal supergravity model (mSUGRA) with universal GUT scale gaugino masses. We find that the resulting signal cross sections, and hence the reach of the Tevatron, are sensitive to the gaugino masses at the GUT scale. In the 24 model, the large splitting amongst the two lightest neutralinos leads to SUSY events containing many isolated leptons, including events with a real leptonic Z boson plus jets plus missing energy signal which is visible over much of parameter space. In contrast, in the 75 and 200 models, the reach via leptonic SUSY signals is greatly reduced relative to mSUGRA, and the signal is usually visible only via the canonical $\\eslt +$jets channel. △ Less", "In this letter we present a predictive SO(10) SUSY GUT with flavor symmetry U(2) \\times U(1) which has several nice features. We are able to fit fermion masses and mixing angles, including recent neutrino data, with 9 parameters in the charged fermion sector and 4 in the neutrino sector. The flavor symmetry plays a preeminent role -- (i) The model is \"natural\" -- we include all terms allowed by the symmetry. It restricts the number of arbitrary parameters and enforces many zeros in the effective mass matrices. (ii) Flavor symmetry breaking from U(2) \\times U(1) \\to U(1) \\to nothing generates the family hierarchy. It also constrains squark and slepton mass matrices, thus ameliorating flavor violation resulting from squark and slepton loop contributions. (iii) Finally, it naturally gives large angle $ν_μ- ν_τ$ mixing describing atmospheric neutrino oscillation data and small angle $ν_e - ν_{s}$ mixing consistent with the small mixing angle MSW solution to solar neutrino data. △ Less", "We examine signals for sparticle production at the Tevatron within the framework of gauge mediated supersymmetry breaking models for four different model lines, each of which leads to qualitatively different signatures. We identify cuts to enhance the signal above Standard Model backgrounds, and use ISAJET to evaluate the SUSY reach of experiments at the Fermilab Main Injector and at the proposed TeV33. For the model lines that we have examined, we find that the reach is at least as large, and frequently larger, than in the mSUGRA framework. For two of these model lines, we find that the ability to identify $b$-quarks and $τ$-leptons with high efficiency and purity is essential for the detection of the signal. △ Less", "We argue that with the discovery of neutrino mass effects at Super-Kamiokande there is a clear logical chain leading from the Standard Model through the MSSM and the recently developed Minimal Left Right Supersymmetric models with a renormalizable see-saw mechanism for neutrino mass to Left Right symmetric SUSY GUTS : in particular, SO(10) and $SU(2)_L \\times SU(2)_R\\times SU(4)_c$. The progress in constructing such GUTS explicitly is reviewed and their testability/falsifiability by proton decay measurements emphasized. △ Less", "We study possible effects of supersymmetry (SUSY) in CP asymmetries in non-leptonic $B_{d,s}$ decays in a variety of SUSY flavour models considered in literature. We use both mass insertion and vertex mixing methods to calculate squark-gluino box diagrams contribution to $B_{d,s} - \\bar{B}_{d,s}$ mixings. With the squark mixing parameter $η=0.22$, and with large new CP phases, it turns out that the CP asymmetries to be measured in upcoming B-factories, HERA-B and LHC-B, can be completely dominated by the SUSY contribution in almost every considered model. Discrimination between the different models can be done by comparing experimental results in different decay modes. In some models squark masses up to $\\sim 5$ TeV can be probed through these experiments provided the SUSY contribution to $B - \\bar{B}$ mixing is at 10% level, $|M^{SUSY}_{12}/M_{12}^{SM}|\\sim 0.1.$ This implies that models with heavy squarks have a fair chance to be tested in the future CP experiments before LHC. △ Less", "The first chapter serves as an introduction to the MSSM. I briefly review the model and explain why stops and sbottoms provide an interesting playground for exploring and testing this model. In the second chapter I discuss stop and sbottom production at lepton colliders. I give the analytical formulae for the production cross sections at e+e- and mu+mu- colliders including (general) beam polarization. A numerical analysis shows the cross sections that can be expected at LEP2, an e+e- Linear Collider, and a Muon Collider. In particular, I address the topics of what can be gained by using polarized beams and how one can determine the MSSM parameters by cross section measurements. The third chapter is devoted to stop and sbottom decays including 1-loop SUSY-QCD corrections. The calculations are done in the on-shell renormalization scheme using dimensional reduction. I present the analytical formulae for the \\order(alpha_s) corrected decay widths and explain the subtleties that have to be taken into account in the calculations. Moreover, I perform a detailed numerical analysis of squark decay widths and branching ratios at tree level and \\order(alpha_s). △ Less", "The upper bound on the mass of the lightest Higgs boson is provided in the supersymmetric standard model with multi-Higgs doublets, up to two-loop order. Relatively large corrections are expected from the experimentally unconstrained extra Yukawa couplings. We calculate it including the two-loop leading-log contributions as a function of the scale $Λ$, below which the theory remains perturbative. Even for $Λ=10^{4}$ GeV, we obtain the upper bound of 140 GeV, which is heavier than that of the MSSM by 10 GeV. △ Less", "We study unconventional decays of the top-quark and the top-squark in the framework of SUSY models with broken R-parity. The model under study is the MSSM with an additional bilinear term that breaks R-parity. In this model the top-squark behaves similar to a third generation leptoquark. We demonstrate that existing Tevatron data on the top give rise to restrictions on the SUSY parameter space. In particular, we focus on scenarios where the tau-neutrino mass is smaller than 1 eV. We give an exclusion plot derived from the leptoquark searches at Tevatron. △ Less", "We summarize the status of next-to-leading order perturbative quantum chromodynamics (pQCD) calculations of the cross sections for the production of squarks, gluinos, neutralinos, charginos, and sleptons as a function of the produced sparticle masses in proton-antiproton collisions at the hadronic center-of-mass energy 2 TeV. △ Less", "We study the production of neutralinos e^+ e^- ->chi^0_i χ^0_j with polarized beams and the subsequent decays chi^0_i -> chi^0_k l^+ l^- and chi^0_j -> chi^0_l l^+ l^-, including the complete spin correlations between production and decay. We present analytical formulae for the differential cross section of the combined process of production and decay of neutralinos. We also allow for complex couplings. The spin correlations have a strong influence on the decay angular distributions and the corresponding forward-backward asymmetries. They are very sensitive to the SUSY parameters and depend strongly on the beam polarizations. We present numerical results for the cross section and the electron forward-backward asymmetry for e^+ e^- -> chi^0_1 chi^0_2, chi^0_2 -> chi^0_1 e^+ e^-. We study the dependence on the parameter M' for various mass splittings between tilde{e}_L and tilde{e}_R and different beam polarizations. △ Less", "We compute Gamma(H+ -> t \\bar{b}) at one-loop in the MSSM and show how future data at the Tevatron and/or at the LHC could be used to unravel the potential SUSY nature of the charged Higgs. △ Less", "In the framework of the Minimal Supersymmetric Standard Model we compute the one-loop effective action for the electroweak bosons obtained after integrating out the different sleptons, squarks, neutralinos and charginos, and present the result in terms of the physical sparticle masses. In addition we study the asymptotic behaviour of the two, three and four point Green's functions with external electroweak bosons in the limit where the physical sparticle masses are very large in comparison with the electroweak scale. We find that in this limit all the effects produced by the supersymmetric particles can be, either absorbed in the Standard Model parameters and gauge bosons wave functions, or else they are supressed by inverse powers of the supersymmetric particle masses. This work, therefore, completes the proof of decoupling of the heavy supersymmetric particles from the standard ones in the electroweak bosons effective action and in the sense of the Appelquist-Carazzone Theorem that we started in a previous work. From the point of view of effective field theories this work can be seen as a (partial) proof that the SM can be obtained indeed from the MSSM as the quantum low energy effective theory of this latter when the SUSY spectra is much heavier than the electroweak scale. △ Less", "By the use of an effective superpotential in supersymmetric quantum chromodynamics (SQCD) with N_f flavors and N_c colors of quarks for N_f>=N_c+2, the influence of soft supersymmetry (SUSY) breakings is examined to clarify dynamics of chiral symmetry breakings near the SUSY limit. In case that SQCD triggers spontaneous chiral symmetry breakings, it is possible to show that our superpotential dynamically favors the successive formation of condensates, leaving either SU(N_f-N_c) or SU(N_f-N_c+1) unbroken as a chiral nonabelian symmetry. △ Less", "The status of internal symmetry breaking at high temperature in supersymmetric models is reviewed. This phenomenon could solve some well known cosmological problems, such as the domain wall, monopole and false vacuum problems. △ Less", "In recent years, many people have studied the possibility that the anomalous U(1) gauge symmetry is a trigger of SUSY breaking and/or an origin of the fermion mass hierarchy. Though it is interesting that the anomalous U(1) symmetry may explain these two phenomena simultaneously, it causes a negative stop mass squared or a severe fine-tuning in order to avoid the FCNC problem. Recently, it was pointed out that the F-term contribution of the dilaton field can dominate the flavor-dependent contribution from the anomalous U(1) D-term, so that the FCNC problem may be naturally avoided. In this paper, we study the case in which the dilaton is stabilized by the deformation of the Kähler potential for the dilaton and find that the order of the ratio of the F-term to the D-term contributions is generally determined. This implies that the branching ratio of μ\\to e γcan be found around the present experimental bound. △ Less", "We analyze the contributions to the neutrinoless double $β$ decay ($0νββ$-decay) coming from the Grand Unified Theory (GUT) constrained Minimal Supersymmetric Standard Model (MSSM) with trilinear R-parity breaking. We discuss the importance of two-nucleon and pion-exchange realizations of the quark-level $0νββ$-decay transitions. In this context, the questions of reliability of the calculated relevant nuclear matrix elements within the Renormalized Quasiparticle Random Phase Approximation (pn-RQRPA) for several medium and heavy open-shell nuclei are addressed. The importance of gluino and neutralino contributions to $0νββ$-decay is also analyzed. We review the present experiments and deduce limits on the trilinear R-parity breaking parameter $λ_{111}'$ from the non-observability of $0νββ$-decay for different GUT constrained SUSY scenarios. In addition, a detailed study of limits on the MSSM parameter space coming from the $B \\to X_s γ$ processes by using the recent CLEO and OPAL results is performed. Some studies in respect to the future $0νββ$-decay project GENIUS are also presented. △ Less", "It is usually assumed that the order H^2 corrections to the SUSY-breaking mass squared terms in the early Universe must be negative in order to allow the Affleck-Dine mechanism to work. We reconsider this assumption in the context of D-term inflation models for the case where the mass squared term has a correction cH^2 with c>0. We show that, in general, the baryon asymmetry is likely to be too small if c > 9/16. However, for c as large as 0.5 the observed baryon asymmetry can be readily generated; in particular, for d=6 directions the observed asymmetry can be produced for a wide range of reheating temperatures, in contrast with the case of negative H^2 corrections which require a reheating temperature around 1 GeV. Thus positive H^2 corrections do not rule out the Affleck-Dine mechanism and can even greatly broaden its applicability to inflation models. △ Less", "A scheme is described in which the light gravitino in low energy SUSY breaking models mixes with neutrinos. The mixing between gravitino and neutrinos arises through the standard model symmetry breaking and an R-parity and lepton number violating bilinear term in the superpotential. It is shown that mixings compatible with the neutrino experiments can be obtained within the cosmological bound on the bilinear term set by the baryon asymmetry of the universe. △ Less", "Rare B decays provides an opportunity to probe for new physics beyond the standard model. the effective Hamiltonian for the decay $b \\to s l^+ l^-$ predicts the characteristic polarization for the final state lepton. Lepton polarization has, in addition to a longitudinal component $P_L$, two orthogonal components $P_T$ and $P_N$ lying in and perpendicular to the decay plane. In this article we perform a study of the $τ$-polarisation asymmetry in the case of SUSY models with large $\\tanβ$ in the inclusive decay $B \\to X_s τ^+ τ^-$. △ Less", "In the MSSM, the assumptions of a common sfermion mass parameter m_0 and a common gaugino mass parameter m_1/2, along with the requirements from radiative electroweak symmetry breaking, lead to relatively large values of the Higgs mixing parameter mu, and consequently to a gaugino-like lightest neutralino. Lifting the requirement that the Higgs mass parameters unify with the sfermion masses is known to allow for smaller mu. We show that a mu parameter sufficiently small to yield a Higgsino-like neutralino requires a precise adjustment of the Higgs mass parameter m_Hu. Consequently a gaugino-type neutralino is still preferred in SUSY models with gaugino mass unification. △ Less", "We report a next-to-leading order (NLO) calculation of the production of gaugino-like charginos ($\\chargino$) and neutralinos ($\\neutralino$) in association with gluinos ($\\gluino$) at hadron colliders, including the strong corrections from colored particles and sparticles. We predict inclusive cross sections at the Fermilab Tevatron and CERN LHC. The NLO cross sections are more stable against variations in the hard-scattering scale parameter and are greater than the LO values. △ Less", "We correct our treatment of decays of the lightest chargino to final states containing the lightest neutralino in the case where the chargino and neutralino masses differ by less than 1 GeV. A brief summary of the phenomenological implications is given. △ Less", "After a brief introduction to SUSY I discuss the missing-p_T signature for superparticles from R-parity conservation and the multilepton signature, which follows from their cascade decay. The GUT and SUGRA constraints on the SUSY mass parameters are discussed along with the resulting SUSY signals at LHC. Finally I consider the effect of relaxing the SUGRA constraint on these signals. △ Less", "We consider the infrared quasi fixed point solutions of the renormalization group equations for the Yukawa couplings and soft supersymmetry breaking parameters in the MSSM in the \\underline{large $\\tanβ$} regime. The existence of IR quasi fixed points together with the values of gauge couplings, third generation quarks, lepton and Z-boson masses allows one to predict masses of the Higgs bosons and SUSY particles as functions of the only free parameter, $m_{1/2}$, or the gluino mass. The lightest Higgs boson mass for $M_{SUSY} \\approx 1$ TeV is found to be $m_h=128.2-0.4-7.1 \\pm 5$ GeV for $μ>0$ and $m_h=120.6-0.1-3.8 \\pm 5$ GeV for $μ<0$. △ Less", "In light of recent experimental results, we present updated bounds on the lightest Higgs boson mass in the Standard Model (SM) and in the Minimal Supersymmetric extension of the Standard Model (MSSM). The vacuum stability lower bound on the SM Higgs boson mass lies above the MSSM lightest Higgs boson mass upper bound for a large amount of SUSY parameter space. We postulate a fourth generation of fermions to see how the area of inconsistency changes, and discover that the MSSM is salvagable if a fourth generation is added to the MSSM (MSSM4). △ Less", "We study the helicity amplitudes of the process γγ\\to γγat high energy, which in the standard and SUSY models first arise at the one-loop order. In the standard model (SM), the diagrams involve W and charged quark and lepton loops, while in SUSY we also have contributions from chargino, charged sfermion and Higgs loop diagrams. The SUSY contributions are most important in the region above the threshold for producing the supersymmetric partners; since there, they interfere most effectively with the primarily imaginary SM amplitudes. Simple expressions for the relevant 1-loop functions are given, which provide a direct overview of the behaviour of the helicity amplitudes in the whole parameter space at high energies. The various characteristics of a large set of observables are studied in detail. △ Less", "We place constraints on the parameter space of the minimal supergravity (SUGRA) inspired supersymmetric (SUSY) extension of the standard model (SM), i.e. the mSUGRA model, by studying the loop-level contributions of supersymmetric particles to electroweak precision observables. In general the Higgs and superpartner particles of SUSY models contribute to electroweak observables through universal propagator corrections as well as process-specific vertex and box diagrams. However, because the mass of the lightest chargino is contrained to be greater than 91 GeV, we find that the process-dependent contributions to four-fermion amplitudes are negligibly small. Hence, the full analysis may be reduced to an analysis of the propagator corrections, and in some regions of parameter space the constraints from the (b ---> s gamma) process are quite important. The propagator corrections are dominated by the contributions of the scalar fermions, and we summarize the results in the Peskin-Takeuchi S-T plane and the contributions to the W-boson mass. We then present the results in the mSUGRA m_0 -- m_{1/2} plane and find that our analysis of the propagator corrections provides constraints in the small-m_0 -- small-m_{1/2} region, precisely the region of interest for collider phenomenology. In some regions of parameter space, especially for mu < 0 and large tan(beta), the constrained region is enlarged considerably by including the process (b ---> s gamma). △ Less", "We provide a gauge-mediation model of dynamical supersymmetry breaking where the gravitino mass takes a value in a wide range from 0.1 eV to 10 GeV. The lower mass region of order 100 keV or less deserves experimental and cosmological interests. The vacuum of our model is a true one without runaway instability, which may be desirable in a cosmological evolution of the universe. △ Less", "Based on the idea that electromagnetism is responsible for the mass differences within isotopic multiplets, and possibly also for the whole mass of the electron, a supersymmetric gauge theoretical model based on the group $SU(2)_{L} \\times SU(2)_{R} \\times U(1)_{Y}$ is constructed. Under some reasonable assumptions to the SUSY particle spectrum, a correct sign for the mass difference within an isotopic multiplet is obtained. This might provide a possible scenario to understand the old puzzle of the proton-neutron mass difference. △ Less", "CONTENTS: 1. Synopsis, 2. The MSSM Spectrum, 3. The Physical Parameters, 4. Higgs Boson Production and Decays, 5. SUSY Particle Production and Decays, 6. Experimental Bounds on SUSY Particle Masses, 7. References. △ Less", "We review the recent developments in the field of nuclear double beta decay, which is presently an important topic in both nuclear and particle physics. The mechanism of lepton number violation within the neutrinoless double beta decay is discussed in context of the problem of neutrino mixing and the R-parity violating supersymmetric extensions of the Standard model. The problem of reliable determination of the nuclear matrix elements governing both two-neutrino and neutrinoless modes of the double beta decay is addressed. The validity of different approximation schemes in the considered nuclear structure studies is analyzed and the role of the Pauli exclusion principle for a correct treatment of nuclear matrix elements is emphasized. The constraints on different lepton number violating parameters like effective electron neutrino mass, effective right-handed weak interaction parameters, effective Majoron coupling constant and R-parity violating SUSY parameters are derived from the best presently available experimental limits on the half life of neutrinoless mode of this process. △ Less", "Nuclear double beta decay provides an extraordinarily broad potential to search for beyond Standard Model physics, probing already now the TeV scale, on which new physics should manifest itself. These possibilities are reviewed here. First, the results of present generation experiments are presented. The most sensitive one of them - the Heidelberg-Moscow experiment in the Gran Sasso - probes the electron mass now in the sub eV region and will reach a limit of $\\sim$ 0.1 eV in a few years. Basing to a large extent on the theoretical work of the Heidelberg Double Beta Group in the last two years, results are obtained also for SUSY models (R-parity breaking, sneutrino mass), leptoquarks (leptoquark-Higgs coupling), compositeness, right-handed W boson mass, test of special relativity and equivalence principle in the neutrino sector and others. One of the enriched $^{76}$Ge detectors also yields the most stringent limits for cold dark matter (WIMPs) to date by using raw data. A new Heidelberg experimental proposal (GENIUS) is described which would allow to increase the sensitivity for Majorana neutrino masses from the present level of at best 0.1 eV down to 0.01 or even 0.001 eV. It would further, already in a first step using only 100 kg of natural Ge detectors, cover almost the full MSSM parameter space for prediction of neutralinos as cold dark matter. △ Less", "Current ideas for SUPERSYMMETRY searches at the LHC are reviewed. We analyse the discovery prospects for various supersymmetric particles and describe recent ideas on the possibilities of detailed SUSY studies at the LHC. We also combine today's experimental knowledge with some speculations about what might be known by the year 2005 to provide a realistic picture for the LHC start. △ Less", "We study implications of spontaneous CP-violation in minimal susy models for CP-asymmetries in rare $B,\\bar B$-decays. In particular, we estimate characteristic values of the angles of the unitarity triangle and show that sizeable CP-violating effects result from $B-\\bar B$ mixing only. Significant deviations from the SM predictions are pointed out. △ Less", "We examine the possibility that SUSY particles are light, i.e. have a mass just beyond the final kinematical reach of LEP2. In this case, even if light particles are not directly detected, their virtual effects are enhanced by a ``close to threshold'' resonance in the s-channel. We find that this resonant effect is absent in the case of light sfermions, while it is enhanced in the case of light gauginos, since neutralinos and charginos add coherently in some regions of the allowed parameter space. We discuss this ``virtual-alliance'' in detail and try to examine the possibilities of its experimental verification. △ Less", "Assuming three light neutrinos and the see-saw mechanism we present a semiquantitative model of fermion masses based on (SUSY) SU(5) and abelian horizontal charges. A good description of the observed pattern of quark and lepton masses is obtained. For neutrinos we naturally obtain widely split masses and large atmospheric neutrino mixing as a consequence of SU(5)-related asymmetric mass matrices for d quarks and charged leptons. △ Less", "The goldstino-matter interactions given by the Goldberger-Treiman relations can receive higher dimensional operator corrections of $ O(q^{2}/M^{2})$, where $M$ denotes the mass of the mediators through which SUSY breaking is transmitted. These corrections in the gauge mediated SUSY breaking models arise from loop diagrams, and an explicit calculation of such corrections is presented. It is emphasized that the Goldberger-Treiman vertices are valid only below the mediator scale and at higher energies goldstinos decouple from the MSSM fields. The implication of this fact on gravitino cosmology in GMSB models is mentioned. △ Less", "We study different phenomenological aspects of compact, D=4, N=1 Type IIB orientifolds considered as models for unification of the standard model and gravity. We discuss the structure of the compactification, string and unification scales depending on the different possible D-brane configurations. It is emphasized that in the context of Type I models the $M_W/M_{Planck}$ hierarchy problem is substantially alleviated and may be generated by geometrical factors. We obtain the effective low-energy supergravity Lagrangian and derive the form of soft SUSY-breaking terms under the assumption of dilaton/moduli dominance. We also discuss the role of anomalous U(1)'s and of twisted moduli in this class of theories. A novel mechanism based on the role of singularities is suggested to achieve consistency with gauge coupling unification in low string scale models. △ Less", "Asymmetric mass matrices can induce large RH mixings. Those are non- measurable in the SM but are there and play an important role in its extensions. The RH rotations are in particular relevant for the proton decay, neutrino properties and baryon asymmetry. E.g. large RH mixings lead to kaon dominated proton decay even without SUSY and could be the reason for a large neutrino mixing. By studying those phenomena one can learn about the RH rotation matrices and this can reduce considerably the arbitrariness in the present fermionic mass study. △ Less", "Enhanced radiative corrections generated in SUSY extensions of the Standard Model make the fit of the precision data ($Z$-boson decay parameters and $W$-boson mass) worse. This negative effect is washed out for heavy enough squarks due to decoupling property of SUSY models. We find that even for light squarks the enhanced radiative corrections can be small. In this case substantial $\\tilde{t}_L \\tilde{t}_R$ mixing is necessary. △ Less", "In the minimal supersymmetric standard model (MSSM), the μ-parameter and the trilinear coupling A_t may be generically complex and can affect various observables at B factories. Imposing the edm constraints, we find that there is no new large phase shift in the B^0 - \\bar{B^0} mixing, CP violating dilepton asymmetry is smaller than 0.1 %, and the direct CP violation in B\\to X_s γcan be as large as \\sim \\pm 16 %. △ Less", "We revisit the eleven dimension Planck scale, the physical scale of the eleventh dimension, the physical scale of Calabi-Yau manifold and coupling in hidden sector in M-theory on $S^1/Z_2$. And we discuss the reasonable bound on them. Considering F-term of dilaton and moduli SUSY breaking and choosing two repersentative points which correspond to scalar quasi-massless scenario and dilaton dominant SUSY breaking scenario respectively, we analyze experimental constraints to the parameter space. The sparticle spectrum and some phenomenological predictions are also given. △ Less", "Neutrinoless double beta decay induced by light Majorana neutrino exchange between two decaying nucleons with squark/slepton exchange inside one and W exchange inside the other nucleon (so-called vector-scalar exchange) gives stringent limits on R-parity violating interactions. We have extended previous work by including the tensor contribution to the transition rate. We discuss the improved limits on trilinear \\Rp -MSSM couplings imposed by the current experimental limit on the $\\znbb$ decay half-life of $^{76}$Ge. △ Less", "We have added some some refrences & given some figures giving results in parameter space allowed by b \\to s γ. Conclusions more or less remains unchanged. △ Less", "The calculation of the next-to-leading order SUSY-QCD corrections to the production of squarks, gluinos and gauginos at the Tevatron is reviewed. The NLO corrections stabilize the theoretical predictions of the various production cross sections significantly and lead to sizeable enhancements of the most relevant cross sections for scales near the average mass of the produced massive particles. We discuss the phenomenological consequences of the results on present and future experimental analyses. △ Less", "On the universal seesaw mass matrix model, which is a promising model of the unified description of the quark and lepton mass matrices, the behaviors of the gauge coupling constants and intermediate energy scales in the SO(10)_L\\times SO(10)_R model are investigated related to the neutrino mass generation scenarios. The unification of the gauge coupling constants in the framework of the non-SUSY model is possible if the SO(10) symmetry is broken via Pati-Salam type symmetries. △ Less", "We analyze in detail the constraints on SUSY-model parameters obtained from K-Kbar mixing in the hypothesis of a splitted SUSY spectrum. FCNC contributions from gluino-squark-quark interactions are studied in the so-called mass insertion approximation. We present boundaries on mass insertions and on SUSY mass scales. We improve previous results by including the NLO-QCD corrections to Delta S=2 effective Hamiltonian and the complete set of B-parameters for the evaluation of hadronic matrix elements. A full set of magic-numbers, that can be used for further analyses of these models, is also given. We find that the inclusion of NLO-QCD corrections and the B-parameters change the results obtained at LO and in the Vacuum Insertion Approximation by an amount of about 25-35%. △ Less", "In perturbation theory the infrared structure of the electroweak interactions produces large corrections proportional to double logarithms log^2 (s/m^2), similar to Sudakov logarithms in QED, when the scale s is much larger than the typical mass m of the particles running in the loops. These energy growing corrections can be particularly relevant for the planned Next Linear Colliders. We study these effects in the Standard Model for the process e+ e^->f fbar and we compare them with similar corrections coming from SUSY loops. △ Less", "It is shown that there is no chirally symmetric vacuum state in the {cal N}=1 supersymmetric Yang-Mills theory. The values of the gluino condensate and the vacuum energy density are found out through a direct instanton calculation. A qualitative picture of domain wall properties is presented, and a new explanation of the phenomenon of strings ending on the wall is proposed. △ Less", "One loop radiative corrections to $e^+e^-\\to H^+ H^-$ are considered at future linear collider energies, in the general type II Two Higgs Doublet Model (THDM) and in the Minimal Supersymmetric Standard Model-like (MSSM) Higgs sector. To make the comparison between THDM and MSSM tractable, we have introduced a quasi-SUSY parameterization which preserves all the tree-level Higgs mass-sum-rules of the MSSM, and involves just 3 free parameters in the Higgs sector (instead of 7 in the general THDM) and comprises the MSSM as a particular case. The model-independent soft photon contribution is isolated and shown to be substantial. Important effects come also from the contribution of the model dependent $h^0 H^+ H^-$ and $H^0 H^+ H^-$ vertices to the final state. In the MSSM, the contribution of the Higgs sector is moderate (a few percent) while in the THDM and both for small and large $\\tan β$ important effects ($\\sim +30%$) can be found. △ Less", "We consider the infrared quasi-fixed point solutions of the renormalization group equations for the top-quark Yukawa coupling and soft supersymmetry breaking parameters in the MSSM. The IR quasi-fixed points together with the values of the gauge couplings, the top-quark and Z-boson masses allow one to predict masses of the Higgs bosons, the stop squarks and the lightest chargino as functions of the only free parameter $m_{1/2}$ or the gluino mass. The mass of the lightest Higgs boson for $μ>0$ and $M_{SUSY} \\approx 1$ TeV is found to be $m_h=(94.3+1.6+0.6\\pm5\\pm0.4)$ GeV. The case with $μ<0$ is excluded by experimental data. △ Less", "The QCD corrections to the top-quark pair production via both polarized and unpolarized gluon fusion in $pp$ collisions are calculated in the Minimal Supersymmetric Model(MSSM). We find the MSSM QCD corrections can reach 4% and may be observable in future precise experiments. Furthermore, we studied the CP violation in the MSSM, our results show that the CP violating parameter is sensitive to the masses of SUSY particles (It becomes zero, when the c.m. energy is less than twice the masses of both gluino and stop quarks.) and may reach $10^{-3}$. △ Less", "We investigate the phenomenology of an orbifold string model in which supersymmetry breaking is dominated by the overall `size' modulus field and all matter fields are in the untwisted sector. The possibly close degeneracy of the lightest neutralino and chargino and the possibly small splitting between the gluino and chargino/LSP mass imply that discovery of supersymmetry at future colliders could be more challenging than anticipated. Specialized search strategies and particular detector features could play an important role. For preferred model parameter choices, the phenomenology of dark matter in the universe is significantly modified. △ Less"]