["We have obtained an exact solution for the BPS domain wall junction for a N=1 supersymmetric theory in four dimensions and studied its properties. The model is a simplified version of the N=2 SU(2) gauge theory with N_f=1 broken to N=1 by the mass of the adjoint chiral superfield. We define mode equations and demonstrate explicitly that fermion and boson with the same mass have to come in pairs except massless modes. We work out explicitly massless Nambu-Goldstone (NG) modes on the BPS domain wall junction. We find that their wave functions extend along the wall to infinity (not localized) and are not normalizable. It is argued that this feature is a generic phenomenon of NG modes on domain wall junctions in the bulk flat space in any dimensions. NG fermions exhibit a chiral structure in accordance with unitary representations of (1, 0) supersymmetry algebra where fermion and boson with the same mass come in pairs except massless modes which can appear singly. △ Less", "In this talk I discuss the qualitative features of an SO(10) SUSY GUT with an SU(2)x U(1)$^n$ family symmetry. I then describe the global fit of this theory to precision electroweak data [including charged fermion masses and mixing angles]. Finally, the predictions of the model for neutrino masses and mixing are discussed. The most predictive version of the model naturally fits atmospheric neutrino data with maximal $ν_μ\\longrightarrow ν_τ$ oscillations and solar neutrino data with small mixing angle MSW $ν_e \\longrightarrow ν_{sterile}$ oscillations. △ Less", "We discuss a rate asymmetry for the radiative $B$-meson decay $B \\to X_s γ$ within the framework of the supersymmetric standard model based on N=1 supergravity. This model contains new sources of CP violation. In spite of severe experimental constraints on the electric dipole moment of the neutron, a new CP-violating phase may not be suppressed, leading to a sizable enhancement of the decay rate asymmetry. The magnitude of the asymmetry is predicted to be larger than that by the standard model in wide parameter regions where the branching ratio is consistent with its experimental bounds. A possible maximal magnitude is about 0.1, which will be well accessible at B factories. △ Less", "This contribution to the proceedings collects new recent results on preheating after inflation. We discuss tachyonic preheating in the SUSY motivated hybrid inflation; development of equilibrium after preheating; theory of fermionic preheating and the problem of gravitino overproduction from preheating. △ Less", "The extra particles provided by Supersymmetry (SUSY) appear as natural candidates for exotica such as the missing Dark Matter of the Universe. The particle candidates for Dark Matter, and the basic elements of the minimal supersymmetric extension of the Standard Model are reviewed. The needed elements to compute the neutralino counting rate are given, considering new Yukawa loop corrections to the neutralino-neutralino-Higgs boson couplings when the neutralino is a Bino-like state. Including the new loop corrections in the Bino limit, the counting rate is improved for several values of the soft breaking supersymmetric parameters. △ Less", "There are many models with non-universal soft SUSY breaking sfermion mass parameters at the grand unification scale. Even in the mSUGRA model scalar mass unification might occur at a scale closer to M_Planck, and renormalization effects would cause a mass splitting at M_GUT. We identify an experimentally measurable quantity Delta that correlates strongly with delta m^2 = m^2_{selectron_R}(M_GUT) - m^2_{selectron_L}(M_GUT), and which can be measured at electron-positron colliders provided both selectrons and the chargino are kinematically accessible. We show that if these sparticle masses can be measured with a precision of 1% at a 500 GeV linear collider, the resulting precision in the determination of Delta may allow experiments to distinguish between scalar mass unification at the GUT scale from the corresponding unification at Q ~ M_Planck. Experimental determination of Delta would also provide a distinction between the mSUGRA model and the recently proposed gaugino-mediation model. Moreover, a measurement of Delta (or a related quantity Delta') would allow for a direct determination of delta m^2. △ Less", "We draw a possible scenario for the observation of massive long-lived charged particles at the LHC detector ATLAS. The required flexibility of the detector triggers and of the identification and reconstruction systems are discussed. As an example, we focus on the measurement of the mass and lifetime of long-lived charged sleptons predicted in the framework of supersymmetric models with gauge-mediated supersymmetry (SUSY) breaking. In this case, the next-to-lightest SUSY particle can be the light scalar partner of the tau lepton, possibly decaying slowly into a gravitino. A wide region of the SUSY parameters space was explored. The accessible range and precision on the measurement of the SUSY breaking scale parameter sqrt(F) achievable with a counting method are assessed. △ Less", "We reconsider the old problem of the dynamics of spontaneous symmetry breaking using 3d lattice simulations, and develop a theory of tachyonic preheating, which occurs due to the spinodal instability of the scalar field. Tachyonic preheating is so efficient that symmetry breaking typically completes within a single oscillation of the field distribution as it rolls towards the minimum of its effective potential. As an application of this theory we consider preheating in the hybrid inflation scenario, including SUSY-motivated F-term and D-term inflationary models. We show that preheating in hybrid inflation is typically tachyonic and the stage of oscillations of a homogeneous component of the scalar fields driving inflation ends after a single oscillation. Our results may also be relevant for the theory of the formation of disoriented chiral condensates in heavy ion collisions. △ Less", "We compute the electric dipole moment (EDM) of the bottom quark in minimal supersymmetric model (SUSY) with explicit CP violation. We estimate its upper bound to be 10^(-20) e-cm where the dominant contribution comes from the charginos for most of the SUSY parameter space. We also find that chargino contribution is directly correlated with the branching fraction of the B\\to X_s γdecay. Furthermore, we analyze the formation of 1 P_1 resonance of the (\\bar{b}b) system in e^+ e^- annihilation, and show that the CP-violating transition amplitude, induced solely by the b-quark EDM, is significantly larger than the CP-conserving ones. Therefore, observation of this CP-odd resonance in e^+ e^- annihilation will be a direct probe of the CP-violating phases in SUSY. In case experiment cannot establish the existence of such a CP-odd (\\bar{b}b) state, then either sparticle masses of all three generations will be pushed well above TeV, weakening the possibility of weak-scale SUSY, or the sparticle mass spectrum will be tuned so as to cancel different contributions to EDMs. △ Less", "We study soft SUSY breaking terms in heterotic M-theory. We show that both weakly and strongly coupled heterotic string models lead to the same relations of soft SUSY breaking terms, $A=-M$ and $m^2 = M^2/3$, up to $O((αT/S)^2)$. △ Less", "The slow roll inflation requires an extremely flat inflaton potential. The supersymmetry (SUSY) is not only motivated from the gauge hierarchy problem, but also from stabilizing that flatness of the inflaton potential against radiative corrections. However, it has been known that the Planck suppressed higher order terms in the Kähler potential receive large radiative corrections loosing the required flatness in the N = 1 supergravity. We propose to impose a global N = 2 SUSY on the inflaton sector. What we find is that the N = 2 SUSY Abelian gauge theory is exactly the same as the desired hybrid inflation model. The flat potential at the tree level is not our choice of parameters but a result of the symmetry. We further introduce a cut-off scale of the theory which is lower than the Planck scale. This lower cut-off scale suppresses the supergravity loop corrections to the flat inflaton potential. △ Less", "In this talk we assume the conventional see-saw mechanism, and contruct a hierarchical pattern of three active neutrinos with bi-maximal mixing. In order to enforce the hierarchy we use the single right handed neutrino dominance mechanism which is a very nice way to ensure a neutrino mass hierarchy in the presence of large mixing angles. We show how this mechanism can be organised in the framework of a U(1) family symmetry, then discuss a realistic string-inspired model which includes such a symmetry. △ Less", "In this report I surveyed physics potential of the gamma-gamma option of a Linear e+e- Collider with the following questions in mind: What new discovery can be expected at a gamma-gamma collider in addition to what will be learned at its `parent' e+e- Linear Collider? By taking account of the hard energy spectrum and polarization of colliding photons, produced by Compton back-scattering of laser light off incoming e- beams, we find that a gamma-gamma collider is most powerful when new physics appears in the neutral spin-zero channel at an invariant mass below about 80% of the c.m. energy of the colliding e-e- system. If a light Higgs boson exists, its properties can be studied in detail, and if its heavier partners or a heavy Higgs boson exists in the above mass range, they may be discovered at a gamma-gamma collider. CP property of the scalar sector can be explored in detail by making use of linear polarization of the colliding photons, decay angular correlations of final state particles, and the pattern of interference with the Standard model amplitudes. A few comments are given for SUSY particle studies at a gamma-gamma collider, where a pair of charged spinless particles is produced in the s-wave near the threshold. Squark-onium may be discovered. An e^\\pm gamma collision mode may measure the Higgs-Z-gamma coupling accurately and probe flavor oscillations in the slepton sector. As a general remark, all the Standard Model background simulation tools should be prepared in the helicity amplitude level, so that simulation can be performed for an arbitrary set of Stokes parameters of the incoming photon beams. △ Less", "We study the inclusive branching ratio for B-> X_s gamma in a class of string-inspired SUSY models with non-universal soft-breaking A-terms. We show that b->s gamma do not severely constrain the non-universality of these models and the parameter regions which are important for generating sizeable contribution to epsilon'/epsilon, of order 2 x10^(-3), are not excluded. We also show that the CP asymmetry of this decay is predicted to be much larger than the standard model prediction in a wide region of the parameter space. In particular, it can be of order 10-15% which can be accessible at B factories. △ Less", "The renormalization group evolution equation for two neutrino mixing is known to exhibit nontrivial fixed point structure corresponding to maximal mixing at the weak scale. The presence of the fixed point provides a natural explanation of the observed maximal mixing of $ν_μ-ν_τ$ if the $ν_μ$ and $ν_τ$ are assumed to be quasi-degenerate at the seesaw scale without constraining on the mixing angles at that scale. In particular, it allows them to be similar to the quark mixings as in generic grand unified theories. We discuss implementation of this program in the case of MSSM and find that the predicted mixing remains stable and close to its maximal value, for all energies below the $O$(TeV) SUSY scale. We also discuss how a particular realization of this idea can be tested in neutrinoless double beta decay experiments. △ Less", "We examine the discovery potential for SUSY new physics at a p{\\bar p} collider upgrade of Tevatron with \\sqrt s = 5.4 TeV and luminosity L ~= 4\\times 10^{32} cm^{-2}s^{-1} (the Tripler). We consider the reach for gluinos and squarks using the experimental signatures with large missing transverse energy (\\met) of jets + \\met and 1l + jets + \\met (where l=electron or muon) within the framework of minimal supergravity. The Tripler's strongest reach for the gluino is 1060 GeV for the jets + \\met channel and 1140 GeV for the 1l + jets + \\met channel for 30 fb^{-1} of integrated luminosity (approximately two years running time). This is to be compared with the Tevatron where the reach is 440(460) GeV in the jets + \\met channel for 15(30) fb^{-1} of integrated luminosity. △ Less", "The basic aim of physics studies at the LHC is to unravel the mechanism responsible for the spontaneous symmetry breaking in the Standard Model (SM). In the currently accepted theoretical picture, this translates into finding `direct' experimental evidence for the Higgs sector. TeV scale supersymmetry (SUSY) provides a very attractive solution to the `naturalness' problem that theories with elementary scalar fields have. Hence in this talk I will summarise the physics potential of the LHC for searching for Higgs and Supersymmetry as well as for measurement of the parameters of the Higgs sector and the SUSY model. Theories with localised gravity (and large extra dimensions) give a credible option to have Standard Model without the attendant `naturalness' problems. I will therefore also summarise the potential of LHC to probe these `large' extra dimensions. △ Less", "I summarise the activities of the different members of the SUSY working group. There have been two major areas of activity: 1) precision measurement of the SUSY particle masses/couplings and hence those of the SUSY model parameters, 2) investigations into SUSY searches at \\eplem, \\gamgam, $\\game$ and $\\emem$ colliders, in the nonstandard scenarios such as explicit CP violation, R-parity violation and Anomaly Mediated Supersymmtery Breaking. In addition there have been studies which looked at the effect of `large' extra dimensions at the various colliders mentioned above. △ Less", "We discuss the structure of infrared and ultraviolet singularities in on-shell QCD and supersymmetric QCD amplitudes at one-loop order. Previous results, valid for massless partons, are extended to the case of massive partons. Using dimensional regularization, we present a general factorization formula that controls both the singular epsilon-poles and the logarithmic contributions that become singular for vanishing masses. We introduce generalized Altarelli--Parisi splitting functions and discuss their relations with the singular terms in the amplitudes. The dependence on the regularization scheme is also considered. △ Less", "In the supersymmetric (SUSY) standard model, the lightest neutralino may be the lightest SUSY particle (LSP), and it is is a candidate of the dark matter in the universe. The LSP dark matter might be produced by the non-thermal process such as heavy particle decay after decoupling of the thermal relic LSP. If the produced LSP is relativistic, and does not scatter enough in the thermal bath, the neutralino LSP may contribute as the warm dark matter (WDM) to wash out the small scale structure of O(0.1) Mpc. In this letter we calculate the energy reduction of the neutralino LSP in the thermal bath and study whether the LSP can be the WDM. If temperature of the production time T_I is smaller than 5MeV, the bino-like LSP can be the WDM and may contribute to the small-scale structure of O(0.1) Mpc. The Higgsino-like LSP might also work as the WDM if T_I< 2MeV. The wino-like LSP cannot be the WDM in the favoured parameter region. △ Less", "I would like to attract attention of the LHC high-energy physics community to non-accelerator, low-energy experiments, that are also very sensitive to new physics. My example concerns search for supersymmetric dark matter particles. It is shown that non-observation of the SUSY dark matter candidates with a high-accuracy detector can exclude large domains of the MSSM parameter space and, in particular, can make especially desirable collider search for light SUSY charged Higgs boson. △ Less", "We analyze the flavor structure of the trilinear couplings in the different theoretical models of SUSY breaking. We generically obtain A_{ij}= A^L_i + A^R_j in all the models examined. In fact, this is the rigorous form when SUSY breaking effects appear through the Kahler metric of chiral fields or through wave-function renormalization. Indeed, the low-energy phenomenological requirements from the absence of charge and color breaking minima and the measurements in flavor changing neutral current (FCNC) observables strongly favor this restricted form of the trilinear matrices. As a straightforward consequence, the number of unknown parameters associated with the trilinear couplings is decreased in a factor of 2. △ Less", "A Supersymmetric Grand unified model is constructed based on SO(10)xSO(10) symmetry in which new types of Yukawa matrices couple standard and exotic fermions. Evolution of these couplings from the Grand Unified scale to the electroweak scale causes some of them to be driven to their fixed points. This solves the supersymmetric alignment problem and ensures that there are no observable flavor changing neutral currents mediated by supersymmetric particles. Fermion hierarchy and neutrino mixing constraints are automatically satisfied in this formalism. △ Less", "We show that in supersymmetric extensions of the Standard Model gluino box diagrams can yield a large CP-violating Delta(I)=3/2 contribution to s->d+q(bar)+q flavor-changing neutral current processes, which feeds into the I=2 isospin amplitude in K->pi+pi decays. This contribution only requires moderate mass splitting between the right-handed squarks u(tilde)_R and d(tilde)_R, and persists for squark masses of order 1 TeV. Taking into account current bounds on Im(delta_{sd}^{LL}) from K-K(bar) mixing, the resulting contribution to epsilon'/epsilon could naturally be an order of magnitude larger than the measured value. △ Less", "SUSY models with a gauge singlet easily allow for a strongly first order electroweak phase transition (EWPT). We discuss the wall profile, in particular transitional CP violation during the EWPT. We calculate CP violating source terms for the charginos in the WKB approximation and solve the relevant transport equations to obtain the generated baryon asymmetry. △ Less", "It is shown that the same essentially non-semiclassical mechanism, which generates in the nonsupersymmetric pure Yang-Mills theory the binary condensate of gauge field strengths, is responsible for the spontaneous breaking of the two supersymmetries in N=2 super Yang-Mills systems. A detailed discussion is presented in ref. \\cite{LBPM} △ Less", "We present a solution to the $μ$ problem in an SO(10) supersymmetric grand unified (SUSY GUT) model with gauge mediated (GMSB) and D-term supersymmetry breaking. A Peccei-Quinn ({\\bf PQ}) symmetry is broken at the messenger scale and enables the generation of the $μ$ term. The invisible axion (Goldstone boson of {\\bf PQ} symmetry breaking) is a cold dark matter candidate. At low energy, our model leads to a phenomenologically acceptable version of the minimal supersymmetric standard model (MSSM) with novel particle phenomenology. Either the gluino or the gravitino is the lightest supersymmetric particle (LSP). The phenomenological constraints on the model result in a Higgs with mass $\\sim 86 - 91$ GeV and $\\tanβ\\sim 9 - 14$. △ Less", "We present a new constraint on a lepton mixing matrix $V$ from lepton-flavor violating (LFV) processes in supersymmetric standard models with massive neutrinos. Here, we assume Yukawa-coupling unification $f_{ν3}\\simeq f_{\\rm top}$, in which $τ$-neutrino Yukawa coupling $f_{ν3}$ is unified into top-quark Yukawa coupling $f_{\\rm top}$ at the unification scale $M_*\\simeq 3\\times 10^{16}$ GeV. We show that the present experimental bound on $μ\\to e γ$ decay already gives a stringent limit on the lepton mixing (typically $V_{13}<0.02$ for $V_{23}=1/\\sqrt{2}$). Therefore, many existing neutrino-mass models are strongly constrained. Future improvement of bounds on LFV processes will provide a more significant impact on the models with the Yukawa-coupling unification. We also stress that a precise measurement of a neutrino mixing $(V_{MNS})_{e3}$ in future neutrino experiments would be very important, since the observation of non-zero $(V_{MNS})_{e3}$, together with negative experimental results for the LFV processes, have a robust potential to exclude a large class of SUSY standard models with the Yukawa-coupling unification. △ Less", "This report presents the theoretical analysis relevant for Higgs physics at the upgraded Tevatron collider and documents the Higgs Working Group simulations to estimate the discovery reach in Run 2 for the Standard Model and MSSM Higgs bosons. Based on a simple detector simulation, we have determined the integrated luminosity necessary to discover the SM Higgs in the mass range 100-190 GeV. The first phase of the Run 2 Higgs search, with a total integrated luminosity of 2 fb-1 per detector, will provide a 95% CL exclusion sensitivity comparable to that expected at the end of the LEP2 run. With 10 fb-1 per detector, this exclusion will extend up to Higgs masses of 180 GeV, and a tantalizing 3 sigma effect will be visible if the Higgs mass lies below 125 GeV. With 25 fb-1 of integrated luminosity per detector, evidence for SM Higgs production at the 3 sigma level is possible for Higgs masses up to 180 GeV. However, the discovery reach is much less impressive for achieving a 5 sigma Higgs boson signal. Even with 30 fb-1 per detector, only Higgs bosons with masses up to about 130 GeV can be detected with 5 sigma significance. These results can also be re-interpreted in the MSSM framework and yield the required luminosities to discover at least one Higgs boson of the MSSM Higgs sector. With 5-10 fb-1 of data per detector, it will be possible to exclude at 95% CL nearly the entire MSSM Higgs parameter space, whereas 20-30 fb-1 is required to obtain a 5 sigma Higgs discovery over a significant portion of the parameter space. Moreover, in one interesting region of the MSSM parameter space (at large tan(beta)), the associated production of a Higgs boson and a b b-bar pair is significantly enhanced and provides potential for discovering a non-SM-like Higgs boson in Run 2. △ Less", "We examine what can be deduced from the discovery of a Higgs boson, focusing on a possible discovery at LEP. The analysis begins with the most general situation where no further constraints can be deduced, and then specializes to include various assumptions. Assuming naturalness, the relatively large mass suggests that one or more of larger $\\tan β$, large phase, or extra singlets is present. We discuss the implications of a Higgs mass discovery for the SUSY spectrum, and in particular gluinos and stops. We show that a lighter gluino produceable at the Tevatron remains a likely possibility, in disagreement with a recent claim. △ Less", "We study the vacuum stability in the anomaly mediated supersymmetry (SUSY) breaking models with massive neutrinos. It is shown that, because of the seesaw-induced mass terms for neutrinos, the true vacuum has a large negative cosmological constant provided that the vacuum where we now live has an (almost) vanishing cosmological constant. Although the quantum transition into the true vacuum from our false vacuum is highly suppressed, the thermal transition at high temperatures may not be neglected because of the thermal excitations. However, we find that the thermal transition is, in fact, negligibly small and hence the anomaly mediation models are cosmologically safe. Thus, we conclude that the reheating temperature T_R could be very high (e.g. T_R >> 10^10 GeV) in the anomaly mediation models even with the seesaw-induced mass terms for neutrinos. △ Less", "We study the direct CP asymmetry in B -> X_s gamma decay in SUSY models with non-universal A-terms. We show that the flavour-dependent phases of the A-terms, unlike the flavour-independent ones, can give rise too large contribution to the CP asymmetry while respecting the experimental bounds on the branching ratio of B -> X_s gamma decay and the electric dipole moments of the electron and neutron. The CP asymmetry of this decay is predicted to be much larger than the standard model prediction in a wide region of the parameter space. In particular, it can be of order 10-15% which can be accessible at B factories. △ Less", "We discuss the production of charginos, neutralinos, and third generation sfermions in $e^+e^-$ annihilation in the energy range $\\sqrt{s} = 0.2-1$ TeV. We present numerical predictions within the Minimal Supersymmetric Standard Model for the cross sections and study the importance of beam polarization for the determination of the underlying SUSY parameters. △ Less", "Including contributions of scale-dependent vacuum expectation values, we derive new analytic formulas and obtain substantially different numerical predictions for the running masses of quarks and charged-leptons at higher scales in the SM, 2HDM and MSSM. These formulas exhibit significantly different behaviours with respect to their dependence on gauge and Yukawa couplings than those derived earlier. At one-loop level the masses of the first two generations are found to be independent of Yukawa couplings of the third generation in all the three effective theories in the small mixing limit. Analytic formulas are also obtained for running $\\tanβ(μ)$ in 2HDM and MSSM. Other numerical analyses include study of the third generation masses at high scales as functions of low-energy values of $\\tanβ$ and SUSY scale $M_S=M_Z-10^4$ GeV. △ Less", "The detection of dark matter is central to particle physics and cosmology. Current fashionable supersymmetric models provide a dark matter candidate, the lightest supersymmetric particle (LSP). When combined with fairly well understood physics (quark structure of the nucleon and some nuclear structure, they yield direct event rates. The obtained rates are, however, very low. So we exploit characteristic signatures, like the modulation effect, i.e. the dependence of the rate on the earth's annual motion, and the directional rate, i.e its dependence on the direction of the recoiling nucleus, employing various velocity distributions, isothermal (symmetric and axially asymmetric) and non isothermal (due to to caustic rings). △ Less", "SUSY breaking without messenger fields is proposed. We assume that our world is on a wall and SUSY is broken only by the coexistence of another wall with some distance from our wall. The Nambu-Goldstone fermion is localized on the distant wall. Its overlap with the wave functions of physical fields on our wall gives the mass splitting of physical fields on our wall thanks to a low-energy theorem. We propose that this overlap provides a practical method to evaluate mass splitting in models with SUSY breaking due to the coexisting walls. △ Less", "We discuss possible large contributions to B -> X_s gamma, which can occur at the next-to-leading order in supersymmetric models. They can originate from terms enhanced by tan(beta) factors, when the ratio between the two Higgs vacuum expectation values is large, or by logarithm of M_{susy}/M_W, when the supersymmetric particles are considerably heavier than the W boson. We give compact formulae which include all potentially large higher-order contributions. We find that tan(beta) terms at the next-to-leading order do not only appear from the Hall-Rattazzi-Sarid effect (the modified relation between the bottom mass and Yukawa coupling), but also from an analogous effect in the top-quark Yukawa coupling. Finally, we show how next-to-leading order corrections, in the large tan(beta) region, can significantly reduce the limit on the charged-Higgs mass, even if supersymmetric particles are very heavy. △ Less", "After briefly reviewing the status of epsilon'/epsilon in the Standard Model, I discuss SUSY contributions to epsilon'/epsilon, K^+ to pi^+ nu bar nu, K_L to pi^0 nu bar nu and K_L to pi^0 e^+ e^-. While in the simplest case of the MSSM with Minimal Flavour Violation the main effect is a suppression of these transitions with respect to the Standard Model, large enhancements are possible in more general SUSY models, with interesting correlations among the different processes. △ Less", "Results are presented of a next-to-leading order calculation in perturbative QCD of the production of charginos and neutralinos in association with gluinos at hadron colliders. Predictions for cross sections are shown at the energies of the Fermilab Tevatron and CERN Large Hadron Collider for a typical supergravity (SUGRA) model of the sparticle mass spectrum and for a light gluino model. △ Less", "We calculate the proton lifetime in an SO(10) supersymmetric grand unified theory [SUSY GUT] with U(2) family symmetry. This model fits the low energy data, including the recent data for neutrino oscillations. We discuss the predictions of this model for the proton lifetime in light of recent SuperKamiokande results which significantly constrain the SUSY parameter space of the model. △ Less", "Flavor changing neutral current and lepton flavor violating processes are studied in the SU(5) SUSY-GUT with right-handed neutrino supermultiplets. Using input parameters motivated by neutrino oscillation, it is shown that the time-dependent CP asymmetry of $b \\to s γ$ can be as large as 20%. We also show that the $B_s$-$\\bar{B}_s$ mixing can be significantly different from the standard model prediction. △ Less", "The existence of extra chiral generations with all fermions heavier than $M_Z$ is strongly disfavored by the precision electroweak data. The exclusion of one additional generation of heavy fermions in SUSY extension of Standard Model is less forbidden if chargino and neutralino have low degenerate masses with $Δm \\simeq 1$ GeV. However the data are fitted nicely even by a few extra generations, if one allows neutral leptons to have masses close to 50 GeV. Such heavy neutrino can be searched in the reaction $e^+ e^- \\to N\\bar{N}γ$ at LEP-200 with total final luminosity of $2600 pb^{-1}$. △ Less", "Bilinear R-parity violation is a simple extension of the MSSM allowing for Majorana neutrino masses. One of the three neutrinos picks up mass by mixing with the neutralinos of the MSSM, while the other two neutrinos gain mass from 1-loop corrections. Once 1-loop corrections are carefully taken into account the model is able to explain solar and atmospheric neutrino data for specific though simple choices of the R-parity violating parameters. △ Less", "The O(alpha_s) SUSY QCD corrections to the decays of the MSSM Higgs bosons into bottom quarks and squarks can be very large for large tan beta in the on--shell renormalization scheme. We improve the calculation by a careful choice of the tree-level Higgs boson couplings in terms of running parameters of quarks and squarks. △ Less", "We construct a realistic model based on SUSY SO(10) with U(2) flavor symmetry. A set of symmetric mass textures give rise to very good predictions; 15 masses and 6 mixing angles are predicted by 11 parameters. Both the vacuum oscillation and LOW solutions are favored for the solar neutrino problem. △ Less", "We present results from a new Monte Carlo simulation for jet fragmentation in QCD and SUSY QCD for large primary energies $\\sqrt s$ up to $10^{16}$ GeV. In the case of SUSY QCD the simulation takes into account not only gluons and quarks as cascading particles, but also their supersymmetric partners. A new model-independent hadronization scheme is developed, in which the hadronization functions are found from LEP data. An interesting feature of SUSY QCD is the prediction of a sizeable flux of the lightest supersymmetric particles (LSPs), if R-parity is conserved. About 10% of the jet energy is transferred to LSPs which, owing to their harder spectra, constitute an important part of the spectra for large $x=E/E_{jet}$. Spectra of protons and of secondary particles, photons and neutrinos, are also calculated. These results have implications for the decay of superheavy particles with masses up to the GUT scale, which have been suggested as a source of ultrahigh energy cosmic rays. △ Less", "We promote the microscopic theory of standard model (MSM, hep-ph/0007077) into supersymmetric framework in order to solve its technical aspects of vacuum zero point energy and hierarchy problems, and attempt, further, to develop its realistic viable minimal SUSY extension. Among other things that - the MSM provides a natural unification of geometry and the field theory, has clarified the physical conditions in which the geometry and particles come into being, in microscopic sense enables an insight to key problems of particle phenomenology and answers to some of its nagging questions - a present approach also leads to quite a new realization of the SUSY yielding a physically realistic particle spectrum. It stems from the special subquark algebra, from which the nilpotent supercharge operators are derived. The resulting theory makes plausible following testable implications for the current experiments at LEP2, at the Tevatron and at LHC drastically different from those of the conventional MSSM models: 1. All the sparticles and Higgs bosons never could emerge in spacetime continuum, thus, they cannot be discovered in these experiments nor at any energy range. 2. For each of the three SM families of quarks and leptons there are corresponding heavy family partners with the same quantum numbers lying far above the electroweak scale, respectively, at the energy threshold values: $E_{1}>(419.6 \\pm 12.0)GeV, \\quad E_{2}= (457.6 \\pm 13.2)GeV$ and $E_{3}=(521.4 \\pm 15.0)GeV.$ △ Less", "The range of neutralino-proton cross sections for R-parity preserving supergravity models with GUT scale unification of the gauge coupling constants is examined. The models considered here are mSUGRA, models with non universal soft breaking and D-brane models. It is found that the current dark matter detectors are sampling significant parts of the SUSY parameter space and future detectors could sample almost the entire space. The special regions of parameter space that may be inaccessible to future detectors are seen to have a squark/gluino spectra beyond 1 TeV, but observable at the LHC. △ Less", "We argue that the discovery of neutrino mass effects at Super-Kamiokande implies a clear logical chain leading from the Standard Model, through the MSSM and the recently developed Minimal Left Right Supersymmetric models with a renormalizable see-saw mechanism for neutrino mass, to Left Right symmetric SUSY GUTS : in particular, SO(10) and $SU(2)_L \\times SU(2)_R\\times SU(4)_c$. The progress in constructing such GUTS explicitly is reviewed and their testability/falsifiability by lepton flavour violation and proton decay measurements emphasized. Susy violations of the survival principle and the interplay between third generation Yukawa coupling unification and the structurally stable IR attractive features of the RG flow in SUSY GUTS are also discussed . △ Less", "We evolve virtual photon parton densities up to the SUSY threshold and higher using coupled inhomogeneous DGLAP differential equations. Reliable input parameterizations were available from the c-quark threshold. Limited $P^2$ ( target photon virtuality ) dependence is observed. The difference to the photon structure function is shown to be significant with the introduction of SUSY dependent splitting functions. A negligible difference is observed by letting the gluino mass enter after the squark mass. An effort is made to include the squark threshold effect in such a way that both the renormalization group equations are satisfied and the perturbative calculation is reproduced. △ Less", "We review an efficient formulation of the complete theory of supersymmetry without R-parity, where all the admissible R-parity violating terms incorporated. Some interesting recent results will be discussed, including newly identified 1-loop contributions to neutrino masses and electric dipole moments of neutron and electron, resulted from R-parity violating LR squark and slepton mixings. △ Less", "We calculate total and differential cross sections for the production of sfermion pairs in photon-photon collisions, including contributions from resolved photons and arbitrary photon polarization. Sfermion production in photon collisions depends only on the sfermion mass and charge. It is thus independent of the details of the SUSY breaking mechanism, but highly sensitive to the sfermion charge. We compare the total cross sections for bremsstrahlung, beamstrahlung, and laser backscattering photons to those in $e^+e^-$ annihilation. We find that the total cross section at a polarized photon collider is larger than the $e^+e^-$ annihilation cross section up to the kinematic limit of the photon collider. △ Less", "We discuss Lepton-Flavour-Violating phenomena such as $μ\\to e γ$, $μ\\to eee$, and $μ\\to e$ conversion in nuclei in SUSY models with and without R-parity. We stress that experimental searches for all the LFV processes are important to distinguish between the different models. △ Less", "We revisit the singular IIB supergravity solution describing M fractional 3-branes on the conifold [hep-th/0002159]. Its 5-form flux decreases, which we explain by showing that the relevant \\NN=1 SUSY SU(N+M)xSU(N) gauge theory undergoes repeated Seiberg-duality transformations in which N -> N-M. Far in the IR the gauge theory confines; its chiral symmetry breaking removes the singularity of hep-th/0002159 by deforming the conifold. We propose a non-singular pure-supergravity background dual to the field theory on all scales, with small curvature everywhere if the `t Hooft coupling g_s M is large. In the UV it approaches that of hep-th/0002159, incorporating the logarithmic flow of couplings. In the IR the deformation of the conifold gives a geometrical realization of chiral symmetry breaking and confinement. We suggest that pure \\NN=1 Yang-Mills may be dual to strings propagating at small g_s M on a warped deformed conifold. We note also that the standard model itself may lie at the base of a duality cascade. △ Less", "Unless squarks and sleptons are in the multi-TeV region or above, CP violating induced electric dipole moments of elementary particles can pose significant puzzles for supersymmetric (SUSY) models. We study the dipole-moment-inducing one-loop amplitudes as a function of the fundamental SUSY parameters and show that these puzzles are removed if there is a sufficiently large hierarchy between the gaugino masses and the scalar mass. We comment on the experimental status of the low gaugino mass scenario. △ Less", "CP violation in the B_d system is discussed in the supersymmetric grand unified theory (GUT) with the right-handed neutrinos. Above the GUT scale, the right-handed down-type squarks couple to the right-handed neutrinos. Due to the renormalization group effect, flavor violations in the lepton sector may be transfered to the right-handed down-type squark mass matrix, which affects the CP violation in the B decay. Taking into account this effect, we compare the CP violation in B_d \\to ψK_S and B_d \\to φK_S processes. We will find that a significant difference is possible between the CP violating phases in two decay processes. △ Less", "We examine the possibility of observing exotic top quark decays via R-violating SUSY interactions at the Fermilab Tevatron and CERN LHC. We present cross-sections for $t\\bar t$ production followed by the subsequent decay of either $t$ or $\\bar t$ via the R-violating interaction while the other undergoes the SM decay. With suitable kinematic cuts, we find that the exotic decays can possibly be detected over standard model backgrounds at the future runs of the Tevatron and LHC, but not at Run 1 of the Tevatron due to limited statistics. Discovery limits for R-Violating couplings in the top sector are presented. △ Less", "We provide a detailed analysis of the supersymmetric tri-lepton signals for sparticle searches at the Tevatron in the minimal supersymmetric standard model with general CP-violating phases but without flavor mixing among sfermions of different generation. The stringent experimental constraints on the CP-violating phases from the electron and neutron electric dipole moments are included in the analysis for two exemplary scenarios of the SUSY parameters; one with decoupled first two generation sfermions and the other with non-decoupled sfermions. In both scenarios, the production cross section and the branching fractions of the leptonic chargino and neutralino decays are sensitive to CP-violating phases. The production-decay spin correlations lead to several non-trivial CP-even observables such as the lepton invariant mass distribution and the lepton angular distribution, and several interesting T-odd (CP-odd) momentum triple products. The possibility of measuring the CP-violating phases directly through those T-odd observables is investigated in detail. △ Less", "We construct and discuss a \"realistic\" example of SUSY SU(5) GUT model, with an additional U(1) flavour symmetry, that is not plagued by the need of large fine tunings, like those associated with doublet-triplet splitting in the minimal model, and that leads to an acceptable phenomenology. This includes coupling unification with a value of alpha_s(m_Z) in much better agreement with the data than in the minimal version, an acceptable hierarchical pattern for fermion masses and mixing angles, also including neutrino masses and mixings, and a proton decay rate compatible with present limits (but the discovery of proton decay should be within reach of the next generation of experiments). In the neutrino sector the preferred solution is one with nearly maximal mixing both for atmospheric and solar neutrinos. △ Less", "We compute the MSSM one-loop contributions to the asymptotic energy behaviour of fermion-antifermion pair production at future lepton-antilepton colliders. Besides the conventional logarithms of Renormalization Group origin, extra SUSY linear logarithmic terms appear of \"Sudakov-type\". In the TeV range their overall effect on a variety of observables can be quite relevant and drastically different from that obtained in the SM case. △ Less", "SO(10) supersymmetric grand unified theories [SUSY GUTs] provide a beautiful framework for physics beyond the standard model. Experimental measurements of the three gauge couplings are consistent with unification at a scale $M_G \\sim 3 \\times 10^{16}$ GeV. In addition predictive models for fermion masses and mixing angles have been found which fit the low energy data, including the recent data for neutrino oscillations. SO(10) boundary conditions can be tested via the spectrum of superparticles. The simplest models also predict neutron and proton decay rates. In this paper we discuss nucleon decay rates and obtain reasonable upper bounds. A clear picture of the allowed SUSY spectra as constrained by nucleon decay is presented. △ Less", "We analyze the decays of charginos, neutralinos, gluinos and the first/second generation squarks in the Minimal Supersymmetric extension of the Standard Model, focusing on the three-body decays in scenarios where the ratio $\\tan β$ of vacuum expectation values of the two Higgs doublet fields is large. We show that the three-body decays of the next-to-lightest neutralinos (lightest charginos) into $b\\bar{b},τ^+τ^-$ ($τν$) final states, where third generation sfermion and Higgs boson exchange diagrams play an important role, are dominant. Furthermore, we show that decays of gluinos into $b\\bar{b}$ final states and squark decays into lighter sbottoms through gluino exchange can also have sizeable branching fractions, especially in scenarios where the soft SUSY breaking gaugino mass parameters are not unified at the GUT scale. △ Less", "Motivated by the possibilities of $b-τ$ or $t-b-τ$ Yukawa unification in the supersymmetric Grand Unified Theories, we consider the dangerous directions of the supersymmetric potential for large values of $\\tanβ(\\geq 30)$, in two versions of the minimal supergravity model with and without common soft breaking scalar masses at the GUT scale, where the potential may become unbounded from below. We find that for the common trilinear coupling $A_0 \\leq 0$ the requirement of $b-τ$ unification in conjunction with the stability condition on the potential yields highly restrictive sparticle spectra with upper, and in many cases, lower bounds stronger than the available experimental lower bounds, on the soft SUSY breaking common scalar mass and the common gaugino mass. Over a significant region of the parameter space, the model becomes even more restrictive if the common sfermion soft mass is different from the soft mass for the Higgs sector. We also find that the bulk of this restricted parameter space can be probed at the LHC. Im models with $t-b-τ$ Yukawa unification, $A_0 \\leq 0$ is ruled out from potential constraints. △ Less", "The helicity amplitudes for the process $γγ\\to A^0 A^0$ are studied to 1-loop order in the minimal SUSY (MSSM) model, where $A^0$ is the CP-odd Higgs particle. Simple exact analytic formulae are obtained, in terms of the $C_0$ and $D_0$ Passarino-Veltman functions; in spite of the fact that the loop-diagrams often involve different particles running along their sides. For a usual mSUGRA set of parameters, $σ(γγ\\to A^0 A^0) \\sim (0.1-0.2)\\rm fb $ is expected. If SUSY is realized in Nature, these expressions should be useful for understanding the Higgs sector. △ Less", "We examine the reach of the CERN LHC pp collider for supersymmetric models where the dominant contribution to soft SUSY breaking parameters arises from the superconformal anomaly. In the simplest viable anomaly mediated SUSY breaking (AMSB) model, tachyonic slepton squared masses are made positive by adding a universal contribution m_0^2 to all scalars. We use the event generator ISAJET to generate AMSB signal events as a function of model parameter space. Assuming an integrated luminosity of 10 fb-1, the LHC can reach to values of $m_{\\tg}\\sim 2.3$ TeV for low values of $m_0$, where the dilepton plus jets plus E_T(missing) channel offers the best reach. For large $m_0$, the best signature is typically 0 or 1 isolated lepton plus jets plus E_T(missing); in this case the reach is typically diminished to values of $m_{\\tg}\\sim 1.3$ TeV. The presence of terminating tracks in a subset of signal events could serve to verify the presence of a long lived lightest chargino which is generic in the minimal AMSB model. △ Less", "We demonstrate that some of the suggested five supergravity points for study at the LHC could be approximately derived from perturbative string theories or M-theory, but that charge and colour breaking minima would result. As a pilot study, we then analyse a perturbative string model with non-universal soft masses that are optimised in order to avoid global charge and colour breaking minima. By combining measurements of up to six kinematic edges from squark decay chains with data from a new kinematic variable, designed to improve slepton mass measurements, we demonstrate that a typical LHC experiment will be able to determine squark, slepton and neutralino masses with an accuracy sufficient to permit an optimised model to be distinguished from a similar standard SUGRA point. The technique thus generalizes SUSY searches at the LHC. △ Less", "We analyze the supersymmetric (SUSY) QCD contribution to the $h^0 b \\bar{b}$ coupling at one loop in the Minimal Supersymmetric Model (MSSM) in the decoupling limit. Analytic expressions in the large SUSY mass region are derived and the decoupling behavior of the corrections is examined in various limiting cases, where some or all of the SUSY mass parameters become large. We show that in the decoupling limit of large SUSY mass parameters and large CP-odd Higgs mass, the $h^0 b \\bar b$ coupling approaches its Standard Model value at one loop. However, the onset of decoupling is delayed when $\\tanβ$ is large. In addition, the one-loop SUSY-QCD corrections decouple if the masses of either the bottom squarks or the gluino are separately taken large; although the approach to decoupling is significantly slower in the latter case. △ Less", "The status of SUSY searches at LEP2 up to centre-of-mass energy of 202 GeV is presented. Search strategies for sleptons, squarks, charginos and neutralinos are discussed in the framework of Minimal Supersymmetric Standard Model with R-parity conservation. With no indication for the production of these particles new limits are set on their masses. △ Less", "Production of supersymmetric particles in TeV scale polarized photon-proton collisions is discussed. Polarizations of both photon and proton beams are considered. Associated productions of squark-chargino and squark-gluino, and production of squark pairs have been examined. Although the cross sections for different initial beam polarizations do not differ much, the polarization asymmetry is sensitive to the sparticle mass. We conclude that the capacity of future linac-ring type TeV scale photon-proton colliders is quite promising in the search for SUSY particles. △ Less", "An effective mass scale Meffsusy for supersymmetric particles is defined and techniques for its measurement at the LHC discussed. Monte Carlo results show that, for jets + ETmiss events, a variable constructed from the scalar sum of the transverse momenta of all reconstructed jets together with ETmiss provides in most cases the most accurate model independent measurement of Meffsusy (intrinsic precision ~ 2.1 % for mSUGRA models). The overall precision with which Meffsusy could be measured after given periods of LHC running and for given classes of SUSY models is calculated. The technique is extended to measurements of the total SUSY particle production cross section sigmasusy. △ Less", "We construct models in which electroweak symmetry is spontaneously broken by supersymmetric strong dynamics at the TeV scale. The order parameter is a composite of scalars, and the longitudinal components of the W and Z are strongly-coupled bound states of scalars. The usual phenomenological problems of dynamical electroweak symmetry breaking are absent: the sign of the S parameter unconstrained in strongly interacting SUSY theories, and fermion masses are generated without flavor-changing neutral currents or large corrections to the rho parameter. The lightest neutral Higgs scalar can be heavier than M_Z without radiative corrections from standard-model fields. All the mass scales in the model can be naturally related in low-scale models of supersymmetry breaking. The mu problem can also be solved naturally, and the model can incorporate perturbative unification of standard-model gauge couplings with intermediate thresholds. △ Less", "In a large class of supersymmetric (SUSY) axion model the mass of axino $\\axino$ (a fermionic superpartner of the axion) is predicted as $m_{\\axino} \\lesssim {\\cal O}(1)$ keV. Thus, the axino is the lightest SUSY particle (LSP). We pointed out that such a light axino provides a natural solution to the gravitino problem, if the gravitino is the next LSP. We derive a constraint on the reheating temperature $T_R$ of inflation, $T_R \\lesssim 10^{15}$ GeV for the gravitino mass $m_{3/2} \\simeq 100$ GeV, which is much weaker than that obtained in the minimal SUSY standard model. △ Less", "There are many low-energy models of supersymmetry breaking parameters which are motivated by theoretical and experimental considerations. Here, we discuss some of the lesser-known theories of low-energy supersymmetry, and outline their phenomenological consequences. In some cases, these theories have more gauge symmetry or particle content than the Minimal Supersymmetric Standard Model. In other cases, the parameters of the Lagrangian are unusual compared to commonly accepted norms (e.g., Wino LSP, heavy gluino LSP, light gluino, etc.). The phenomenology of supersymmetry varies greatly between the different models. Correspondingly, particular aspects of the detectors assume greater or lesser importance. Detection of supersymmetry and the determination of all parameters may well depend upon having the widest possible view of supersymmetry phenomenology. △ Less", "In this talk, I discuss some aspects of Higgs searches at future colliders, particularly comparing and contrasting the capabilities of LHC and Next Linear Collider (NLC), including the aspects of Higgs searches in supersymmetric theories. After this, I will discuss how the search and study of sparticles other than the Higgs can give information about the parameters of the Minimal Supersymmetric Standard Model (MSSM). △ Less", "We analyse the predictions for the inclusive branching ratio for $b\\to sγ$ decay in a class of string-inspired SUSY models with non-universal soft-breaking A-terms. These models are particularly interesting since the non-universality of the A-terms plays an important role in providing new significant contributions to CP violation effects in kaon physics while respecting the severe bounds on electric dipole moments. We show that $b\\to sγ$ do not severely constrain the non-universality of these models. In particular, at low $\\tanβ$ $(\\tanβ\\simeq 2)$, our predictions are close to the universal case. For large $\\tanβ$ ($\\tanβ\\gsim 15$),the effect of non-universality is enhanced and stronger constraints hold. We find that the parameter regions which are important for generating sizeable contribution to $ε'/ε$, of order $2 \\times 10^{-3}$, are not excluded. △ Less", "We construct a realistic model based on SUSY SO(10) with U(2) flavor symmetry. In contrast to the commonly used effective operator approach, $126-$dimensional Higgses are used to construct the Yukawa sector. R-parity symmetry is thus preserved at low energies. The Dirac and right-handed Majorana mass matrices in our model have very small mixing, and they combine with the seesaw mechanism resulting in a large leptonic mixing. The symmetric mass textures arising from the left-right symmetry breaking chain of SO(10) give rise to very good predictions; 15 masses (including 3 right-handed Majorana neutrino masses) and 6 mixing angles are predicted by 11 parameters. Both the vacuum oscillation and LOW solutions are favored for the solar neutrino problem. △ Less", "We extend the recently proposed gluino axion model to include neutrino masses. We discuss how the canonical seesaw model and the Higgs triplet model may be realized in this framework. In the former case, the heavy singlet neutrinos are contained in superfields which do not have any vacuum expectation value, whereas the gluino axion is contained in one which does. We also construct a specific renormalizable model which realizes the mass scale relationship $M_{SUSY} \\sim f_a^2/M_U$, where $f_a$ is the axion decay constant and $M_U$ is a large effective mass parameter. △ Less", "We examine the (softly broken) supersymmetric gauge-Higgs-Yukawa theories satisfying the compositeness conditions at a certain scale. In these theories the Higgs superfields can be regarded as the chiral composite fields. It is found that there are the fundamental theories, which contain the dimension 5 interactions and the hard SUSY breaking in perturbation, turn to be renormalizable and also softly broken theories in the nonperturbative framework. The soft SUSY breaking parameters as well as the Yukawa coupling in the corresponding gauge-Higgs-Yukawa theories are restricted by the renormalization group invariant relations. △ Less", "Several new effects have been investigated in recent analyses of supersymmetric dark matter. These include the effects of the uncertainties of wimp velocity distributions, of the uncertainties of quark densities, of large CP violating phases, of nonuniversalities of the soft SUSY breaking parameters at the unification scale and of coannihilation on supersymmetric dark matter. We review here some of these with emphasis on the effects of nonuniversalities of the gaugino masses at the unification scale on the neutralino-proton cross-section from scalar interactions. The review encompasses several models where gaugino mass nonuniversalities occur including SUGRA models and D brane models. One finds that gaugino mass nonuniversalities can increase the scalar cross-sections by as much as a factor of 10 and also significantly extend the allowed range of the neutralino mass consistent with constraints up to about 500 GeV. These results have important implications for the search for supersymmetric dark matter. △ Less", "NLO SUSY-QCD contributions to associated production of gluinos and gauginos are shown to enhance the cross sections by about 10% at the Tevatron and by as much as a factor of two at the LHC. They shift the mass determinations or discovery limits, soften the $p_T$ spectra, and stabilize the predictions against variations of the renormalization and factorization scales. △ Less", "We present complete results of a next-to-leading order calculation of the production of gaugino-like charginos ($\\chargino$) and neutralinos ($\\neutralino$) in association with gluinos ($\\gluino$) at hadron colliders, including the strong corrections from the exchange of colored particles and sparticles. Adopting a variety of models for the sparticle mass spectrum, including typical supergravity (SUGRA) models and a light gluino model, we provide predictions for total and differential cross sections at the energies of the Fermilab Tevatron and CERN Large Hadron Collider (LHC). △ Less", "We re-analyse the prospects of discovering supersymmetry at the LHC, in order to re-express coverage in terms of a fine-tuning parameter and to extend the analysis to scalar masses (m_0) above 2 TeV. We use minimal supergravity (mSUGRA) unification assumptions for the SUSY breaking parameters. The discovery reach at high m_0 is of renewed interest because this region has recently been found to have a focus point, leading to relatively low fine-tuning, and because it remains uncertain how much of the region can be ruled out due to lack of radiative electroweak symmetry breaking. The best fine tuning reach is found in a mono-leptonic channel, where for mu>0, A_0=0 and tan beta=10 (within the focus point region), and a top mass of 174 GeV, all points in mSUGRA with m_0 < 4000 GeV, with a fine tuning measure up to 210 (500) are covered by the search, where the definition of fine-tuning excludes (includes) the contribution from the top Yukawa coupling. Even for arbitrarily high m_0, mSUGRA can be discovered through gaugino events, provided the gaugino mass parameter M_1/2 < 460 GeV. In this region, the mono-leptonic channel still provides the best reach. △ Less", "It is shown that, due to soft supersymmetry breaking in gauge theories within the superfield formalism, there appears the mass for auxiliary gauge fields. It enters into the RG equations for soft masses of physical scalar particles and can be eliminated by solving its own RG equation. Explicit solutions up to the three-loop order in the general case and in the MSSM are given. The arbitrariness in choosing the initial condition is discussed. △ Less", "We study flavour violation in the minimal SUSY SU(5) GUT assuming all the third generation Yukawa couplings to be due to the renormalizable physics above GUT scale. At large $\\tanβ,$ as suggested by Yukawa unification in SU(5), sizable flavour violation in the left (right) slepton (down squark) sector is induced due to renormalization effects of down type Yukawa couplings between GUT and Planck scales in addition to the flavour violation in the right slepton sector. The new flavour physics contribution to $K-\\bar K,$ $B-\\bar B$ mixing is small but might be of phenomenological interest in the case of $b\\to sγ.$ The sign of the latter contribution is the same as the sign of the dominant chargino contribution, thus making the constraints on SUSY scale coming from $b\\to sγ$ somewhat more restrictive. The most important feature of the considered scenario is the large rate of lepton flavour violation. Given the present experimental constraints, the $μ\\to eγ$ and $μ-e$ conversion branching ratios are above the sensitivity of the planned experiments unless the SUSY scale is pushed above one TeV. △ Less", "The results obtained by the Working Group on Supersymmetry at the 1999 Les Houches Workshop on Collider Physics are summarized. Separate chapters treat \"general\" supersymmetry, R-parity violation, gauge mediated supersymmetry breaking, and anomaly mediated supersymmetry breaking. △ Less", "A brief review is given of the effects of CP violation on the direct detection of neutralinos in dark matter detectors. We first summarize the current developments using the cancellation mechanism which allows for the existence of large CP violating phases consistent with experimental limits on the electron and on the neutron electric dipole moments in a broad class of SUSY, string and D brane models. We then discuss their effects on the scattering of neutralinos from quarks and on the event rates. It is found that while CP effects on the event rates can be enormous such effects are reduced significantly with the imposition of the EDM constraints. However, even with the inclusion of the EDM constraints the effects are still very significant and should be included in a precision prediction of event rates in any SUSY, string or D brane model. △ Less", "An understanding of the lepton masses within the framework of SUSY is presented. A family symmetry is introduced. Sneutrino VEV breaks this symmetry. The tau mass is due to the Higgs VEV, and muon mass purely from the sneutrino VEV. A viable model is constructed, which predicts (1-10) MeV tau-neutrino. △ Less", "It has recently been pointed out that viable sparticle mass spectra can be generated in Yukawa unified SO(10) supersymmetric grand unified models consistent with radiative breaking of electroweak symmetry. Model solutions are obtained only if $\\tanβ\\sim 50$, $μ<0$ and positive $D$-term contributions to scalar masses from SO(10) gauge symmetry breaking are used. In this paper, we attempt to systematize the parameter space regions where solutions are obtained. We go on to calculate the relic density of neutralinos as a function of parameter space. No regions of the parameter space explored were actually cosmologically excluded, and very reasonable relic densities were found in much of parameter space. Direct neutralino detection rates could exceed 1 event/kg/day for a $^{73}$Ge detector, for low values of GUT scale gaugino mass $m_{1/2}$. We also calculate the branching fraction for $b\\to s γ$ decays, and find that it is beyond the 95% CL experimental limits in much, but not all, of the parameter space regions explored. However, recent claims have been made that NLO effects can reverse the signs of certain amplitudes in the $b\\to sγ$ calculation, leading to agreement between theory and experiment in Yukawa unified SUSY models. For the Fermilab Tevatron collider, significant regions of parameter space can be explored via $b\\bar{b}A$ and $b\\bar{b}H$ searches. There also exist some limited regions of parameter space where a trilepton signal can be seen at TeV33. Finally, there exist significant regions of parameter space where direct detection of bottom squark pair production can be made, especially for large negative values of the GUT parameter $A_0$. △ Less", "The various experimental bounds on flavor-changing interactions severely restrict the low-energy flavor structures of soft supersymmetry breaking parameters. In this work, we show that with a particular assumption of Yukawa couplings, the fermion mass and sfermion soft mass matrices are simultaneously diagonalized by common mixing matrices and we then obtain an alignment solution for the flavor problems. The required condition is generated by renormalization group evolutions and achieved at low-energy scale independently of high-energy structures of couplings. In this case, the diagonal entries of the soft scalar mass matrices are determined by gaugino and Higgs soft masses. We also discuss possible realizations of this scenario and the characteristic sparticle spectrum in the models. △ Less", "The invariant mass spectrum, forward-backward asymmetry, and lepton polarizations of the exclusive processes $B\\to K(K^*)\\ell^+ \\ell^-, \\ell=μ, τ$ are analyzed under supersymmetric context. Special attention is paid to the effects of neutral Higgs bosons (NHBs). Our analysis shows that the branching ratio of the process $\\bkm$ can be quite largely modified by the effects of neutral Higgs bosons and the forward-backward asymmetry would not vanish. For the process $\\bksm$, the lepton transverse polarization is quite sensitive to the effects of NHBs, while the invariant mass spectrum, forward-backward asymmetry, and lepton longitudinal polarization are not. For both $\\bkt$ and $\\bkst$, the effects of NHBs are quite significant. The partial decay widths of these processes are also analyzed, and our analysis manifest that even taking into account the theoretical uncertainties in calculating weak form factors, the effects of NHBs could make SUSY shown up. △ Less", "We discuss the possibility that the vacuum is dynamically determined in the history of the universe. The point is that some of the bubbles with a certain vacuum shrink by the evolution of the universe via gravity and may become black holes. When the temperature of the phase transition T_{PT} is higher than 10^9 GeV, these black holes evaporate until now. If T_{PT}<10^9 GeV, we may see these black holes in our universe. It is interesting that in many cases false vacua are favored in the context of cosmology. By using this argument, supersymmetry(SUSY), if it exists, can be broken cosmologically. We can guess the SUSY breaking scale from the mass of the black holes. △ Less", "Due to the high energy and luminosity of the LHC, the ATLAS experiment has a huge discovery potential for new physics. A Standard Model Higgs boson can be discovered over the full range of allowed masses, and its mass should be measured with a precision of about 0.1%. The Higgs sector of the MSSM should be fully explored by searches for supersymmetric Higgs bosons. Squarks and gluinos can be discovered up to masses of 2.5 TeV and several precision measurements can be performed in the SUSY sector. The existence of particles predicted by other theories beyond the Standard Model has been also investigated. △ Less", "We study the decoupling of the first two squark and slepton families in order to lower the flavour changing neutral current effects. Models with inverse sfermion mass hierarchy based upon gauged U(1) flavour symmetries provide a natural framework where decoupling can be implemented. Decoupling requires a large gap between the Fermi scale and the supersymmetry breaking scale. Maintaining the electroweak symmetry breaking at the Fermi scale requires some fine-tuning that we investigate by solving the two-loop renormalization group equations. We show that the two-loop effects are governed by the anomaly compensated by the Green-Schwarz mechanism and can be determined from the quark and lepton masses. The electroweak breaking constraints lead to a small $μ$ scenario where the LSP is Higgsino-like. △ Less", "The effects of large CP violating phases arising from the soft SUSY breaking parameters on the proton lifetime are investigated in supersymmetric grand unified models. It is found that the CP violating phases can reduce as well as enhance the proton lifetime depending on the part of the parameter space one is in. Modifications of the proton lifetime by as much as a factor of 2 due to the effects of the CP violating phases are seen. The largest effects arise for the lightest sparticle spectrum in the dressing loop integrals and the effects decrease with the increasing scale of the sparticle masses. An analysis of the uncertainties in the determination of the proton life time due to uncertainties in the quark masses and in the other input data is also given. These results are of import in the precision predictions of the proton lifetime in supersymmetric unification both in GUT and in string models when the soft SUSY breaking parameters are complex. △ Less", "We argue that the nature of the global conservation laws in Supersymmetric Grand Unified Theories is determined by the basic vacuum configuration in the model rather than its Lagrangian. It is shown that the suppression of baryon number violation in a general (R-parity violating) superpotential can naturally appear in some extended SU(N) SUSY GUTs which, among other degenerate symmetry-breaking vacua, have a missing VEV vacuum configuration giving a solution to the doublet-triplet splitting problem. We construct SU(7) and SU(8) GUTs where the effective lepton number violating couplings immediately evolve, while the baryon number non-conserving ones are safely projected out as the GUT symmetry breaks down to that of the MSSM. However at the next stage, when SUSY breaks, the radiative corrections shift the missing VEV components to some nonzero values of order M_{SUSY}, thereby inducing the ordinary Higgs doublet mass, on the one hand, and tiny baryon number violation, on the other. So, a missing VEV solution to the gauge hierarchy problem leads at the same time to a similar hierarchy of baryon vs lepton number violation. △ Less", "The neutrino experiment results suggest that the neutrinos have finite masses and the lepton-flavor symmetries are violating in nature. In the supersymmetric models, the charged lepton-flavor violating processes, such as mu -> e gamma and tau -> mu gamma, may have the branching ratios accessible to the future experiments, depending on origins of the neutrino masses and the SUSY breaking. In this paper we discuss the branching ratios in the supergravity scenario using the current solar and atmospheric neutrino experimental data. △ Less", "Mixing between bosons that transform differently under the standard model gauge group, but identically under its unbroken subgroup, can induce interactions that violate the total lepton number. We discuss four-fermion operators that mediate lepton number violating neutrino interactions both in a model-independent framework and within supersymmetry (SUSY) without R-parity. The effective couplings of such operators are constrained by: i) the upper bounds on the relevant elementary couplings between the bosons and the fermions, ii) by the limit on universality violation in pion decays, iii) by the data on neutrinoless double beta decay and, iv) by loop-induced neutrino masses. We find that the present bounds imply that lepton number violating neutrino interactions are not relevant for the solar and atmospheric neutrino problems. Within SUSY without R-parity also the LSND anomaly cannot be explained by such interactions, but one cannot rule out an effect model-independently. Possible consequences for future terrestrial neutrino oscillation experiments and for neutrinos from a supernova are discussed. △ Less", "Lepton flavor violating processes $μ\\to e γ$ and $μ\\to 3e$ with polarized muons are studied in the supersymmetric grand unified theory (SUSY GUT). As a result of a detailed numerical calculation, it is shown that the P- and T-odd asymmetries defined with the help of the muon polarization and the ratio of two branching fractions make a good contrast between the SU(5) and SO(10) SUSY GUT. These observables are useful to extract differences of the two theories. In particular, the P-odd asymmetry of $μ\\to e γ$ varies 100%--100% in SO(10) whereas it is 100% in SU(5) and the T-odd asymmetry of $μ\\to 3e$ can reach 15% in SU(5) within the EDM constraints whereas it is small in SO(10). △ Less", "Right-handed (RH) rotations do not play a role in the Standard Model, and only the differences of the LH mixing angles are involved in ${\\bf V}_{\\scr \\textrm{CKM}}$. This leads to the huge freedom in the fermionic mass matrices. However, that is no more true in extensions of the Standard Model. For example in GUTs large RH rotations of the quarks can be related to the observed large neutrino mixing or in particular, all mixing angles are relevant for the proton decay. We present a simple realistic non-SUSY SO(10) GUT with large RH and LH mixing and study the corresponding nucleon decay rates. △ Less", "We study next-to-leading corrections to the integral kernel of the BFKL equation for high energy cross-sections in QCD and in supersymmetric gauge theories. The eigenvalue of the BFKL kernel is calculated in an analytic form as a function of the anomalous dimension γof the local gauge-invariant operators and their conformal spin n. For the case of an extended N=4 SUSY the kernel is significantly simplified. In particular, the terms non-analytic in n are canceled. We discuss the relation between the DGLAP and BFKL equations in the N=4 model. △ Less", "We examine signals for sparticle production at the CERN Large Hadron Collider (LHC) within the framework of gauge mediated supersymmetry breaking models with a low SUSY breaking scale for four different model lines, each of which leads to qualitatively different signatures. We first examine the reach of the LHC via the canonical E_T^miss and multilepton channels that have been advocated within the mSUGRA framework. Next, we examine special features of each of these model lines that could serve to further enhance the SUSY signal over Standard Model backgrounds. We use ISAJET to evaluate the SUSY reach of experiments at the LHC. We find that the SUSY reach, measured in terms of m(gluino), is at least as large, and sometimes larger, than in the mSUGRA framework. In the best case of the co-NLSP scenario, the reach extends to m(gluino) >~ 3 TeV, assuming 10 fb^-1 of integrated luminosity. △ Less", "The existence of extra chiral generations is strongly disfavored by the precision electroweak data if all the extra fermions are heavier than m_Z. However fits as good as the SM can be obtained if one allows the new neutral leptons to have masses close to 50 GeV. In the framework of SUSY models precision measurements cannot exclude one additional generation of heavy fermions if chargino and neutralino have masses around 60 GeV with delta_m around 1 GeV. △ Less", "In this paper we investigated the Drell-Yan process of the light neutralino pair $\\tildeχ^0_{i}\\tildeχ^0_{j}~(i,j=1,2)$ productions at hadron colliders. We studied the dependence of the coupling properties of two light neutralino $\\tildeχ^0_{1,2}$ on the three SUSY Lagrangian parameters $M_1$, $M_2$ and $μ$, and find that the production rate of $\\tildeχ^0_1 \\tildeχ^0_2$ pair will be dominated by the Higgsino-like couplings under the condition $μ\\ll M_2$ and $μ\\sim M_1$, while the productions of $\\tildeχ^0_1\\tildeχ^0_1$ and $\\tildeχ^0_2\\tildeχ^0_2$ pairs will be enhanced by the gaugino-like couplings under $M_i \\ll μ$. For the Higgsino-like $\\tildeχ^0_{1,2}$ neutralinos, the cross section of $\\tildeχ^0_1\\tildeχ^0_2$ production at the LHC can reach $100~fb$. △ Less", "We study the feasibility of incorporating the popular Zee model for neutrino mass in the framework of the supersymmetric standard model. While a singlet slepton has the right quantum number to play the role of the Zee charged scalar boson, the SUSY framework introduces extra contributions. We derive conditions for the Zee contributions to dominate, hence retaining the flavor of the Zee model. △ Less", "First of all, \"right\" sneutrino can be the lightest supersymmetric particle. Then, the flavor democracy favors large value of the tan^($beta$). Finally, the huge number of free parameters in the three families MSSM may be considered as an indication of SUSY at preonic level. △ Less", "A full account is given of the procedure used by the authors to construct an SO(10) supersymmetric grand unified model of the fermion mass matrices. Various features of the model which gives remarkably accurate results for the quark and lepton masses and mixings were presented earlier in separate publications. The construction of the matrices is first discussed in the framework of effective operators, from which one naturally obtains the maximal ν_μ- ν_τmixing, while the small angle or maximal mixing solutions for the solar neutrinos depend upon the nature of the Majorana matrix. A set of Higgs and fermion superfields is then introduced from which the Higgs and Yukawa superpotentials uniquely give the structure of the mass matrices previously obtained. The right-handed Majorana matrix arises from one Higgs field coupling to several pairs of superheavy conjugate neutrino singlets. For the simple version considered, 10 input parameters accurately yield the 20 masses and mixings of the quarks and leptons, and the 3 masses of the right-handed neutrinos. △ Less", "In a previous paper, we presented a model in which the {\\em same} modulus field breaks SUSY and a simple GUT gauge group, and which has {\\em dynamical} origins for {\\em both} SUSY breaking and GUT scales. In this model, the supergravity (SUGRA) and gauge mediated (GM) contributions to MSSM scalar and gaugino masses are comparable - this enables a realistic spectrum to be attained since GM contribution to the right-handed (RH) slepton (mass)^2 by itself (i.e., neglecting SUGRA contribution to sfermion {\\em and} gaugino masses) is negative. But, in general, the SUGRA contribution to sfermion masses (from non-renormalizable contact Kähler terms) leads to flavor violation. In this paper, we use the recently proposed idea of gaugino mediated SUSY breaking (\\tilde{g}MSB) to improve the above model. With MSSM matter and SUSY breaking fields localized on separate branes in an extra dimension of size R \\sim 5 M^{-1}_{Pl} (in which gauge fields propagate), the SUGRA contribution to sfermion masses (which violates flavor) is suppressed. As in 4 dimensions, MSSM gauginos acquire {\\em non}-universal masses from both SUGRA and GM - gaugino masses (in particular the SUGRA contribution to gaugino masses), in turn, generate acceptable sfermion masses through RG evolution; the phenomenology is discussed briefly. We also point out that a) in models where SUSY is broken by a GUT non-singlet field, there is, in general, a contribution to MSSM gaugino (and scalar) masses from the coupling to heavy gauge multiplet which {\\em might} be {\\em comparable} to the SUGRA contribution and b) models of GM proposed earlier which also have negative RH slepton (mass)^2 can be rendered viable using the \\tilde{g}MSB idea. △ Less", "We study a generalization of anomaly-mediated supersymmetry breaking (AMSB) scenarios, under the assumption that the effects of the high-scale theory do not completely decouple and D-term type contributions can be therefore present. We investigate the effect of such possible D-term additional contributions to soft scalar masses by requiring that, for non-vanishing, renormalizable Yukawa couplings $Y^{ijk} $, the sum of squared soft supersymmetry breaking mass parameters, $M^2_{ijk} \\equiv m_i^2+m_j^2+m_k^2$, is RG-invariant, in the sense that it becomes independent of the specific ultraviolet boundary conditions as it occurs in the AMSB models. These type of models can avoid the problem of tachyonic solutions for the slepton mass spectrum present in AMSB scenarios. We implement the electroweak symmetry breaking condition and explore the sparticle spectrum associated with this framework. To show the possible diversity of the sparticle spectrum, we consider two examples, one in which the D-terms induce a common soft supersymmetry breaking mass term for all sfermion masses, and another one in which a light stop can be present in the spectrum. △ Less", "We present an analysis of the discovery reach for supersymmetric particles at the upgraded Tevatron collider, assuming that SUSY breaking results in universal soft breaking parameters at the grand unification scale, and that the lightest supersymmetric particle is stable and neutral. We first present a review of the literature, including the issues of unification, renormalization group evolution of the supersymmetry breaking parameters and the effect of radiative corrections on the effective low energy couplings and masses of the theory. We consider the experimental bounds coming from direct searches and those arising indirectly from precision data, cosmology and the requirement of vacuum stability. The issues of flavor and CP-violation are also addressed. The main subject of this study is to update sparticle production cross sections, make improved estimates of backgrounds, delineate the discovery reach in the supergravity framework, and examine how this might vary when assumptions about universality of soft breaking parameters are relaxed. With 30 fb$^{-1}$ luminosity and one detector, charginos and neutralinos, as well as third generation squarks, can be seen if their masses are not larger than 200-250 GeV, while first and second generation squarks and gluinos can be discovered if their masses do not significantly exceed 400 GeV. We conclude that there are important and exciting physics opportunities at the Tevatron collider, which will be significantly enhanced by continued Tevatron operation beyond the first phase of Run II. △ Less", "We review the main reasons pushing us beyond the SM and we argue in favor of new physics at the electroweak scale (hence experimentally accessible at present or near-future machines). We focus on the appealing possibility that such new physics is given by a supersymmetric (SUSY) extension of the SM. We discuss the minimal case, Constrained Minimal Supersymmetric SM, and more general (maybe more natural) cases where some of the drastic assumptions of the CMSSM are dropped. In particular, in these lectures we focus on CP violation and its relation to flavor physics in the SUSY context. CP constrains the low-energy SUSY extensions of the SM, but, at the same time, it provides new powerful tool for indirect SUSY searches. △ Less", "One of the useful features of muon colliders is the naturally narrow spread in beam energies. Measurements of threshold cross sections then become a prime candidate for precision measurements of particle masses, widths, and couplings as well as determining particle spin. We describe the potential for measuring cross sections near threshold in supersymmetric theories. △ Less", "Possible CP violation in supersymmetric (SUSY) extensions of the Standard Model (SM) is discussed. The consequences of CP violating phases in the gaugino masses, trilinear soft supersymmetry-breaking terms and the `mu' parameter are explored. Utilizing the constraints on these parameters from electron and neutron electric dipole moments, possible CP violating effects in B-physics are shown. A set of measurements from the B-system which would overconstrain the above CP violating phases is illustrated. △ Less", "Non-universality in the soft breaking terms is a common feature in most superstring inspired SUSY models. This property is required to obtain sizeable CP violation effects from SUSY and, on the other hand, can be used to avoid the Electric Dipole Moment constraints. We take advantage of these qualities and explore a class of SUSY models based on type I string theory where scalar masses, gaugino masses and trilinear couplings are non-universal. In this framework, we show that, in the presence of large SUSY phases, the bounds on the Electric Dipole Moments can be controled without fine-tuning. At the same time, we find that these phases, free from EDM constraints, lead to large contributions to the observed CP phenomena in Kaon system and, in particular, to direct CP violation in epsilon'/epsilon. △ Less", "We construct a realistic SU(7) model which provides answers to many questions presently facing the prototype SU(5) SUSY GUT. Among them are a solution to the doublet-triplet splitting problem, string scale unification, proton decay, the hierarchy of baryon vs lepton number violation and neutrino masses. △ Less", "If there is a single underlying \"theory of everything\" which in some limits of its \"moduli space\" reduces to the five weakly coupled string theories in 10D, and 11D SUGRA, then it is possible that all six of them have some common domain of validity and that they are in the same universality class, in the sense that the 4D low energy physics of the different theories is the same. We call this notion String Universality. This suggests that the true vacuum of string theory is in a region of moduli space equally far (in some sense) from all perturbative theories, most likely around the self-dual point with respect to duality symmetries connecting them. We estimate stringy non-perturbative effects from wrapped brane instantons in each perturbative theory, show how they are related by dualities, and argue that they are likely to lead to moduli stabilization only around the self-dual point. We argue that moduli stabilization should occur near the string scale, and SUSY breaking should occur at a much lower intermediate scale, and that it originates from different sources. We discuss the problems of moduli stabilization and SUSY breaking in currently popular scenarios, explain why these problems are generic, and discuss how our scenario can evade them. We show that String Universality is not inconsistent with phenomenology but that it is in conflict with some popular versions of brane world scenarios. △ Less", "SUSY effects on various flavor changing neutral current processes are discussed in the minimal supergravity model and the SU(5) grand unified theory with right-handed neutrino supermultiplets. In particular, in the latter case the neutrino Yukawa coupling constants can be a source of the flavor mixing in the right-handed-down-type-squark sector. It is shown that due to this mixing the time-dependent CP asymmetry of radiative B decay can be as large as 30% and the ratio of $B_s$-$\\bar{B}_s$ mixing and $B_d$-$\\bar{B}_d$ mixing deviates from the prediction in the standard model and the minimal supergravity model without the neutrino interaction. △ Less", "Much heavier sfermions of the first-two generations than the other superparticles provide a natural explanation for the flavor and CP problems in the supersymmetric standard model (SUSY SM). However, the heavy sfermions may drive the mass squareds for the light third generation sfermions to be negative through two-loop renormalization group (RG) equations, breaking color and charge. Introducing extra matters to the SUSY SM, it is possible to construct models where the sfermion masses are RG invariant at the two-loop level in the limit of vanishing gaugino-mass and Yukawa-coupling contributions. We calculate the finite corrections to the light sfermion masses at the two-loop level in the models. We find that the finite corrections to the light-squark mass squareds are negative and can be less than (0.3-1)% of the heavy-squark mass squareds, depending on the number and the parameters of the extra matters. We also discuss whether such models realized by the U(1)_X gauge interaction at the GUT scale can satisfy the constraints from Δm_K and ε_K naturally. When both the left- and right-handed down-type squarks of the first-two generations have common U(1)_X charges, the supersymmetric contributions to Δm_K and ε_K are sufficiently suppressed without spoiling naturalness, even if the flavor-violating supergravity contributions to the sfermion mass matrices are included. When only the right-handed squarks of the first-two generations have a common U(1)_X charge, we can still satisfy the constraint from Δm_K naturally, but evading the bound from ε_K requires the CP phase smaller than 10^{-2}. △ Less", "We study the formation of Q-balls which are made of flat directions that appear in the supersymmetric extension of the standard model in the context of gravity-mediated supersymmetry breaking. The full non-linear calculations for the dynamics of the complex scalar field are made. Since the scalar potential in this model is flatter than φ^2, we have found that fluctuations develop and go non-linear to form non-topological solitons, Q-balls. The size of a Q-ball is determined by the most amplified mode, which is completely determined by the model parameters. On the other hand, the charge of Q-balls depends linearly on the initial charge density of the Affleck-Dine (AD) field. Almost all the charges are absorbed into Q-balls, and only a tiny fraction of the charges is carried by a relic AD field. It may lead to some constraints on the baryogenesis and/or parameters in the particle theory. The peculiarity of gravity-mediation is the moving Q-balls. This results in collisions between Q-balls. It may increase the charge of Q-balls, and change its fate. △ Less", "I summarize our recent works on the effects of flavor conserving CP violating phases in SUSY models on $B$ and $K$ phenomenology. △ Less", "Neutrinoless double beta ($\\znbb$) decay is considered within bilinear R-parity breaking supersymmetry, including the full one-loop corrections to the neutrino-neutralino mass matrix. Expected rates for $\\znbb$ decay in this model are discussed in light of recent atmospheric and solar neutrino data. We conclude that (a) tree-level calculations for $\\znbb$ decay within the bilinear model are not reliable in the range of parameters preferred by current solar and atmospheric neutrino problems. And (b) if the solar and atmospheric neutrino problems are to be solved within bilinear R-parity violating SUSY the expected rates for $\\znbb$ decay are very low; the effective Majorana neutrino mass at most 0.01 eV and typical values being one order of magnitude lower. Observing $\\znbb$ decay in the next round of experiments therefore would rule out the bilinear R-parity violating supersymmetric model as an explanation for solar and atmospheric neutrino oscillations, as well as any hierarchical scheme for neutrino masses, unless new neutrino interactions are present. △ Less", "We survey a variety of proposals for new physics at high scales that serve to relate the multitude of soft supersymmetry breaking parameters of the MSSM. We focus on models where the new physics results in non-universal soft parameters, in sharp contrast with the usually assumed mSUGRA framework. These include {\\it i}) SU(5) and SO(10) grand unified (GUT) models, {\\it ii}) the MSSM plus a right-handed neutrino, {\\it iii}) models with effective supersymmetry, {\\it iv}) models with anomaly-mediated SUSY breaking and gaugino mediated SUSY breaking, {\\it v}) models with non-universal soft terms due to string dynamics, and {\\it vi}) models based on $M$-theory. We outline the physics behind these models, point out some distinctive features of the weak scale sparticle spectrum, and allude to implications for collider experiments. To facilitate future studies, for each of these scenarios, we describe how collider events can be generated using the program ISAJET. Our hope is that detailed studies of a variety of alternatives will help point to the physics underlying SUSY breaking and how this is mediated to the observable sector, once sparticles are discovered and their properties measured. △ Less", "The status of two on-going studies concerning important aspects of the phenomenology of gauge-mediated supersymmetry breaking (GMSB) models at TeV colliders is reported. The first study deals with the characteristics of the light Higgs boson spectrum allowed by the (minimal and non-minimal) GMSB framework. Today's most accurate GMSB model generation and two-loop Feynman-diagrammatic calculation of m_h have been combined. The Higgs masses are shown in dependence of various model parameters at the messenger and electroweak scales. In the minimal model, an upper limit on m_h of about 124 GeV is found for m_t = 175 GeV. The second study is focused on the measurement of the fundamental SUSY breaking scale sqrt(F) at the LHC in the GMSB scenario where a stau is the next-to-lightest SUSY particle (NLSP) and decays into a gravitino with c*tau_NLSP in the range 0.5 m to 1 km. This implies the measurement of mass and lifetime of long lived sleptons. The identification is performed by determining the time of flight in the ATLAS muon chambers. Accessible range and precision on sqrt(F) achievable with a counting method are assessed. △ Less", "The main purpose of this thesis is to discuss the impact of electroweak precision measurements on the present knowledge of particle physics, both in the framework of the Standard Model and of its most straightforward extensions. In Chapter 1 we give a general overview of the electroweak sector of the SM and of SUSY phenomenology. In Chapter 2 we deal with different definitions of the electroweak mixing angle, with particular attention to the relation between the phenomenological angle $θ$ and the MS parameter $\\hatθ$. In Chapter 3 we use results found in the previous chapter to discuss in detail how both the decoupling and the non-decoupling approach to the running of coupling constants in the MS scheme produce the same numerical value of $m_{GUT}$, despite of the different initial conditions. In Chapter 4 we derive simple analytical formulas for the contribution of a chargino almost degenerate with the lightest neutralino to electroweak observables, showing that in the case of wino domination the study of oblique corrections allows a concrete improvement of experimental bounds on chargino mass. Finally, in Chapter 5 we consider the possibility of extra fermion generations, proving that they are strongly disfavoured by the present experimental data if all particles are heavier that Z-boson, while for the specific case of the extra neutrino around 50 GeV in mass (still allowed by experimental data) the quality of the fit is not worse than the SM. △ Less", "Effects of supersymmetric particles on flavor changing neutral current and lepton flavor violating processes are studied in the supersymmetric SU(5) grand unified theory with right-handed neutrino supermultiplets. Using input parameters motivated by neutrino oscillation, it is shown that the time-dependent CP asymmetry of radiative B decay can be as large as 30% when the $τ\\to μγ$ branching ratio becomes close to the present experimental upper bound. We also show that the $B_s$--$\\bar{B}_s$ mixing can be significantly different from the presently allowed range in the standard model. △ Less", "The resonant production of sneutrinos at the LHC via the R-parity violating couplings $ł'_{ijk} L_i Q_j D^c_k$ is studied through its three-leptons signature. A detailed particle level study of signal and background is performed using a fast simulation of the ATLAS detector. Through the full reconstruction of the cascade decay, a model-independent and precise measurement of the masses of the involved sparticles can be performed. Besides, this signature can be detected in a large part of the SUSY parameter space and for wide ranges of values of several $ł'_{ijk}$ coupling constants. △ Less", "We review constraints on additional Z' bosons predicted in supersymmetric (SUSY) E_6 models from electroweak experiments - Z-pole experiments, mW measurements and the low-energy neutral current (LENC) experiments. Four representative models - χ,ψ, η, νmodels - are studied in some detail. We find that the improved data of parity violation in cesium atom, which is 2.2-σaway from the Standard Model (SM) prediction, could be explained by the exchange of the heavy mass eigenstate Z_2 in the intermediate state. The improvement over the SM can be found in χ, η, νmodels, where the total χ^2 of the fit to the 26 data points decreases by about five units, owing to the better fit to the atomic parity violation. Impacts of the kinetic mixing between the U(1)_Y and U(1)' gauge bosons on the χ^2-analysis are studied. We find that the Z' model with (β_E, δ)=(-π/4,0.2), where β_E is the mixing angle between Z_χand Z_ψbosons and δdenotes the kinetic mixing, shows the most excellent fit to the data: the total χ^2 decreases by about seven units as compared to the SM. We introduce the effective mixing parameter ζ, a combination of the mass and the kinetic mixing parameters. The 95% CL lower mass bound of Z_2 can be shown as a function of ζ. A theoretical prediction on ζand the U(1)'gauge coupling g_E is studied for the χ,ψ,ηand νmodels by assuming the minimal particle content of the SUSY E_6 models. △ Less", "We discuss production and decays of stops, sbottoms, tau-sneutrinos, and staus in e+e- annihilation in the energy range \\sqrt{s} = 0.5-1 TeV. We present numerical predictions within the Minimal Supersymmetric Standard Model for cross sections and decay rates, including one-loop radiative corrections as well as initial state radiation. We also study the importance of beam polarization for the determination of the underlying SUSY parameters. Moreover, we make a comparison of the potential to study squarks and sleptons of the 3rd generation between Tevatron, LHC, and Linear Collider. △ Less", "Neutrinoless double beta decay belongs to the most sensitive tools for the search of new physics beyond the standard model. The recent half life limit of the Heidelberg-Moscow experiment implies restrictive bounds on the absolute mass scale in the neutrino sector. Possible improvements by the GENIUS project provide a unique possibility to reconstruct the neutrino mass spectrum. Further constraints on new interactions in the neutrino sector are given in a model-independent way. Consequences for neutrino anomalies and theories beyond the standard model such as left-right symmetric models, R-parity violating SUSY and leptoquarks are discussed. The potential of double beta decay experiments in the search for WIMP dark matter is reviewed. △ Less", "The most recent cosmological data point in the direction of a cosmological constant dominated universe. A suitable candidate for providing the required acceleration is a rolling scalar field named ``quintessence''. We address the issue of building a particle physics model for quintessence in the context of Susy QCD. We then go on to ask if the quintessence scalar can be identified with the inflaton field and give two examples in which this is indeed the case. △ Less", "The exotic neutrinoless $μ^- - e^-$ nuclear conversion is studied within the conventional extensions of the standard model as well as in the minimal supersymmetric (SUSY) models with and without R-parity conservation. The dependence of the $μ^- - e^-$ conversion rates on the nucleon and nuclear structure is consistently taken into account. Using our calculated transition matrix elements and the available experimental data on the branching ratio $R_{μe^-}$ for $^{48}$Ti and $^{208}$Pb as well as the expected experimental sensitivity for $^{27}$Al employed as a target in the planned at Brookhaven $μ^--e^-$ conversion (MECO) experiment, we extract very severe constraints for the flavor violation parameters. We especially emphasize on the constraints resulting for SUSY R-parity violating parameters. △ Less", "In view of the latest LEP data we consider the effects of charginos and neutralinos on the two-photon and bbbar signatures of the Higgs at the LHC. Assuming the usual GUT inspired relation between M_1 and M_2 we show that there are only small regions with moderate tanbeta and large stop mixings that may be dangerous. Pathological models not excluded by LEP which have degeneracy between the sneutrino and the chargino are however a real danger because of large branching fraction of the Higgs into invisibles. We have also studied models where the gaugino masses are not unified at the GUT scale. We take M_1=M_2/10 as an example where large reductions in the signal at the LHC can occur. However we argue that such models with a very light neutralino LSP may give a too large relic density unless the sleptons are light. We then combine this cosmological constraint with neutralino production with light sfermions to further reduce the parameter space that precludes observability of the Higgs at the LHC. We still find regions of parameter space where the drops in the usual Higgs signals at the LHC can be drastic. Nonetheless, in such scenarios where Higgs may escape detection we show that one should be able to produce all charginos and neutralinos. Although the heavier of these could cascade into the Higgs, the rates are not too high and the Higgs may not always be recovered this way. △ Less", "In most supersymmetric theories charginos, $\\tildeχ^\\pm_{1,2}$, belong to the class of the lightest supersymmetric particles. The chargino system can be reconstructed completely in $e^+e^-$ collider experiments: $e^+e^-\\to\\tildeχ_i^+ \\tildeχ_j^- [i,j=1,2]$. By measuring the total cross sections and the asymmetries with polarized beams, the chargino masses and the gaugino-higgsino mixing angles of these states can be determined accurately. If only the lightest charginos $\\tildeχ_1^\\pm$ are kinematically accessible in a first phase of the machine, transverse beam polarization or the measurement of chargino polarization in the final state is needed to determine the mixing angles. From these observables the fundamental SUSY parameters can be derived: the SU(2) gaugino mass $M_2$, the modulus and the cosine of the CP-violating phase of the higgsino mass parameter $μ$, and $\\tanβ= v_2/v_1$, the ratio of the vacuum expectation values of the two neutral Higgs doublet fields. The remaining two-fold ambiguity of the phase can be resolved by measuring the normal polarization of the charginos. Sum rules of the cross sections can be exploited to investigate the closure of the two-chargino system. △ Less", "We study the distribution of lepton pairs from the second lightest neutralino decay \\tildeχ^0_2-->\\tilde{l}l followed by \\tilde{l}\\to \\tildeχ^0_1 l. The distribution of the ratio of lepton transverse momenta A_T shows peak structure if m_{ll}< m^{max}_{ll}/2 is required. The peak position A_T^{peak} is described by a simple function of the ino and slepton masses in the m_{ll}\\sim 0 limit. When a moderate m_{ll} cut is applied, A_T^{peak} depends on the \\tildeχ^0_2 velocity distribution, but the dependence would be corrected by studying the lepton P_T distribution. A_T^{peak} and the edge of m_{ll} distributions are used to determine the mass parameters involved in the decay for parameters of interest to LHC experiments. For some cases the ino and slepton masses may be determined within 10% by the lepton distribution only independent of model assumptions. Correct combinations of A_{T}^{peak} and m_{ll}^{edge} would be identified even if different \\tildeχ^0_2 decay chains are co-existing. The analysis could be extended to the Tevatron energy scale or other cascade decays. △ Less", "Anomaly Mediated SUSY Breaking models are reviewed. Possible signatures at the LHC for one case of the minimal realistic model are examined. △ Less", "The chargino $\\tildeχ^\\pm_{1,2}$ system can be reconstructed completely in $e^+e^-$ collisions. By measuring the total cross sections and the asymmetries with polarized beams in $e^+e^-\\to\\tildeχ_i^+ \\tildeχ_j^- [i,j=1,2]$, the chargino masses and the gaugino-higgsino mixing angles of these states can be determined very accurately. If only the lightest charginos $\\tildeχ_1^\\pm$ are kinematically accessible, transverse beam polarization is needed to determine the mixing angles unambiguously. From these observables the fundamental SUSY parameters can be derived: the SU(2) gaugino mass $M_2$, the modulus and the cosine of the CP-violating phase of the higgsino mass parameter $μ$, and $\\tanβ= v_2/v_1$, the ratio of the vacuum expectation values of the two neutral Higgs doublet fields. [The remaining two-fold ambiguity of the phase can be resolved by measuring the normal polarization of the charginos.] △ Less", "The constraints of electric dipole moments (EDMs) of electron and neutron on the parameter space in supergravity (SUGRA) models with nonuniversal gaugino masses are analyzed. It is shown that with a light sparticle spectrum, the sufficient cancellations in the calculation of EDMs can happen for all phases being order of one in the small tan$β$ case and all phases but $φ_μ$ ($|φ_μ| <\\sim π/6$) order of one in the large tan$β$ case. This is in contrast to the case of mSUGRA in which in the parameter space where cancellations among various SUSY contributions to EDMs happen $|φ_μ|$ must be less than $π/10$ for small $tanβ$ and ${\\cal{O}}(10^{-2})$ for large $tanβ$. Direct CP asymmetries and the T-odd polarization of lepton in $B\\to X_s l^+l^-$ are investigated in the models. In the large tan$β$ case, $A_{CP}^2$ and $P_N$ for l=$μ$ ($τ$) can be enhanced by about a factor of ten (ten) and ten (three) respectively compared to those of mSUGRA. △ Less", "Supersymmetric CP violating phases are examined within the framework of gravity mediated supergravity grand unified models with R parity invariance for models with a light ($\\stackrel{<}{\\sim} 1$ TeV) particle spectrum. In the minimal model, the nearness of the t quark Landau pole naturally suppresses the t-quark cubic soft breaking parameter at the electroweak scale allowing the electron and neutron experimental electric dipole moment (EDM) constraints to be satisfied with a large GUT scale phase. However, the EDM constraints require that $θ_B$, the quadratic soft breaking parameter phase be small at the electroweak scale unless tan$β\\stackrel{<}{\\sim}3$, which then implies that at the GUT scale this phase must be large and highly fine tuned to satisfy radiative breaking of $SU(2)\\times U(1)$. Similar results hold for non minimal models, and a possible GUT model is discussed where all GUT scale CP violating phases are naturally small (i.e. O($10^{-2})$). An interesting D-brane model is examined which enhances the size of the phases over much of the parameter space at the electroweak sector for tan$β\\stackrel{<}{\\sim} 5$, but still possesses the fine tuning problem at the GUT scale. △ Less", "ISAJET is a Monte Carlo program which simulates $pp$, $\\bar pp$ and $e^+e^-$ interactions at high energies. This document summarizes the physics underlying the program and describes how to use it. Version~7.48 includes several new features. Anomaly Mediated SUSY Breaking (AMSB) models and right-handed sneutrinos have been added; the latter play a role, e.g., in inverted hierarchy models. A new process generating $Z+\\hbox{2 jets}$ based on the Helas library and MadGraph has been added. Another new process generating Kaluza-Klein gravitons in models with extra dimensions has been added. △ Less", "The success of SU(5)-like gauge coupling unification boundary conditions $g_3^2=g_2^2=5/3 g_1^2$ has biased most attempts to embed the SM interactions into a unified structure. After discussing the limitations of the orthodox approach, we propose an alternative that appears to be quite naturally implied by recent developments based on D-brane physics. In this new alternative: 1) The gauge group, above a scale of order 1 TeV, is the minimal left-right symmetric extension $SU(3)\\times SU(2)_L\\times SU(2)_R\\times U(1)_{B-L}$ of the SM; 2) Quarks, leptons and Higgs fields come in three generations; 3) Couplings unify at an intermediate string scale $M_s= 9\\times 10^{11}$ GeV with boundary conditions $g_3^2=g_L^2=g_R^2=32/3 g_{B-L}^2$. This corresponds to the natural embedding of gauge interactions into D-branes and is different from the standard SO(10) embedding which corresponds to $k_{B-L}=8/3$. Unification only works in the case of three generations; 4) Proton stability is automatic due to the presence of $Z_2$ discrete R-parity and lepton parities. A specific Type IIB string orientifold model with the above characteristics is constructed. The existence of three generations is directly related to the existence of three complex extra dimensions. In this model the string scale can be identified with the intermediate scale and SUSY is broken also at that scale due to the presence of anti-branes in the vacuum. We discuss a number of phenomenological issues in this model including Yukawa couplings and a built-in axion solution to the strong-CP problem. The present framework could be tested by future accelerators by finding the left-right symmetric extension of the SM at a scale of order 1 TeV. △ Less", "A brief overview over the phenomenology of the MSSM at present and future colliders is given. The complementarity of indirect tests of the model via precision observables and of the information from the direct production of SUSY particles is emphasized. If the lightest Higgs boson of the MSSM will be detected, its mass will also play an important role as a precision observable. △ Less", "In the framework of a 2HDM effective lagrangian for the MSSM, we analyse important phenomenological aspects associated with quantum soft SUSY-breaking effects that modify the relation between the bottom mass and the bottom Yukawa coupling. We derive a resummation of the dominant supersymmetric corrections for large values of \\tb to all orders in perturbation theory. With the help of the operator product expansion we also perform the resummation of the leading and next-to-leading logarithms of the standard QCD corrections. We use these resummation procedures to compute the radiative corrections to the \\tbH, \\Htb decay rates. In the large \\tb regime, we derive simple formulae embodying all the dominant contributions to these decay rates and we compute the corresponding branching ratios. We show, as an example, the effect of these new results on determining the region of the \\mH--\\tb plane excluded by the Tevatron searches for a supersymmetric charged Higgs boson in top quark decays, as a function of the MSSM parameter space. △ Less", "We construct the minimal SUSY model that causes spontaneous CP violation with an abelian flavor symmetry in the context of the large extra dimensions and show that various phenomenological problems can be solved by introducing only scales below the low fundamental scale. We also realize the realistic size of the CP violation and the small masses of the neutrinos. The strong CP problem can be solved by the axion scenario and the axion can be made invisible by introducing an additional large extra dimension. △ Less", "In the framework of the MSSM the non-universal boundary conditions of soft SUSY breaking parameters are considered. Taking as input the top, bottom and Z-boson masses, the values of the gauge couplings at the EW scale and the infrared quasi-fixed points for Yukawa couplings and the soft parameters the mass of the lightest CP-even Higgs boson is found to be m_h=92.7^{+10}_{-4.9} +- 5 +- 0.4 GeV/c^2 for the low \\tanβcase and m_h=125.7^{+6.4}_{-9.0} +- 5 +- 0.4 GeV/c^2 (μ> 0) or m_h =125.4^{+6.6}_{-9.0} +-5 +- 0.4 GeV/c^2 (μ< 0) in the case of large $\\tanβ$. △ Less", "Supersymmetric models with an inverted mass hierarchy (IMH: multi-TeV first and second generation matter scalars, and sub-TeV third generation scalars) can ameliorate problems arising from flavor changing neutral currents, $CP$ violating phases and electric dipole moments, while at the same time satisfying conditions on naturalness. It has recently been shown that such an IMH can be generated radiatively, making use of infra-red fixed point properties of renormalization group equations given Yukawa coupling unification and suitable $GUT$ scale boundary conditions on soft SUSY breaking masses. In these models, explicit spectra cannot be obtained due to problems implementing radiative electroweak symmetry breaking (REWSB). We show that use of SO(10) $D$-term contributions to scalar masses can allow REWSB to occur, while maintaining much of the desired IMH. A somewhat improved IMH is obtained if splittings are applied only to Higgs scalar masses. △ Less", "In a previous paper we analyzed fermion masses (focusing on neutrino masses and mixing angles) in an SO(10) SUSY GUT with U(2)$\\timesU(1)^n$ family symmetry. The model is \"natural\" containing all operators in the Lagrangian consistent with the states and their charges. With minimal family symmetry breaking vevs the model is also predictive giving a unique solution to atmospheric (with maximal $ν_μ\\to ν_τ$ mixing) and solar (with SMA MSW $ν_e \\to ν_s$ mixing) neutrino oscillations. In this paper we analyze the case of general family breaking vevs. We now find several new solutions for three, four and five neutrinos. For three neutrinos we now obtain SMA MSW, LMA MSW or vacuum oscillation solutions for solar neutrinos. In all three cases the atmospheric data is described by maximal $ν_μ\\to ν_τ$ mixing. In the four and five neutrino cases, in addition to fitting atmospheric and solar data as before, we are now able to fit LSND data. All this is obtained with the additional parameters coming from the family symmetry breaking vevs; providing only minor changes in the charged fermion fits. △ Less", "We analyze the next-to-leading order SUSY-QCD corrections to the production of Higgs particles at hadron colliders in supersymmetric extensions of the Standard Model. Besides the standard QCD corrections due to gluon exchange and emission, genuine supersymmetric corrections due to the virtual exchange of squarks and gluinos are present. At both the Tevatron and the LHC, these corrections are found to be small in the Higgs-strahlung, Drell-Yan-like Higgs pair production and vector boson fusion processes. △ Less", "We improve the calculation of the supersymmetric $O(α_s)$ QCD corrections to the decays of Higgs bosons into quarks and squarks in the Minimal Supersymmetric Standard Model. In the on-shell renormalization scheme these corrections can be very large, which makes the perturbative expansion unreliable. This is especially serious for decays into bottom quarks and squarks for large $\\tanβ$. Their corrected widths can even become negative. We show that this problem can be solved by a careful choice of the tree-level Higgs boson couplings to quarks and squarks, in terms of the QCD and SUSY QCD running quark masses, running trilinear couplings $A_q$, and on-shell left-right mixing angles of squarks. We also present numerical results for the corrected partial decay widths for the large $\\tanβ$ case. △ Less", "We study the effect of new flavor changing SUSY phases arising in the squark mass matrix in semileptonic decays B->Xs ll and B->K(*) ll (l=e,mu). SUSY effects are parametrized using the mass insertion approximation formalism. Constraints on SUSY contributions coming from other processes (e.g. b->s gamma, B->K* ll) are taken into account. Chargino and gluino contributions to photon and Z-mediated decays are included and non-perturbative corrections are considered. We study the correlation between the CP (and forward--backward) asymmetries and the expected value of the inclusive branching ratio. Several possible scenarios are distinguished and discussed according to the mass insertion that is considered. △ Less", "The Beyond the Standard Model Working Group discussed a variety of topics relating to exotic searches at current and future colliders, and the phenomenology of current models beyond the Standard Model. For example, various supersymmetric (SUSY) and extra dimensions search possibilities and constraints are presented. Fine-tuning implications of SUSY searches are derived. The implications of Higgs (non)-discovery are discussed, as well as the program HDECAY. The individual contributions are included seperately. Much of the enclosed work is original, although some is reviewed. △ Less", "We study the Zee model of neutrino mass in the framework of R-parity violating supersymmetry. Within the matter contents of the minimal supersymmetric standard model, any one of the three right-handed sleptons could be a suitable candidate for the charged-singlet scalar of the Zee model, and one of the Higgs doublets provides the extra necessary vacuum expectation value. A combination of one bilinear and two trilinear R-parity-violating couplings then completes the model. In this framework, we also discuss other various contributions to neutrino masses and derive the conditions for the dominance of the contribution from the Zee model, and hence maintain the successfully Zee mass texture. However, this model within the minimal supersymmetric standard model is shown to be only marginally feasible. More general versions of supersymmetrization of the Zee model are also discussed. A particularly interesting example that has extra Higgs doublets while the slepton, especially the selectron, keeps the role of the Zee scalar is illustrated. △ Less", "The production process of the charged Higgs-boson associated with a $W$ boson at electron-positron colliders is discussed in the two-Higgs-Doublet Model (2HDM) and in the Minimal Supersymmetric Standard Model (MSSM). The process is induced at one-loop level in these models. We examine how much the cross section can be enhanced by quark- and Higgs-loop effects. In the non-SUSY 2HDM, in addition to large top-bottom ($t$-$b$) loop effects for small $\\tan β$ ($\\ll \\sqrt{m_t/m_b}$), the Higgs-loop diagrams can contribute to the cross section to some extent for moderate $\\tan β$ values. For larger $\\tan β$ ($\\gg \\sqrt{m_t/m_b}$), such enhancement by the Higgs non-decoupling effects is bounded by the requirement for validity of perturbation theory. In the MSSM with heavy super-partner particles, only the $t$-$b$ loops enhance the cross section while Higgs-loop effects are very small. △ Less", "Supersymmetric (SUSY) models with heavy sfermions ($m_{\\tilde{f}} \\sim 10$ TeV) in the first two generations and the third generation sfermion masses below 1 TeV can solve the SUSY flavor and the CP problems as well as satisfy naturalness constraints. We study the phenomenology of a string-inspired scenario and compare it with the minimal supergravity unified model (mSUGRA). The SUSY trilepton signature at the upgraded Tevatron, the $b\\to sγ$ branching fraction and the neutralino dark matter relic density in this model can differ significantly from the mSUGRA model. △ Less", "We consider the top-quark decay $t\\to \\tilde τb$ and $t\\to τb \\tildeχ^0_1$ via explicit R-parity violating interactions in SUSY theories. We discuss the observability of those channels at the Fermilab Tevatron collider. The existing Tevatron data indicate a 95% confidence level upper bound on the coupling to be less than 0.94(0.63) for a long-lived (short-lived) $\\tildeχ^0_1$ with $m_{\\tildeτ}=70$ GeV. At Tevatron Run II with an integrated luminosity of 2 (10) fb$^{-1}$, one can obtain a 2$σ$ constraint as 0.38 (0.24) for a long-lived $\\tildeχ^0_1$ and 0.29(0.19) for a short-lived $\\tildeχ^0_1$, beyond the current indirect limit. △ Less", "Discrete nonabelian gauge symmetries appear to be the most advantageous candidates for a family symmetry. We present a predictive SO(10) SUSY GUT model with $D_3 \\times U(1)$ family symmetry (D_3 is the dihedral group of order 6). The hierarchy in fermion masses is generated by the family symmetry breaking $D_3 \\times U(1) \\to Z_N \\to $ nothing. This model fits the low energy data in the charged fermion sector quite well and naturally provides large angle $ν_μ$-$ν_τ$ mixing describing atmospheric neutrino oscillation data and small angle $ν_e$-$ν_s$ mixing consistent with the small mixing angle MSW solution to the solar neutrino data. In addition, the non-abelian family symmetry D_3 is sufficient to suppress large flavor violations. △ Less", "We show that EDMs obey a simple approximate scaling under the transformation $m_0\\to λm_0,m_{1/2}\\to λm_{1/2}$ in the large $μ$ region when $μ$ itself obeys the same scaling, ie., $μ\\to λμ$. In the scaling region the knowledge of a single point in the MSSM parameter space where the cancellation in the EDMs occur allows one to generate a trajectory in the $m_0-m_{1/2}$ plane where the cancellation mechanism holds and the EDMs are small. We illustrate these results for MSSM with radiative electro-weak symmetry breaking constraints. We also discuss a class of D brane models based on Type IIB superstring compactifications which have non-universal phases in the gaugino mass sector and allow large CP violating phases consistent with the EDM constraints through the cancellation mechanism. The scaling in these D brane models and in a heterotic string model is also discussed. △ Less", "We investigate whether multi-TeV (1-3 TeV) squarks can be natural in models of gauge mediated SUSY breaking. The idea is that for some boundary condition of the scalar (Higgs and stop) masses, the Higgs (mass)$^2$, evaluated at the renormalization scale $\\sim O(100)$ GeV, is not very sensitive to (boundary values of) the scalar masses (this has been called ``focussing'' in recent literature). Then, the stop masses can be multi-TeV without leading to fine-tuning in electroweak symmetry breaking. {\\em Minimal} gauge mediation does {\\em not} lead to this focussing (for all values of $\\tan β$ and the messenger scale): the (boundary value of) the Higgs mass is too small compared to the stop masses. Also, in minimal gauge mediation, the gaugino masses are of the same order as the scalar masses so that multi-TeV scalars implies multi-TeV gauginos (especially gluino) leading to fine-tuning. We discuss ideas to {\\em increase} the Higgs mass relative to the stop masses (so that focussing can be achieved) and also to {\\em suppress} gaugino masses relative to scalar masses (or to modify the gaugino mass relations) in {\\em non-minimal} models of gauge mediation -- then multi-TeV (top and other) squarks can be natural. Specific models of gauge mediation which incorporate these ideas and thus have squarks (and in some cases, the gluino) heavier than a TeV without resulting in fine-tuning are also studied and their collider signals are contrasted with those of other models which have multi-TeV squarks. △ Less", "The cosmological relic density of the lightest supersymmetric particle (LSP) of type I string derived model is calculated. This model can accommodate large values of CP violating phases, and the electron and neutron electric dipole moments satisfy the experimental constraint. We show that the constraint from the electric dipole moment on the ratio between the gaugino masses implies that the mass of the LSP, which is bino like, is close to the lightest chargino. The co-annihilation between them is very important to reduce the LSP relic density to an interesting region. We show that the SUSY phases, although they are large, have no significant effect on the relic density and on the the upper bound imposed on the LSP mass. However, they are very significant for the detection rates. We emphasize that the phase of the trilinear coupling increase the direct and indirect detection rates. △ Less", "We investigate the possibilities for constraining tan beta within the MSSM by combining the theoretical result for the upper bound on the lightest Higgs-boson mass as a function of tan beta with the informations from the direct experimental search for this particle. We discuss the commonly used ``benchmark'' scenario, in which the parameter values m_top = 175 GeV and M_susy = 1 TeV are chosen, and analyze in detail the effects of varying the other SUSY parameters. We furthermore study the impact of the new diagrammatic two-loop result for mh, which leads to an increase of the upper bound on mh by several GeV, on present and future constraints on tan beta. We suggest a slight generalization of the ``benchmark'' scenario, such that the scenario contains the maximal possible values for mh(tan beta) within the MSSM for fixed m_top and M_susy. The implications of allowing values for m_top, M_susy beyond the ``benchmark'' scenario are also discussed. △ Less", "Recently it has been demonstrated that large phases in softly broken supersymmetric theories are consistent with electric dipole moment constraints, and are motivated in some (Type I) string models. Here we consider whether large flavor-independent soft phases may be the dominant (or only) source of all CP violation. In this framework $ε$ and $ε'/ε$ can be accommodated, and the SUSY contribution to the B system mixing can be large and dominant. An unconventional flavor structure of the squark mass matrices (with enhanced super-CKM mixing) is required for consistency with B and K system observables. △ Less", "If the soft Supersymmetry (SUSY) breaking masses and couplings are complex, then the associated CP-violating phases can in principle modify the known phenomenological pattern of the Minimal Supersymmetric Standard Model (MSSM). We investigate here their effects on Higgs boson production in the gluon-gluon fusion mode at the Tevatron and the Large Hadron Collider (LHC), by taking into account all experimental bounds available at present. The by far most stringent ones are those derived from the measurements of the Electric Dipole Moments (EDMs) of fermions. However, it has recently been suggested that, over a sizable portion of the MSSM parameter space, cancellations among the SUSY contributions to the EDMs can take place, so that the CP-violating phases can evade those limits. We find a strong dependence of the production rates of any neutral Higgs state upon the complex masses and couplings over such parts of the MSSM parameter space. We show these effects relatively to the ordinary MSSM rates as well as illustrate them at absolute cross section level at both colliders △ Less", "We address the following question. Take the Constrained Minimal Supersymmetric Standard Model (CMSSM) with the two CP violating SUSY phases different from zero, and neglect the bound coming from the electric dipole moment of the neutron (EDM): is it possible to fully account for CP violation in the kaon and B systems using only the SUSY contributions with vanishing CKM phase? We show that the ${BR}(B\\to X_{s} γ)$ constraint, though CP conserving, forces a negative answer to the above question. This implies that, even in the regions of the CMSSM where a cancellation of different contributions to the EDM allows for large SUSY phases, it is not possible to exploit the SUSY phases to fully account for observable CP violation. Hence to have sizeable SUSY contributions to CP violation, one needs new flavor structures in the sfermion mass matrices beyond the usual CKM matrix. △ Less", "A minimal lepton number violation (LNV) is proposed which could naturally appear in SUSY theories, if Yukawa and LNV couplings had a common origin. According to this idea properly implemented into MSSM with an additional abelian flavor symmetry the prototype LNV appears due to a mixing of leptons with superheavy Higgs doublet mediating Yukawa couplings. As a result, all significant physical manifestations of LNV reduce to those of the effective trilinear couplings $LL\\bar{E}$ and $LQ\\bar{D}$ aligned, by size and orientation in a flavor space, with the down fermion (charged lepton and down quark) effective Yukawa couplings, while the effective bilinear terms appear generically suppressed relative to an ordinary $μ$-term of MSSM. Detailed phenomenology of the model related to the flavor-changing processes both in quark and lepton sectors, radiatively induced neutrino masses and decays of the LSP is presented. Remarkably, the model can straightforwardly be extended to a Grand Unified framework and an explicit example with SU(7) GUT is thoroughly discussed. △ Less", "We perform an investigation of the MSSM parameter space at the Fermi scale taking into account available accelerator, non-accelerator and cosmological constraints. Extra assumptions about upper bounds for some of the SUSY particles are also imposed. We show that a non-observation of the SUSY dark matter candidates with a high-accuracy dark matter detector, such as Ge-73, under above-mentioned assumptions can exclude large domains of the MSSM parameter space and, for instance, can make especially desirable collider search for light SUSY charged Higgs boson. △ Less", "We make a detailed study of the unification of gauge couplings in the MSSM with large extra dimensions. We find some scenarios where unification can be achieved (with the strong coupling constant at the Z mass within one standard deviation of the experimental value) with both the compactification scale and the SUSY breaking scale in the few TeV range. No enlargement of the gauge group or particle content is needed. One particularly interesting scenario is when the SUSY breaking scale is larger than the compactification scale, but both are small enough to be probed at the CERN LHC. Unification in two scales scenarios is also investigated and found to give results within the LHC. △ Less", "We present simple analytical formulae which describe solutions of the RG equations for Yukawa couplings in SUSY gauge theories with the accuracy of a few per cent. Performing the Grassmannian expansion in these solutions one finds those for all the soft couplings and masses. The solutions clearly exhibit the fixed point behaviour which can be calculated analytically. A comparison with numerical solutions is demonstrated. △ Less", "Within a wide class of models, the LEP2 lower limit of 95 GeV on the chargino mass implies gluinos are heavier than $\\sim$300 GeV. In this case electroweak $\\tw_1\\twb_1$ and $\\tw_1\\tz_2$ production are the dominant SUSY processes at the Tevatron, and the extensively examined isolated trilepton signal from $\\tw_1\\tz_2$ production assumes an even greater importance. We update our previous calculations of the SUSY reach of luminosity upgrades of the Fermilab Tevatron in this channel incorporating ({\\it i}) decay matrix elements in the computation of the momenta of leptons from chargino and neutralino decays, ({\\it ii}) the trilepton background from $W^*Z^*$ and $W^*γ^*$ production which, though neglected in previous analyses, turns out to be the dominant background, and finally, ({\\it iii}) modified sets of cuts designed to reduce these new backgrounds and increase the range of model parameters for which the signal is observable. We show our improved projections for the reach for SUSY of both the Fermilab Main Injector and the proposed TeV33 upgrade. We also present opposite sign same flavor dilepton invariant mass distributions as well as the $p_T$ distributions of leptons in SUSY trilepton events, and comment upon how the inclusion of decay matrix elements impacts upon the Tevatron reach, as well as upon the extraction of neutralino masses. △ Less", "R-parity conservation is an {\\it ad hoc} assumption in the most popular version of the supersymmetric standard model. Most studies of models which do allow for R-parity violation have been restricted to various limiting scenarios. The single-VEV parametrization used in this paper provides a workable framework to analyze phenomenology of the most general theory of SUSY without R-parity. We perform a comprehensive study of leptonic phenomenology at tree-level. Experimental constraints on various processes are studied individually and then combined to yield regions of admissible parameter space. In particular, we show that large R-parity violating bilinear couplings are not ruled out, especially for large $\\tanβ$. △ Less", "We perform a Next-to-Leading order analysis of Delta S=2 processes beyond the Standard Model. Combining the recently computed NLO anomalous dimensions and the B parameters of the most general Delta S=2 effective Hamiltonian, we give an analytic formula for Delta M_K and epsilon_K in terms of the Wilson coefficients at the high energy scale. This expression can be used for any extension of the Standard Model with new heavy particles. Using this result, we consider gluino-mediated contributions to Delta S=2 transitions in general SUSY models and provide an improved analysis of the constraints on off-diagonal mass terms between the first two generations of down-type squarks. Finally, we improve the constraints on R-violating couplings from Delta M_K and epsilon_K. △ Less"]