["This is the summary report of the ``Indirect Investigations of SUSY'' subgroup of the P3 Physics Group at Snowmass 2001. △ Less", "We present a next-to-leading order determination of the gluino-mediated SUSY contributions to B_d-Bbar_d mixing and to the CP asymmetry a_{J/psi K_s} in the framework of the mass-insertion approximation. Using hadronic matrix elements recently computed on the lattice, we obtain improved constraints on the squark-mass splittings. △ Less", "In the strong Yukawa coupling limit the renormalization of trilinear couplings $A_i(t)$ and combinations of the scalar particle masses $\\mathfrak{M}_i^2(t)$ are studied in the framework of the Next--to--Minimal SUSY Model. The dependence of given parameters on their initial values at the Grand Unification scale disappears when the solutions of the renormalization group equations approach the infrared quasi fixed points. Besides that at $\\tildeα_{\\text{GUT}}\\ll Y_i(0)\\ll 1$ in the vicinity of quasi fixed points $A_i(t)$ and $\\mathfrak{M}_i^2(t)$ concentrated near lines or surfaces in the soft SUSY breaking parameter space. It occurs because the dependence of trilinear couplings and combinations of scalar particle mass on $A_i(0)$ and $\\mathfrak{M}_i^2(0)$ disappears rather weakly. We propose a method which enables to obtain equations for such lines and surfaces. Their origin is also discussed by means of exact and approximate solutions of the NMSSM renormalization group equations. △ Less", "Searches for SUSY particles are the main physics focus of the ongoing Run IIa of the Tevatron. LEP results have constrained heavily the Minimal Supersymmetric Standard Model. In this paper the results obtained at LEP and the Tevatron Run I are analysed within two consistent scenarios: the gravity-mediated MSSM framework and the minimal SUGRA scenario. In these frameworks limits much beyond the kinematic reach of LEP are set, and the allowed mass range for particles which are not directly observable at LEP is explored. These results can be used to evaluate searches at the Tevatron Run II. Both R-parity conserving and violating scenarios are considered. Model-dependence and coverage of LEP results is discussed in view of searches at the Tevatron Run II, and a conservative review of some of the other constraints is given. Consequences of the light Higgs boson of the Minimal Supersymmetric Standard Model with mass close to 114-117 GeV and branching ratio to b bar b consistent with the one expected in the Standard Model are examined. △ Less", "We present a code that calculates the relic density of the LSP in the MSSM. All tree-level processes for the annihilation of the LSP are included as well as all possible coannihilation processes with neutralinos, charginos, sleptons,squarks and gluinos. In all we have included over 2800 processes not counting charged conjugate states.The cross-sections extracted from CompHEP are calculated exactly. Relativistic formulae for the thermal average are used and care is taken to handle poles and thresholds by adopting specific integration routines. The input parameters can be either the soft SUSY parameters in a general MSSM or the five parameters of a SUGRA model. A link with ISASUGRA/ISAJET allows to calculate the parameters of the MSSM at the weak scale for an input at the GUT scale. The Higgs masses are calculated with FeynHiggsFast. Routines calculating g-2 and bsgamma are also included. △ Less", "We consider the production of SUSY scalar pairs at lepton colliders, for c.m. energies much larger than the mass of the heaviest SUSY (real or virtual) particle involved in the process. In that energy regime, we derive the leading and subleading terms of the electroweak Sudakov logarithms in the MSSM, first working at one loop with physical states and then resumming to all orders with asymptotic expansions. We show that the first order of the resummed expression reproduces the physical one loop approximation, and compute systematically the possible effects on various observables both at one loop and to all orders. We discuss the regimes and the processes where the one loop approximation can or cannot be trusted, working in an energy range between 1 TeV and 4 TeV under a \"light\" SUSY mass assumption. As a byproduct of our analysis, we propose a determination of the MSSM parameter tan(beta) showing how a relative accuracy of about 25 percent can be easily achieved in the region tan(beta)>14, under reasonable experimental assumptions. △ Less", "We study FCNC and CP violating processes in the MSSM without a new flavour structure (flavour blind MSSM). The low energy parameters are determined by the running of the soft breaking terms from the GUT scale with SUSY phases consistent with the EDM constraints. We find that the CP asymmetry in b -> s gamma can reach large values potentially measurable at B factories, especially in the low BR(b -> s gamma) region. We analyze the SUSY contributions to the anomalous magnetic moment of the muon pointing out its impact on the b -> s gamma CP asymmetry and on the SUSY spectrum. △ Less", "Semi-simple unification is one of a model which naturally solves two difficulties in the supersymmetric grand unification theory: doublet-triplet splitting problem and suppression of dimension 5 proton decay. We analyzed the dimension 6 proton decay of this model using perturbative analysis at the next-to-leading order. The life time of proton is 3 \\times 10^{34} - 10^{35} years for wide range of SUSY breaking parameters, and there is an intriguing possibility of observing proton decay signals in the next-generation water Cherenkov detectors such as Hyper-Kamiokande and TITAND. Several uncertainties in this prediction are also discussed. △ Less", "The gluino contributions to the $C'_{7,8}$ Wilson coefficients for $b->s γ$ are calculated within the unconstrained MSSM. New stringent bounds on the $δ^{RL}_{23}$ and $δ^{RR}_{23}$ mass insertion parameters are obtained in the limit in which the SM and SUSY contributions to $C_{7,8}$ approximately cancel. Such a cancellation can plausibly appear within several classes of SUSY breaking models in which the trilinear couplings exhibit a factorized structure proportional to the Yukawa matrices. Assuming this cancellation takes place, we perform an analysis of the $b->s γ$ decay. We show that in a supersymmetric world such an alternative is reasonable and it is possible to saturate the $b->s γ$ branching ratio and produce a CP asymmetry of up to 20%, from only the gluino contribution to $C'_{7,8}$ coefficients. Using photon polarization a LR asymmetry can be defined that in principle allows for the $C_{7,8}$ and $C'_{7,8}$ contributions to the $b->s γ$ decay to be disentangled. In this scenario no constraints on the ``sign of $μ$'' can be derived. △ Less", "We discuss the possibilities to observe the decays of heavy SUSY Higgs bosons into supersymmetric particles at the LHC. Such an observation would be of interest either in a discovery search if sparticle modes are the dominant ones, or in a study of additional decay modes, bringing information on the SUSY scenario potentially at work. We will focus on the most promising channel where the heavy neutral Higgses decay into a pair of next-to-lightest neutralinos, followed by their decay into two leptons and the LSP, thus leading to four isolated leptons + missing E_T as the main final state signature. A study with the CMS detector shows that the background (SM + SUSY) can be sufficiently suppressed and that in the mass region between m_A = 230 and 450 GeV, for low and intermediate values of tan beta, the signal would be visible provided neutralinos and sleptons are light enough. △ Less", "This work summarises the present understanding of the expected MSSM SUSY Higgs reach for CMS. Many of the studies presented here result from detailed detector simulations incorporating final CMS detector design and response. With 30 fb-1 the h -> gamma,gamma and h -> bb channels allow to cover most of the MSSM parameter space. For the massive A,H,H+ MSSM Higgs states the channels A,H -> tau,tau and H+ -> tau,nu turn out to be the most profitable ones in terms of mass reach and parameter space coverage. Consequently CMS has made a big effort to trigger efficiently on taus. Provided neutralinos and sleptons are not too heavy, there is an interesting complementarity in the reaches for A,H -> tau,tau and A,H -> chi,chi. △ Less", "We perform a complete analysis of the supersymmetric particle spectrum in the Minimal Supergravity (mSUGRA) model. We show that present constraints on the Higgs boson and superparticle masses from collider searches and precision measurements still allow for large regions of the mSUGRA parameter space where some sparticles as well as the heavier Higgs particles, are light enough to be produced at the next generation of $e^+e^-$ linear colliders. An important part of this parameter space remains even when we require that the density of the lightest neutralinos left over from the Big Bang falls in the range favored by current determinations of the Dark Matter density in the Universe. △ Less", "First we give a review of the spurion formalism and the exact renormalization group equations for soft supersymmetry breaking parameters in general gauge theories. Next we discuss the minimal supersymmetric standard model coupled to superconformal theories leading to hierarchical Yukawa couplings by large anomalous dimensions of quarks and leptons. The soft scalar masses are found to satisfy the noble sum rule in IR regime. It is possible construct the models such that the degenerate squark/slepton masses are realized thanks to this IR sum rule. However, it is found also that this degeneracy is slightly broken mainly by the radiative corrections of the SM gaugino mass insertion. We show that the degeneracy is sufficient for the squark sector, but weak for the slepton sector to avoid the supersymmetric flavor problems. △ Less", "In brane world models of nature, supersymmetry breaking is often isolated on a distant brane in a higher dimensional space. The form of the Kahler potential in generic string and M-theory brane world backgrounds is shown to give rise to tree-level non-universal squark and slepton masses. This results from the exchange of bulk supergravity fields and warping of the internal geometry. This is contrary to the notion that bulk locality gives rise to a sequestered no-scale form of the Kahler potential with vanishing tree-level masses and solves the supersymmetric flavor problem. As a result, a radiatively generated anomaly mediated superpartner spectrum is not a generic outcome of these theories. △ Less", "Single production at hadron and photon colliders of gluinos and sneutrinos of supersymmetric models, as well as radions of the Randall-Sundrum model, is discussed. In the case of supersymmetry, R-parity breaking is needed in order to produce single susy particles. Resonant production of radions is considered at gamma-gamma collider. △ Less", "We present the one-loop corrected decay widths for the decays of the neutral Higgs bosons h^0, H^0, and A^0 into a neutralino pair neu_m neu_n (m, n = 1, >..., 4) and to the decay neu_m -> (h^0, H^0, A^0) + neu_n. The corrections contain the one-loop contributions of all fermions and sfermions. All parameters are taken on-shell. This requires a proper treatment of the neutralino mass and mixing matrix. The dependence on the SUSY parameters is discussed. The corrections can be large in certain regions of the parameter space. △ Less", "The light slepton-sneutrino scenario with non-universal scalar masses at the GUT scale is preferred by the electroweak precision data. Though a universal soft breaking mass at or below the Plank scale can produce the required non-universality at the GUT scale through running, such models are in conflict with the stability of the electroweak symmetry breaking vacuum. If the supergravity motivated idea of a common scalar mass at some high scale along with light sleptons is supported by future experiments that may indicate that we are living in a false vacuum. In contrast SO(10) D-terms, which may arise if this GUT group breaks down directly to the Standard Model, can lead to this spectrum with many striking phenomenological predictions, without jeopardizing vacuum stability. △ Less", "Recently we proposed a natural scenario of grand unified theories with anomalous U(1)_A gauge symmetry, in which doublet-triplet splitting is realized in SO(10) unification using Dimopoulos-Wilczek mechanism and realistic quark and lepton mass matrices can be obtained in a simple way. The scenario has an additional remarkable feature that the symmetry breaking scale and the mass spectrum of super heavy particles are determined essentially by anomalous U(1)_A charges. Therefore once all the anomalous U(1)_A charges are fixed, the gauge coupling flows can be calculated. We examine several models in which the gauge coupling unification is realized. Examining the conditions for the coupling unification, we show that when all the fields except those of the minimal SUSY standard model become super-heavy, the unification scale generically becomes just below the usual GUT scale Λ_G\\sim 2\\times 10^{16} GeV and the cutoff scale becomes around Λ_G. Since the lower GUT scale leads to shorter life time of nucleon, the proton decay via dimension six operator p\\to e^+π^0 can be seen in future experiment. On the other hand, the lower cutoff scale than the Planck scale may imply the existence of extra dimension in which only gravity modes can propagate. △ Less", "We address the complementarity of the CERN Large Hadron Collider and an $e^+ e^-$ Linear Collider in determining SUSY model parameters for a particular SO(10) SUSY GUT case study. △ Less", "The presence of dark matter in the solar neighbourhood can be tested in the framework of stellar evolution theory by using the new results of helioseismology. If weakly interacting massive particles accumulate in the center of the Sun, they can provide an additional mechanism for transferring energy from the solar core. The presence of these particles produces a change in the local luminosity of the Sun of the order of 0.1%, which is now within the reach of seismic solar experiments. We find that typical WIMPs with a mass of 60 GeV, annihilation cross-section of 10^{-32} cm^3/sec, and scalar scattering interaction between 10^{-36} cm^2 and 10^{-41} cm^2, the lower end of this range being that suggested by the DAMA direct detection experiment, modify the radial profile of the square of the sound speed in the solar core by \\~ 0.1 %. This level of change is strongly constrained by the most recent helioseismological results. Significantly more massive WIMPs have a much smaller effect on the solar core temperature profile. However future helioseismological experiments have the potential exploring most, if not all, of the WIMP parameter space accessible to current and planned direct detection experiments. △ Less", "We consider particlelike solutions to supergravity based on the Kerr-Newman BH solution. The BH singularity is regularized by means of a phase transition to a new superconducting vacuum state near the core region. We show that this phase transition can be controlled by gravity in spite of the extreme smallness of the local gravitational field. Supersymmetric BPS domain wall model is suggested which can provide this phase transition and formation the stable charged (dual) superconducting core. △ Less", "We study the muon magnetic dipole moment and the Higgs mass in the framework of the supersymmetric SU(5) models. In this analysis, all the relevant parameters in the Lagrangian are taken to be free; in particular, assumption of the universal scalar mass is not adopted. Negative search for the Higgs boson at the LEP II experiment sets an important constraint on the supersymmetric contribution to the muon magnetic dipole moment a_μ(SUSY). It is shown that, for a fixed value of the lightest Higgs mass, the maximum possible value of a_μ(SUSY) becomes significantly larger in the general SU(5) case compared to the case of the universal scalar mass (i.e., the case of the so-called ``CMSSM''). We also point out that, if we take relatively large value of the trilinear scalar couplings, the constraint from the Higgs mass is drastically relaxed. In this case, a_μ(SUSY) can be as large as \\sim 50\\times 10^{-10} even for small value of \\tanβ(say, for \\tanβ=5). △ Less", "We re-examine spontaneous $\\cp$ violation (SCPV) at the tree level in the context of the next-to-minimal supersymmetric standard model (NMSSM) with two Higgs doublets and a gauge singlet field. We analyse the most general Higgs potential without a discrete $Z_3$ symmetry, and derive an upper bound on the mass of the lightest neutral Higgs boson. We estimate $\\epsi_K$ by applying the mass insertion approximation, finding that in order to account for the for the observed $\\cp$ violation in the neutral kaon sector a non-trivial flavour structure in the soft-breaking $A$ terms is required and that the upper bound on the lightest Higgs-boson mass becomes stronger. We also discuss the implications of electric dipole moments of the electron and the neutron in SUSY models with SCPV. △ Less", "We consider the Standard Models of particle physics and hot big bang cosmology, and review the theoretical and experimental motivations for extending these models to include supersymmetry and inflation. An obvious extension would be to unite these two models into a single all-encompassing theory. We identify a list of theoretical challenges that such a theory must address, which we illustrate with a simple model - a variant of the next-to-minimal supersymmetric Standard Model - that addresses these challenges. △ Less", "An analysis is given of the $b-τ$ Yukawa coupling unification in view of the recent result from Brookhaven on $g_μ-2$ and under the constraint of $b\\to s+γ$. We explore $b-τ$ unification under the above constraints for nonuniversal boundary conditions for the soft SUSY breaking parameters. We find new regions of the parameter space where significant negative supersymmetric contribution to the b quark mass can arise and $b-τ$ unification within SU(5) framework can occur with nonuniversal gaugino masses. Specifically we find that for the case where the gaugino mass matrix transforms like a 24 plet one finds a negative contribution to the b quark mass irrespective of the sign of the Higgs mixing parameter $μ$ when the supersymmetric contribution to $g_μ-2$ is positive. We exhibit regions of the parameter space where $b-τ$ unification occurs for $μ>0$ satisfying the constraints of $b\\to s+γ$ and $g_μ-2$. The $μ<0$ case is also explored. The dependence of the accuracy of $b-τ$ unification defined by $|λ_b-λ_τ|/λ_τ$ on the parameter space is also investigated and it is shown that unification with an accuracy of a few percent can be achieved in significant regions of the parameter space. The allowed parameter space is consistent with the naturalness constraints and the corresponding sparticle spectrum is accessible at the Large Hadron Collider. △ Less", "Diagnostic signals of the minimal model of anomaly mediated supersymmetry breaking are discussed in the context of a $\\sqrt{s}$ = 1 TeV $e^+e^-$ linear collider. △ Less", "In supersymmetric models with gaugino mediated SUSY breaking (inoMSB), it is assumed that SUSY breaking on a hidden brane is communicated to the visible brane via gauge superfields which propagate in the bulk. This leads to GUT models where the common gaugino mass $m_{1/2}$ is the only soft SUSY breaking term to receive contributions at tree level. To obtain a viable phenomenology, it is assumed that the gaugino mass is induced at some scale $M_c$ beyond the GUT scale, and that additional renormalization group running takes place between $M_c$ and $M_{GUT}$ as in a SUSY GUT. We assume an SU(5) SUSY GUT above the GUT scale, and compute the SUSY particle spectrum expected in models with inoMSB. We use the Monte Carlo program ISAJET to simulate signals within the inoMSB model, and compute the SUSY reach including cuts and triggers approriate to Fermilab Tevatron and CERN LHC experiments. We find no reach for SUSY by the Tevatron collider in the trilepton channel. %either with or without %identified tau leptons. At the CERN LHC, values of $m_{1/2}=1000$ (1160) GeV can be probed with 10 (100) fb$^{-1}$ of integrated luminosity, corresponding to a reach in terms of $m_{\\tg}$ of 2150 (2500) GeV. The inoMSB model and mSUGRA can likely only be differentiated at a linear $e^+e^-$ collider with sufficient energy to produce sleptons and charginos. △ Less", "An SO(10) SUSY GUT model which leads to maximal atmospheric neutrino mixing and the LMA solar neutrino solution, developed in collaboration with S.M. Barr, is briefly described. Since the model is quantitatively predictive, it can be used to assess the need for a neutrino factory, as shown in collaboration with S. Geer. △ Less", "The Higgs boson sector of the Minimal Supersymmetric Standard Model (MSSM) is investigated in a uniform way in the framework of the three most prominent soft SUSY-breaking scenarios, mSUGRA, mGMSB and mAMSB, especially concerning the Higgs searches at LEP2. △ Less", "The large freedom in the SM fermionic mass matrices allows for large LH and LH quark rotations. This is a natural possibility in view of the observed large leptonic mixing. Proton decay and especially its gauge mediated decay is sensitive also to those mixing angles which are non-relevant in the SM. A model with realistic mass matrices and large rotations is presented.. It is shown that the large leptonic mixing leads to enhancement of the proton decay branching ratios involving muons. △ Less", "The origin of quark and lepton masses is one of the outstanding problems of physics. As the experimental data becomes more and more accurate, testing theories of fermion masses requires greater care. In this talk we discuss a theoretical framework for testing those theories with a high energy desert. It is only with precision tests that we can hope to narrow the set of viable, beyond the standard model theories. △ Less", "It is shown that renormalization of the Fayet-Iliopoulos term in a softly broken SUSY gauge theory, in full analogy with all the other soft terms renormalizations, is completely defined in a rigid or an unbroken theory. However, contrary to the other soft renormalizations, there is no simple differential operator that acts on the renormalization functions of a rigid theory and allows one to get the renormalization of the F-I term. One needs an analysis of the superfield diagrams and some additional diagram calculations in components. The method is illustrated by the four loop calculation of some part of renormalization proportional to the soft scalar masses and the soft triple couplings. △ Less", "The possibility to simulate lepton number violating supersymmetric models has been introduced into the recently updated PYTHIA event generator, now containing 1278 decay channels of SUSY particles into SM particles via lepton number violating interactions. This generator has been used in combination with the ATLFAST detector simulation to study the impact of lepton number violation (LV) on event topologies in the ATLAS detector, and trigger menus designed for LV-SUSY are proposed based on very general considerations. In addition, a rather preliminary analysis is presented on the possibility for ATLAS to observe a signal above the background in several mSUGRA scenarios, using a combination of primitive cuts and neural networks to optimize the discriminating power between signal and background events over regions of parameter space rather than at individual points. It is found that a 5 sigma discovery is possible roughly for m_{1/2} < 1TeV and m_0 < 2TeV with an integrated luminosity of 30fb^{-1}, corresponding to one year of data taking with the LHC running at ``mid-luminosity'', L = 3*10^{33}s^{-1}cm^{-2}. △ Less", "We fitted the neutrino oscillations, baryogenesis and neutrinoless double beta decay using Anti-GUT model. △ Less", "We show that a large CP asymmetry in hyperon decays can be naturally realized in the framework of SUSY models. The possibility is implemented by the hermiticities of Yukawa and A matrices. And also, the observed values of $ε$ and $ε'$ are explained. △ Less", "We study gauge mediation models of supersymmetry breaking with neutralino LSP. These models are naturally realized by embedding the usual four-dimensional gauge mediation models into a higher-dimensional spacetime such as $M^4 \\times S^1 / Z_{2}$. We calculate the relic abundance of the neutralino LSP in these models and show that there exist wide parameter regions where the neutralino LSP constitutes the dominant component of the cold dark matter. These regions evade constraints from collider experiments such as Higgs mass bounds and $b \\ra s γ$, and also provide the value for the muon anomalous magnetic moment which is consistent with the SUSY explanation of the deviation from the standard model prediction. △ Less", "We construct a model based on SUSY SO(10) combined with U(2) family symmetry including complex phases leading to CP violation. In contrast with the commonly used effective operator approach, \\bar{126}-dimensional Higgs fields are utilized to construct the Yukawa sector. R-parity symmetry is thus preserved at low energies. The symmetric mass textures arising from the left-right symmetry breaking chain of SO(10) give rise to very good predictions for quark and lepton masses and mixings. The prediction for \\sin 2βagrees with the current bounds from BaBar and Belle. In the neutrino sector, our predictions are in good agreement with results from atmospheric neutrino experiments. Our model favors both the LOW and QVO solutions to the solar neutrino anomaly; the matrix element for neutrinoless double beta decay is highly suppressed. The leptonic analog of the Jarlskog invariant, J_{CP}^{l}, is predicted to be of O(10^{-2}). △ Less", "An analysis is made on bottom-tau Yukawa unification in supersymmetric (SUSY) SU(5) grand unified theory (GUT) in the framework of minimal supergravity, in which the parameter space is restricted by some experimental constraints including Br(b to s gamma) and muon g-2. The bottom-tau unification can be accommodated to the measured branching ratio Br(b to s gamma) if superparticle masses are relatively heavy and higgsino mass parameter μis negative. On the other hand, if we take the latest muon g-2 data to require positive SUSY contributions, then wrong-sign threshold corrections at SUSY scale upset the Yukawa unification with more than 20 percent discrepancy. It has to be compensated by superheavy threshold corrections around the GUT scale, which constrains models of flavor in SUSY GUT. A pattern of the superparticle masses preferred by the three requirements is also commented. △ Less", "It is shown that a realistic SUSY SU(6) GUT can dynamically generate the GUT scale and solve at the same time the doublet-triplet splitting problem. The cosmological implications of such a model are briefly reviewed. △ Less", "We investigate squark and gluino pair production at LHC(CMS) for the case of nonuniversal gaugino masses. Visibility of signal by an excess over SM background in $(n \\geq 2)jets + E^{miss}_T + (m \\geq leptons)$ events depends rather strongly on the relation between LSP, gluino and squark masses and it decreases with the increase of LSP mass. For relatively heavy LSP mass close to squark or gluino masses it is possible to detect SUSY for $(m_{\\tilde{q}}, m_{\\tilde{g}}) \\leq (1 - 1.5)$ TeV.} △ Less", "The restrictions on the lightest Higgs boson mass in the minimal supersymmetric models are briefly reviewed. The particle spectrum is considered in the framework of the simplest modification of NMSSM that allows to avoid the domain wall problem and to get the self--consistent solution in the strong Yukawa coupling limit. The lightest Higgs boson mass in the investigated model can reach $125 GeV$ at values of $\\tanβ\\ge 1.9$ and does not exceed $130.5\\pm 3.5 GeV$. △ Less", "A lattice regularization of the supersymmetric Wess-Zumino model is studied by using Ginsparg-Wilson operators. We recognize a certain conflict between the lattice chiral symmetry and the Majorana condition for Yukawa couplings, or in Weyl representation a conflict between the lattice chiral symmetry and Yukawa couplings. This conflict is also related, though not directly, to the fact that the kinetic (Kähler) term and the superpotential term are clearly distinguished in the continuum Wess-Zumino model, whereas these two terms are mixed in the Ginsparg-Wilson operators. We illustrate a case where lattice chiral symmetry together with naive Bose-Fermi symmetry is imposed by preserving a SUSY-like symmetry in the free part of the Lagrangian; one-loop level non-renormalization of the superpotential is then maintained for finite lattice spacing, though the finite parts of wave function renormalization deviate from the supersymmetric value. All these properties hold for the general Ginsparg-Wilson algebra independently of the detailed construction of lattice Dirac operators. △ Less", "We summarize the recent results on the supersymmetric QCD radiative corrections, at the one-loop level, in Higgs and top quark decays, in the context of the Minimal Supersymmetric Standard Model and in the decoupling limit of very heavy SUSY particles. Special attention is devoted to the particular decays $h^0\\to b \\bar b$, $H^+\\to t \\bar b$, $H^0\\to b \\bar b$, $A^0\\to b \\bar b$ and $t \\to H^+\\bar b$ where the radiative corrections from heavy squarks and heavy gluinos do not decouple and are enhanced at large $\\tan β$. Some interesting phenomenological consequences are also briefly summarized. △ Less", "Mechanism for generation of suppressed neutrino masses, within low scale theories, is considered. The mechanism do not have extradimensional nature and is realized through extended $SU(2)_L$ scalar multiplets. Latters, in some cases, are also crucial for successful low scale unification. △ Less", "We study the supersymmetric leptogenesis via $LH_{u}$ flat direction with a gauged $U(1)_{B-L}$ symmetry. We find that the resultant baryon asymmetry is enhanced compared with the case without a gauged $U(1)_{B-L}$ symmetry. The baryon asymmetry is proportional to the reheating temperature of inflation, but it is independent of the gravitino mass. If high reheating temperatures of inflation $T_{R}\\sim 10^{10}\\GEV$ are available, the mass of the lightest neutrino, $m_{ν1}\\sim 10^{-4}\\EV$, is small enough to explain the baryon asymmetry in the present universe. Furthermore, the gravitino mass independence of the produced baryon asymmetry allows us to explain the present baryon asymmetry even in low energy SUSY breaking scenarios such as gauge-mediation models. Our leptogenesis scenario is also very special in the sense that it is completely free from the serious Q-ball formation problem. △ Less", "Present situation in the flavour mixing of quarks and leptons is briefly reviewed and a new approach called the Minimal Flavour Mixing (MFM) is considered in detail. According to MFM the whole of the flavour mixing is basically determined by the physical mass generation of the first family of fermions. So, in the chiral symmetry limit when the masses of the lightest quarks, u and d, vanish, all the weak mixing angle vanish. This minimal pattern is shown to fit extremely well the already established CKM matrix elements and to give fairly distinctive predictions for the as yet poorly known ones. Remarkably, together with generically small quark mixing it also leads to the large neutrino mixing thus giving adequate solution to the solar and athmospheric neutrino oscillation problem. The possible origin of this approach in the MSSM extended by the high-scale $SU(3)_{F}$ chiral family symmetry is discussed. △ Less", "Supersymmetric models with a warped fifth spatial dimension can solve the hierarchy problem, avoiding some shortcomings of non-supersymmetric constructions, and predict a plethora of new phenomena at typical scales Lambda not far from the electroweak scale (Lambda ~ a few TeV). In this paper we derive the low-energy effective theories of these models, valid at energies below Lambda. We find that, in general, such effective theories can deviate significantly from the Minimal Supersymmetric Standard Model (MSSM) or other popular extensions of it, like the NMSSM: they have non-minimal Kaehler potentials (even in the Mp -> \\infty limit), and the radion is coupled to the visible fields, both in the superpotential and the Kaehler potential, in a non-trivial (and quite model-independent) fashion. The corresponding phenomenology is pretty unconventional, in particular the electroweak breaking occurs in a non-radiative way, with tan beta \\simeq 1 as a quite robust prediction, while the mass of the lightest Higgs boson can be as high as ~ 700 GeV. △ Less", "We present an analysis of compactifications of the type IIB superstring on AdS_5 x S^5 / Γ, where Γis an abelian cyclic group. Every Γ=Z_n of order n<= 12 is considered. This results in 60 chiral models, and a systematic analysis with n<8 yields four containing the minimal SUSY standard model with three families. One of these models extends to an infinite sequence of three-family MSSMs. We also give a lower bound on the number of chiral models for all values of n. △ Less", "We show that the bosonic decays of the lighter top and bottom squarks, i.e. t~_1 -> b~_1 + (H^+ or W^+) and b~_1 -> t~_1 + (H^- or W^-), can be dominant in a wide range of the MSSM parameters. Compared to the fermionic decays, such as t~_1 -> b + chargino_j, these bosonic decays can have significantly different decay distributions. We also show that the effect of the supersymmetric QCD running of the quark and squark parameters on the t~_1 and b~_1 decay branching ratios is quite dramatic. These could have an important impact on the search for t~_1 and b~_1 and the determination of the MSSM parameters at future colliders. △ Less", "I briefly describe the recent construction of the first specific string D-brane models yielding just the SM massless fermion spectrum. One of the most remarkable facts predicted by these constructions is that the global symmetries of the SM like Baryon and Lepton numbers as well as the axial $U(1)_A$ are gauged symmetries whose anomalies are cancelled by a Green-Schwarz mechanism only in the case of three quark-lepton generations. Proton stability and the Dirac nature of neutrino masses are thus a prediction of these theories. This is work done in collaboration with Fernando Marchesano and Raul Rabadan. △ Less", "Motivated from the recent results of neutrino oscillation experiment, we investigated lepton flavor violating (LFV) processes in a SU(5) supersymmetric grand unified theory with right-handed neutrino. The current experimental upper bound for $μ\\to eγ$ process gives already some constraint on the model. Correlation between $μ\\to e γ$ and the SUSY contribution to the muon anomalous magnetic moment is also discussed. Future LFV experiments will give considerable impacts on this type of SUSY GUT models equipped with seesaw neutrino mass generation. △ Less", "BPS walls and junctions are studied in ${\\cal N}=1$ SUSY nonlinear sigma models in four spacetime dimensions. New BPS junction solutions connecting N discrete vacua are found for nonlinear sigma models with several chiral scalar superfields. A nonlinear sigma model with a single chiral scalar superfield is also found which has a moduli space of the topology of $S^1$ and admits BPS walls and junctions connecting arbitrary points in moduli space. SUSY condition in nonlinear sigma models are classified either as stationary points of superpotential or singularities of the Kähler metric in field space. The total number of SUSY vacua is invariant under holomorphic field redefinitions if we count ``runaway vacua'' also. △ Less", "We study if a sizeable muon electric dipole can arise in supersymmetric frameworks able to account for the tight experimental bounds on sfermion masses, like an appropriate flavor symmetry, or like a flavor-blind mechanism of SUSY breaking (in presence of radiative corrections charchteristic of GUT models, or due to Yukawa couplings of neutrinos in see-saw models). In some cases it is possible to evade the naive scaling d_mu/d_e = m_mu/m_e and obtain a d_mu as large as 10^{-22--23} e cm. In most cases d_mu is around 10^{-24--25} e cm and (d_mu/d_e)/(m_mu/m_e) is only slightly different from one: this ratio contains interesting informations on the source of the dipoles and on the texture of the lepton Yukawa matrix. We also update GUT predictions for mu --> e gamma and related processes. △ Less", "We report on a preferred region of supersymmetric parameter space by t, b, tau Yukawa unification. We find a narrow region survives for mu > 0 (suggested by b --> s gamma and the anomalous magnetic moment of the muon) with A_0 \\sim - 2 m_{16}, m_{16} > 1200 GeV, mu, M_{1/2} << m_{16} and tan β\\sim 50 \\pm 2. Demanding Yukawa unification thus makes definite predictions for Higgs and sparticle masses. △ Less", "We constrain the parameter space of the minimal and gaugino-assisted anomaly mediation, and gaugino mediation models by requiring that the electroweak vacuum corresponds to the deepest minimum of the scalar potential. In the framework of anomaly mediation models we find strong lower bounds on slepton and squark masses. In the gaugino mediation models the mass spectrum is forced to be at the TeV scale. We find extensive regions of the parameter space which are ruled out, even at low tan(beta). The implications of these results on the g-2 of the muon are also analyzed. △ Less", "We discuss corrections to $ΔM_{B_d}$, $ΔM_{B_s}$ and to the CP violation parameter $ε$ in two examples of (generalized) minimal flavour violation models: 2HDM and MSSM in the large $\\tanβ$ limit. We show that for $H^+$ not too heavy, $ΔM_{B_s}$ in the MSSM with heavy sparticles can be substantially smaller than in the SM due the charged Higgs box contributions and in particular due to the growing like $\\tan^4β$ contribution of the double penguin diagrams involving neutral Higgs boson exchanges. △ Less", "In the Minimal Supersymmetric Standard Model (MSSM), the simultaneous appearance of lepton and baryon number violation causes the proton to decay much faster than the experimental bound allows. Customarily, a discrete symmetry known as R-parity is imposed to forbid these dangerous interactions. This work begins by arguing that there is no deep theoretical motivation for preferring R-parity over other discrete symmetries and continues by adopting the MSSM with baryon number conservation replacing R-parity conservation. For the purpose of studying the influence of the consequent lepton number violating interactions, 1278 new decay channels of supersymmetric particles into Standard Model particles have been included in the PYTHIA event generator. The augmented event generator is then used in combination with the atlfast detector simulation to study the impact of lepton number violation on event topologies in the ATLAS detector, and trigger menus designed for LV-SUSY are proposed based on very general conclusions. The subsequent analysis uses a combination of primitive cuts and neural networks to optimize the discriminating power between signal and background events. In all scenarios studied, it is found that a $5σ$ discovery is possible for cross sections down to $10^{-10}$ mb with an integrated luminosity of 30 fb$^{-1}$. △ Less", "The Minimal Supersymmetric Standard Model (MSSM) can include two soft breaking terms which are often neglected: a non-analytic scalar trilinear coupling and a Higgsino bilinear term. A set of high-scale boundary conditions consistent with the reparameterisation invariance which the model possesses is obtained. The three-family renormalisation group equations for the MSSM with these terms are presented. The ranges of the universal high-scale values of these couplings which lead to an acceptable TeV-scale theory are obtained, as is the supersymmetric particle spectrum at this scale. The effect of the new terms on fine-tuning is presented. SOFTSUSY, an existing program for calculating SUSY particle spectra, has been used, with as few modifications as possible. △ Less", "We summarized our report on neutrino masses and $μ\\to e γ$ in the generic supersymmetric standard model, emphasizing on the much overlooked scalar masses contributions from R-parity violation. △ Less", "We investigate whether the Affleck-Dine mechanism can produce sufficient baryon number of the universe in the gauge-mediated SUSY breaking models, while evading the cosmological moduli problem by late-time entropy production. We find that the Q-ball formation renders the scenario very difficult to work, irrespective of the detail mechanism of the entropy production. △ Less", "We construct supersymmetric (SUSY) grand unification (GUT) models in the six dimensional space-time where the GUT symmetry is broken down to the standard-model gauge group by a simple orbifolding T^2/Z_4 or T^2/Z_6 and a pair of massless Higgs doublets in the SUSY standard model are naturally obtained. Since the background geometry here is simple compared with models using the Scherk-Schwarz mechanism, one might hope for an approximate gauge coupling unification in the present models. Here, the presence of the massless Higgs multiplets in the bulk is quite natural, since the anomaly cancellation in the six dimensional space-time requires N=2 hyper multiplets in the bulk, some of which are origins of the Higgs doublets. However, the origin of the quarks and leptons is still not clear at all. △ Less", "We re-examine the bounds on supersymmetric particle masses in light of the E821 data on the muon anomalous magnetic moment. We confirm, extend and supersede previous bounds. In particular we find (at one sigma) no lower limit on tan(beta) or upper limit on the chargino mass implied by the data at present, but at least 4 sparticles must be lighter than 700 to 820 GeV and at least one sparticle must be lighter than 345 to 440 GeV. However, the E821 central value bounds tan(beta) > 4.7 and the lighter chargino mass by 690 GeV. For tan(beta) < 10, the data indicates a high probability for direct discovery of SUSY at Run II or III of the Tevatron. △ Less", "We make explicit the statement that Minimal Supersymmetric SU(5) has been excluded by the Super-Kamiokande search for the process $p \\to K^{+} \\overlineν$. This exclusion is made by first placing limits on the colored Higgs triplet mass, by forcing the gauge couplings to unify. We also show that taking the superpartners of the first two generations to be very heavy in order to avoid flavor changing neutral currents, the so-called ``decoupling'' idea, is insufficient to resurrect the Minimal SUSY SU(5). We comment on various mechanisms to further suppress proton decay in SUSY SU(5). Finally, we address the contributions to proton decay from gauge boson exchange in the Minimal SUSY SU(5) and flipped SU(5) models. △ Less", "We show that in a large class of supersymmetric models with spontaneously broken B-L symmetry, neutron--antineutron oscillations occur at an observable level even though the scale of B-L breaking is very high, v_{B-L} ~ 2 x 10^{16} GeV, as suggested by gauge coupling unification and neutrino masses. We illustrate this phenomenon in the context of a recently proposed class of seesaw models that solves the strong CP problem and the SUSY phase problem using parity symmetry. We obtain an upper limit on N-\\bar{N} oscillation time in these models, τ_{N-\\bar{N}} < 10^{9} -10^{10} sec. This suggests that a modest improvement in the current limit on τ_{N-\\bar{N}} of 0.86 x 10^8 sec will either lead to the discovery of N-\\bar{N} oscillations, or will considerably restrict the allowed parameter space of an interesting class of neutrino mass models. △ Less", "The SUSY contribution to the muon magnetic moment anomaly, a_mu^SUGRA, and the electron electric dipole moment, d_e, is discussed within the framework of a modified mSUGRA model where the magnitudes of the soft breaking masses are universal, but arbitrary phases are allowed. It is shown analytically how the cancellation mechanism can allow for large phases (i.e. theta_B <~ 0.4) and still suppress the value of d_e below its current experimental bound. The dependence of a_mu^SUGRA on the CP violating phases are analytically examined, and seen to decrease it but by at most a factor of about two. This reduction would then decrease the upper bound on m_1/2 due to the lower bound of Brookhaven data, and hence lower the SUSY mass spectrum, making it more accessible to accelerators. At the electroweak scale, the phases have to be specified to within a few percent to satisfy the experimental bound on d_e, but at the GUT scale, fine tuning below 1% is required for lower values of m_1/2. This fine tuning problem will become more serious if the bound on d_e is decreased. △ Less", "We study the so-called ``Kaluza-Klein regularization''. We calculate one-loop corrections to the Higgs mass due to Kaluza-Klein modes explicitly in a model with SUSY breaking mass splitting between bosonic and fermionic modes. We perform the proper time cutoff at $1/Λ^2$ and the KK level truncation at $\\ell$. It is shown that the finite result is obtained as long as $\\ell \\gg RΛ$ for the compactification radius $R$. △ Less", "We construct SU(5) SUSY GUT in 5D compactified on S^1/Z_2 orbifold where the matter fields are living in the five dimensional bulk. SU(5) symmetry is broken down to the Standard Model gauge group by the orbifold projection which automatically ensures stability of proton in all orders of perturbation theory. The model predicts extra mirror quark-lepton families which along with the GUT particles and the excitations of extra dimensions could be observable at high energy colliders providing the unification scale is in the TeV range. △ Less", "We analyse the rare decay mode B_s -> mu^+ mu^- in the minimal supergravity scenario (mSUGRA). We find a strong correlation with the muon anomalous magnetic moment (g-2)_mu. An interpretation of the recently measured excess in (g-2)_mu in terms of mSUGRA corrections implies a substantial supersymmetric enhancement of the branching ratio Br(B_s -> mu^+ mu^-): if (g-2)_mu exceeds the Standard Model prediction by 4*10^{-9}, Br(B_s -> mu^+ mu^-) is larger by a factor of 10-100 than in the Standard Model and within reach of Run-II of the Tevatron. Thus an experimental search for B_s -> mu^+ mu^- is a stringent test of the mSUGRA GUT scale boundary conditions. If the decay B_s -> mu^+ mu^- is observed at Run-II of the Tevatron, then we predict the mass of the lightest supersymmetric Higgs boson to be less than 120 GeV. The decay B_s -> mu^+ mu^- can also significantly probe the favoured parameter range in SO(10) SUSY GUT models. △ Less", "A SUSY breaking mechanism with no messenger fields is proposed. We assume that our world is on a domain wall and SUSY is broken only by the coexistence of another wall with some distance from our wall. We find an ${\\cal N}=1$ model in four dimensions which admits an exact solution of a stable non-BPS configuration of two walls and studied its properties explicitly. We work out how various soft SUSY breaking terms can arise in our framework. Phenomenological implications are briefly discussed. We also find that effective SUSY breaking scale becomes exponentially small as the distance between two walls grows. △ Less", "A brief overview is given of recent developments in the analyses of large phases and CP violation in supersymmetric unified models. The problem of experimental electric dipole moment constraints and large phases is discussed. Implications of large phases on supersymmetric phenomena are reviewed. The possibility of generating a muon electric dipole moment much larger than implied by the scaling relation $d_μ/d_e\\simeq m_μ/m_e$ from lepton flavor nonuniversality and within reach of the recently proposed Brookhaven experiment for a sensitive probe of $d_μ$ is also discussed. △ Less", "We perform a complete analysis of the supersymmetric particle spectrum in the Minimal Supergravity (mSUGRA) model where the soft SUSY breaking scalar masses, gaugino masses and trilinear couplings are unified at the GUT scale, so that the electroweak symmetry is broken radiatively. We show that the present constraints on the Higgs boson and superparticle masses from collider searches and precision measurements still allow for large regions of the mSUGRA parameter space where charginos, neutralinos, sleptons and top squarks as well as the heavier Higgs particles, are light enough to be produced at the next generation of $\\ee$ linear colliders with center of mass energy around $\\sqrt{s} \\sim 800$ GeV, with sizeable cross sections. An important part of this parameter space remains even when we require that the density of the lightest neutralinos left over from the Big Bang, which we calculate using standard assumptions, falls in the range favored by current determinations of the Dark Matter density in the Universe. Already at a c.m. energy of 500 GeV, SUSY particles can be accessible in some parameter range, and if the energy is increased to $\\sqrt{s} \\simeq 1.2$ TeV, the $e^+e^-$ collider will have a reach for high precision studies of SUSY particles in a range that is comparable to the discovery range of the LHC. △ Less", "Recently we proposed an attractive scenario of grand unified theories with anomalous $U(1)_A$ gauge symmetry, in which doublet-triplet splitting is naturally realized in SO(10) unification using Dimopoulos-Wilczek mechanism and realistic quark and lepton mass matrices can be obtained in a simple way. In this paper we show that there is a mechanism in which the doublet Higgs obtains the supersymmetric mass which is proportional to the SUSY breaking parameters. This mechanism can be applied easily in the above scenario. The point is that the mass term, which is forbidden by SUSY zero mechanism, can be induced by SUSY breaking. The proportional coefficient is controlled by the anomalous U(1)_A charges. △ Less", "Advancing QCD toward astroparticle applications generates new challenges for perturbation theory, such as the presence of large evolution scales with sizeable scaling violations involving both the initial and the final state of a collision. Possible applications in the context of Ultra High Energy Cosmic Rays (UHECR) of these effects are discussed. △ Less", "I review the theory of preheating after inflation, focusing on the recently found tachyonic preheating in the theories with spontaneous symmetry breaking. This occurs due to the tachyonic instability of the scalar field near the top of its effective potential. Contrary to the common expectation, tachyonic instability converts most of the energy into that of colliding classical waves very rapidly, within a single oscillation. Efficient tachyonic preheating is typical for the hybrid inflationary scenario, including SUSY motivated and brane inflation models. △ Less", "Supersymmetry exhibts new sources of CP violation. We discuss the implications of these new contributions to CP violation both in the K and B physics. We show that CP violation puts severe constraints on low energy SUSY, but it represents also a promising ground to look for signals of new physics. △ Less", "We analyze the cascade decays of the scalar quarks and gluinos of the Minimal Supersymmetric extension of the Standard Model, which are abundantly produced at the Large Hadron Collider, into heavier charginos and neutralinos which then decay into the lighter ones and charged Higgs particles, and show that they can have substantial branching fractions. The production rates of these Higgs bosons can be much larger than those from the direct production mechanisms, in particular for intermediate values of the parameter $\\tan β$, and could therefore allow for the detection of these particles. We also discuss charged Higgs boson production from direct two-body top and bottom squark decays as well as from two- and three-body gluino decays. △ Less", "Applying Jarlskog's treatment of the CKM matrix, to the neutralino mass matrix in MSSM for real soft gaugino SUSY breaking and $μ$-parameters, we construct explicit analytical expressions for the four projectors which acting on any neutralino state project out the mass eigenstates. Analytical expressions for the neutralino mass eigenvalues in terms of the various SUSY parameters, are also given. It is shown that these projectors and mass eigenvalues are sufficient to describe any physical observable involving neutralinos, to any order of perturbation theory. As an example, the $e^-e^+ \\to \\tilde χ^0_i \\tilde χ^0_j $ cross section at tree level is given in terms of these projectors. The expected magnitude of their various matrix elements in plausible SUSY scenarios is also discussed. △ Less", "We review the problem of neutrino masses and mixings in the context of Grand Unified Theories. After a brief summary of the present experimental status of neutrino physics, we describe how the see-saw mechanism can automatically account for the large atmospheric mixing angle. We provide two specific examples where this possibility is realized by means of a flavour symmetry. We then review in some detail the various severe problems which plague minimal GUT models (like the doublet-triplet splitting and proton-decay) and which force to investigate the possibility of constructing more elaborate but realistic models. We then show an example of a quasi-realistic SUSY SU(5) model which, by exploiting the crucial presence of an abelian flavour symmetry, does not require any fine-tuning and predicts a satisfactory phenomenology with respect to coupling unification, fermion masses and mixings and bounds from proton decay. △ Less", "In supersymmetric models with explicit breaking of R-parity the lightest supersymmetric particle (LSP) may be the lightest stau, $\\stau_1$. Such a scenario would provide a clear sign of R-parity violating SUSY, although its phenomenology may resemble that of a charged Higgs boson, $H^\\pm$. We discuss various ways of distinguishing a LSP $\\stau_1$ from $H^\\pm$ at future colliders, and address the case of $\\stau_1$ mimicking the signal for $H^\\pm$. As an example we suggest that the recent L3 signal for $H^+H^-\\to qq'qq'$ and $H^+H^-\\to qq'τν_τ$ could be more easily explained by a LSP $\\stau_1$. △ Less", "We propose a simultaneous solution to the strong CP problem and the SUSY phase problem based on parity symmetry realized when the supersymmetric standard model is embedded into a left-right symmetric framework at a scale near 2 x 10^{16} GeV, as suggested by neutrino masses and gauge coupling unification. In this class of models, owing to parity, SUSY contributions to the muon anomalous magnetic moment can be naturally large without conflicting with the EDM of the electron and the neutron. The strong CP violation parameter θis zero at the tree level, also due to parity (P), but is induced due to P-violating effects below the unification scale. We estimate the induced θto be < 10^{-16}, if we adopt a constrained supersymmetric spectrum with universal scalar masses. In the more general SUSY breaking scenario, after imposing flavor changing constraints, we find theta ~ (10^{-8}-10^{-10}), which is compatible with, but not much below the present limit on neutron EDM. We also argue that potential non-perturbative corrections to θfrom quantum gravitational effects are not excessive in these models. △ Less", "Proton decay via d=5 operators is excluded by now not only in the framework of SUSY SU(5) but also its extensions like SUSY SO(10) are on the verge of being inconsistent with d=5 decays. It is reasonable therefore to suppress, e.g. by a symmetry, the d=5 operators and to consider gauge boson induced d=6 decays. This is suggested in several recent papers in the framework of models with a lighter $ M_X$. We discuss here explicitly the fermionic sector of such a renormalizable SUSY SO(10) with realistic mass matrices. We find that the recently ``observed'' large leptonic mixing leads to an enhancement of the nucleon decay channels involving $μ$'s and in particular the $μ^+π^o$, $μ^+π^-$ modes. △ Less", "We discuss the role played by the horizontal flavour symmetry in supersymmetric theories. In particular, we consider the horizontal symmetry $SU(3)_H$ between the three fermion families and show how this concept can help in explaining the fermion mass spectrum and mixing pattern in the context of SUSY GUTs. △ Less", "The region of moduli space of string theories which is most likely to describe the \"real world\" is where the string coupling is about unity and the volume of extra compact dimensions is about the same size as the string volume. Here we map the landscape of this \"central\" region in a model-independent way, assuming only that the string coupling and compact volume moduli are chiral superfields of N=1 supergravity in 4 dimensions, and requiring only widely accepted conditions: that the supersymmetry (SUSY) breaking scale is about the weak scale and that the cosmological constant be of acceptably small magnitude. We find that the superpotential has (in the supersymmetric limit) a fourth order zero in the SUSY breaking direction. The potential near the minimum is very steep in the SUSY preserving directions, and very flat in the SUSY breaking direction, consequently the SUSY breaking field has a weak scale mass, while other moduli are heavy. We also argue that there will be additional near by minima with a large negative cosmological constant. △ Less", "A generic F-theory compactification containing many D3 branes develops multiple brane throats. The interaction of observers residing inside different throats involves tunneling suppression and, as a result, is very weak. This suggests a new mechanism for generating small numbers in Nature. One application is to the hierarchy problem: large supersymmetry breaking near the unification scale inside a shallow throat causes TeV-scale SUSY-breaking inside the standard-model throat. Another application, inspired by nuclear-decay, is in designing naturally long-lived particles: a cold dark matter particle residing near the standard model brane decays to an approximate CFT-state of a longer throat within a Hubble time. This suggests that most of the mass of the universe today could consist of CFT-matter and may soften structure formation at sub-galactic scales. The tunneling calculation demonstrates that the coupling between two throats is dominated by higher dimensional modes and consequently is much larger than a naive application of holography might suggest. △ Less", "Supersymmetric grand unified models based on SO(10) gauge symmetry have many desireable features, including the unification of Yukawa couplings. Using D-term contributions to scalar masses arising from the breakdown of SO(10), Yukawa coupling unification only to 30% can be achieved in models with a positive superpotential Higgs mass. The superparticle mass spectrum is highly constrained, and yields relatively light top squarks and charginos. Surprisingly, the pattern of GUT scale soft SUSY breaking masses are close to those found in the context of inverted hierarchy models. Our analysis supports the idea that the low energy MSSM parameter space is an approximate SO(10) inspired fixed point. △ Less", "We study the phenomenological implications of the Higgs sector CP violation at a photon collider. In our model, the CP violation is radiatively induced by the non-trivial CP phases of the third-generation scalar-quark sector in the MSSM. We re-evaluate the $s$-channel resonance production cross sections and the polarization asymmetries of the neutral Higgs bosons based on the calculation of the mass matrix of the neutral Higgs bosons which is valid for any values of the relevant SUSY parameters. The CP properties of the Higgs bosons can be precisely probed through their $s$-channel resonance productions at a photon linear collider by exploiting circularly and/or linearly polarized backscattered laser photons. △ Less", "Giving up the assumption of the gaugino mass unification at the GUT scale, the latest LEP and Tevatron data still allow the lightest supersymmetric Higgs to have a large branching fraction into invisible neutralinos. Such a Higgs may be difficult to discover at the LHC and is practically unreachable at the Tevatron. We argue that, for some of these models to be compatible with the relic density, light sleptons with masses not far above the current limits are needed. There are however models that allow for larger sleptons masses without being in conflict with the relic density constraint. This is possible because these neutralinos can annihilate efficiently through a Z-pole. We also find that many of these models can nicely account, at the 2σlevel, for the discrepancy in the latest g-2 measurement. However, requiring consistency with the g-2 at the 1σlevel, excludes models that lead to the largest Higgs branching fraction into LSP's. In all cases one expects that even though the Higgs might escape detection, one would have a rich SUSY phenomenology even at the Tevatron, through the production of charginos and neutralinos. △ Less", "We investigate the Higgs boson sector of the Minimal Supersymmetric Standard Model (MSSM) in the framework of the three most prominent soft SUSY-breaking scenarios, mSUGRA, MGMSB and mAMSB. For each scenario, we determine the parameters at the electroweak scale from the set of input variables at higher energy scales (depending on the specific scenario) and evaluate the Higgs boson properties. The latter are based on results obtained within the Feynman-diagrammatic approach by taking into account the complete one-loop and the dominant two-loop contributions. The maximum value of the mass of the lightest neutral CP-even MSSM Higgs boson, m_h, is determined in the three scenarios, and the behavior of the Higgs couplings to fermions and gauge bosons is investigated. Restrictions on tan beta and on the set of higher-energy scale parameters are derived from the lower limits arising from the Higgs search at LEP2. We furthermore discuss the regions of parameter space in the three scenarios compatible with interpreting the excess observed at LEP2 as a Higgs signal, with m_h = (115.0 + 1.3 - 0.9) GeV. The case where the events observed at LEP2 could originate from the production of the heavier neutral CP-even Higgs boson is also considered. The implications of a possible Higgs signal at 115 GeV for SUSY searches at future colliders are briefly discussed for each of the three scenarios. △ Less", "In low energy SUSY theories exchange of gluino and squark with left-right mixing can produce a large gluonic dipole interaction. In this paper we study the effects of this interaction on $B\\to K π$ using QCD improved factorization method. The Standard Model predicts a smaller branching ratio for $B^0 \\to \\bar K^0 π^0$ than experimental measured one. We find that within the parameter space allowed from $B\\to γX_s$ constraint, the SUSY dipole interaction can enhance this branching ratio to agree with the experimental measurement. Combining recent data for all the four $\\bar B^0 \\to K^- π^+, \\bar K^0 π^0$ and $B^- \\to K^- π^0, \\bar K^0 π^-$ decay modes, we find that the allowed parameter space is reduced significantly compared with that using $B\\to X_s γ$ data alone. It is found that even with these constraints, the predictions for CP violation in these modes can be dramatically different from those of the SM predictions. △ Less", "An overview is given of the experimental neutrino mixing results and types of neutrino models proposed, with special attention to the general features of various GUT models involving intra-family symmetries and horizontal flavor symmetries. Many of the features are then illustrated by a specific SO(10) SUSY GUT model formulated by S.M. Barr and the author which can explain all four types of solar neutrino mixing solutions by various choices of the right-handed Majorana mass matrix. The quantitative nature of the model's large mixing angle solution is used to compare the reaches of a neutrino super beam and a neutrino factory for determining the small U_{e3} mixing matrix element. △ Less", "Beam polarization at e+ e- linear colliders will be a powerful tool for high precision analyses. Often it is assumed that the full information from polarization effects is provided by polarization of the electron beam and no further information can be obtained by the simultaneous polarization of the positrons. In this paper we point out the advantages of polarizing both beams, and summarize the polarization-related results of the Higgs, Electroweak, QCD, SUSY and Alternative Theories working groups of the ECFA/DESY workshop for a planned linear collider operating in the energy range sqrt{s}= 500-800 GeV. △ Less", "We consider the Affleck-Dine baryogenesis comprehensively in the minimal supersymmetric standard model with gauge-mediated supersymmetry breaking. Considering the high temperature effects, we see that the Affleck-Dine field is naturally deformed into the form of the Q ball. In the natural scenario where the initial amplitude of the field and the A-terms are both determined by the nonrenormalizable superpotential, we obtain only very a narrow allowed region in the parameter space in order to explain the baryon number of the universe for the case that the Q-ball formation occurs just after baryon number production. Moreover, most of the parameter sets suited have already been excluded by current experiments. We also find new situations in which the Q-ball formation takes place rather late compared with baryon number creation. This situation is more preferable, since it allows a wider parameter region for naturally consistent scenarios, although it is still difficult to realize in the actual cosmological scenario. △ Less", "A model based on SUSY SO(10) combined with U(2) family symmetry constructed recently by the authors is generalized to include phases in the mass matrices leading to CP violation. In contrast with the commonly used effective operator approach, $\\bar{126}$-dimensional Higgs fields are utilized to construct the Yukawa sector. R-parity symmetry is thus preserved at low energies. The symmetric mass textures arising from the left-right symmetry breaking chain of SO(10) give rise to very good predictions for quark and lepton masses and mixings. The prediction for $\\sin 2β$ agrees with the average of current bounds from BaBar and Belle. In the neutrino sector, our predictions are in good agreement with results from atmospheric neutrino experiments. Our model favors both the LOW and QVO solutions to the solar neutrino anomaly; the matrix element for neutrinoless double beta decay is highly suppressed. The leptonic analog of the Jarlskog invariant, $J_{CP}^{l}$, is predicted to be of $O(10^{-2})$. △ Less", "The electron electric dipole moment (d_e) and the muon magnetic moment anomaly (a_μ) recently observed at BNL are analyzed within the framework of SUGRA models with CP violating phases at the GUT scale. It is seen analytically that even if d_e were zero, there can be a large Bino mass phase (ranging from 0 to 2 π) with a corresponding large B soft breaking mass phase (of size ~< 0.5 with sign fixed by the experimental sign of a_μ). The dependence of the B phase on the other SUSY parameters, gaugino mass m_{1/2}, \\tan β, A_0, is examined. The lower bound of a_μ determines the upper bound of m_{1/2}. It is shown analytically how the existence of a non-zero Bino phase reduces this upper bound (which would correspondingly lower the SUSY mass spectra). The experimental upper bound on d_e determines the range of allowed phases, and the question of whether the current bound on d_e requires any fine tuning is investigated. At the electroweak scale, the phases have to be specified to within a few percent. At the GUT scale, however, the B phase requires fine tuning below the 1% level over parts of the parameter space for low m_{1/2}, and if the current experimental bound on d_e were reduced by only a factor of 3-4, fine tuning below 1% would occur at both the electroweak and GUT scale over large regions of the parameter space. All accelerator constraints (m_h > 114 GeV, b -> s γ, etc.) and relic density constraints with all stau-neutralino co-annihilation processes are included in the analysis. △ Less", "We briefly review models of neutrino masses and mixings. In view of the existing experimental ambiguities many possibilities are still open. After an overview of the main alternative options we focus on the most constrained class of models based on three widely split light neutrinos within SUSY Grand Unification. △ Less", "We present 4D gauge theories which at low energies coincide with higher dimensional supersymmetric (SUSY) gauge theories on a transverse lattice. We show that in the simplest case of pure 5D SUSY Yang-Mills there is an enhancement of SUSY in the continuum limit without fine-tuning. This result no longer holds in the presence of matter fields, in which case fine-tuning is necessary to ensure higher dimensional Lorentz invariance and supersymmetry. We use this construction to generate 4D models which mimic gaugino mediation of SUSY breaking. The way supersymmetry breaking is mediated in these models to the MSSM is by assuming that the physical gauginos are a mixture of a number of gauge eigenstate gauginos: one of these couples to the SUSY breaking sector, while another couples to the MSSM matter fields. The lattice can be as coarse as just two gauge groups while still obtaining the characteristic gaugino-mediated soft breaking terms. △ Less", "We have entered the era of BaBar, Belle and Tevatron competition; with new hardware and unprecedented statistics reach, we must be prepared for discovering new phenomena. While these unfoldings could be coming from new physics, it could also come about as new tricks from old. We illustrate new physics with generic $bsg$ dipole and its impact on $\\sin2Φ_{φK_S}$, and at a deeper level, the marriage of flavor symmetries and SUSY, which could impact on $B_d$, $B_s$ and $D^0$ mixings and CP violation, and possibility of a light $\\widetilde{sb}$ squark. As simple unfolding, we touch upon charmless $B \\to$ baryonic pair decay, with or without an associated $η^\\prime/γ$. We close with the possible spectacular signal of $B\\to J/ψDπ$ as a flabbergasting new trick from nonperturbative QCD: intrinsic charm of $B$. △ Less", "We investigate the constraints on the flavour violating parameters from the decay B --> X_s gamma, taking into account the interplay of the various sources of flavour violation in the unconstrained MSSM. We present a systematic leading logarithmic QCD analysis of these model-independent constraints, including contributions from gluinos, neutralinos, charginos, charged Higgs bosons and interferences between them. We show that two simple combinations of elements of the down squark mass matrix are stringently bounded over large parts of the parameter space where only weak assumptions on the hierarchical structure of the squark mass matrices are made. We also briefly analyse up to which values SUSY contributions, compatible with B --> X_s gamma, can enhance the Wilson coefficient C_8(m_W), which plays an important role in the phenomenology of charmless hadronic B decays. △ Less", "Within low scale theories traditional see-saw and scalar triplet mechanisms, for neutrino mass suppression, do not work out anymore and for realistic model building some new ideas are needed. In this paper we suggest mechanism, different from existing ones, which provides natural suppression of the neutrino masses. The mechanism is realized through extended scalars of 4, 5 or 6 dimensional $SU(2)_L$ multiplets. Scenario, with fundamental mass scale $M_f$ in a $\\sim 10^{3}$ TeV range, requires 4-plets guaranteeing neutrino masses $\\stackrel{<}{\\sim}1$ eV. For theories with $M_f= few \\cdot 10$ TeV 5-plets should be involved, while in scenarios with $M_f=$ few TeV, 6-plets could be efficient. The considered mechanism could be successfully applied also for supersymmetric theories, building scenarios with various values of low $M_f$. Within considered models we also address the question of gauge coupling unification. For low scale unification, existence of compact extra dimensions turns out to be crucial. Due to additional scalar multiplets, some new examples of unification are found for both - non SUSY and SUSY cases. Within non SUSY scenarios introduced $SU(2)_L$ scalars take advantage and are important for successful unification. △ Less", "In the world without an axion the smallness of $\\barθ$ may be achieved due to a spontaneously broken discrete left-right symmetry. We analyze the radiatively induced \\barθin the context of generic left-right symmetric SUSY models without assuming flavor degeneracy in the squark sector. Left-right symmetry allows to keep \\barθwithin its present bound only if the inter-generational mass splitting in the squark sector at the scale of the left-right symmetry breaking is smaller than 0.5%. We also consider the naturalness of m_u=0 solution to the strong CP problem in the context of horizontal flavor symmetries. A strong bound on the combination of the horizontal charges in the Up quark sector is found in this case. △ Less", "We propose a new solution to the strong CP problem based on supersymmetric non-renormalization theorems. CP is broken spontaneously and it's breaking is communicated to the MSSM by radiative corrections. The strong CP phase is protected by a susy non-renormalization theorem and remains exactly zero while loops can generate a large CKM phase from wave function renormalization. We present a concrete model as an example but stress that our framework is general. We also discuss constraints on susy breaking and point out experimental signatures. △ Less", "We show that large ($> 100$ GeV) mass splittings between the charged Higgs boson ($H^\\pm$) and the neutral Higgs bosons ($H^0$ and $A^0$) are possible in the Minimal Supersymmetric Standard Model (MSSM). Such splittings occur when the $μ$ parameter is considerably larger than the common SUSY scale, $M_{SUSY}$, and have significant consequences for MSSM Higgs searches at future colliders. △ Less", "Nowadays in the MSSM the moderate values of $\\tanβ$ are almost excluded by LEP II lower bound on the lightest Higgs boson mass. In the Next-to-Minimal Supersymmetric Standard Model the theoretical upper bound on it increases and reaches maximal value in the strong Yukawa coupling limit when all solutions of renormalization group equations are concentrated near the quasi-fixed point. For calculation of Higgs boson spectrum the perturbation theory method can be applied. We investigate the particle spectrum in the framework of the modified NMSSM which leads to the self-consistent solution in the strong Yukawa coupling limit. This model allows one to get $m_h\\sim 125$ GeV at values of $\\tanβ\\ge 1.9$. In the investigated model the lightest Higgs boson mass does not exceed $130.5\\pm 3.5$ GeV. The upper bound on the lightest CP-even Higgs boson mass in more complicated supersymmetric models is also discussed. △ Less", "We present an example of SUSY SU(6) GUT, which predicts an excellent value for $\\al_s(M_Z)(\\simeq 0.119)$, in comparison with the value $\\al_s^0(M_Z)\\simeq 0.126$ of minimal SUSY SU(5). A crucial role is played by the vectorlike multiplets from the matter sector, whose masses lie below the GUT scale. For a realistic pattern of fermion masses, the adjoint scalar of SU(6) has VEV along the $SU(4)\\times SU(2)\\times U(1)$ direction. This also offers a natural resolution of the doublet-triplet (DT) splitting through the pseudo Goldstone Boson mechanism. △ Less", "Neutrino oscillation signals at muon storage rings (MSR) can be mimicked by Supersymmetric (SUSY) interactions in an R-parity violating scenario. We have investigated the $τ$-appearance signals for both long-baseline and near-site experiments, and concluded that the latter is of great use in distinguishing between oscillation and SUSY effects. On the other hand, SUSY can cause a manifold increase in the event rate for wrong-sign muons at a long-baseline setting, thereby providing us with signatures of new physics. △ Less", "A discrete R-symmetry often appears as an exact gauge symmetry in the low energy effective theory of superstring theories. We search for such discrete R-symmetries from a phenomenological point of view and find that Z_{9R} and Z_{18R} are candidates of the nonanomalous R-symmetry in the case of the minimal supersymmetric standard model. We also find Z_{4R} and Z_{20R} in the case that quarks and leptons are embedded in the SU(5) GUT multiplets. Interesting is that in the latter case all the solutions predict some extra matter multiplets and we find that the simplest choice is to take a pair of {\\bf 5} and {\\bf 5}^* of SU(5)_{GUT} whose mass is of order the SUSY breaking scale \\sim 1 TeV. We emphasize that the presence of such extra matters is testable in future collider experiments. △ Less", "We study the direct detection rate for SUSY cold dark m atter (CDM) predicted by the minimal supersymmetric standard model with universal boundary conditions and large values for tanβ. The relic abundance of the lightest supersymmetric particle (LSP), assumed to be approximately a bino, is obtained by including its coannihilations with the next-to-lightest supersymmetric particle (NLSP), which is the lightest s-tau. We find detectable rates in the currently planned experiments for a sector of the parameter space consistent with the cosmological constraint on the LSP relic abundance and the ones imposed by b->s gamma and the Higgs searches. △ Less", "The detection of the theoretically expected dark matter is central to particle physics and cosmology. Current fashionable supersymmetric models provide a natural dark matter candidate which is the lightest supersymmetric particle (LSP). Such models combined with fairly well understood physics like the quark substructure of the nucleon and the nuclear structure (form factor and/or spin response function), permit the evaluation of the event rate for LSP-nucleus elastic scattering. The thus obtained event rates are, however, very low or even undetectable. So it is imperative to exploit the modulation effect, i.e. the dependence of the event rate on the earth's annual motion. Also it is useful to consider the directional rate, i.e its dependence on the direction of the recoiling nucleus. In this paper we study such a modulation effect both in non directional and directional experiments. We calculate both the differential and the total rates using both isothermal, symmetric as well as only axially asymmetric, and non isothermal, due to caustic rings, velocity distributions. We find that in the symmetric case the modulation amplitude is small. The same is true for the case of caustic rings. The inclusion of asymmetry, with a realistic enhanced velocity dispersion in the galactocentric direction, yields an enhanced modulation effect, especially in directional experiments. △ Less", "The SUSY-QCD radiative corrections to the Γ(H+ -> t \\bar b) partial decay width are analyzed within the Minimal Supersymmetric Standard Model at the one-loop level, {\\mathcal O}(α_s), and in the decoupling limit. We present the analytical expressions of these corrections in the large SUSY masses limit and study the decoupling behaviour of these corrections in various limiting cases. We find that if the SUSY mass parameters are large and of the same order, the one loop SUSY-QCD corrections {\\it do not decouple}. The non-decoupling contribution is enhanced by \\tan βand therefore large corrections are expected in the large \\tan βlimit. In contrast, we also find that the SUSY-QCD corrections decouple if the masses of either the squarks or the gluinos are separately taken large. △ Less", "A brief review is given of $a_μ=(g_μ-2)/2$ as a probe of supersymmetry and of extra dimensions. It is known since the early to mid nineteen eightees that the supersymmetric electro-weak correction to $a_μ$ can be as large or larger than the Standard Model electro-weak correction and thus any experiment that proposes to test the Standard Model electro-weak correction will also test the supersymmetric correction and constrain supersymmetric models. The new physics effect seen in the Brookhaven (BNL) experiment is consistent with these early expectations. Detailed analyses within the well motivated supergravity unified model show that the size of the observed difference ($a_μ^{exp}-a_μ^{SM}$) seen at Brookhaven implies upper limits on sparticle masses in a mass range accessible to the direct observation of these particles at the Large Hadron Collider. Further, analyses also show that the BNL data is favorable for the detection of supersymmeteric dark matter in direct dark matter searches. The effect of large extra dimensions on $a_μ$ is also discussed. It is shown that with the current limits on the size of extra dimensions, which imply that the inverse size of such dimensions lies in the TeV region, their effects on $a_μ$ relative to the supersymmetric contribution is small and thus extra dimensions do not produce a serious background to the supersymmetric contribution. It is concluded that the analysis of the additional data currently underway at Brookhaven as well as a reduction of the hadronic error will help pin down the scale of weak scale supersymmetry even more precisely. △ Less", "We investigate the prospects for heavy charged Higgs boson production through the mechanisms pp-bar(pp)->tbH+ +X at the upgraded Fermilab Tevatron and at the upcoming LHC collider at CERN respectively. We focus on the MSSM case at high values of tan[beta]> m_top/m_bot and include the leading SUSY quantum corrections. A detailed study is performed for all important production modes and basic background processes for the \"ttbb\" signature. At the upgraded Tevatron a charged Higgs signal is potentially viable in the 220-250 GeV range or excluded at 95%CL up to 300 GeV. At the LHC, a H+ of mass up to 800 GeV can be discovered at 5 sigma or else be excluded up to a mass of ~ 1.5 TeV. The presence ofSUSY quantum effects may highly influence the discovery potential in both machines and can typically shift these limits by 200 GeV at the LHC. △ Less", "Recently it was shown, within the mass insertion approximation (MIA), that the gluino mediated flavor changing neutral current (FCNC) interactions can saturate both epsilon_K and Re(epsilon'/epsilon_K) even for the real Cabibbo-Kobayashi-Maskawa (CKM) matrix through a single CP violating parameter (delta^d_12)_LL. In this work, we extend our previous analysis to the nonvanishing KM phase, and to the effective SUSY model where the MIA is no longer a good approximation. In our model, epsilon_K and B0 - B0 bar mixing can receive significant SUSY contributions. Therefore the usual constraints on rho and eta in the Wolfenstein parametrization of the CKM matrix can be relaxed except for the |V_ub/V_cb| from the semileptonic b -> u transition. This affects K -> pi nu nu bar and K_L -> mu+ mu- indirectly, even if they are not directly induced by gluino-mediated FCNC, while K_L -> pi0 e+ e- is influenced both directly and indirectly. Differences between our model and other SUSY models enhancing Re(epsilon'/epsilon_K) are discussed in detail. △ Less", "We discuss the lepton sector of a realistic string-inspired model based on the Pati-Salam $SU(4)\\times SU(2)_L \\times SU(2)_R$ gauge group supplemented by a U(1) family symmetry. The model involves third family Yukawa unification, predicts large $\\tan β\\sim 50$, and describes all fermion masses and mixing angles, including approximate bi-maximal mixing in the neutrino sector. Atmospheric neutrino mixing is achieved via a large 23 entry in the neutrino Yukawa matrix which can have important phenomenological effects. We find that the recent BNL result on the muon ($g-2$) can be easily accommodated in a large portion of the SUSY parameter space of this model. Over this region of parameter space the model predicts a CP-even Higgs mass near 115 GeV, and a rate for $τ\\to μγ$ which is close to its current experimental limit. △ Less", "We investigate the implications of the recent measurement of muon anomalous magnetic moment for the direct detection of neutralino dark matter in the three different SUSY models: mSUGRA, a model with non-universal Higgs mass, and an SO(10) GUT model. We consider two extreme scenario for $Δa_μ$ bound, i.e. $27 \\times 10^{-10} < Δa_μ< 59 \\times 10^{-10}$ (1$σ$ bound) and $0 < Δa_μ< 11 \\times 10^{-10}$ ($2σ$ below). In mSUGRA model, the counting ratio may be above the sensitivity of the future experiments when parameters are within $1σ$ bound of $Δa_μ$. However, the $Ω_χ$ tends to be high compared to the currently favored value $Ω=0.3$. For models with the non-universal scalar masses, the possibility to have the consistent $Ω_χ$ and the high counting ratio is open up in the region of parameter space where Higgsino mass $μ$ is smaller than mSUGRA prediction. In particular, in the SO(10) model, the LSP dark matter detection rate may be enhanced by almost one order of magnitude compared to mSUGRA and the model with non-universal Higgs mass, for cosmologically acceptable $Ω_χ h^2$. The highest detection rate of LSP dark matter occurs in the region where the LSP constitutes a subdominant part of local halo DM. Implication of SUSY mass parameter measurement under the cosmological constraint is also discussed. △ Less", "We consider the process of top-antitop production from electron-positron annihilation, for c. m. energies in the few TeV regime, in the MSSM theoretical framework. We show that, at the one loop level, the \\underline{slopes} of a number of observable quantities in an energy region around 3 TeV are only dependent on $\\tanβ$. Under optimal experimental conditions, a combined measurement of slopes might identify $\\tanβ$ values in a range $\\tanβ< 2$, $\\tanβ>20$ with acceptable precision. △ Less", "We compute the leading logarithms electroweak contributions to gamma gamma to f f(bar) processes in SM and MSSM. Several interesting properties are pointed out, such as the importance of the angular dependent terms, of the Yukawa terms, and especially of the $\\tan^2β$ dependence in the SUSY contributions. These properties are complementary to those found in e+e- to f f(bar). These radiative correction effects should be largely observable at future high energy gamma gamma colliders. Polarized beams would bring interesting checks of the structure of the one loop corrections. We finally discuss the need for two-loop calculations and resummation. △ Less", "We remark that the precision of recent determinations of $α_s(M^2_Z)$ is such that one can get bounds on supersymmetric partner masses (squark and gluino) by requiring consistency of determinations of $α_s$ at \"low\" energies, where those particles do not contribute, and on the $Z$ peak. For approximately degenerate squarks and gluinos with mass $\\widetilde{m}$, we find the bound $\\widetilde{m}\\geq 173$ GeV, at the $2σ$ level. At the $2.5σ$ level, $\\widetilde{m}\\geq 121$ GeV. △ Less", "We briefly review the present status of Affleck-Dine baryo/leptogenesis scenarios in the minimal supersymmetric standard model (MSSM) in the context of the gravity-mediated SUSY breaking, and show that there is a serious cosmological problem in the Affleck-Dine mechanism. That is, the late decay of the associated large Q-balls leads to the over production of the lightest supersymmetric particles. Then, we point out that the minimal extension of the MSSM by introducing a gauged $U(1)_{B-L}$ symmetry naturally solves this problem. Here, the breaking scale of the $U(1)_{B-L}$ can be determined quite independently of the reheating temperature from the required baryon asymmetry. It is extremely interesting that the obtained scale of the $U(1)_{B-L}$ breaking is well consistent with the one suggested from the seesaw mechanism to explain the recent neutrino-oscillation experiments. We consider that the present scenario provides a new determination of the $U(1)_{B-L}$ breaking scale fully independent of the neutrino masses. We also comment on viability of the present scenario in anomaly-mediated SUSY breaking models. △ Less", "We examine the possibility of observing exotic top quark decays via $R$-Parity violating SUSY interactions in $e^+e^-$ collisions at $\\sqrt{s = 500 GeV$. We present cross-sections for $t\\bar t$ production followed by the subsequent decay of either the $t$ or $\\overline{t}$ via the $R$-Parity violating interaction while the other undergoes the SM decay. We discuss kinematic cuts that allow the exotic SUSY decays to be detected over standard model backgrounds. Discovery limits for $R$-Parity violating couplings in the top sector are presented assuming an integrated luminosity of $100 fb^{-1}$. △ Less", "We analyze the supersymmetric contributions to the anomalous magnetic moment of the muon (a_μ) in the framework of pure and gaugino-assisted anomaly mediation models, and gaugino mediation models. In the last two models the gauge multiplets propagate in the higher dimensional bulk, providing a natural mechanism for solving the problem of negative squared slepton masses present in the pure anomaly mediation models. In the light of the new BNL results for a_μ, we found that the pure and gaugino-assisted anomaly mediation models are almost excluded by the BNL constraints at 2σlevel when combined with CLEO constraints on b->sg at 90 % of C.L. In contrast, the gaugino mediation models provide extensive regions in the SUSY parameter space where both of these constraints are satisfied. △ Less", "I report our recent works on the effects of % flavor conserving CP violating phases in SUSY models on B and K phenomenology. △ Less", "We study the contribution of a generic charged Higgs $(H^+)$ to the muon anomalous magnetic moment $a_μ$ with the SUSY soft breaking parameters. We find out that the deviation between the experimental data and the predicted SM value on $a_μ$ can be explained by the two-loop charged Higgs diagrams even with $m_{H^+}\\sim 400 GeV$. △ Less", "Motivated by the large mixing angle solutions for the atmospheric and solar neutrino anomalies, flavor changing neutral current processes and lepton flavor violating processes as well as the muon anomalous magnetic moment are analyzed in the framework of SU(5) SUSY GUT with right-handed neutrino. In order to explain realistic mass relations for quarks and leptons, we take into account effects of higher dimensional operators above the GUT scale. It is shown that the supersymmetric (SUSY) contributions to the CP violation parameter in $K^0-\\bar{K}^0$ mixing, $ε_K$, the $μ\\to e γ$ branching ratio, and the muon anomalous magnetic moment become large in a wide range of parameter space. We also investigate correlations among these quantities. Within the current experimental bound of $\\text{B}(μ\\to e γ)$, large SUSY contributions are possible either in the muon anomalous magnetic moment or in $ε_K$. In the former case, the favorable value of the recent muon anomalous magnetic moment measurement at the BNL E821 experiment can be accommodated. In the latter case, the allowed region of the Kobayashi-Maskawa phase can be different from the prediction within the Standard Model (SM) and therefore the measurements of the CP asymmetry of $B\\to J/ψK_S$ mode and $Δm_{B_s}$ could discriminate this case from the SM. We also show that the $τ\\to μγ$ branching ratio can be close to the current experimental upperbound and the mixing induced CP asymmetry of the radiative B decay can be enhanced in the case where the neutrino parameters correspond to the Mikheyev-Smirnov-Wolfenstein small mixing angle solution. △ Less", "We comment on the presence of power-like divergences in Kaluza-Klein theories with supersymmetry breaking a là Scherk-Schwarz. By introducing a SUSY preserving regulator, we show that, in the context of a recently model proposed by Barbieri, Hall and Nomura, the Higgs mass is finite and unambiguously defined. The same result applies to similar models. △ Less", "Recent results from Belle and BaBar Collaborations hint at a small $\\sin2φ_1$, while the measured $B\\toππ$ rate also seems to be on the low side. Supersymmetric (SUSY) models with down squark mixings can account for the deficits in both cases. By studying the origin of SUSY contributions that could impact on $B^0_d$--$\\bar B^0_d$ mixing and $B\\toππ$ decay, we find that the former would most likely arise from left-left or right-right squark mixings, while the latter would come from left-right squark mixings. These two processes in general are not much correlated in the Minimum Supersymmetric Standard Model. If the smallness of $B\\toππ$ is due to SUSY models, one would likely have large $B\\toργ$ from chiral enhancement, and the rate could be within present experimental reach. Even if $B\\toργ$ is not greatly enhanced, it could have large mixing dependent CP violation. △ Less", "We perform a comprehensive analysis of the decays of charginos and neutralinos in the Minimal Supersymmetric Standard Model where the neutralino $χ_1^0$ is assumed to be the lightest supersymmetric particle. We focus, in particular, on the three-body decays of the next-to-lightest neutralino and the lightest chargino into the lightest neutralino and fermion-antifermion pairs and include vector boson, Higgs boson and sfermion exchange diagrams, where in the latter contribution the full mixing in the third generation is included. The radiative corrections to the heavy fermion and SUSY particle masses will be also taken into account. We present complete analytical formulae for the Dalitz densities and the integrated partial decay widths in the massless fermion case, as well as the expressions of the differential decay widths including the masses of the final fermions and the polarization of the decaying charginos and neutralinos. We then discuss these decay modes, in particular in scenarios where the parameter $\\tan β$ is large and in models without universal gaugino masses at the Grand Unification scale where some new decay channels, such as decays into gluinos and $q\\bar{q}$ pairs, open up. △ Less", "Combining the cosmological requirement on dark matter with the recent BNL g-2 measurement it is argued that, within the mSUGRA framework, the preferred region for SUSY mass parameters falls well inside the area covered by the future linear colliders under consideration for right handed sleptons and of the 2 lightest neutralinos. The coverage for the lightest chargino and left handed sleptons is also favoured but with smaller confidence. △ Less", "The see-saw mechanism is a very attractive explanation for small neutrino masses, parametrized at the GUT scale by the right-handed Majorana mass matrix, ${\\cal M}$, and the neutrino Yukawa matrix, ${\\bf Y_ν}$. We show that in a SUSY model with universal soft terms, ${\\cal M}$ and ${\\bf Y_ν}$ can be calculated from the light neutrino masses, the MNS matrix, and ${\\bf Y^{\\dagger}_ν} {\\bf Y_ν}$, which enters into the left-handed slepton radiative corrections. This suggests that in principle the GUT-scale inputs of the seesaw could be reconstructed from the neutrino and sneutrino mass matrices. We briefly discuss why this is impractical, but advocate the neutrino and sneutrino mass matrices as an alternative bottom-up parametrization of the seesaw. △ Less", "We report on a global CKM matrix analysis taking into account most recent experimental and theoretical results. The statistical framework (Rfit) developed in this paper advocates formal frequentist statistics. Other approaches, such as Bayesian statistics or the 95% CL scan method are also discussed. We emphasize the distinction of a model testing and a model dependent, metrological phase in which the various parameters of the theory are determined. Measurements and theoretical parameters entering the global fit are thoroughly discussed, in particular with respect to their theoretical uncertainties. Graphical results for confidence levels are drawn in various one and two-dimensional parameter spaces. Numerical results are provided for all relevant CKM parameterizations, the CKM elements and theoretical input parameters. Predictions for branching ratios of rare K and B meson decays are obtained. A simple, predictive SUSY extension of the Standard Model is discussed. △ Less", "Double beta decay is indispensable to solve the question of the neutrino mass matrix together with $ν$ oscillation experiments. The most sensitive experiment since eight years - the Heidelberg-Moscow experiment in Gran-Sasso - already now, with the experimental limit of < m_ν> < 0.26 eV excludes degenerate $ν$ mass scenarios allowing neutrinos as hot dark matter in the universe for the small angle MSW solution of the solar neutrino problem. It probes cosmological models including hot dark matter already now on the level of future satellite experiments MAP and PLANCK. It further probes many topics of beyond Standard Model physics at the TeV scale. Future experiments should give access to the multi-TeV range and complement on many ways the search for new physics at future colliders like LHC and NLC. For neutrino physics GENIUS will allow to test almost all neutrino mass scenarios allowed by the present neutrino oscillation experiments. At the same time GENIUS will cover a wide range of the parameter space of predictions of SUSY for neutralinos as cold dark matter. Further it has the potential to be a real-time detector for low-energy (pp and 7Be) solar neutrinos. A GENIUS Test Facility has just been funded and will come into operation by end of 2001. △ Less", "CP violation plays a privileged role in our quest for new physics beyond the electroweak standard model (SM). In the SM the violation of CP in the weak interactions has a single source: the phase of the quark mixing matrix (the CKM matrix, for Cabibbo-Kobayashi-Maskawa). Most extensions of the SM exhibit new sources of CP violation. For instance, the truly minimal supersymmetric extension of the SM (CMSSM) has two new phases in addition to the CKM phase. Given that CP violation is so tiny in the kaon system, is still largely unexplored in B physics and is negligibly small in the electric dipole moments, it is clear that new physics may have a good chance to manifest some departure from the SM in this particularly challenging class of rare phenomena. On the other hand, it is also apparent that CP violation generally represents a major constraint on any attempt at model building beyond the SM. In this review we tackle these two sides of the relation between CP violation and new physics. Our focus will be on the potentialities to use CP violation as a probe on Supersymmetric (SUSY) extensions of the SM. We wish to clarify the extent to which such indirect signals for SUSY are linked to a fundamental theoretical issue: is there a relation between the mechanism that originates the whole flavor structure and the mechanism that is responsible for the breaking of supersymmetry? Different ways to answer this question lead to quite different expectations for CP violation in B physics. △ Less", "We study the implications on flavor changing neutral current and CP violating processes in the context of supersymmetric theories without a new flavor structure (flavor blind supersymmetry). The low energy parameters are determined by the running of the soft breaking terms from the grand unified scale with SUSY phases consistent with the EDM constraints. We find that the CP asymmetry in b --> s gamma can reach large values potentially measurable at B factories, especially in the low BR(b --> s gamma) region. We perform a fit of the unitarity triangle including all the relevant observables. In this case, no sizeable deviations from the SM expectations are found. Finally we analyze the SUSY contributions to the anomalous magnetic moment of the muon pointing out its impact on the b --> s gamma CP asymmetry and on the SUSY spectrum including chargino and stop masses. △ Less", "The recent measurement of a_μ=\\frac{g_μ-2}{2} by the E821 Collaboration at Brookhaven deviates from the quoted Standard Model (SM) central value prediction by 2.6σ. The difference between SM theory and experiment may be easily accounted for in a variety of particle physics models employing weak scale supersymmetry (SUSY). Other supersymmetric models are distinctly disfavored. We evaluate a_μfor various supersymmetric models, including minimal supergravity (mSUGRA), Yukawa unified SO(10) SUSY GUTs, models with inverted mass hierarchies (IMH), models with non-universal gaugino masses, gauge mediated SUSY breaking models (GMSB), anomaly-mediated SUSY breaking models (AMSB) and models with gaugino mediated SUSY breaking (inoMSB). Models with Yukawa coupling unification or multi-TeV first and second generation scalars are disfavored by the a_μmeasurement. △ Less", "We consider the muon anomalous magnetic moment $a_μ$ in the string models with dilaton domination with two different string scales : the usual GUT scale and the intermediate scale. After imposing the direct search limits on the lightest neutral Higgs and SUSY particle masses and the lightest neutralino LSP, the $a_μ^{\\rm SUSY}$ is predicted to be less than $65 (55) \\times 10^{-10}$ for $M_{string} = 2 \\times 10^{16}$ GeV ($3 \\times 10^{11}$ GeV). If we further impose the $B\\to X_s γ$ branching ratio, the predicted $a_μ^{\\rm SUSY}$ becomes lower to $35 \\times 10^{-10}$ for intermediate string scale. The resulting LSP - proton scattering cross section is less than $\\sim 10^{-7}$ pb, which is below the sensitivity of the current direct dark matter search experiments, but could be covered by future experiments. △ Less", "If Ultra High Energy Cosmic Rays (UHECRs) with E>4 10^{19} eV originate from BL Lacertae at cosmological distances as suggested by recent studies, the absence of the GZK cutoff can not be reconciled with Standard-Model particle properties. Axions would escape the GZK cutoff, but even the coherent conversion and back-conversion between photons and axions in large-scale magnetic fields is not enough to produce the required flux. However, one may construct models of other novel (pseudo)scalar neutral particles with properties that would allow for sufficient rates of particle production in the source and shower production in the atmosphere to explain the observations. As an explicit example for such particles we consider SUSY models with light sgoldstinos. △ Less", "For some choices of soft SUSY--breaking parameters, the LSP is a stable neutralino, the NLSP is a chargino almost degenerate in mass with the LSP (with mass difference $\\sim m_π-$few GeV), and all other sparticles are relatively heavy. We discuss the potential of a $\\sqrt{s}\\sim 600\\gev$ $e^+e^-$ collider for studying such models. △ Less", "We investigate the effect of supersymmetric CP violating phases on the inclusive decay B\\to X_dγ. Although such a decay contains a large background from B\\to X_sγ, if isolated it may exhibit sizeable CP violation, both in the Standard Model (SM) and in the context of models beyond the SM. With unconstrained supersymmetric CP violating phases we show that the direct CP asymmetry (A_CP) lies in the region -40% \\le A_CP \\le 40%, where a positive asymmetry would constitute a clear signal of physics beyond the SM. Even if a direct measurement of B\\to X_dγproves too dif ficult experimentally, its asymmetry contributes non-negligibly to the measurements of A_CP for B\\to X_sγ, and thus should be included in future analyses. We show t hat there may be both constructive and destructive interference between A^dγ_CP and A^sγ_CP. △ Less", "If neutrino masses and mixings are suitable to explain the atmospheric and solar neutrino fluxes, this amounts to contributions to FCNC processes, in particular mu --> e, gamma. If the theory is supersymmetric and the origin of the masses is a see-saw mechanism, we show that the prediction for BR(mu --> e, gamma) is in general larger than the experimental upper bound, especially if the largest Yukawa coupling is O(1) and the solar data are explained by a large angle MSW effect, which recent analyses suggest as the preferred scenario. Our analysis is bottom-up and completely general, i.e. it is based just on observable low-energy data. The work generalizes previous results of the literature, identifying the dominant contributions. Application of the results to scenarios with approximate top-neutrino unification, like SO(10) models, rules out most of them unless the leptonic Yukawa matrices satisfy very precise requirements. Other possible ways-out, like gauge mediated SUSY breaking, are also discussed. △ Less", "Motivated by the recently measured muon's anomalous magnetic moment $a_μ$, we examine the supersymmetry contribution to $a_μ$ in various mediation models of supersymmetry breaking which lead to predictive flavor conserving soft parameters at high energy scale. The studied models include dilaton/modulus-mediated models in heterotic string/$M$ theory, gauge-mediated model, no-scale or gaugino-mediated model, and also the minimal and deflected anomaly-mediated models. For each model, the range of $a^{SUSY}_μ$ allowed by other experimental constraints, e.g. b --> sγand the collider bounds on superparticle masses, is obtained together with the corresponding parameter region of the model. Gauge-mediated models with low messenger scale can give any $a^{SUSY}_μ$ within the $2σ$ bound. In many other models, b --> sγfavors $a^{SUSY}_μ$ smaller than either the $-1σ$ value ($26\\times 10^{-10}$) or the central value ($42\\times 10^{-10}$). △ Less", "Assuming that the scale of new physics exceeds the weak scale, we have considered all possible origins of deviations from the Standard Model in $\\gmu2$. If the underlying theory can be treated perturbatively, then to account for an effect as large as has been recently reported\\cite{BNL}, the only possibilities would be models that contain particles that yield direct contributions, of which SUSY models are prototypical, or models having unexpectedly light leptoquarks or having a rather exotic heavy vector boson that couples predominantly to muons. Other possibilities either are already excluded by existing experimental results or would have to be unnaturally large. If, on the contrary, the underlying new physics involves strong interactions, as in technicolor models, then the discrepancy could be accounted for by a variety of effective operators. △ Less", "We study soft SUSY breaking parameters in the Nelson-Strassler type of models: SUSY standard models coupled with SCFTs. In this type of models, soft SUSY breaking parameters including sfermion masses can be suppressed around the decoupling scale of SCFTs. We clarify the condition to derive exponential suppression of sfermion masses within the framework of pure SCFTs. Such behavior is favorable for degeneracy of sfermion masses. However, the realistic sfermion masses are not quite degenerate due to the gauge couplings and the gaugino masses in the SM sector. We show the sfermion mass spectrum obtained in such models. The aspect of suppression for the soft SUSY breaking parameters is also demonstrated in an explicit model. We also give a mechanism generating the $μ$-term of the Electro-Weak scale by a singlet field coupled with the SCFT. △ Less", "Low-energy effective M-theory (11d supergravity or 11d SUSY theory) is considered in 11d flat or AdS background. After orbifold compactification of eleventh dimension one gets flat 10d brane at non-zero temperature. Quantum effective potential (free energy at low-temperature approximation) is calculated on such brane with account of only lowest mass from Kaluza-Klein modes. Such effective potential may stabilize the radius of 11th dimension (radion stabilization) as it is demonstrated explicitly. △ Less", "We examine the recently observed deviation of the muon g - 2 from the Standard Model prediction within the framework of gravity mediated SUGRA models with R parity invariance. Universal soft breaking (mSUGRA) models, and models with non-universal Higgs and third generation squark/slepton masses at M_G are considered. All relic density constraints from stau-neutralino co-annihilation and large \\tanβNLO corrections for b \\to sγdecay are included, and we consider two possibilities for the light Higgs: m_h > 114 GeV and m_h > 120 GeV. The combined m_h, b \\to sγand a_μ bounds give rise to lower bounds on \\tanβand m_{1/2}, while the lower bound on a_μ gives rise to an upper bounds on m_{1/2}. These bounds are sensitive to A_0, e.g. for m_h > 114 GeV, the 95% C.L. is \\tanβ> 7(5) for A_0 = 0(-4m_{1/2}), and for m_h > 120 GeV, \\tanβ> 15(10). The positive sign of the a_μ deviation implies μ> 0, eliminating the extreme cancellations in the dark matter neutralino-proton detection cross section so that almost all the SUSY parameter space should be accessible to future planned detectors. Most of the allowed parts of parameter space occur in the co-annihilation region where m_0 is strongly correlated with m_{1/2}. The lower bound on a_μ then greatly reduces the allowed parameter space. Thus using 90% C. L. bounds on a_μ we find for A_0 = 0 that \\tanβ\\geq 10 and for \\tanβ\\leq 40 that m_{1/2} = (290 - 550) GeV and m_0 = (70 - 300) GeV. Then the tri-lepton signal and other SUSY signals would be beyond the Tevatron Run II (except for the light Higgs), only the \\tildeτ_1 and h and (and for part of the parameter space) the \\tilde{e}_1 will be accessible to a 500 GeV NLC, while the LHC would be able to see the full SUSY mass spectrum. △ Less", "We use the recently derived CP phase dependent analytic results for the supersymmetric electro-weak correction to $g_μ-2$ to constrain the explicit CP phases in softly broken supersymmetry using the new physics effect seen in the g-2 Brookhaven measurement. It is shown that the BNL data strongly constrains the CP violating phase $θ_μ$ (the phase of the Higgs mixing parameter $μ$) and $ξ_2$ (the phase of the SU(2) gaugino mass $\\tilde m_2$) and as much as 60-90% of the region in the $ξ_2-θ_μ$ plane is eliminated over a significant region of the MSSM parameter space by the BNL constraint. The region of CP phases not excluded by the BNL experiment allows for large phases and for a satisfaction of the EDM constraints via the cancellation mechanism. We find several models with large CP violation which satisfy the EDM constraint via the cancellation mechanism and produce an $a_μ^{SUSY}$ consistent with the new physics signal seen by the Brookhaven experiment. The sparticle spectrum of these models lies within reach of the planned accelerator experiments. △ Less", "Double beta decay is indispensable to solve the question of the neutrino mass matrix together with $ν$ oscillation experiments. The most sensitive experiment since eight years - the Heidelberg-Moscow experiment in Gran-Sasso - already now, with the experimental limit of $<m_ν> < 0.26$ eV excludes degenerate $ν$ mass scenarios allowing neutrinos as hot dark matter in the universe for the small angle MSW solution of the solar neutrino problem. It probes cosmological models including hot dark matter already now on the level of future satellite experiments MAP and PLANCK. It further probes many topics of beyond Standard Model physics at the TeV scale. Future experiments should give access to the multi-TeV range and complement on many ways the search for new physics at future colliders like LHC and NLC. For neutrino physics some of them (GENIUS) will allow to test almost all neutrino mass scenarios allowed by the present neutrino oscillation experiments. At the same time GENIUS will cover a wide range of the parameter space of predictions of SUSY for neutralinos as cold dark matter. Further it has the potential to be a real-time detector for low-energy ($pp$ and $^7$Be) solar neutrinos. A GENIUS Test Facility has just been funded and will come into operation by end of 2001. △ Less", "In the light of the recent muon (g_mu-2) result by the E821 experiment at the Brookhaven National Laboratory, we study the event rates of the charged lepton-flavour-violating (LFV) processes in the supersymmetric standard model (SUSY SM) with the heavy right-handed neutrinos (SUSY see-saw model). Since the left-handed sleptons get the LFV masses via the neutrino Yukawa interaction in this model, the event rate of mu->e gamma and the SUSY-SM correction to (g_mu-2)/2 (δa_mu^{SUSY}) are strongly correlated. When the left-handed sleptons have a LFV mass between the first and second generations ((m^2_L)_{12}) in the mass matrix, it should be suppressed by \\sim 10^{-3} ({10^-9}/δa_mu^{SUSY}) compared with the diagonal components (m_{SUSY}^2), from the current experimental bound on mu-> e gamma. The recent (g_mu-2) result indicates {δa_mu^{SUSY}}\\sim 10^{-9}. The future charged LFV experiments could cover (m^2_L)_{12}/m_{SUSY}^2\\gsim 10^{-(5-6)}. These experiments will give a significant impact on the flavour models and the SUSY-breaking models. In the SUSY see-saw model (m^2_L)_{12} is proportional to square of the tau-neutrino Yukawa-coupling constant. In the typical models where the neutrino-oscillation results are explained and the top-quark and tau-neutrino Yukawa couplings are unified at the GUT scale, a large LFV mass of (m^2_L)_{12}/m_{SUSY}^2\\gsim 10^{-4} is generated, and the large LFV event rates are predicted. We impose a so-called no-scale condition for the SUSY-breaking parameters at the GUT scale, which suppresses the FCNC processes, and derive the conservative lower bound on mu-> egamma. The predicted Br(mu-> e gamma) could be covered at the future LFV experiments. △ Less", "Effects of soft SUSY-breaking terms on inflation potentials are discussed. There exist generic constraints that must be satisfied in order not for the inflaton potential to loose its flatness. We examine explicitly the constraints in the case of a hybrid inflation model and find that the coupling constant λbetween the inflaton and the ``water-fall-direction'' field is bounded as 2.0 \\times 10^{-6} < λ. This is a highly non-trivial result. Indeed, if we adopt the severest constraint from avoiding the problem of the gravitinos produced non-thermally, λ< 7.4 \\times 10^{-6} is required, under a reasonable assumption on the reheating process. This means that the hybrid inflation model marginally has a viable parameter space. We also discuss analogous constraints on other inflation models. △ Less", "The GENIUS (\\underline {Ge}rmanium in Liquid \\underline {Ni}trogen \\underline {U}nderground \\underline {S}etup) project has been proposed in 1997 \\cite{KK-BEY97} as first third generation double beta decay project, with a sensitivity aiming down to a level of an effective neutrino mass of $<m>\\sim$ 0.01 - 0.001 eV. Such sensitivity has been shown to be indispensable to solve the question of the structure of the neutrino mass matrix which cannot be solved by neutrino oscillation experiments alone \\cite{KKPS}. It will allow broad access also to many other topics of physics beyond the Standard Model of particle physics at the multi-TeV scale. For search of cold dark matter GENIUS will cover almost the full range of the parameter space of predictions of SUSY for neutralinos as dark matter \\cite{KK-Ram,Bed-KK2}. Finally, GENIUS has the potential to be the first real-time detector for low-energy (pp and $^7{Be}$) solar neutrinos \\cite{Bau-KK,KKPropos99}. A GENIUS-Test Facility has just been funded and will come into operation by end of 2001. △ Less", "Recently, the E821 experiment at the Brookhaven National Laboratory announced their latest result of their muon g-2 measurement which is about 2.6-σaway from the standard model prediction. Taking this result seriously, we examine the possibility to explain this discrepancy by the supersymmetric contribution. Our analysis is performed in the framework of the unconstrained supersymmetric standard model which has free seven parameters relevant to muon g-2. We found that, in the case of large \\tanβ, sparticle masses are allowed to be large in the region where the SUSY contribution to the muon g-2 is large enough, and hence the conventional SUSY search may fail even at the LHC. On the contrary, to explain the discrepancy in the case of small \\tanβ, we found that (i) sleptons and SU(2)_L gauginos should be light, and (ii) negative search for the Higgs boson severely constrains the model in the framework of the mSUGRA and gauge-mediated model. △ Less", "After summarising very briefly the key features of different model predictions for sparticle masses and their relation with the supersymmetry (SUSY) breaking scales and parameters, I discuss the capabilities of an $e^+ e^-$ Linear Collider (LC) with $\\sqrt{s} \\geq$ 500 GeV for precision measurements of sparticle properties. Then I focus on the lessons one can learn about the scale and mechanism of SUSY breaking from these measurements and point out how LC can crucially complement and extend the achievements of the LHC. I end by mentioning what would be the desired extensions in the type/energy of the colliding particles and their luminosity from the point of view of SUSY investigations. △ Less", "We investigate squark and gluino pair production at LHC (CMS) with subsequent decays into quarks, leptons and LSP in models with effective supersymmetry where third generation of squarks is relatively light while the first two generations of squarks are heavy. We consider the general case of nonuniversal gaugino masses. Visibility of signal by an excess over SM background in (n \\geq 2)jets + (m \\geq 0)leptons + E^{miss}_T events depends rather strongly on the relation between LSP, second neutralino, gluino and squark masses and it decreases with the increase of LSP mass. We find that for relatively heavy gluino it is very difficult to detect SUSY signal even for light 3^{rd} generation squarks (m_{\\tilde q_3}\\le 1 TeV) if the LSP mass is closed to the 3^{rd} generation squark mass. △ Less", "We study the supersymmetric (SUSY) QCD radiative corrections, at the one-loop level, to $h^0$, $H^{\\pm}$ and t quark decays, in the context of the Minimal Supersymmetric Standard Model (MSSM) and in the decoupling limit. The decoupling behaviour of the various MSSM sectors is analyzed in some special cases, where some or all of the SUSY mass parameters become large as compared to the electroweak scale. We show that in the decoupling limit of both large SUSY mass parameters and large CP-odd Higgs mass, the $Γ(h^0\\to b \\bar b)$ decay width approaches its Standard Model value at one loop, with the onset of decoupling being delayed for large $\\tanβ$ values. However, this decoupling does not occur if just the SUSY mass parameters are taken large. A similar interesting non-decoupling behaviour, also enhanced by $\\tanβ$, is found in the SUSY-QCD corrections to the $Γ(H^+\\to t \\bar b)$ decay width at one loop. In contrast, the SUSY-QCD corrections in the $Γ(t\\to W^+ b)$ decay width do decouple and this decoupling is fast. △ Less", "Using a recursive algorithm to solve the renormalization group equations of N=1 QCD (DGLAP), we describe the most general supersymmetric evolution of the parton distributions. The analysis involves the regular DGLAP evolution, a partial supersymmetric intermediate evolution and a final supersymmetric evolution combined at various matching scales. We use a model in which supersymmetric distributions are radiatively generated at each susy threshold due to the mixing of the QCD anomalous dimensions with the N=1 sector. Various types of matching conditions are considered, reflecting partially broken and exact supersymmetric scenarios with a wide range of susy-breaking mass parameters. Numerical results for all the distributions are presented. △ Less", "New NLO b->sgamma calculations have become available using resummed radiative corrections. Using these calculations we perform a global fit of the supergravity inspired constrained minimal supersymmetric model (CMSSM). We find that the resummed calculations show similar constraints as the LO calculations, namely that only with a relatively heavy supersymmetric mass spectrum of the order of 1 TeV the b-τYukawa unification and the b->sgamma rate can coexist in the large tanb scenario. The resummed b->sgamma calculations are found to reduce the renormalization scale uncertainty considerably. The low tanb scenario is excluded by the present Higgs limits from LEP II. The constraint from the Higgs limit in the $m_0,m_{1/2}$ plane is severe, if the trilinear coupling A_0 at the GUT scale is fixed to zero, but is considerably reduced for $A_0\\le -2m_0$. The relatively heavy SUSY spectrum required by \\besg corresponds to a Higgs mass of $m_h=119\\pm 1~ (stop masses)}\\pm 2~(theory)~\\pm~3 (top mass) GeV $ in the CMSSM. △ Less", "A promising way to reconcile naturalness with a decoupling solution to the SUSY flavor and CP problems is suggested by models with a radiatively driven inverted mass hierarchy (RIMH). The RIMH models arise naturally within the context of SUSY SO(10) grand unified theories. In their original form, RIMH models suffer from two problems: 1.) obtaining the radiative breakdown of electroweak symmetry, and 2.) generating the correct masses for third generation fermions. The first problem can be solved by the introduction of SO(10) D-term contributions to scalar masses. We show that correct fermion masses can indeed be obtained, but at the cost of limiting the magnitude of the hierarchy that can be generated. We go on to compute predictions for the neutralino relic density as well as for the rate for the decay $b\\to sγ$, and show that these yield significant constraints on model parameter space. We show that only a tiny corner of model parameter space is accessible to Fermilab Tevatron searches, assuming an integrated luminosity of 25~$fb^{-1}$. We also quantify the reach of the CERN LHC collider for this class of models, and find values of $m_{\\tg}\\sim 1600$ GeV to be accessible assuming just 10 fb$^{-1}$ of integrated luminosity. In an Appendix, we list the two loop renormalization group equations for the MSSM plus right handed neutrino model that we have used in our analysis. △ Less", "QED, Hadronic, and Electroweak Standard Model contributions to the muon anomalous magnetic moment, a_mu = (g_mu-2)/2, and their theoretical uncertainties are scrutinized. The status and implications of the recently reported 2.6 sigma experiment vs.theory deviation a_mu^{exp}-a_mu^{SM} = 426(165) times 10^{-11} are discussed. Possible explanations due to supersymmetric loop effects with m_{SUSY} \\simeq 55 sqrt{tan beta} GeV, radiative mass mechanisms at the 1--2 TeV scale and other ``New Physics'' scenarios are examined. △ Less", "In this talk, I summarize a work done in collaboration with Otto Kong on the Zee neutrino mass model. We show that the MSSM with explicit R-parity violation actually contains the Zee model with the right-handed sleptons as the Zee singlet. We determine the conditions on the parameter space such that the neutrino mass matrix provides a viable texture that explains the atmospheric and solar data. △ Less", "Theoretical overview on phenomenology of Higgs boson and SUSY Higgs boson at a future linear collider experiment is given as a Higgs and SUSY Higgs working group summary report for LCWS 2000. △ Less", "The cosmological relic density of the lightest supersymmetric particle of the minimal supersymmetric standard model is calculated under the assumption of gauge and Yukawa coupling unification. We employ radiative electroweak breaking with universal boundary conditions from gravity-mediated supersymmetry breaking. Further constraints are imposed by the experimental bounds on the b-quark mass and the BR(b -> s gamma). We find that coannihilation of the lightest supersymmetric particle, which turns out to be an almost pure bino, with the next-to-lightest supersymmetric particle (the lightest stau) is crucial for reducing its relic density to an acceptable level. △ Less", "The gauge-mediated SUSY-breaking (GMSB) model needs entropy production at a relatively low temperature in the thermal history of the Universe for the unwanted relics to be diluted. This requires a mechanism for the baryogenesis after the entropy production, and the Affleck and Dine (AD) mechanism is a promising candidate for it. The AD baryogenesis in the GMSB model predicts the existence of the baryonic Q ball, that is the B ball, and this may work as the dark matter in the Universe. In this article, we discuss the stability of the B ball in th presence of baryon-number violating interactions. We find that the evaporation rate increases monotonically with the B-ball charge because the large field value inside the B ball enhances the effect of the baryon-number-violating operators. While there are some difficulties to evaluate the evaporation rate of the B ball, we derive the evaporation time (lifetime) of the B ball for the mass-to-charge ratio $ω_0\\gsim 100 \\MEV$. The lifetime of the B ball and the distortion of the cosmic ray positron flux and the cosmic background radiation from the B ball evaporation give constraints on the baryon number of the B ball and the interaction, if the B ball is the dark matter. We also discuss some unresolved properties of the B ball. △ Less", "The flavor-changing top-quark decay $t\\to c h$, where $h$ is the lightest CP-even Higgs boson in the minimal supersymmetric standard model, is examined in the R-parity-violating supersymmetric model. Within the existing bounds on the relevant R-parity-violating couplings, the branching fraction for $t\\to c h$ can be as large as about $10^{-5}$ in some part of the parameter space. △ Less", "No-scale structure of the Kahler potential is obtained in many types of supersymmetric models. In this paper, phenomenological aspects of these models are investigated with special attention to the current Higgs mass bound at LEP and b \\to s γresult at the CLEO. When the boundary condition is given at the GUT scale and gaugino masses are universal at this scale, very narrow parameter region is allowed only for positive Higgsino mass region if R-parity is conserved. The negative Higgsino mass case is entirely excluded. On the other hand, relatively large parameter region is allowed when the boundary condition is given above the GUT scale, and Tevatron can discover SUSY signals for the positive Higgs mass case. The no-scale models with Wino, Higgsino or sneutrino LSP are also considered. We show that the Higgs mass constraint is important for the Higgsino LSP case, which requires the LSP mass to be larger than about 245 GeV. △ Less", "In this paper, we will describe the results of SUSY parameter space searches including minimal supergravity, non-universal supergravity and minimal supersymmetry and the implications on the indirect detection of neutralino dark matter. We give special attention to the effects of detector thresholds, solar absorption of neutrinos and hadronization of neutralino annihilation products. These effects are known to be important in calculating accurate event rates. △ Less", "We study cosmologies in the Randall-Sundrum models, incorporating the possibility of time-varying speed of light and Newton's constant. The cosmologies with varying speed of light (VSL) were proposed by Moffat and by Albrecht and Magueijo as an alternative to inflation for solving the cosmological problems. We consider the case in which the speed of light varies with time after the radion or the scale of the extra dimension has been stabilized. We elaborate on the conditions under which the flatness problem and the cosmological constant problem can be resolved. We find that the RS models are more restrictive about possible desirable VSL cosmological models than the standard general relativity. Particularly, the VSL cosmologies may provide with a possible mechanism for bringing the quantum corrections to the fine-tuned brane tensions after the SUSY breaking under control. △ Less", "We discuss the production at $e^+e^-$ colliders of Higgs bosons in association with both the scalar leptons and the lightest neutralinos in the Minimal Supersymmetric extension of the Standard Model. While the rates for associated Higgs production with neutralinos and first/second generation sleptons are rather tiny, the cross section for the production of the lightest Higgs boson $h$ with scalar $τ$ lepton pairs can reach the femtobarn level at c.m. energies at and above 500 GeV in favorable regions of the parameter space, making this process potentially detectable at a high-luminosity $\\ee$ collider, in particular in the $γγ$ option. This would provide a determination of the $h \\tildeτ \\tildeτ$ coupling and opens up the possibility of measuring the parameter $\\tan β$. △ Less", "In the MSSM, we make a careful tree-level study of Charge and Color Breaking conditions in the plane $(H_2, \\tilde{u}_L, \\tilde{u}_R)$, focusing on the top quark scalar case. A simple and fast procedure to compute the VEVs of the dangerous vacuum is presented and used to derive a model-independent optimal CCB bound on $A_t$. This bound takes into account all possible deviations of the CCB vacuum from the D-flat directions. For large $\\tan β$, it provides a CCB maximal mixing for the stop scalar fields $\\tilde{t}_1,\\tilde{t}_2$, which automatically rules out the Higgs maximal mixing $|A_t|=\\sqrt{6} m_{\\tilde{t}}$. As a result, strong limits on the stop mass spectrum and a reduction, in some cases substantial, of the one-loop upper bound on the CP-even lightest Higgs boson mass, $m_h$, are obtained. To incorporate one-loop leading corrections, this tree-level CCB condition should be evaluated at an appropriate renormalization scale which proves to be the SUSY scale. △ Less", "We describe how bi-maximal neutrino mixing can be realized in realistic models based on MSSM and SUSY GUTs such as SU(5) and SO(10). A crucial role is played by an anomalous ${\\cal U}(1)$ flavor symmetry, which also helps understand the observed charged fermion mass hierarchies and the magnitudes of the CKM matrix elements. While in MSSM a variety of solutions for the solar neutrino puzzle are possible, SUSY SU(5) and SO(10) only permit the large mixing angle MSW solution. Models in which the ${\\cal U}(1)$ symmetry also mediates SUSY breaking allow both the large mixing angle and the low MSW solutions. We also present renormalization group studies for the neutrino mass matrix, generated through the ${\\cal U}(1)$ flavor symmetry. Our analysis shows that renormalization does not change the desirable picture of bi-maximal mixing. △ Less", "We investigated the contribution of the MSSM Higgs bosons produced in the neutralino annihilation in the Earth and Sun to the total WIMPs detection signals. We found that this contribution is very important and results in a lower bound for the muon flux from the Sun of 10^{-7} - 10^{-8} m^{-2} yr^{-1} for neutralinos heavier than 200 GeV. We noticed that due to the SUSY charged Higgs bosons one can expect an energetic tau neutrino flux from the Sun at a level of 10^2 m^{-2} yr^{-1}. △ Less", "The connection between the present density of neutralinos that are left over from the Big Bang and the superparticle mass scale is briefly reviewed. Superparticle mass scales in the range from a few GeV to several TeV can lead to an acceptable density of thermal relic neutralinos, the actual value depending on relations between the masses of certain sparticles and Higgs bosons. △ Less", "This is the talk given at the Symposium \"Thirty Years of Supersymmetry\", October 13-15, 2000, Theoretical Physics Institute, University of Minnesota. The history of construction of the first supersymmetric field theory in four dimensions (1970) is reviewed. In Appendix a verbatim translation of my paper published in 1971 in Russian (preprint FIAN-41) is presented. In this paper what is now known as chiral and vector supermultiplets were algebraically constructed. △ Less", "We present a model based on our favourite gauge group which we call Anti-GUT and which in its extended form to be applied for neutrinos in the see-saw picture consists in that we have for each family separately a set of gauge fields as in the Standard Model plus a gauged (B-L)-charge. It may function as a concrete model manifestation of the type of model suggested by some general statistical considerations as to what a mass matrix model is to be to match naturally the rough features of the spectrum and the baryon asymmetry so nicely obtained in see-saw models along the Fukugita-Yanagida scheme. △ Less", "We calculate the ratio of the two branching ratios, Br(h -> bb-bar) and Br(h -> cc-bar) + Br(h -> gg), in the minimal supersymmetric standard model taking into account the SUSY-loop corrections to the Higgs sector and the hbb-bar vertex. We show that the heavy Higgs mass can be extracted from the ratio, almost independently of other SUSY parameters, in the region of tan(beta) ~< 10. △ Less", "The chargino and neutralino pair production processes at $e^+e^-$ collisions are explored to determine the underlying SUSY parameters. The sum rules for the couplings are used to check the closure of two-chargino and four-neutralino systems in the minimal supersymmetric extension of the standard model. △ Less", "We reexamine large CP-violating phases in the general Minimal Supersymmetric Standard Model, as well as more restricted models. We perform a detailed scan over parameter space to find solutions which satisfy the current experimental limits on the electric dipole moments of the electron, neutron and $^{199}$Hg atom, exploring the allowed configurations of phases and masses, and we attempt to quantify the level of tuning of the parameters necessary to populate the regions of cancellations. We then consider the measurement of CP-violating phases at a future linear collider. We find that measurements of chargino and neutralino masses and production cross-sections allow for a determination of $φ_1$(the phase of $M_1$) to a precision of $π/30$, while the EDM constraints require that $θ_μ$ be too small to be measured. Using the EDM constraints we find that the CP-even model parameters and the phase $φ_1$ can be determined at a Linear Collider with $400 \\gev$ c.m. energy. As long as some information on the size of $|μ|$ is included in the observables, a measurement of $φ_1$ is guaranteed for $φ_1 > π/10$. To unambiguously identify CP violation, we construct CP-odd kinematical variables at a linear collider. However, the CP asymmetries are rather small, typically about $0.1-1.5%$, and it will be challenging to experimentally observe the predicted asymmetries. △ Less", "In recent years there has been a great deal of interest in R-parity violating supersymmetric models. We explain the motivation for studying these models and explore the various phenomenological consequences of R-parity violation. It has become essential for the experimental study of any new model to have a Monte Carlo event generator which includes the processes predicted by that model. We review the techniques used in the construction of these simulations and show how we have extended the HERWIG event generator to include R-parity violating processes. We discuss how to treat the emission of QCD radiation in these processes including colour coherence effects via the angular-ordered parton shower. We then make use of this simulation to investigate the discovery potential for resonant slepton production, via either supersymmetric gauge or R-parity violating decay modes, in hadron-hadron collisions. Finally, we look at the possibility that the KARMEN time anomaly can be explained by the existence of a light neutralino which is produced and decays via R-parity violation. △ Less", "We present results on the full one-loop electroweak radiative corrections to the squark decay partial widths into charginos and neutralinos. We show the renormalization framework, and present numerical results for the third squark family. The corrections can reach values of ~ 10%, which are comparable to the radiative corrections from the strong sector of the model. Therefore they should be taken into account for the precise extraction of the SUSY parameters at future colliders. △ Less", "We suggest a solution to the μproblem of gauge mediated supersymmtery breaking models based on flavor symmetries. In this scenario the μterm arises through the vacuum expectation value of a singlet scalar field which is suppressed by a flavor symmetry factor relative to the scale of dynamical SUSY breaking. The same flavor symmetry also ensures that the soft SUSY breaking parameter Bμis not much larger than μ^2, a necessary condition for the stability of electroweak symmetry breaking. Explicit examples where Bμ~ μ^2 and Bμ<< μ^2 are presented. The latter case provides a natural solution to the supersymmetric CP problem. We show that the same flavor symmetry that suppresses the μand the Bμparameters can also play a role in explaining the fermion mass and mixing hierarchy puzzle. △ Less", "We re-examine spontaneous CP violation at the tree level in the context of the next-to-minimal supersymmetric standard model (NMSSM) with two Higgs doublets and a gauge singlet field. We analyse the most general Higgs potential without a discrete Z_3 symmetry, and derive an upper bound on the mass of the lightest neutral Higgs boson consistent with present experimental data. We investigate, in particular, its dependence on the admixture and CP-violating phase of the gauge singlet field, as well as on tan(beta). To assess the viability of the spontaneous CP violation scenario, we estimate epsilon_K by applying the mass insertion approximation. We find that a non-trivial flavour structure in the soft-breaking A terms is required to account for the observed CP violation in the neutral kaon sector. Furthermore, combining the minimisation conditions for spontaneous CP violation with the constraints coming from K0-K0bar mixing, we find that the upper bound on the lightest Higgs-boson mass becomes stronger. We also point out that the electric dipole moments of electron and neutron are a serious challenge for SUSY models with spontaneous CP violation. △ Less", "The present lectures contain an introduction to low energy supersymmetry, a new symmetry that relates bosons and fermions, in particle physics. The Standard Model of fundamental interactions is briefly reviewed, and the motivation to introduce supersymmetry is discussed. The main notions of supersymmetry are introduced. The supersymmetric extension of the Standard Model - the Minimal Supersymmetric Standard Model - is considered in more detail. Phenomenological features of the MSSM as well as possible experimental signatures of SUSY are described. An intriguing situation with the supersymmetric Higgs boson is discussed. △ Less", "We investigate three different possibilities for improving the fermion mass relations that arise in grand unified theories (GUTs). Each scenario relies on supersymmetric loop effects alone, without modifying the naive Yukawa unification. First, we consider A-terms that follow the usual proportionality condition. In this case SUSY effects can improve the mass relations, but not completely. Interestingly, imposing Yukawa coupling unification for two families greatly constrains the range of parameters in the MSSM. Secondly, we employ a new ansatz for the tri-linear A-terms that satisfies all experimental and vacuum stability bounds, and can successfully modify the mass relations. Finally, we investigate the use of general (non-proportional) A-terms, with large off-diagonal entries. In this case flavor changing neutral current (FCNC) data present an important constraint. We do not pretend to present a complete, motivated theory of fermion masses. Rather this paper can be viewed as an existence proof, serving to show that Yukawa coupling unification can occur even within the framework of minimal GUTs. △ Less", "CP violation, fermion masses and mixing angles including that of neutrinos are studied in an SUSY SO(10)$\\times Δ(48)\\times$ U(1) model. The nonabelian SU(3) discrete family symmetry $Δ(48)$ associated with a simple scheme of U(1) charge assignment on various fields concerned in superpotential leads to unique Yukawa coupling matrices with zero textures. Thirteen parameters involving masses and mixing angles in the quark and charged lepton sector are successfully predicted by only four parameters. The masses and mixing angles for the neutrino sector could also be predicted by constructing an appropriate heavy Majorana neutrino mass matrix without involving new parameters. It is found that the atmospheric neutrino deficit, the mass limit put by hot dark matter and the LSND $\\barν_μ \\to \\barν_{e}$ events may simultaneously be explained, but solar neutrino puzzle can be solved only by introducing a sterile neutrino. An additional parameter is added to obtain the mass and mixing of the sterile neutrino. The hadronic parameters $B_{K}$ and $f_{B}\\sqrt{B}$ are extracted from the observed $K^{0}$-$\\bar{K}^{0}$ and $B^{0}$-$\\bar{B}^{0}$ mixings respectively. The direct CP violation ($ε'/ε$) in kaon decays and the three angles $α$, $β$ and $γ$ of the unitarity triangle in the CKM matrix are also presented. More precise measurements of $α_{s}(M_{Z})$, $|V_{cb}|$, $|V_{ub}/V_{cb}|$, $m_{t}$, as well as various CP violation and neutrino oscillation experiments will provide an important test for the present model and guide us to a more fundamental theory. △ Less", "We review the equivalence of two approaches to study theories with gauge fields in extra spatial dimensions, namely the ``4D'' approach (with KK states) and the ``5D'' approach (with matching to the 4D theory at the compactification scale). In particular, we reiterate that there are two different power-law scalings of ``effective'' gauge couplings. In a supersymmetric framework with SUSY breaking in the radius modulus, i.e., the field which fixes the size of the extra dimensions, these two approaches seem to give gaugino masses at loop-level (with a possible enhancement due to large number of Kaluza-Klein states) (hep-ph/0008069), and tree-level (hep-ph/0008103), respectively. We show explicitly how this discrepancy can be resolved. △ Less", "We give explicit expressions for the amplitudes associated with the supersymmetric contributions to the process: b -> s gamma in the context of SUSY extensions of Standard Model with non-universal soft SUSY breaking terms. From experimental data, we deduce the limits on the squark mass insertions obtained from different contributions (gluinos, neutralinos and charginos). △ Less", "We study the direct detection rate for SUSY cold dark matter (CDM) predicted by the minimal supersymmetric standard model with universal boundary conditions and large values for tan(beta). The relic abundance of the lightest supersymmetric particle (LSP), assumed to be approximately a bino, is obtained by including its coannihilations with the next-to-lightest supersymmetric particle (NLSP), which is the lightest s-tau. The cosmological constraint on this quantity severely limits the allowed SUSY parameter space, especially in the case the CP-even Higgs has mass of around 114 GeV. We find that for large tan(beta) it is possible to find a subsection of the allowed parameter space, which yields detectable rates in the currently planned experiments. △ Less", "Neutrino oscillation signals at muon storage rings can be faked by supersymmetric (SUSY) interactions in an R-parity violating scenario. We investigate the $τ$-appearance signals for both long-baseline and near-site experiments, and conclude that the latter is of great use in distinguishing between oscillation and SUSY effects. On the other hand, SUSY can cause a manifold increase in the event rate for wrong-sign muons at a long-baseline setting, thereby providing us with signatures of new physics. △ Less", "Low energy supersymmetry with bilinear breaking of R-parity leads to a weak-scale seesaw mechanism for the atmospheric neutrino scale and a radiative mechanism for the solar neutrino scale. The model has striking implications for collider searches of supersymmetric particles. Assuming that the lightest SUSY particle is the lightest neutralino we demonstrate that (i) The neutralino decays inside the detector even for tiny neutrino masses. (ii) Measurements of the neutrino mixing angles lead to predictions for the ratios of various neutralino branching ratios implying an independent test of neutrino physics at future colliders, such as the Large Hadron Collider or a Linear Collider. △ Less", "The general features of the evolution of the Yukawa coupling constants and seesaw operators in the universal seesaw model with det M_F=0 are investigated. Especially, it is checked whether the model causes bursts of Yukawa coupling constants, because in the model not only the magnitude of the Yukawa coupling constant (Y_L^u)_{33} in the up-quark sector but also that of (Y_L^d)_{33} in the down-quark sector is of the order of one, i.e., (Y_L^u)_{33} \\sim (Y_L^d)_{33} \\sim 1. The requirement that the model should be calculable perturbatively puts some constraints on the values of the intermediate mass scales and tanβ(in the SUSY model). △ Less", "We explore a new solution to the $μ$-problem. In the scenario of SUSY-breaking mediation through anti-generation fields, we find that the $Bμ$ term has its origin in a seesaw-type mechanism as well as in a loop diagram through gauge interactions. It is shown that the dominant contributions to the $Bμ$ term are controlled by the flavor symmetry in the model. △ Less", "We discuss to which extent the present experiments of direct search for WIMPs, when interpreted in terms of relic neutralinos, probe interesting regions of the supersymmetric parameter space, which are also being progressively explored at accelerators. Our analysis is performed in a number of different supersymmetric schemes. We derive the relevant neutralino cosmological properties, locally and on the average in the universe. We prove that part of the susy configurations probed by current WIMP experiments entail relic neutralinos of cosmological interest. The main astrophysical and particle physics uncertainties, relevant for a proper comparison between theory and experimental data, are stressed and taken into account. △ Less", "We report a study on the measurement of the SUSY breaking scale sqrt(F) in the framework of gauge-mediated supersymmetry breaking (GMSB) models at the LHC. The work is focused on the GMSB scenario where a stau is the next-to-lightest SUSY particle (NLSP) and decays into a gravitino with lifetime c*tau_NLSP in the range 0.5 m to 1 km. We study the identification of long-lived sleptons using the momentum and time of flight measurements in the muon chambers of the ATLAS experiment. A realistic evaluation of the statistical and systematic uncertainties on the measurement of the slepton mass and lifetime is performed, based on a detailed simulation of the detector response. Accessible range and precision on sqrt(F) achievable with a counting method are assessed. Many features of our analysis can be extended to the study of different theoretical frameworks with similar signatures at the LHC. △ Less", "If the Standard Model (SM) Higgs particle is sufficiently heavy, then its contribution to gamma gamma to Z Z should be largely imaginary, interfering with the also predominantly imaginary SM \"background\" generated by the W-loop. For standard model Higgs masses in the region 200 \\lsim m_H \\lsim 500 GeV, this interference is found to be constructive and increasing the Higgs signal. In the minimal SUSY case an interference effect should also appear for the contribution of the heavier CP-even neutral Higgs boson H^0, provided it is sufficiently heavy. The effect is somewhat reduced though, by the smallness of the H^0 width and the gamma gamma and ZZ branching ratios. The interference is again found to be constructive for part of the parameter space corresponding to sfermion masses at the TeV scale and maximal stop mixing. For both the SM and SUSY cases, regions of the parameter space exist though, where the interference may be destructive. It is therefore essential to take these effects into account when searching for possible scalar Higgs-like candidates. To this aim, we present the complete analytic expressions for both resonance and background amplitudes. △ Less", "Accumulation and annihilation of weakly interacting massive particles (WIMPs) in the earth and the sun may be observed by the resulting neutrino signal. We demonstrate that, for certain parts of the SUSY parameter space, present and future neutrino telescopes can expect a higher rate of events due to tau-neutrinos than of events due to muon-neutrinos. We show how $ν_τ\\leftrightarrowν_μ$ oscillations, and in the case of the sun also scattering, absorption and regeneration, modify the signal expectation. We find that most currently proposed neutralino models predict equal or increased muon fluxes if $ν_τ\\leftrightarrowν_μ$ oscillations are included. △ Less", "We present an outlook for possible R-parity violating SUSY search at gamma-proton and gamma-electron colliders. Single production of third generation slepton/sneutrino through the lambda'-ijk couplings at a gamma-p collider is investigated and compared with the results of the resonant sfermion productions at the existing colliders. Also single sneutrino production at a future gamma-electron collider through the lambda(ijk) couplings is disussed. △ Less", "We present an analysis of the low-energy implications of an intermediate scale ~10^{11} GeV string theory. We mainly focus on the evolution of the physical parameters under the renormalisation group equations (RGEs) and find several interesting new features that differ from the standard GUT scale or Planck scale scenarios. We give a general discussion of soft supersymmetry breaking terms in type I theories and then investigate the renormalization group running. In the dilaton domination scenario, we present the sparticle spectra, analyzing constraints from charge and colour breaking, fine tuning and radiative electroweak symmetry breaking. We compare with the allowed regions of parameter space when the RGEs start running at the standard GUT or the intermediate scales, and find quite remarkably that the dilaton dominated supersymmetry breaking scenario, which is essentially ruled out from constraints on charge and colour breaking if the fundamental scale is close to the Planck mass, is allowed in a large region of parameter space if the fundamental scale is intermediate. △ Less", "The mixings of $d_R$ quarks, hidden from view in Standard Model (SM), are naturally the largest if one has an Abelian flavor symmetry. With supersymmetry (SUSY) their effects can surface via $\\tilde d_R$ squark loops. Squark and gluino masses are at TeV scale, but they can still induce effects comparable to SM in $B_d$ (or $B_s$) mixings, while $D^0$ mixing could be close to recent hints from data. In general, CP phases would be different from SM, as may be indicated by recent B Factory data. Presence of non-standard soft SUSY breakings with large $\\tanβ$ could enhance $b\\to dγ$ (or $sγ$) transitions. △ Less", "Using an effective potential approach, we compute two-loop radiative corrections to the MSSM lightest ${\\cal CP}$-even Higgs boson mass $M_{h^0}$ to ${\\cal O}(α_t^2)$ for arbitrary left-right top-squark mixing and $\\tanβ$. We find that these corrections can increase $M_{h^0}$ by as much as 5 GeV; assuming a SUSY scale of 1 TeV, the upper bound on the Higgs boson mass is $M_{h^0}\\approx 129\\pm 5$ GeV for the top quark pole mass $175\\pm 5$ GeV. We also derive an analytical approximation formula for $M_{h^0}$ which is good to a precision of $\\lsim 0.5$ GeV for most of the parameter space and suitable to be further improved by including renormalization group resummation of leading and next-to-leading order logarithmic terms. Our final compact formula admits a clear physical interpretation: radiative corrections up to the two-loop level can be well approximated by a one-loop expression with parameters evaluated at the appropriate scales, plus a smaller finite two-loop threshold correction term. △ Less", "SUSY models with a gauge singlet easily allow for a strong first order electroweak phase transition (EWPT) if the vevs of the singlet and Higgs fields are of comparable size. We discuss the profile of the stationary expanding bubble wall and CP-violation in the effective potential, in particular transitional CP-violation inside the bubble wall during the EWPT. The dispersion relations for charginos contain CP-violating terms in the WKB approximation. These enter as source terms in the Boltzmann equations for the (particle--antiparticle) chemical potentials and fuel the creation of a baryon asymmetry through the weak sphaleron in the hot phase. This is worked out for concrete parameters. △ Less", "The existing estimation of the Electric Dipole Moment(EDM) of the neutron in the SUSY SU(5) GUT model was quite smaller than one in the MSSM, despite of its increased degree of freedom. This paradoxical result can be resolved by appropriately estimating the CP-violation in the Higgs sector. As a result, the neutron EDM in this model is estimated lager than the existing one as expected. △ Less", "Within the framework of the Minimal Supersymmetric Standard Model (MSSM) the Higgs masses and LEP II production cross sections are calculated for a wide range of the parameter space. In addition, the parameter space restricted by unification, electroweak symmetry breaking and other low energy constraints is considered in detail, in which case the masses of all SUSY partners can be estimated, so that their contributions to the radiative corrections can be calculated. Explicit analytical formulae for these contribution are derived. The radiative corrections from the Yukawa couplings of the third generation are found to dominate over the contributions from charginos and neutralinos. Large Higgs mass uncertainties are due to the top mass uncertainty and the unknown sign of the Higgs mixing parameter. For the low tanb scenario the mass of the lightest Higgs is found to be below 103 GeV for a top mass below 190 GeV. The cross section at a LEP energy of 192 GeV is sufficient to find or exclude this low tanb scenario for a top mass below 180 GeV. For the high tanb scenario only a small fraction of the parameter space can be covered, since the Higgs mass is predicted between 105 and 125 GeV in most cases. At the theoretically possible LEP II energy of 205 GeV part of the parameter space for the large tanb scenario would be accessible. △ Less", "A review is given on the consistency checks of GUT, which unify the electroweak and strong nuclear forces into a single theory. Such theories predict a new kind of force, which could provide answers to several open questions in cosmology. The possible role of such a ``primeval'' force will be discussed in the framework of the Big Bang Theory. Although such a force cannot be observed directly, there are several predictions of GUT's, which can be verified at low energies. The MSSM distinguishes itself from other GUT's by a successful prediction of many unrelated phenomena with a minimum number of parameters. Among them: a) Unification of the couplings constants; b) Unification of the masses; c) Existence of dark matter; d) Proton decay; e) electroweak symmetry breaking at a scale far below the unification scale. A combined fit shows that indeed the MSSM model can satisfy all these constraints simultaneously. The corresponding constraints on the as yet unknown top mass, the strong coupling constant, and all SUSY masses are given within the minimal model, taking into account the complete second order RGE's for the couplings and the one-loop corrected Higgs potential for the calculation of the Z and the Higgs masses. △ Less"]