["Recently, it was pointed out that soft masses of the supersymmetric gauge theories with extra dimensions tends to a flavor conserving point, which is a desirable scenario in gravity mediation models. We point out that in 6D we must consider the anomaly free condition in addition to the condition on the asymptotic freedom. From this, we find $E_6$, $E_7$ and $E_8$ are natural candidates in 6D. There is no SU(N) model, but there exist two SO(10) models and SO(2n) models(one each for each $n\\ge 6$) satisfying these conditions. In 5 dimensions, there is no such condition on anomaly freedom, but the softening may not be enough. △ Less", "We study a finite SU(5) grand unified model based on the non-Abelian discrete symmetry A_4. This model leads to the democratic structure of the mass matrices for the quarks and leptons. In the soft supersymmetry breaking sector, the scalar trilinear couplings are aligned and the soft scalar masses are degenerate, thus solving the SUSY flavor problem. △ Less", "The axion solution to the strong CP problem makes use of a global Peccei-Quinn U(1) symmetry which is susceptible to violations from quantum gravitational effects. We show how discrete gauge symmetries can protect the axion from such violations. PQ symmetry emerges as an approximate global symmetry from discrete gauge symmetries. Simple models based on Z_N symmetries with N =11,12, etc are presented realizing the DFSZ axion and the KSVZ axion. The discrete gauge anomalies are cancelled by a discrete version of the Green-Schwarz mechanism. In the supersymmetric extension our models provide a natural link between the SUSY breaking scale, the axion scale, and the SUSY-preserving μterm. △ Less", "We discuss constraints on SUSY models with non-unified gaugino masses. We concentrate on the slepton/gaugino sector and obtain a lower limit on the neutralino mass combining direct limits, indirect limits as well as relic density measurements. △ Less", "The determination of absolute neutrino masses is crucial for the understanding of theories underlying the standard model, such as SUSY. We review the experimental prospects to determine absolute neutrino masses and the correlations among approaches, using the Delta m^2's inferred from neutrino oscillation experiments and assuming a three neutrino Universe. △ Less", "We consider the production, at future lepton colliders, of charged Higgs pairs in supersymmetric models. Assuming a relatively light SUSY scenario, and working in the MSSM, we show that, for c.m. energies in the one TeV range, a one-loop logarithmic Sudakov expansion that includes an \"effective\" next-to subleading order term is adequate to the expected level of experimental accuracy. We consider then the coefficient of the linear (subleading) SUSY Sudakov logarithm and the SUSY next to subleading term of the expansion and show that their dependence on the supersymmetric parameters of the model is drastically different. In particular the coefficient of the SUSY logarithm is only dependent on $\\tanβ$ while the next to subleading term depends on a larger set of SUSY parameters. This would allow to extract from the data separate informations and tests of the model. △ Less", "The so-called curvaton mechanism --a way to convert isocurvature perturbations into adiabatic ones-- is investigated both analytically and numerically in a pre-big bang scenario where the role of the curvaton is played by a sufficiently massive Kalb--Ramond axion of superstring theory. When combined with observations of CMBR anisotropies at large and moderate angular scales, the present analysis allows us to constrain quite considerably the parameter space of the model: in particular, the initial displacement of the axion from the minimum of its potential and the rate of evolution of the compactification volume during pre-big bang inflation. The combination of theoretical and experimental constraints favours a slightly blue spectrum of scalar perturbations, and/or a value of the string scale in the vicinity of the SUSY-GUT scale. △ Less", "Intersecting D-brane models seem to be one of the most promising avenues to embed the Standard Model physics within the string context. We review here different aspects of these models. Topics include the question of SUSY and quasi-SUSY in intersecting brane models, model-building, the brane recombination interpretation of the SM Higgs mechanism, Yukawa couplings, the lowering of the string scale and possible new Z's accessible to accelerators. △ Less", "At hadron colliders, the search for R-parity violating supersymmetry can probe scalar masses beyond what is covered by pair production processes. We evaluate the next-to-leading order SUSY-QCD corrections to the associated stop or sbottom production with a lepton through R-parity violating interactions. We show that higher order corrections render the theoretical predictions more stable with respect to variations of the renormalization and factorization scales and that the total cross section is enhanced by a factor up to 70% at the Tevatron and 50% at the LHC. We investigate in detail how the heavy supersymmetric states decouple from the next-to-leading order process, which gives rise to a theory with an additional scalar leptoquark. In this scenario the inclusion of higher order QCD corrections increases the Tevatron reach on leptoquark masses by up to 40 GeV and the LHC reach by up to 200 GeV. △ Less", "We consider the phenomenological implications of a soft SUSY breaking term BN at the TeV scale (here B is the U(1)_Y gaugino and N is the right-handed neutrino field). In models with a massless (or nearly massless) neutralino, such a term will give rise through the see-saw mechanism to new contributions to the mass matrix of the light neutrinos. We treat the massless neutralino as an (almost) sterile neutrino and find that its mass depends on the square of the soft SUSY breaking scale, with interesting consequences for neutrino physics. We also show that, although it requires fine-tuning, a massless neutralino in the MSSM or NMSSM is not experimentally excluded. The implications of this scenario for neutrino physics are discussed. △ Less", "I discuss the various available tools for the study of the properties of the new particles predicted in the Minimal Supersymmetric extension of the Standard Model. Emphasis will be put on the codes for the determination of the sparticle and Higgs boson spectrum. Codes for the calculation of production cross sections, decay widths and branching ratios, Dark Matter relic density and detection rates, as well as codes for automatic analytical calculations and Monte-Carlo event generators for Supersymmetric processes will be briefly discussed. △ Less", "We show that the quark flavour structure and CP violating phenomena are strongly correlated in supersymmetric theories. For a generic pattern of supersymmetry breaking the two broad categories of Yukawa couplings, democratic and hierarchical textures, have entirely different phenomenological implications. With hierarchical Yukawas, the rephasing invariant phase, arg(V_us V_cb V_cb^* V_cs^*), in the CKM mixing matrix has to be of order unity, while the SUSY CP violating phases are severely constrained by electric dipole moments, giving rise to the so-called SUSY CP problem. With democratic Yukawas, all experimental CP results can be accommodated with small values for the CKM and SUSY CP violating phases (i.e., CP can be considered as an approximate symmetry at the high energy scale). We also show that within this scenario, an entirely real CKM matrix in supersymmetric models is still allowed by the present experimental results. △ Less", "We give a simultaneous analysis of $g_μ-2$ and lepton flavor violation within MSSM. Working on the interaction basis, we give direct relations between $δa_μ$ and Br$(τ\\toμγ)$ induced by the supersymmetric particles. We find the SUSY parameter space to satisfy the $g_μ-2$ constraint can be considerably different from that given in case of no lepton flavor mixing in the soft SUSY breaking sector. △ Less", "We study the effects of non-commutative QED (NCQED) in fermion pair production, gamma + gamma to f + \\bar{f} and Compton scattering, e + gamma to e + gamma. Non-commutative geometries give rise to 3- and 4-point photon vertices and to momentum dependent phase factors in QED vertices which will have observable effects in high energy collisions. We consider e^+ e^- colliders with energies appropriate to the TeV Linear Collider proposals and the multi-TeV CLIC project operating in gamma gamma and e gamma modes. Non-commutative scales roughly equal to the center of mass energy of the e^+e^- collider can be probed, with the exact value depending on the model parameters and experimental factors. The Compton process is sensitive to Lambda_{NC} values roughly twice as large as those accessible to the pair production process. △ Less", "We show that the inflaton condensate associated with a global symmetry can fragment into quasi stable Q balls after the end of inflation, provided the inflaton oscillations give rise to an effective equation of state with negative pressure. We argue that chaotic inflation with a running inflaton mass may give rise to the desired scenario where the process of fragmentation into inflatonic Q balls can actually take place even though there is total zero charge. We show that such inflatonic Q balls will reheat the Universe to a sufficiently low temperature via surface evaporation. △ Less", "We evaluate the relic density of neutralinos in the minimal supergravity (mSUGRA) model. All 2->2 neutralino annihilation diagrams, as well as all initial states involving sleptons, charginos, neutralinos and third generation squarks are included. Relativistic thermal averaging of the velocity times cross sections is performed. We find that co-annihilation effects are only important on the edges of the model parameter space, where some amount of fine-tuning is necessary to obtain a reasonable relic density. Alternatively, at high tan(beta), annihilation through the broad Higgs resonances gives rise to an acceptable neutralino relic density over broad regions of parameter space where little or no fine-tuning is needed. △ Less", "Much recent attention has focused on theories with large extra compactified dimensions. However, while the phenomenological implications of the volume moduli associated with such compactifications are well understood, relatively little attention has been devoted to the shape moduli. In this talk, I demonstrate that non-trivial shape moduli can lead to a number of effects which are relevant not only for experimental searches for extra dimensions, but also for the interpretation of experimental data if such extra dimensions are found. This talk reports on work done partly in collaboration with Arash Mafi. △ Less", "We consider the gluino-mediated SUSY contributions to B0 - B0 bar mixing, B -> J/psi K_S and B -> X_d gamma in the mass insertion approximation. We find the (LL) mixing parameter can be as large as |delta_{13}^d_{LL}| < 2*10^-1, but the (LR) mixing is strongly constrained by the B -> X_d gamma branching ratio and we find |delta_{13}^d_{LR}| < 10^-2. The implications for the direct CP asymmetry in B -> X_d gamma and the dilepton charge asymmetry (A_{ll}) are also discussed, where substantial deviations from the standard model predictions are possible. △ Less", "The renormalization of the Minimal Supersymmetric Standard Model is discussed. In particular we focus on the soft-supersymmetry breaking sector of the MSSM and comment on non-renormalization theorems. △ Less", "The theoretical status of Higgs boson and supersymmetric particle production at hadron colliders is reviewed with particular emphasis on recent results and open problems. △ Less", "We investigate flavor physics at present and future B factories in order to distinguish supersymmetric models. We evaluate CP asymmetries in various B decay modes, Delta M(Bd), Delta M(Bs), and epsilon_K in three supersymmetric models, i.e. the minimal supergravity, the SU(5) SUSY GUT with right handed neutrinos, and a supersymmetric model with U(2) flavor symmetry. The allowed regions of Delta M(Bs)/Delta M(Bd) and CP asymmetries in B to J/psi K_S and b to s gamma are different for the three models so that it is possible to distinguish the three models by precise determinations of these observables in near future experiments. △ Less", "Neutrino oscillations give clear evidence for non-vanishing neutrino masses and lepton-flavor violation (LFV) in the neutrino sector. This provides strong motivation to search for signals of LFV also in the charged lepton sector, and to probe the SUSY see-saw mechanism. We compare the sensitivity of rare radiative decays on the right-handed Majorana mass scale M_R with the reach in slepton-pair production at a future linear collider. △ Less", "In this talk we discuss the origin and nature of the dark matter in the Affleck-Dine (AD) baryogenesis. The AD baryogenesis via most of the flat directions predict formations of large Q-balls, and a great number of the lightest supersymmetric particles (LSPs) are produced nonthermally via the late-time decays of these Q-balls. In order to avoid the overclosure of the universe by these nonthermally produced LSPs, an LSP with a large pair-annihilation cross section, like Higgsino- or Wino-like neutralino, is required, instead of the standard Bino-like neutralino. This reveals new cosmologically interesting parameter regions in various SUSY breaking models, which have not attracted much attention so far. △ Less", "For superpartner masses not much heavier than the weak scale $M=M_{\\rm W}$, large logarithmic corrections of the Sudakov type arise at TeV energies. In this paper we discuss the general structure of electroweak supersymmetric (susy) Sudakov corrections in the framework of the infrared evolution equation method. We discuss Yukawa sector Ward-identities which lead to the exponentiation of the subleading (SL) logarithmic Yukawa enhanced Sudakov corrections in both the Standard Model (SM) as well as in softly broken supersymmetric extensions. The results are given to SL accuracy to all orders in perturbation theory for arbitrary external lines in the ``light'' susy-mass scenario. The susy-QCD limit for virtual corrections is presented. Phenomenological applications regarding the precise determination of the important parameter $\\tan β$ through virtual corrections are discussed which are independent of the soft susy breaking mechanism to sub-subleading accuracy to all orders. △ Less", "We summarize methods and expected accuracies in determining the basic low-energy SUSY parameters from experiments at future e$^+$e$^-$ linear colliders in the TeV energy range, combined with results from LHC. In a second step we demonstrate how, based on this set of parameters, the fundamental supersymmetric theory can be reconstructed at high scales near the grand unification or Planck scale. These analyses have been carried out for minimal supergravity [confronted with GMSB for comparison], and for a string effective theory. △ Less", "As was suggested about a year ago, one of the most dramatic consequences of low-scale (~1 TeV) quantum gravity is copious production of mini black holes at future accelerators and in ultra-high-energy cosmic ray collisions. Hawking radiation of these black holes is constrained mainly to our (3+1)-dimensional world and results in rich phenomenology. With the original idea having been cited over a hundred times since its appearence, we review the current status of astrophysical observations of black holes and selected topics in the mini black hole phenomenology, such as production rates at colliders and in cosmic rays, Hawking radiation as a sensitive probe of the dimensionality of extra space, as well as an exciting possibility of finding new physics in the decays of black holes. △ Less", "We examine here the constraints from the amount of relic density of neutralino dark matter and other experiments have on the SUSY parameter space for the mSUGRA model and for models with non-universal soft breaking at the GUT scale. In mSUGRA, the allowed amount of dark matter restricts the SUSY parameter space to a narrow band in m_0 - m_{1/2} (except at very large \\tanβ). The Higgs mass and b-> sγconstraints produce a lower bound of m_{1/2}>~{\\sim} 300GeV and if the muon magnetic moment anomaly can be interpreted as a 3σdeviation from the Standard Model, one also obtains an upper bound of m_{1/2} <~900 GeV, making the SUSY spectrum well accessible to the LHC. The B_s->μμdecay is seen to be accessible to the Tevatron Run2B with 15 fb^{-1} for \\tanβ>~30. However, only parts of the spectrum will be accessible to the NLC if it's energy is below 800GeV. Non-universal soft breaking opens new regions of parameter space. Thus the m_{1/2} lower bound constraint of b->sγand also the Higgs mass can be reduced greatly if the gluino mass is assumed larger at the GUT scale (allowing for a lighter gaugino spectrum), and non-universal Higgs soft breaking masses at the GUT scale can open new allowed regions at relatively low m_{1/2} and high m_0 where dark matter detection cross sections may be increased by a factor of ten or more. △ Less", "In order to reveal the underlying structure of Supersymmetry one has to determine the low--energy parameters without assuming a specific SUSY breaking scheme. In this paper we show a procedure how to determine M_1, Φ_{M_1}, M_2, μ, Φ_μ and \\tanβeven in the case when only light charginos \\tildeχ^{\\pm}_1 and neutralinos \\tildeχ^0_1, \\tildeχ^0_2 would be accessible at the first stage of a future Linear Collider with polarized beams. △ Less", "In this talk we assume SO(10) boundary conditions at the GUT scale, including unification for the third generation Yukawa couplings $λ_t = λ_b = λ_τ$. We find that this assumption is only consistent with the low energy data in a narrow region of soft SUSY breaking parameter space. We discuss the consequences of this result for Higgs and SUSY searches. △ Less", "We discuss the status of supersymmetric grand unified theories [SUSY GUTs] with regards to the observation of proton decay. In this talk we focus on SUSY GUTs in 4 dimensions. We outline the major theoretical uncertainties present in the calculation of the proton lifetime and then present our best estimate of an absolute upper bound on the predicted proton lifetime. Towards the end, we consider some new results in higher dimensional GUTs and the ramifications for proton decay. △ Less", "The ATLAS and CMS Collaborations at the CERN Large Hadron Collider (LHC) have devoted considerable effort to the study of SUSY signatures and measurements. This talk provides an overview of what can be learned at the LHC if TeV-scale SUSY exists. △ Less", "Secondary photons from decays of metastable neutralinos can contribute to the ultra-high energy cosmic ray flux. The neutralino production rate is too low in acceleration mechanisms to affect the cosmic ray spectrum without emitting enormous energy in photons and neutrinos. However, in top-down models with sources not concentrated in galactic halos, neutralino decays change the spectrum significantly. We estimate the parameters of a model in which photons from neutralino decays are responsible for cosmic ray events with energies above 10^20 eV, and figure out distinctive experimental signatures for this model. △ Less", "The lightest supersymmetric particle, most likely the lightest neutralino, is one of the most prominent particle candidates for cold dark matter (CDM). We show that the primordial spectrum of density fluctuations in neutralino CDM has a sharp cut-off, induced by two different damping mechanisms. During the kinetic decoupling of neutralinos, non-equilibrium processes constitute viscosity effects, which damp or even absorb density perturbations in CDM. After the last scattering of neutralinos, free streaming induces neutralino flows from overdense to underdense regions of space. Both damping mechanisms together define a minimal mass scale for perturbations in neutralino CDM, before the inhomogeneities enter the nonlinear epoch of structure formation. We find that the very first gravitationally bound neutralino clouds ought to have masses above 10^{-6} solar masses, which is six orders of magnitude above the mass of possible axion miniclusters. △ Less", "In the context of colliding brane worlds I discuss a toy cosmological model, developed in collaboration with E. Gravanis, which arguably produces inflation and a relaxing to zero cosmological ``constant'' hierarchically small as compared to the supersymmetry breaking (TeV) scale. Supersymmetry breaking is induced by compactification of the brane worlds on magnetized tori. The crucial ingredient is the non-criticality (non conformality) of string theory on the observable brane world induced at the collision, which is thus viewed as a cause for departure from equilibrium in this system. The hierarchical smallness of the present-era vacuum energy, as compared to the SUSY breaking scale, is thus attributed to relaxation. △ Less", "Recently, refinements have been made on both the theoretical and experimental determinations of the i.) mass of the lightest Higgs scalar, ii.) relic density of cold dark matter in the universe, iii.) branching fraction for radiative B decay BF(b \\to s γ), iv.) muon anomalous magnetic moment, and v.) flavor violating decay B_s \\to μ^+μ^-. In this work, we present constraints from each of these quantities on the minimal supergravity model as embedded in the updated version of the computer program ISAJET v7.64. Improvements and updates since our published work are especially emphasized. The combination of constraints points to certain favored regions of model parameter space where collider and non-accelerator SUSY searches may be more focused. △ Less", "We study the associated production of the $A^0$ neutral CP--odd Higgs boson with a neutral gauge boson $Z$ as well as single production of $A^0$ via $e^+e^- \\to ν_e {\\barν}_e A^0$ at the one loop level in the Minimal Supersymmetric Standard Model (MSSM). We show that the MSSM cross--section may be enhanced by light SUSY particles. Then we study the production processes $e^+e^-\\to H^0_iZ$, $H^0_iν_e\\bar ν_e$ and $H^0_iH^0_j$ in the context of the MSSM with scalar-pseudoscalar mixing. In a given channel we show that the cross--section for all i (=1,2,3) can be above 0.1 fb provided $M_{H_{2,3}}\\la 300$ GeV. This should be detectable at a Next Linear Collider and would provide evidence for scalar--pseudoscalar mixing. △ Less", "In the Minimal Supersymmetric Standard Model (MSSM), the process e+ e- -> gluino gluino is mediated by quark/squark loops, dominantly of the third generation, where the mixing of left- and right-handed states can become large. Taking into account realistic beam polarization effects, photon and Z0-boson exchange, and current mass exclusion limits, we scan the MSSM parameter space for various e+e- center-of-mass energies to determine the regions, where gluino production should be visible. △ Less", "We discuss constraints on the right-handed Majorana mass scale M_R of the SUSY see-saw model in the mSUGRA framework. The sensitivity of radiative lepton-flavor violating decays on M_R is compared with the reach in lepton-flavor violating channels at a future linear collider. △ Less", "The purely leptonic decays D -> e nu and Ds -> e nu, for which no experimental limits exist, are highly suppressed in the Standard Model. Mere observation of these decays at the B factories BELLE/BaBar or forthcoming CLEO-c would be a clear signal of physics beyond the SM. We show that R parity violating slepton contributions can give rise to spectacular enhancements of the decay rates, resulting in branching ratios as large as 5 x 10^-3, which strongly motivates a search in these channels. △ Less", "We consider $B_s \\to μ^+ μ^-$ and the muon $(g-2)_μ$ in various SUSY breaking mediation mechanisms. If the decay $B_s \\to μ^+ μ^-$ is observed at Tevatron Run II with a branching ratio larger than $\\sim 2 \\times 10^{-8} $, the noscale supergravity (including the gaugino mediation), the gauge mediation scenario with small number of messenger fields and low messenger scale, and a class of anomaly mediation scenarios will be excluded, even if they can accommodate a large muon $(g-2)_μ$. On the other hand, the minimal supergravity scenario and similar mechanisms derived from string models can accommodate this observation. △ Less", "We adopt the SUSY benchmark scenario SPS 1a in supersymmetric models where the Higgs sector is extended by singlet superfields. We consider light neutralinos with dominant singlino character whose couplings are generally suppressed. The cross sections for direct production of the singlino-dominated neutralinos can be of the order of several fb for singlet vevs of some TeV. Hence even exotic neutralinos which are not the LSP and are omitted in the decay chains of the other supersymmetric particles may be visible at a high luminosity linear e^+e^- collider. If, however, the LSP is singlino-dominated the decay width of the NLSP can be very small and displaced vertices exist for large singlet vacuum expectation values. △ Less", "LEP results have constrained heavily the Minimal Supersymmetric Standard Model, while providing hints for light Higgs boson and for ``SUSY-assisted'' gauge couling unification. In this paper the results obtained at LEP within two scenarios, the gravity-mediated MSSM framework and the minimal SUGRA scenario are presented. Model-dependence and coverage of LEP results is discussed. △ Less", "We consider here the constraints in SUGRA models on the SUSY parameter space due to current experimental bounds on the light Higgs mass m_h, the b-> s gamma decay, the amount of neutralino cold dark matter Omega h^2, and the muon magnetic moment. Models with universal soft breaking (mSUGRA) and non-universal gaugino or Higgs masses at M_G are examined. For mSUGRA, the m_h, b->s gamma and Omega h^2 constraints imply a lower bound on the gaugino mass of m_{1/2}>~300GeV implying the gluino and squarks have mass >~700GeV, and the neutralino >~120GeV. The current status of the Brookhaven muon g - 2 experiment is reviewed, and if the Standard Model (SM) contribution evaluated using the e^+ + e^- data is correct, a 2 sigma bound on the deviation of experiment from the SM produces an upper bound on m_{1/2} that eliminates the \"focus point\" regions of parameter space. Dark matter (DM) detection cross sections range from 5\\times10^{-8} pb to 5\\times10^{-10} pb which would be accessible to future planned detectors. The SUSY decay B_s->μ^+ +μ^- is seen to be accessible to the Tevatron Run 2B with 15 fb^{-1} luminosity for tanbeta >~30. The most favorable signals of SUSY for linear colliders are stau pair production and neutralino pair production, though it will require an 800GeV machine to cover the full parameter space. Non-universal models can modify some of the above results. Thus a non-universal (heavier) gluino mass at M_G can significantly reduce the lower bound constraints of b\\to s gamma and m_h giving rise to a lighter SUSY spectrum. A heavier up Higgs mass can open an additional region with allowed relic density arising from annihilation via the s-channel Z diagram with an O(10) larger DM detector cross section. △ Less", "In this talk we discus some properties of supersymmetric theories on orbifolds in five dimensions. The structure of FI--tadpoles may lead to (strong) localization of charged bulk scalars. Orbifold theories may suffer from various kinds of anomalies. The parity anomaly may render the construction of the orbifold theory ill--defined. The gauge anomaly on the orbifold are localized at the fixed points, which can sometimes be canceled by a Chern--Simons term. △ Less", "Using a simple Asymptotically Strong N=1 Susy SU(2) Gauge theory coupled to a {\\bf{5}}-plet Chiral superfield we demonstrate the plausibility of the `` truly minimal '' Asymptotically Strong Grand Unification scenario proposed by us recently. Assuming a dynamical superpotential consistent with the symmetries and anomalies is actually induced non-perturbatively we show the gauge symmetry is dynamically and spontaneously broken at a UV scale that is generically {\\it{exponentially}} larger than the scales characteristic of the effective low energy theory. The pattern of condensates in a semi-realistic SU(5) ASGUT is analyzed using the Konishi anomaly assuming condensation occurs as shown by our toy model. The necessarily complementary relation of ASGUTs to the Dual Unification program and the novel cosmogony implied by their unusual thermodynamic properties are also discussed. △ Less", "We present a model of inflation based on the anomaly-induced effective action of gravity in the presence of a conformally invariant Hilbert-Einstein term. Our approach is based on the conformal representation of the fields action and on the integration of the corresponding conformal anomaly. In contradistinction to the original Starobinsky's model, inflation can be stable at the beginning and unstable at the end. The instability is caused by a slowing down of inflation due to quantum effects associated to the massive fermion fields. In supersymmetric theories this mechanism can be linked to the breaking of SUSY and suggests a natural way to achieve graceful exit from the inflationary to the FLRW phase. △ Less", "In the MSSM, an unfortunate prediction of minimal anomaly mediated supersymmetry breaking is that the slepton masses squared are negative. This problem is particularly intractable because of the insensitivity of anomaly mediation to ultraviolet physics. In this paper we note that tree level couplings to the conformal compensator in the Kahler potential give 10 TeV as a natural mass scale for physics beyond the MSSM, and, moreover, that the SUSY breaking effects from physics at this scale do not generically decouple from the low-energy spectrum. We consider particular extensions, including the effects of vector-like matter at 10 TeV, and a specific model in which the leptons are placed in a triplet of an asymptotically free SU(3). We find that the features of minimal anomaly mediation are not a robust prediction of the general framework, and that the problem of negative slepton masses squared can easily be avoided. △ Less", "We discuss the conditions under which the flavor structure of SUSY model induces, either radiatively or through mixing, new flavor-violating interactions in the Higgs sector. The radiative flavor mediation mechanism is illustrated using the minimal SUSY extension of the SM (MSSM) with generic trilinear A-terms, and applied to evaluate the corrections to Lepton Flavor-Violating (LFV) and Flavor-Conserving (LFC) Higgs vertices. Flavor mediation through mixing is discussed within the context of an $E_6$-inspired multi-Higgs model, suplemented with an abelian flavor symmetry. Tevatron and LHC can probe the flavor structure of these models through the detection of the LFV Higgs mode h->tau mu, while NLC can perform high-precision tests of the LFC mode h ->tau+ tau-. △ Less", "For superpartner masses not much heavier than the weak scale $M=M_{\\rm W}$, large logarithmic corrections of the Sudakov type arise at TeV energies. In this paper we summarize recent results of supersymmetric (susy) electroweak radiative corrections for sfermion and charged Higgs production at $e^+e^-$ colliders in the MSSM. The results are given to subleading logarithmic (SL) accuracy to all orders in perturbation theory in the ``light'' susy-mass scenario. Prospects for the determination of $\\tan β\\geq 10$ are discussed which is independent of soft susy-breaking terms to SL accuracy. △ Less", "In this talk, I present the last and more precise results obtained in the computation of the final spectra of stable particles issued from the decay of super-heavy X particles (M_X ~ 10^21 to 10^25 eV). Such very energetic decay products, carrying a fraction of the mass of the X particle, are believed to be a plausible explanation for the observed ultra-high energy cosmic rays (UHECR). Combining these results with X-particle models and with a code describing the propagation effects for UHECRs through the interstellar medium, it becomes possible to make some predictions on the fluxes expected on Earth, hopefully detectable in the next generation of experiments. △ Less", "We review the results on the investigation of the LHC(CMS) SUSY discovery potential for the case of nonuniversal gaugino and squark masses. △ Less", "We discuss CP violation in supersymmetric theories and show that CP phenomena can act as a probe of their origins, i.e., compactification and spontaneous supersymmetry breaking. CP violation as a probe of the flavor structure of supersymmetric theories is also discussed. A brief overview is given of several low energy phenomena where CP phases can produce new effects. These include important CP effects in processes involving sparticles and CP mixing effects in the neutral Higgs boson system. We also discuss the possibility of violations of scaling in the electric dipole moments (EDMs) due to the presence of nonuniversalities and show that with inclusion of nonuniversalities the muon EDM could be up to 1-2 orders of magnitude larger than implied by scaling and within reach of the next generation of experiments. Thus the EDMs are an important probe of the flavor structure of supersymmetric theories. △ Less", "We have developed an efficient formulation for the study of the generic supersymmetric standard model, which admits all kind of R-parity violating terms. Using the formulation, we discuss all sources of fermion dipole moment contributions from R-parity violating, or rather lepton number violating, parametersand the constraints obtained. Stringent constraints comparable to those from neutrino masses are resulted in some cases. △ Less", "In this talk I discuss some scenarios which involve small extensions of the ideas usually considered in the Minimal Supersymmetric Standard Model (MSSM). I present results of a study of the implication of non-universal gaugino masses (NGM) for the invisible decays of the lightest scalar and the correlation of the same with the relic density of the lightest supersymmetric particle (LSP) in the Universe. Further I discuss SUSY with \\rpv. Decay of $\\tilde χ_1^0$ in the case of dominant \\rpv and \\LV, trilinear $λ$ and $λ'$ couplings, and also that of $\\tilde χ_1^0, \\tilde χ_1^+$ caused by the bilinear \\rpv, \\LV couplings are discussed. The effect of the latter for the trilepton signal at the Tevatron is presented. I end with a discussion of signals of Heavy Majorana Neutrinos (HMN) at the LHC. △ Less", "The radiatively induced neutrino mass matrix is investigated on the basis of an SU(5) SUSY model. In order to evade the proton decay, an ansatz based on a discrete symmetry $Z_2$ is assumed: although, at the unification scale, we have two types of superfields $Ψ_{L(\\pm)}=\\bar{5}_{L(\\pm)}+10_{L(\\pm)}$, which are transformed as $Ψ_{L(\\pm)} \\to \\pm Ψ_{L(\\pm)}$ under the discrete symmetry Z$_2$, the particles $Ψ_{L(+)}$ are decoupled after the SU(5) symmetry is broken, so that our quarks and leptons belong to Ψ_{L(-)}. The R-parity-violating terms for our quarks and leptons Ψ_{L(-)} are basically forbidden under the symmetry Z_2. However, we assume that mixings between members of Ψ_{L(+)} and those of Ψ_{L(-)} are in part caused after SU(5) is broken. As a result, the R-parity-violating interactions are in part allowed, so that the neutrino masses are radiatively generated, while the proton decay due to the R-parity violating terms is still forbidden because the term d_R^c d_R^c u_R^c has z=-1. △ Less", "The explanation of various observed phenomena such as large angle neutrino oscillations, hierarchies of charged fermion masses and CKM mixings, and apparent baryon number conservation may have a common origin. We show how this could occur in 5D SUSY SU(5) supplemented by a ${\\cal U}(1)$ flavor symmetry and additional matter supermultiplets called 'copies'. In addition, the proton decays into $p\\to Kν$, with an estimated lifetime of order $10^{33}-10^{36}$ yrs. Other decay channels include $Ke$ and $Kμ$ with comparable rates. We also expect that BR$(μ\\to eγ)\\sim $BR$(τ\\to μγ)$. △ Less", "We suggest simple models which produce the suitable fermion mass hierarchies and flavor mixing angles based on the 6 dimensional N=1 supersymmetric SO(10) grand unified theory compactified on a $T^2/(Z_2 \\times Z_2')$ orbifold. We introduce extra vector-like heavy fields in the extra dimensions, and the suitable fermion mass hierarchies and flavor mixings are generated by integrating out these heavy fields. We consider gaugino mediation and gauge mediation supersymmetry breaking mechanisms and their flavor structures. The experimental constraints of small flavor changing neutral currents suggest where to locate the supersymmetry breaking brane in the gaugino mediation mechanism. On the other hand, the SUSY breaking masses are highly degenerated in the gauge mediation scenario, where the flavor changing neutral currents are naturally suppressed as in the ordinal four dimensional gauge mediation models. △ Less", "We analyze the partial decay widths of sfermions decaying into charginos and neutralinos Γ(\\sfermion -> f'χ) at the one-loop level. We present the renormalization framework, and discuss the value of the corrections for top- and bottom-squark decays. △ Less", "We examine the T-odd transverse lepton and $Λ$ polarizations in the baryonic decays of $Λ_b\\toΛl^+l^- (l=e ,μ)$ to study the T violating effects. We show that the lepton polarizations are suppressed but the $Λ$ ones can be as large as 50% in CP violating theories beyond the standard model such as the SUSY models, which can be tested in various future hadron colliders. △ Less", "In this talk, I briefly review a selection of SUSY effects in B physics. First, I consider models with Minimal Flavour Violation. Then I discuss SUSY models with new sources of flavour violation in squark mass matrices, analyzing present constraints and possible developments with forthcoming data on b -> s and b -> d transitions. △ Less", "It was recently shown how to break supersymmetry in certain $AdS_3$ spaces, without destabilizing the background, by using a ``double trace'' deformation which localizes on the boundary of space-time. By viewing spatial sections of $AdS_3$ as a compactification space, one can convert this into a SUSY breaking mechanism which exists uniformly throughout a large 3+1 dimensional space-time, without generating any dangerous tadpoles. This is a generalization of a Visser type infinite extra dimensions compactification. Although the model is not Lorentz invariant, the dispersion relation is relativistic at high enough momenta, and it can be arranged such that at the same kinematical regime the energy difference between between former members of a SUSY multiplet is large. △ Less", "I discuss effective field theories of brane-world models where different sectors break different halves of the extended bulk supersymmetry. It is shown how to consistently couple N=2 supersymmetric matter to N=1 superfields that lack N=2 partners but transform in a non-linear representation of the N=2 algebra. In particular, I explain how to couple an N=2 vector to N=1 chiral fields such that the second supersymmetry is non-linearly realized. This method is then used to study systems where different sectors break different halves of supersymmetry, which appear naturally in models of intersecting branes. △ Less", "We analyze the transmission of supersymmetry breaking in brane-world models of pseudo-supersymmetry. In these models two branes preserve different halves of the bulk supersymmetry. Thus supersymmetry is broken although each sector of the model is supersymmetric when considered separately. The world-volume theory on one brane feels the breakdown of supersymmetry only through two-loop interactions involving a coupling to fields from the other brane. In a 5D toy model with bulk vectors, we compute the diagrams that contribute to scalar masses on one brane and find that the masses are proportional to the compactification scale up to logarithmic corrections, m^2 ~ (2 pi R)^{-2}(ln(2 pi R ms)-1.1), where ms is an ultraviolet cutoff. Thus, for large compactification radii, where this result is valid, the brane scalars acquire a positive mass squared. We also compute the three-loop diagrams relevant to the Casimir energy between the two branes and find E ~ (2 pi R)^{-4}((ln(2 pi R ms)-1.7)^2+0.2). For large radii, this yields a repulsive Casimir force. △ Less", "Neutrinoless double beta decay is a very important process both from the particle and nuclear physics point of view. From the elementary particle point of view it pops up in almost every model. giving rise, among others, to the following mechanisms: a) The traditional contributions like the light neutrino mass mechanism . b) The exotic R-parity violating supersymmetric (SUSY) contributions. Similar considerations apply to its sister lepton and muon number violating muon to positron conversion. The observation of neutrinoless double beta decay will signal that the neutrinos are massive Majorana particles. For nuclear physics it is challenging, because: 1) The nuclei, which can undergo double beta decay, have complicated structure. 2) The energetically allowed transitions are suppressed. 3) One must cope with the short distance behavior of the transition operators. Thus novel effects (decay of pions in flight between nucleons etc) have to be considered. 4) One has to take into account possible momentum dependent terms of the nucleon current. For light neutrinos such modifications of the nucleon current reduce the nuclear matrix elements by about 25 per cent. In the case of heavy neutrino the effect is much larger and model dependent. With the above effects the nuclear matrix elements for all interesting nuclei A = 76, 82, 96, 100, 116, 128, 130, 136 and 150 are discussed. Some have been obtained in the shell model but most in QRPA. Thus we have extracted new limits on the various lepton violating parameters. We find an average neutrino mass of about 0.5eV and, for reasonable choices of the parameters of SUSY models, we get a stringent limit on the R-parity violating parameter less than 0.00068. △ Less", "The necessary complex structures needed for CP violation are not easy to generate and, indeed, CP can be a symmetry in higher dimensional theories. In 4-dimensions CP violation argues for the existence of a scalar sector and, in its simplest manifestation, leads to the CKM model. Further CP violating phases, from an extended scalar sector, are constrained by the requirement of having no FCNC. Although new CP violating phases are expected in SUSY extensions of the SM, the good agreement of data with the CKM model only provides bounds on these phases. Baryogenesis via leptogenesis requires the presence of CP violating phases in the neutrino sector. However, the CP phases likely to be eventually meausured experimentally are not necessarily directly connected to the ones which drive the leptogenesis. △ Less", "We review the status of radiative corrections to SUSY processes. We present the method of the on-shell renormalization for the sfermion and the chargino/neutralino system and work out the appropriate renormalization conditions. In particular, we discuss slepton, squark, chargino and neutralino production in e+ e- collisions and the two-body decays of sfermions and of Higgs bosons into SUSY particles. It is necessary to take into account radiative corrections in the precision studies possible at a future linear e+ e- collider. △ Less", "We briefly comment on the question of spontaneous CP violation for several models of weak interactions. We focus on one of the minimal extensions of the Standard Model where spontaneous CP violation is viable,the next-to-minimal supersymmetric standard model (NMSSM), with two Higgs doublets and a gauge singlet. We analyse the most general Higgs potential without a discrete Z_3 symmetry, and derive an upper bound on the mass of the lightest neutral Higgs boson. We estimate $ε_K$ by applying the mass insertion approximation, finding that in order to account for the observed CP violation in the neutral kaon sector a non-trivial flavour structure in the soft-breaking A-terms is required and that the upper bound on the lightest Higgs-boson mass becomes stronger. We also discuss the implications of electric dipole moments of the electron and the neutron in SUSY models with SCPV. △ Less", "We show some results in the minimal supersymmetric Standard Model (MSSM) and the two Higgs doublet model (THDM) for W+/- H-/+ production cross sections at e+ e- and hadron colliders. We demonstrate that the predictions for the cross sections in the two models can be vastly different. Observing these processes, once the existence of a charged Higgs is established, might shed some light on the underlying model for an extended Higgs sector. △ Less", "I discuss a class of hierarchical neutrino mass models based on the see-saw mechanism with single right-handed neutrino dominance. I apply this mechanism to a string inspired SUSY Pati-Salam model and indicate how it may emerge from intersecting D-branes. △ Less", "I review promising approaches to neutrino mass models, focussing on three neutrino patterns of neutrino masses and mixing angles, and the corresponding Majorana mass matrices. I discuss the see-saw mechanism, and show how it may be applied in a very natural way to give a neutrino mass hierarchy with large atmospheric and solar angles by assuming single right-handed neutrino dominance. A theoretical framework for understanding quark and lepton (including neutrino) masses and mixing angles based on SUSY, GUTs and Family symmetry is then described, and sample models which involve single right-handed neutrino dominance are discussed. △ Less", "In the present review we show that renormalizations in a softly broken SUSY gauge theory are not independent but directly follow from those of an unbroken or rigid theory. This is a consequence of a treatment of a softly broken theory as a rigid one in external spurion superfield. This enables one to get the singular part of effective action in a broken theory from a rigid one by a simple modification of the couplings. Substituting the modified couplings into renormalization constants, RG equations, solutions to these equations, approximate solutions, fixed points, etc., one can get corresponding relations for the soft terms by a simple Taylor expansion over the Grassmannian variables. Some examples including the MSSM in low and high $\\tanβ$ regime, SUSY GUTs and the N=2 Seiberg-Witten model are considered. △ Less", "We present a general analysis of B_{s,d}-> l^+ l^- and K_L -> l^+ l^- decays in supersymmetric models with non-minimal sources of flavour mixing. In spite of the existing constraints on off-diagonal squark mass terms, these modes could still receive sizeable corrections, mainly because of Higgs-mediated FCNCs arising at large tan(beta). The severe limits on scenarios with large tan(beta) and non-negligible {tilde d}^i_{R(L)}-{d-tilde}^j_{R(L)} mixing imposed by the present experimental bounds on these modes and Delta B=2 observables are discussed in detail. In particular, we show that scalar-current contributions to K_L -> l^+ l^- and B-{bar B} mixing set non-trivial constraints on the possibility that B_s -> l^+ l^- and B_d -> l^+ l^- receive large corrections. △ Less", "An analytic analysis of the CP violating effects arising from the soft SUSY breaking parameters on the decays $B^0_{s,d}\\to \\it l^+\\it l^-$ at large $\\tanβ$ is given. It is found that the phases have a strong effect on the branching ratio and in some regions of the parameter space they can lead to a variation of the branching ratio by as much as 1-2 orders of magnitude. These results have important implications for the discovery of the $B^0_{s}\\to μ^+μ^-$ signal in RUNII of the Tevatron and further on how the parameter space of SUSY models will be limited once the signal is found. △ Less", "If tan(beta) is large, down-type quark mass matrices and Yukawa couplings cannot be simultaneously diagonalized, and flavour violating couplings of the neutral Higgs bosons are induced at the 1-loop level. These couplings lead to Higgs-mediated contributions to the decays B_s -> mu+ mu- and B_d -> tau+ tau-, at a level that might be of interest for the current Tevatron run, or possibly, at B-factories. We evaluate the branching ratios for these decays within the framework of minimal gravity-, gauge- and anomaly-mediated SUSY breaking models, and also in SU(5) supergravity models with non-universal gaugino mass parameters at the GUT scale. We find that the contribution from gluino loops, which seems to have been left out in recent phenomenological analyses, is significant. We explore how the branching fraction varies in these models, emphasizing parameter regions consistent with other observations. △ Less", "GRACE/SUSY is a program package for generating the tree-level amplitude and evaluating the corresponding cross section of processes of the minimal supersymmetric extension of the standard model (MSSM). The Higgs potential adopted in the system, however, is assumed to have a more general form indicated by the two-Higgs-doublet model. This system is an extension of GRACE for the standard model(SM) of the electroweak and strong interactions. For a given MSSM process the Feynman graphs and amplitudes at tree-level are automatically created. The Monte-Carlo phase space integration by means of BASES gives the total and differential cross sections. When combined with SPRING, an event generator, the program package provides us with the simulation of the SUSY particle productions. △ Less", "In the Minimal Supersymmetric Model (MSSM) the hitherto unconstrained flavor mixing between top-squark and charm-squark will induce the flavor-changing neutral-current (FCNC) interaction between top quark and charm quark, which then give rise to various processes at the next generation linear collider (NLC), i.e., the top-charm associated productions via $e^+ e^-$, $e^- γ$ and $γγ$ collisions as well as the top quark rare decays $t \\to c V$ ($V=g$, $γ$ or $Z$). All these processes involve the same part of the parameter space of the MSSM. Through a comparative analysis for all these processes at the NLC, we found the best channel to probe such SUSY-induced top quark FCNC is the top-charm associated production in $γγ$ collision, which occurs at a much higher rate than $e^+ e^-$ or $e^- γ$ collision and may reach the detectable level for some part of the parameter space. Since the rates predicted by the Standard Model are far below the detectable level, the observation of such FCNC events would be a robust indirect evidence of SUSY. △ Less", "Recent measurements of CP asymmetry in B --> phi K_S appear to be inconsistent with Standard Model expectations. We explore the effect of R-parity-violating SUSY to understand the data. △ Less", "It is an exciting time for flavor physics. In this talk, I discuss recent topics in baryogenesis and leptogenesis in light of new data, and implications in B and neutrino physics. I also discuss current situation of grand unified theories concerning coupling unification, proton decay, and indirect consequences in lepton flavor violation and B physics. I explain attempts to understand the origin of flavor based on flavor symmetry, in particular \"anarchy\" in neutrinos. △ Less", "We derive various solutions for the gauge field and the gaugino when there are both 5D bulk kinetic terms and 4D brane kinetic terms. Below the compactification scale $1/y_c$, gauge interaction by the massless mode is universal, independent of the locations of sources, but above $1/y_c$, the interaction distinguishes their locations. We consider the $S^1/(Z_2\\times Z_2')$ orbifold compactification, in which N=2 SUSY and SU(2) gauge symmetry break down to N=1 and U(1), respectively. While the odd parity gauge fields under $Z_2$, $A^1_μ$ and $A^2_μ$, interact with the bulk gauge coupling $g^2$, $A^3_μ$ at low energy interacts with $e^2g^2/(e^2+g^2)$ due to the brane kinetic term with the coupling $e^2$. Even if $g^2$, which is asymptotically free, blew up at the scale $1/y_c<μ< Λ_{\\rm cutoff}$, $e^2g^2/(e^2+g^2)$ could remain small at low energy by brane matter fields' contribution. The condensations of the gauginos $Ψ^1$ and $Ψ^2$ generate soft mass term of $Ψ^3$ by gravity mediation. △ Less", "We calculate the Yukawa corrections of order ${\\cal O}(α_{ew}m_{t(b)}^2/m_W^2)$, ${\\cal O}(α_{ew}m_{t(b)}^3/m_W^3)$ and ${\\cal O}(α_{ew}m_{t(b)}^4/m_W^4)$ to the widths of the decays $\\tilde t_2\\to \\tilde t_1 + (h^0,H^0,A^0)$ in the Minimal Supersymmetric Standard Model, and perform a detailed numerical analysis. We also compare the results with the ones presented in an earlier literature, where the ${\\cal O}(α_{s})$ SUSY-QCD corrections to the same three decay processes have been calculated. Our numerical results show that for the decays $\\tilde t_2\\to \\tilde t_1 + h^{0}$, $\\tilde t_2\\to \\tilde t_1 + H^{0}$, the Yukawa corrections are significant in most of the parameter range, which can reach a few ten percent, and for the decay $\\tilde t_2\\to\\tilde t_1 + A^{0}$, the Yukawa corrections are relatively smaller, which are only a few percent. The numerical calculations also show that using the running quark masses and the running trilinear coupling $A_t$, which include the QCD, SUSY-QCD, SUSY-Electroweak effects and resume all high order ($\\tanβ$)-enhanced effects, can vastly improve the convergence of the perturbation expansion. We also discuss the effects of the running of the higgsino mass parameter $μ$ on the corrections, and find that they are significant, too, especially for large $\\tanβ$. △ Less", "We discuss two cosmological issues in a generic gauge-mediated supersymmetry (SUSY)-breaking model, namely the Universe's baryon asymmetry and the gravitino dark-matter density. We show that both problems can be simultaneously solved if there exist extra matter multiplets of a SUSY-invariant mass of the order of the ``$μ$-term'', as suggested in several realistic SUSY grand-unified theories. We propose an attractive scenario in which the observed baryon asymmetry is produced in a way totally independent of the reheating temperature of inflation without causing any cosmological gravitino problem. Furthermore, in a relatively wide parameter space, we can also explain the present mass density of cold dark matter by the thermal relics of the gravitinos without an adjustment of the reheating temperature of inflation. We point out that there is an interesting relation between the baryon asymmetry and the dark-matter density. △ Less", "Supersymmetry with bilinear R-parity violation provides a predictive framework for neutrino masses and mixings in agreement with current neutrino oscillation data. The model leads to striking signals at future colliders through the R-parity violating decays of the lightest supersymmetric particle. Here we study charged scalar lepton decays and demonstrate that if the scalar tau is the LSP (i) it will decay within the detector, despite the smallness of the neutrino masses, (ii) the relative ratio of branching ratios Br({tilde tau}_1 --> e sum nu_i)/ Br({tilde tau}_1 --> mu sum nu_i) is predicted from the measured solar neutrino angle, and (iii) scalar muon and scalar electron decays will allow to test the consistency of the model. Thus, bilinear R-parity breaking SUSY will be testable at future colliders also in the case where the LSP is not the neutralino. △ Less", "We study the production of a heavy CP-odd $A^0$ boson in association with a photon $e^+e^-\\to A^0γ$ and a Z boson $e^+e^-\\to A^0 Z$ as well as the single production of $A^0$ via $e^+e^- \\to ν_e\\barν_e A^0$ in the MSSM with CP violating phases. In the case of $e^+e^-\\to A^0γ/ A^0 Z$, we show that the squark contribution, which vanishes in the MSSM with real parameters, turns out to be sizeable in presence of CP violating phases in the soft SUSY parameters. For $e^+e^- \\to ν_e \\barν_e A^0$ in both the 2HDM and MSSM with real parameters, the cross section does not reach observable rates at a NLC. It is found that with a large CP violating phase for $A_t$, cross sections of the order 0.1 fb are attainable for all the processes $e^+e^-\\to A^0γ$, $e^+e^-\\to A^0 Z$ and $e^+e^- \\to ν_e \\barν_e A^0$. △ Less", "The observation of charged lepton flavor non-conservation would be a clear signature of physics beyond the Standard Model. In particular, supersymmetric (SUSY) models introduce mixings in the sneutrino and the charged slepton sectors which could imply flavor-changing processes at rates accessible to upcoming experiments. In this paper we analyze the possibility to observe Z --> lep_I lep_J in the GigaZ option of TESLA at DESY. We show that although models with SUSY masses above the current limits could predict a branching ratio BR(Z --> mu e) accessible to the experiment, they would imply an unobserved rate of mu --> e gamma and thus are excluded. In models with a small mixing angle between the first and the third (or the second and the third) slepton families GigaZ could observe Z --> tau mu (or Z --> tau e) consistently with present bounds on lep_J --> lep_I gamma. In contrast, if the mixing angles between the three slepton families are large the bounds from mu --> e gamma push these processes below the reach of GigaZ. We show that in this case the masses of the three slepton families must be strongly degenerated (with mass differences of order 10^{-3}). We update the limits on the slepton mass insertions delta_{LL,RR,LR} and discuss the correlation between flavor changing and g_mu-2 in SUSY models. △ Less", "We provide a comparison of the results of four SUSY mass spectrum calculations in mSUGRA: Isajet, SuSpect, SoftSusy, and SPheno. In particular, we focus on the high tan(beta) and focus point regions, where the differences in the results are known to be large. △ Less", "Supersymmetry predicts that gauge couplings are equal to the corresponding gaugino-sfermion-fermion Yukawa couplings. This prediction can be tested for the QCD sector of the MSSM by studying the processes eplus+eminus -> squark+antisquark+gluon and eplus+eminus -> squark+antiquark+gluino at a future linear collider. We present results for these processes at next-to-leading order in alpha_s in the framework of the MSSM. We find sizable SUSY-QCD corrections. The renormalization scale dependence is significantly reduced at next-to-leading order. △ Less", "We discuss how an anomalous U(1) symmetry when appended to MSSM and SUSY GUTs [e.g. SU(5)] can help overcome a variety of puzzles related to charged fermion masses and mixings, flavor changing processes, proton decay and neutrino oscillations. Proton lifetime for SU(5) GUT, in particular, is predicted in a range accessible to the ongoing or planned searches. △ Less", "A review is given of CP violation in a broad class of models based on supersymmetry, superstrings and brane models. Such models contain typically large CP violating phases which affect a variety of supersymmetric phenomenon at low energies and affect search for supersymmetry at colliders and in dark matter experiments. We focus here on few such phenomena, specifically the mixing of the CP even and the CP odd Higgs bosons which can be induced by loop corrections and on CP violation in the muon sector. Possible signals for the observation of CP violation are also discussed. △ Less", "We compute the supersymmetric QCD corrections to the decay distribution of polarized top quarks for the semileptonic decay mode $t(\\uparrow)\\to b l^+ν_l$. As a byproduct, we reinvestigate the SUSY-QCD corrections to the total decay width $Γ(t\\to W^+b)$ and resolve a discrepancy between two previous results in the literature. △ Less", "We propose Susy GUTs have a UV attractor at E ~ Lambda_{cU} ~ 10^{17} GeV where gauge symmetries ``confine'' forming singlet condensates at scales E ~ Lambda_{cU}. The length l_U ~ Lambda_{cU}^{-1} characterizies the size of gauge non- singlet particles yielding a picture dual to the Dual Standard model of Vachaspati. This Asymptotic Slavery (AS) fixed point is driven by realistic Fermion Mass(FM) Higgs content which implies AS. This defines a dynamical morphogenetic scenario dependent on the dynamics of UV strong N=1 Susy Gauge-Chiral(SGC) theories. Such systems are already understood in the AF case but ignored in the AS case. Analogy to the AFSGC suggests the perturbative SM gauge group of the Grand Desert confines at GUT scales i.e GUT symmetry is ``non-restored''. Restoration before confinement and self-inconsistency are the two other (less likely) logical possibilities. Truly Minimal (TM) SU(5) and SO(10) models with matter and FM Higgs only are defined; AM (adjoint multiplet type) Higgs may be introduced for a Classical Phase Transition (CPT) description. Renormalizability and R-Parity leave only the low energy (SM) data as free parameters in the TM (Quantum PT) case. Besides ab initio resolution of the Heirarchy problem and choice of Susy vacuum, fresh perspectives on particle elementarity and duality, doublet triplet splitting, proton decay suppression, soft Susy masses etc open up. ``Elastic'' (spin 2 and spin 3/2) fluctuations of the AS (or pleromal) condensate coupling universally to SM particles with length scale l_U ~ l_{Pl} imply an effective N=1 (super)gravity in the Grand Desert, in which gaugino condensates yield soft Susy breaking. The AF dogma must be proven or discarded. △ Less", "The GUT-based approach to physics has been attractive since it was first put forward close to thirty years ago; it has been enriched by new ideas, notably supersymmetry and strings; and there are real hints that it is on the right track, notably from measurements of the weak mixing angle and neutrino masses. In this article (based on my Heinrich Hertz lecture at SUSY 2002 at DESY, June, 2002), some of the arguments for grand unification will be reviewed. △ Less", "The (B_{d}\\longrightarrow ΦK_{s}) process is without tree level decay amplitude . Then the SUSY contributions may be significant . We calculate the neutralino and gluino penguin contributions to the CP violating phase in (SU(5) ) grand unified theory with right-handed neutrino (SU(5)_{RN}) . We find that the SUSY contribution may change the phase in (B_{d}\\longrightarrow ΦK_{s} ). △ Less", "A More flavored Higgs boson arises when the flavor structure encoded in SUSY extensions of the SM is transmited to the Higgs sector. The flavor-Higgs transmition mechanism can have a radiative or mixing origin, as it is illustrated with several examples, and can produce interesting Higgs signatures that can be probed at future high-energy colliders. Within the MSSM, the flavor mediation mechanism can be of radiative type, as it is realized trhough gaugino-slepton loops, which transmit the flavor structture of the soft-breaking sector to the Higgs bosons. In particular we focus on evaluating the contributions from the general trilinear terms to the lepton flavor violating Higgs (LFV) vertices. On the other hand, as an example of flavor mediation through mixing, we discuss an E_6 inspired multi-Higgs model, with an abelian flavor symmetry, where LFV as well as lepton flavor conserving Higgs effects are found to arise, though in this case at tree-level. We find that Tevatron and LHC can provide information on the flavor structure of these models through the detection of the LFV higgs mode h-> tau+mu, while NLC can perform high-precision measurements of the LFC mode h-> tau tau. △ Less", "Rare decays of B and K mesons and CP violations thereof are considered in SUSY models with S_3^3 flavor symmetry. SUSY contributions to epsilon_K and epsilon'/epsilon_K can be large, but not to B0 - B0 bar mixing because of strong constraint from B -> X_d gamma for (delta^d_{13})_{LR}. Still large deviations from the SM predictions are possible in the branching ratio for B -> X_d gamma and direct CP violations therein, even if the KM angle gamma is in the range preferred by the SM CKM fit. Experimental study of B -> X_d gamma is strongly recommended as a probe for new physics with nontrivial flavor structure in the (13) mixing. △ Less", "The new measurement of the anomalous magnetic moment of the muon by the Brookhaven AGS experiment 821 again shows a discrepancy with the Standard Model value. We investigate the consequences of these new data for neutralino dark matter, updating and extending our previous work [E. A. Baltz and P. Gondolo, Phys. Rev. Lett. 86, 5004 (2001)]. The measurement excludes the Standard Model value at 2.6sigma confidence. Taking the discrepancy as a sign of supersymmetry, we find that the lightest superpartner must be relatively light and it must have a relatively high elastic scattering cross section with nucleons, which brings it almost within reach of proposed direct dark matter searches. The SUSY signal from neutrino telescopes correlates fairly well with the elastic scattering cross section. The rate of cosmic ray antideuterons tends to be large in the allowed models, but the constraint has little effect on the rate of gamma ray lines. We stress that being more conservative may eliminate the discrepancy, but it does not eliminate the possibility of high astrophysical detection rates. △ Less", "We investigate, if the cosmic ray positron fraction, as reported by the HEAT and AMS collaborations, is compatible with the annihilation of neutralinos in the supergravity inspired Constrained Minimal Supersymmetric Model (CMSSM), thus complementing previous investigations, which did not consider constraints from unification, electroweak symmetry breaking and the present Higgs limits at LEP. We perform a global fit of all SUSY parameters to low energy constraints and find that in the acceptable parameter regions the neutralino annihilation into b-bbar quark pairs is the dominant channel and improves the fit to the experimental positron fraction data considerably with respect to a fit with background only. These fits are comparable to the fit for regions of parameter space, where the annihilation into W^+ W^- pairs dominates. However, these latter regions are ruled out by the present Higgs limit of 114 GeV from LEP in combination with b->s gamma data. △ Less", "We discuss effects of the light sparticles on decays of the lightest Higgs in a supersymmetric model with nonuniversal gaugino masses at the high scale, focusing on the `invisible' decays into neutralinos. These can impact significanlty the discovery possibilities of the lightest Higgs at the LHC. We show that due to these decays, there exist regions of the $M_2-μ$ space where the B.R. $(h \\to γγ)$ becomes dangerously low even after imposing the LEP constraints on the sparticle masses, implying a possible preclusion of its discovery in the $γγ$ channel. We find that there exist regions in the parameter space with acceptable relic density and where the ratio ${B.R. (h \\to γγ)_{SUSY} \\over B.R. (h \\to γγ)_{SM}}$ falls below 0.6, implying loss of signal in the $γγ$ channel. These regions correspond to $\\tilde χ_1^+, \\tilde χ_2^0$ masses which should be accessible already at the Tevatron. Further we find that considerations of relic density put lower limit on the U(1) gaugino mass parameter $M_1$ independently of $μ, \\tan β$ and $m_0$. △ Less", "We construct a 5D SUSY SU(6) GUT on an $S^{(1)}/Z_2\\tm Z_2'$ orbifold. The first stage of gauge symmetry breaking occurs through compactification and a specific selection of boundary conditions. Additional symmetries play a crucial role for the generation of $μ$ and $Bμ$ terms of appropriate values: with a $SU(2)_{cus}$ custodial symmetry the Higgs doublets naturally emerge as massless pseudo-Goldstone bosons in the unbroken SUSY limit. After SUSY breaking they get masses of the order of the weak scale. If instead of $SU(2)_{cus}$ a discrete $Z_5$ symmetry is applied the Higgs doublet's masses are still adequately suppressed, but they are not pseudo-Goldstones. The $Z_5$ discrete symmetry also can be very important for GUT scale generation and an all order hierarchy. Fermion masses are naturally generated and nicely blend with additional symmetries. In the considered scenario unification of the three gauge couplings occurs near $10^{16}$ GeV. △ Less", "We consider the gluino-mediated SUSY contributions to B0 - B0 bar mixing, B -> J/psi K_S and B -> X_d gamma in the mass insertion approximation. We find the LL mixing parameter can be as large as |delta_{13}^d_{LL}| < 2*10^-1, but the LR mixing is strongly constrained by the B -> X_d gamma branching ratio and we find |delta_{13}^d_{LR}| < 10^-2. The implications for the direct CP asymmetry in B -> X_d gamma and the dilepton charge asymmetry (A_{ll}) are also discussed, where substantial deviations from the standard model predictions are possible. △ Less", "We consider a 5D SUSY $SU(3)_c\\times SU(2)_L\\times U(1)_Y\\times {\\cal U}(1)$ model compactified on an $S^{(1)}/Z_2$ orbifold. To cancel anomalies arising from the presence of ${\\cal U}(1)$, we employ a Chern-Simons term and also chiral fields which could reside on the brane or in the bulk depending on the model. The presence of ${\\cal U}(1)$ symmetry leads to baryon number conservation, gives rise to matter parity, and permits satisfactory neutrino masses and mixings even for a low fundamental scale. The brane Fayet-Iliopoulos D-terms naturally break ${\\cal U}(1)$, leaving N=1 SUSY unbroken in 4 dimensions. △ Less", "The new project GENIUS will cover a wide range of the parameter space of predictions of SUSY for neutralinos as cold dark matter. Together with DAMA it will be the only experiment which can probe the seasonal modulation signal. Concerning hot dark matter GENIUS will be able to fix the (effective) neutrino mass with high accuracy. A GENIUS Test Facility has just been funded and will come into operation by end of 2002. △ Less", "The GENIUS (Germanium in Liquid Nitrogen Underground Setup) project has been proposed in 1997 [KK-BEY97] as first third generation double beta decay project, with a sensitivity aiming down to a level of an effective neutrino mass of <m_ν> < 0.01eV or less. Such sensitivity is important to fix the structure of the neutrino mass matrix with high accuracy, which cannot be done by neutrino oscillation experiments alone. GENIUS will allow broad access also to many other topics of physics beyond the Standard Model of particle physics at the multi-TeV scale. For search of cold dark matter GENIUS will cover a large part of the parameter space of predictions of SUSY for neutralinos as dark matter [Bed-KK2,Ell,KK-LowNu2]. Finally, GENIUS has the potential to be a real-time detector for low-energy (pp and 7{Be}) solar neutrinos [Bau-KK,KK-LowNu2]. A GENIUS-Test Facility has just been funded and will come into operation by end of 2002. △ Less", "The new project GENIUS will cover a wide range of the parameter space of predictions of SUSY for neutralinos as cold dark matter. Further it has the potential to be a real-time detector for low-energy (pp and 7Be) solar neutrinos. A GENIUS Test Facility has just been funded and will come into operation by end of 2002. △ Less", "We study the effects of scalar-pseudoscalar mixing induced from quantum loop on $ε'/ε$ in SUSY models with $\\tanβ\\sim m_{t}/m_{b}$. We find that even the non-universal soft ${\\cal A}^{d}$ term and Yukawa matrix, $Y^{d}$, are hermitian, the predicted value of $|ε'/ε|$ can be consistent with the measured results of NA48 and KTeV. And also the EDMs are compatible with experimental bounds. △ Less", "In this paper we study the polarization asymmetries of the final state lepton in the radiative dileptonic decay of B meson (\\bsllg) in the framework of Minimal Supersymmetric Standard Model (MSSM) and various other unified models within the framework of MSSM e.g. mSUGRA, SUGRA (where condition of universality of scalar masses is relaxed) etc. Lepton polarization, in addition of having a longitudinal component (\\pl), can have two other components, \\pt and \\pn, lying in and perpendicular to the decay plane, which are proportional to \\ml and hence are significant for final state being $μ^+ ~ μ^-$ or $τ^+ \\~τ^-$. We analyse the dependence of these polarization asymmetries on the parameters of the various models. △ Less", "We compute the complete next-to-leading order SUSY-QCD corrections for the associated production of a charged Higgs boson with a top quark via bottom-gluon fusion. We investigate the applicability of the bottom parton description in detail. The higher order corrections can be split into real and virtual corrections for a general two Higgs doublet model and into additional massive supersymmetric loop contributions. We find that the perturbative behavior is well under control. The supersymmetric contributions consist of the universal bottom Yukawa coupling corrections and non-factorizable diagrams. Over most of the relevant supersymmetric parameter space the Yukawa coupling corrections are sizeable, while the remaining supersymmetric loop contributions are negligible. △ Less", "The renormalization group equations (RGEs) of the mass matrices of quarks and leptons in a SO(10) model with two Higgs scalars in the Yukawa coupling are studied. This model is the minimal model of SUSY and non-SUSY SO(10) GUT which can reproduce all the experimental data. Non-SUSY SO(10) GUT model has the intermediate energy phase, Pati-Salam phase, and passes through the symmetry breaking pattern, $SO(10) \\to SU(2)_L \\times SU(2)_R \\times SU(4)_C \\to SU(2)_L \\times U(1)_Y \\times SU(3)_C$. Though minimal, it has, after the Pati-Salam phase, four Higgs doublets in Yukawa interactions. We consider the RGE's of the Yukawa coupling constants of quarks and charged leptons and of the coupling constants of the dimension five operators of neutrinos corresponding to the above symmetry breaking pattern. The scalar quartic interactions are also incorporated. △ Less", "CP violation in the SM is naturally implemented as a small imaginary perturbation to real Yukawa couplings. For example, a large CP asymmetry in B_d decays can arise if the imaginary parts of quark mass matrices are of order 10^(-3)m_t,b or smaller. Applying the same principle of ``additive CP violation'' to soft SUSY-breaking terms, the electric dipole moments of the neutron and mercury atom are predicted near current experimental limits; for nonuniversal A-terms, EDM bounds can be satisfied given certain flavour structures. The proposal is conveniently formulated in a democratic basis, with Yukawas and soft terms of the form const. x (1+eps+i zeta) where eps<<1, zeta<~10^(-3), motivated by approximate permutation x CP symmetry. △ Less", "High resolution N-body simulations have revealed the survival of considerable substructure within galactic halos. Assuming that the predicted dark matter clumps are composed of annihilating neutralinos, we examine their detectability via Atmospheric Cherenkov Telescopes (ACTs). Depending on their density profile, individual neutralino clumps should be observable via their gamma-ray continuum and line emissions. We find that the continuum signal is the most promising signal for detecting a neutralino clump, being significantly stronger than the monochromatic signals. Limits from the line detectability can help lift degeneracies in the supersymmetric (SUSY) parameter space. We show that by combining the observations of different mass clumps, ACTs can explore most of the SUSY parameter space. ACTs can play a complementary role to accelerator and gamma-ray satellite limits by exploring relatively large neutralino masses and less concentrated clumps. We develop a strategy for dark matter clump studies by future ACTs based on VERITAS specifications and encourage the development of techniques to identify primaries. This can reduce the background by an order of magnitude. △ Less", "Recently a class of Type IIA orientifold models was constructed yielding just the fermions of the SM at the intersections of D6-branes wrapping a 6-torus. We generalize that construction to the case of Type IIB compactified on an orientifold of T^4 \\times (C/Z_N) with D5-branes intersecting at angles on T^4. We construct explicit models in which the massless fermion spectrum is just the one of a three-generation Standard Model. One of the motivations for these new constructions is that in this case there are 2 dimensions which are transverse to the SM D5-brane configuration. By making those two dimensions large enough one can have a low string scale M_s of order 1-10 TeV and still have a large M_{Planck} in agreement with observations. From this point of view, these are the first explicit D-brane string constructions where one can achieve having just the fermionic spectrum and gauge group of the SM embedded in a Low String Scale scenario. The cancellation of U(1) anomalies turns out to be quite analogous to the toroidal D6-brane case and the proton is automatically stable due to the gauging of baryon number. Unlike the D6-brane case, the present class of models has N = 0 SUSY both in the bulk and on the branes and hence the spectrum is simpler. △ Less", "Precision electroweak data suggests the existence of a light Standard Model Higgs boson. Its width is very narrow by an accident of the fermion mass hierarchies, and so slight perturbations to the theory induce dramatic changes in the phenomenology of direct Higgs boson production. Several theory ideas motivated by low-scale extra dimensions lead to a universal rate suppression of Higgs boson observables. The Tevatron and LHC will have difficulty accruing compelling evidence for small universal suppression of rate observables, and even more difficulty discerning the underlying cause. A high energy e+e- collider would have relatively little trouble. △ Less", "Recently, refinements have been made on both the theoretical and experimental determinations of the i.) mass of the lightest Higgs scalar (m_h), ii.) relic density of cold dark matter in the universe (Omega_CDM h^2), iii.) branching fraction for radiative B decay BF(b \\to s γ), iv.) muon anomalous magnetic moment (a_μ), and v.) flavor violating decay B_s \\to μ^+μ^-. Each of these quantities can be predicted in the MSSM, and each depends in a non-trivial way on the spectra of SUSY particles. In this paper, we present updated constraints from each of these quantities on the minimal supergravity (mSUGRA) model as embedded in the computer program ISAJET. The combination of constraints points to certain favored regions of model parameter space where collider and non-accelerator SUSY searches may be more focussed. △ Less", "We propose to use T-odd momentum correlations as physical observables to study T violation in $B\\to K^{*}l^{+}l^{-} (l=e,μ)$ decays. We show that these observables are zero in the standard model but sizable at the level of 10% in the supersymmetric model. These large T violating effects are measurable at the B-factories in KEK and SLAC and future hadron colliders. We also point out that the T violating effects are insensitive to nonperturbative QCD contributions. △ Less", "Recently, a new mechanism, which explains why the three gauge coupling constants meet at a certain scale in the minimal supersymmetric standard model, has been proposed in a scenario of grand unified theories with anomalous $U(1)_A$ gauge symmetry. It is a non-trivial result that although there are many superheavy fields whose mass scales are below the unification scale, this mechanism explains this fact by means of one-loop renormalization group equations. Since the unification scale generically becomes below the usual GUT scale, $2\\times 10^{16}$ GeV, and proton decay via dimension 5 operators is suppressed, the scenario predicts that proton decay via dimension 6 operators, $p\\to e π^0$, will be observed in the near future. In this paper, we attempt to estimate a reasonable range of values of the lifetime of the proton predicted within this scenario by using a two-loop renormalization group calculation and the ambiguities of \\order1 coefficients. △ Less", "We compute the one-loop supersymmetric (SUSY) contributions to the weak charges of the electron ($Q_W^e$) and proton ($Q_W^p$) using the Minimal Supersymmetric Standard Model (MSSM). These $q^2=0$ vector couplings of the $Z^0$-boson to fermions will be determined in two fixed-target, parity-violating electron scattering experiments. The SUSY loop contributions to $Q_W^p$ and $Q_W^e$ can be substantial, leading to several percent corrections to the Standard Model values for these quantities. We show that the relative signs of the SUSY loop effects on $Q_W^e$ and $Q_W^p$ are correlated and positive over nearly all of the MSSM parameter space, whereas inclusion of R-parity nonconserving interactions can lead to opposite sign relative shifts in the weak charges. Thus, a comparison of $Q_W^p$ and $Q_W^e$ measurements could help distinguish between different SUSY scenarios. △ Less", "We show that in see-saw models of neutrino mass a la SUSY SO(10), the observed large mixing in atmospheric neutrinos naturally leads to large b-s transitions. If the associated new CP phase turns out to be large, this SUSY contributions can drastically affect the CP violation in some of the B decay channels yielding the beta and gamma angles of the unitarity triangle. They can even produce sizeable CP asymmetries in some decay modes which are not CP violating in the standard model context. Hence the observed large neutrino mixing makes observations of low energy SUSY effect in some CP violating decay channels potentially promising in spite of the agreement between the Standard Model and data in K and B physics so far. △ Less", "A fully realistic unified theory is constructed, with SU(5) gauge symmetry and supersymmetry both broken by boundary conditions in a fifth dimension. Despite the local explicit breaking of SU(5) at a boundary of the dimension, the large size of the extra dimension allows precise predictions for gauge coupling unification, alpha_s(M_Z) = 0.118 \\pm 0.003, and for Yukawa coupling unification, m_b(M_Z) = 3.3 \\pm 0.2 GeV. A complete understanding of the MSSM Higgs sector is given; with explanations for why the Higgs triplets are heavy, why the Higgs doublets are protected from a large tree-level mass, and why the mu and B parameters are naturally generated to be of order the SUSY breaking scale. All sources of d=4,5 proton decay are forbidden, while a new origin for d=6 proton decay is found to be important. Several aspects of flavor follow from an essentially unique choice of matter location in the fifth dimension: only the third generation has an SU(5) mass relation, and the lighter two generations have small mixings with the heaviest generation. The entire superpartner spectrum is predicted in terms of only two free parameters. The squark and slepton masses are determined by their location in the fifth dimension, allowing a significant experimental test of the detailed structure of the extra dimension. Lepton flavor violation is found to be generically large in higher dimensional unified theories with high mediation scales of SUSY breaking. In our theory this forces a common location for all three neutrinos, predicting large neutrino mixing angles. Rates for mu -> e gamma, mu -> e e e, mu -> e conversion and tau -> mu gamma are larger in our theory than in conventional 4D supersymmetric GUTs. Proposed experiments probing mu -> e transitions will probe the entire interesting parameter space of our theory. △ Less", "The formation and late time decays of Q-balls are generic consequences of the Affleck-Dine (AD) baryogenesis. A substantial amount of the lightest supersymmetry (SUSY) particles (LSPs) are produced non-thermally as the decay products of these Q-balls. This requires a significantly large annihilation cross section of the LSP so as not to overclose the universe, which predicts a higgsino- or wino-like LSP instead of the standard bino LSP. We have reexamined the AD baryogenesis with special attention to the late-time decays of the Q-balls, and then specified the parameter regions where the LSPs produced by the Q-ball decays result in a cosmologically interesting mass density of dark matter by adopting several SUSY breaking models. This reveals new cosmologically interesting parameter regions, which have not attracted much attention so far. We have also investigated the prospects of direct and indirect detection of these dark matter candidates, and found that there is an intriguing possibility to detect them in various next generation dark matter searches. △ Less", "The CompHEP software package allows the evaluation of cross section and decays of elementary particles with a high level of automation. Arbitrary tree levelp rocesses can be calculated starting from the set of vertices prescribed by a given physical model. This note describes the details of the Minimal Supersymmetric Standard Model (MSSM) implementation in the CompHEP package, and the notation for the particles and parameters of the MSSM in CompHEP. △ Less", "Exotic dark matter together with the vacuum energy (cosmological constant) seem to dominate in the flat Universe. Thus direct dark matter detection is central to particle physics and cosmology. Supersymmetry provides a natural dark matter candidate, the lightest supersymmetric particle (LSP). Furthermore from the knowledge of the density and velocity distribution of the LSP, the quark substructure of the nucleon and the nuclear structure (form factor and/or spin response function), one is able to evaluate the event rate for LSP-nucleus elastic scattering. The thus obtained event rates are, however, very low. So it is imperative to exploit the two signatures of the reaction, namely the modulation effect, i.e. the dependence of the event rate on the Earth's motion, and the directional asymmetry, i.e. the dependence of the rate on the the relative angle between the direction of the recoiling nucleus and the sun's velocity. These two signatures are studied in this paper employing various velocity distributions and a supersymmetric model with universal boundary conditions at large tan(beta). △ Less", "We discuss the stringy properties of high-energy QCD using its hidden integrability in the Regge limit and on the light-cone. It is shown that multi-colour QCD in the Regge limit belongs to the same universality class as superconformal $\\cal{N}$=2 SUSY YM with $N_f=2N_c$ at the strong coupling orbifold point. The analogy with integrable structure governing the low energy sector of $\\cal{N}$=2 SUSY gauge theories is used to develop the brane picture for the Regge limit. In this picture the scattering process is described by a single M2 brane wrapped around the spectral curve of the integrable spin chain and unifying hadrons and reggeized gluons involved in the process. New quasiclassical quantization conditions for the complex higher integrals of motion are suggested which are consistent with the $S-$duality of the multi-reggeon spectrum. The derivation of the anomalous dimensions of the lowest twist operators is formulated in terms of the Riemann surfaces △ Less", "We address the compatibility of a light sbottom (mass $2\\sim 5.5 \\gev$) and a light gluino (mass $12\\sim 16 \\gev$) with electroweak precision measurements. Such light particles have been suggested to explain the observed excess in the $b$ quark production cross section at the Tevatron. The electroweak observables may be affected by the sbottom and gluino through the SUSY-QCD corrections to the $Zbb$ vertex. We examine, in addition to the SUSY-QCD corrections, the electroweak corrections to the gauge boson propagators from the stop which are allowed to be light from the SU(2)$_L$ symmetry. We find that this scenario is strongly disfavored from electroweak precision measurements unless the heavier sbottom mass eigenstate is lighter than $180\\gev$ and the left-right mixing in the stop sector is sufficiently large. This implies that one of the stops should be lighter than about $98\\gev$. △ Less", "In N = 1 super Yang-Mills theories, under certain conditions satisfied by the spectrum and the Yukawa couplings, the beta functions will vanish to all orders in perturbation theory. We address the generation of realistic quark mixing angles and masses in such finite Grand Unified Theories. Working in the context of finite SUSY SU(5), we present several examples with realistic quark mixing matrices. Non-Abelian discrete symmetries are found to be important in satisfying the conditions for finiteness. Our realistic examples are based on permutation symmetries and the tetrahedral symmetry $A_4$. These examples enable us to address questions such as the decay rate of the proton in finite GUTs. △ Less", "We examine supergravity models with grand unification at M_G possessing R parity invariance. Current data has begun to significantly constrain the parameter space. Thus for mSUGRA, accelerator data places a lower bound on m_{1/2} of m_{1/2} >~300 GeV while astronomical data on the amount of relic dark matter narrowly determines m_0 in terms of m_{1/2} (for fixed value of tanbeta and A_0) due to co-annihilation effects. Additional new data could fix the parameters further. Thus the parameter space is sensitive to the muon magnetic moment anomaly, δa_μ, and if δa_μlies 1 σabove its current central value, it would exclude mSUGRA, while if it lies 1σbelow (but is still positive) it pushes the SUSY spectrum into the TeV domain. The B_s ->μ^+ μ^- decay is seen to be accessible to the Tevatron RunII with branching ratio sensitivity of Br[B_s ->μ^+ μ^-] > 6.5\\times10^{-9} with 15 fb^{-1}/detector, and a value of 7(14)\\times10^{-8} obtainable with 2 fb^{-1} would be sufficient to exclude mSUGRA for tan beta < 50(55). Measurements of B_s ->μ^+ μ^- can cover the full mSUGRA parameter space for tanbeta > 40 if δa_μ> 11\\times10^{-10}, and combined measurements of B_s -> μ^+ μ^-, a_μand m_h (or alternately the gluino mass) would effectively determine the mSUGRA parameters for μ> 0. Detector cross sections are then within the range of planned future dark matter experiments. Non-universal models are also discussed, and it is seen that detector cross sections there can be much larger, and can be in the DAMA data region. △ Less", "In this talk we investigate the dark matter prospects for supersymmetric models with non-universal gaugino masses. We motivate the use of non-universal gaugino masses from several directions, including problems with the current favorite scenario, the cMSSM. We then display new corridors of parameter space that allow an acceptable dark matter relic density once gaugino mass universality is relaxed. We finish with a specific string-derived model that allows this universality relaxation and then use the dark matter constraint to make specific statements about the hidden sector of the model. △ Less", "The gluino contributions to the $C'_{7,8}$ Wilson coefficients for b->sγare calculated within the unconstrained MSSM. New stringent bounds on the \\dRLbs and \\dRRbs mass insertion parameters are obtained in the limit in which the SM and SUSY contributions to $C_{7,8}$ approximately cancel. Such a cancellation can plausibly appear within several classes of SUSY breaking models. Assuming this cancellation takes place, we perform an analysis of the b->sγdecay. We show that, in the unconstrained MSSM such an alternative is reasonable and it is possible to saturate the b->sγbranching ratio and produce a CP asymmetry of up to 20%, from only the gluino contribution to $C'_{7,8}$ coefficients. Using photon polarization a LR asymmetry can be defined that in principle allows the $C_{7,8}$ and $C'_{7,8}$ contributions to the b->sγdecay to be disentangled. △ Less", "We present a new formalism describing the neutralino physics in the context of the minimal supersymmetric model (MSSM), where CP violation induced by complex $M_1$ and $μ$ parameters is allowed. The formalism is based on the construction of neutralino projectors, and can be directly generalized to non-minimal SUSY models involving any number of neutralinos. It extends a previous work applied to the real SUSY parameter case. In MSSM, the method allows to describe all physical observables related to a specific neutralino, in terms of its CP eigenphase and three complex numbers called its \"reduced projector elements\". As the experimental knowledge on the neutralino-chargino sectors will be being accumulated, the problem of extracting the various SUSY parameters will arise. Motivated by this, we consider various scenarios concerning the quantities that could be first measured. Analytical disentangled expressions determining the related SUSY parameters from them, are then derived, which also emphasize the efficiency of the formalism. △ Less", "We study whether the individual violation of the lepton numbers L_{e,mu,tau} in the charged sector can lead to measurable rates for BR(mu->e gamma) and BR(tau->mu gamma). We consider three different scenarios, the fist one corresponds to the Minimal Supersymmetric Standard Model with non-universal soft terms. In the other two cases the violation of flavor in the leptonic charged sector is associated to the neutrino problem in models with a see-saw mechanism and with R-parity violation respectively. △ Less", "Recently, extra dimensional SUSY GUT models have been proposed in which compactification of the extra dimension(s) leads to a breakdown of the gauge symmetry and/or supersymmetry. We examine a particular class of higher-dimensional models exhibiting supersymmetry and SU(5) or SO(10) GUT symmetry. SUSY breaking occurs on a hidden brane, and is communicated to the visible brane via gaugino mediation. Non-universal gaugino masses are developed at the compactification scale as a consequence of a restricted gauge symmetry on the hidden brane. In this case, the compactification scale is at or slightly below the GUT scale. We examine the parameter space of such models where gaugino masses are related due to a Pati-Salam symmetry on the hidden brane. We find limited but significant regions of model parameter space where a viable spectra of SUSY matter is generated. Our results are extended to the more general case of three independent gaugino masses; here we find that large parameter space regions open up for large values of the U(1) gaugino mass M_1. We also find the relic density of neutralinos for these models to be generally below expectations from cosmological observations, thus leaving room for hidden sector states to make up the bulk of cold dark matter. Finally, we evaluate the branching fraction BF(b -> s gamma) and muon anomalous magnetic moment a_μ. △ Less", "We discuss the embedding of R-Parity preserving Minimal Left Right Supersymmetric models into Pati-Salam and SO(10) GUTs. △ Less", "We investigate quark flavor signals in three different supersymmetric models, the minimal supergravity, the SU(5) SUSY GUT with right handed neutrinos, and the minimal supersymmetric standard model with U(2) flavor symmetry, in order to study physics potential of the present and future $B$ factories. We evaluate CP asymmetries in various B decay modes, $Δm_{B_s}$, $Δm_{B_d}$, and $ε_K$. The allowed regions of the CP asymmetry in $B\\to J/ψK_S$ and $Δm_{B_s}/Δm_{B_d}$ are different for the three models so that precise determinations of these observables in near future experiments are useful to distinguish the three models. We also investigate possible deviations from the standard model predictions of CP asymmetries in other B decay modes. In particular, a large deviation is possible for the U(2) model. The consistency check of the unitarity triangle including $B\\to ππ,ρπ,D^{(*)}K^{(*)},D^{(*)}π,D^{*}ρ$, and so on, at future high luminosity $e^+e^-$ $B$ factories and hadronic $B$ experiments is therefore important to distinguish flavor structures of different supersymmetric models. △ Less", "We study gauge coupling unification and various phenomenological issues, such as baryon number conservation, the $μ$ problem and neutrino anomalies, within SUSY 5D orbifold models. The 5D MSSM on an $S^{(1)}/Z_2$ orbifold with 'minimal' field content does not lead to low scale unification, while some of its extensions can give unification near the multi TeV scale. Within the orbifold SU(5) GUT, low scale unification can not be realized due to full SU(5) multiplets participating in the renormalization above the compactification scale. As alternative examples, we construct 5D N=1 SUSY Pati-Salam $SU(4)_c\\tm SU(2)_L\\tm SU(2)_R\\equiv G_{422}$ and flipped $SU(5)\\tm U(1)\\equiv G_{51}$ GUTs [both maximal subgroups of SO(10)] on an $S^{(1)}/Z_2\\tm Z_2'$ orbifold. New examples of low scale unifications within $G_{422}$ are presented. For $G_{51}$ the unification scale is shown to be necessarily close to $\\sim 10^{16}$ GeV. The possible influence of brane couplings on the gauge coupling unification is also outlined. For the resolution of the various phenomenological problems extensions with a discrete ${\\cal Z}$ symmetry turn out to be very effective. △ Less", "In the minimal supersymmetric standard model (MSSM) properties of the third generation sfermions are important from the viewpoint of discriminating the SUSY breaking models and in the determination of the Higgs boson mass. If gluinos are copiously produced at CERN LHC, gluino decays into tb through stop and sbottom can be studied using hadronic decays of the top quark. The kinematical endpoint of the gluino decays can be evaluated using a W sideband method to estimate combinatorial backgrounds. This implies that fundamental parameters related to the third generation squarks can be reliably measured. The top-quark polarization dependence in the decay process may also be extracted by looking at the b jet distribution near the kinematical endpoint. △ Less", "We discuss the fermion mass hierarchy and the flavor mixings in the fat brane scenario of a five dimensional SUSY theory. Assuming that the matter fields lives in the bulk, their zero mode wave functions are Gaussians, and Higgs fields are localized on the brane, we find simple various types of the matter configurations generating the mass matrices consistent with experimental data. Sfermion mass spectrum is also discussed using the matter configurations found above. Which type of squark mass spectra (the degeneracy, the decoupling and the alignment) is realized depends on the relative locations of SUSY breaking brane and the brane where Higgs fields are localized. △ Less", "We examine the virtual effects of Kaluza-Klein (KK) states on Higgs physics in universal extra dimension models. We study the partial widths $Γ_{h \\to gg}$, $Γ_{h \\to γγ}$, and $Γ_{h \\to γZ}$, which are relevant for Higgs production and detection in future collider experiments. These interactions occur at one loop in the Standard Model, as do the KK contributions. We find that the deviations induced by the KK exchanges can be significant; for one extra dimension, the $gg \\to h$ production rate is increased by $10% - 85%$ for the mass of the first KK state in the range $500 \\gsim m_1 \\gsim 1500$ GeV, a region untested by current direct search and precision measurement constraints. The $h \\to γγ$ decay width is decreased by $\\lsim 20%$ in the same mass range. For two or more universal extra dimensions the results are cutoff dependent, and can only be qualitatively estimated. We comment on the detectability of these shifts at the LHC and at future $e^+ e^-$ and $γγ$ colliders. △ Less", "We consider gravity mediated supersymmetry (SUSY) breaking in 5D spacetime with two 4D branes B1 and B2 separated in the extra dimension. Using an off-shell 5D supergravity (SUGRA) formalism, we argue that the SUSY breaking scales could be non-universal even at the fundamental scale in a brane world setting, since SUSY breaking effects could be effectively localized. As an application, we suggest a model in which the two light chiral MSSM generations reside on B1, while the third generation is located on B2, and the Higgs multiplets as well as gravity and gauge multiplets reside in the bulk. For SUSY breaking of the order of 10--20 TeV caused by a hidden sector localized at B1, the scalars belonging to the first two generations can become sufficiently heavy to overcome the SUSY flavor problem. SUSY breaking on B2 from a different localized hidden sector gives rise to the third generation soft scalar masses of the order of 1 TeV. Gaugino masses are also of the order of 1 TeV if the size of the extra dimension is $\\sim 10^{-16}$ ${\\rm GeV}^{-1}$. As in 4D effective supersymmetric theory, an adjustment of TeV scale parameters is needed to realize the 100 GeV electroweak symmetry breaking scale. △ Less", "Report of the \"Beyond the Standard Model\" working group for the Workshop `Physics at TeV Colliders', Les Houches, France, 21 May - 1 June 2001. It consists of 18 separate parts: 1. Preface; 2. Theoretical Discussion; 3. Numerical Calculation of the mSUGRA and Higgs Spectrum; 4. Theoretical Uncertainties in Sparticle Mass Predictions; 5. High Mass Supersymmetry with High Energy Hadron Colliders; 6. SUSY with Heavy Scalars at LHC; 7. Inclusive Study of MSSM in CMS; 8. Establishing a No-Lose Theorem for NMSSM Higgs Boson Discovery at the LHC; 9. Effects of Supersymmetric Phases on Higgs Production in Association with Squark Pairs in the Minimal Supersymmetric Standard Model; 10. Study of the Lepton Flavour Violating Decays of Charged Fermions in SUSY GUTs; 11. Interactions of the Goldstino Supermultiplet with Standard Model Fields; 12. Attempts at Explaining the NuTeV Observation of Di-Muon Events; 13. Kaluza-Klein States of the Standard Model Gauge Bosons: Constraints From High Energy Experiments; 14. Kaluza-Klein Excitations of Gauge Bosons in the ATLAS Detector; 15. Search for the Randall Sundrum Radion Using the ATLAS Detector; 16. Radion Mixing Effects on the Properties of the Standard Model Higgs Boson; 17. Probing Universal Extra Dimensions at Present and Future Colliders; 18. Black Hole Production at Future Colliders. △ Less", "The formalism for the neutrinoless muon positron conversion is investigated in detail and the relevant nuclear matrix elements for light intermediate neutrinos in the case of the experimentally interesting A=27 system are calculated. The nucleus is going to be used as a stopping target in the MECO experiment at Brookhaven, one of the most sensitive probes expected to reach a sensitivity in the branching ratio within the next few years, which will be an improvement of three orders of magnitude. The relevant transition operators are constructed utilizing a variety of mechanisms present in current gauge theories, with emphasis on the intermediate neutrinos, both light and heavy, and heavy SUSY particles. The nuclear wave functions, both for the initial state and all excited final states are obtained in the framework of 1s-0d shell model employing the well-known and tested Wildenthal realistic interaction. In the case of the light intermediate neutrinos the transition rates to all excited final states up to 25 MeV in energy are calculated. We find that the imaginary part of the amplitude is dominant. The total rate is calculated by summing over all these partial transition strengths. We also find that the rate due to the real part of the amplitude is much smaller than the corresponding quantity found previously by the closure approximation. △ Less", "We study examples of chiral four-dimensional IIB orientifolds with Scherk--Schwarz supersymmetry breaking, based on freely acting orbifolds. We construct a new Z3xZ3' model, containing only D9-branes, and rederive from a more geometric perspective the known Z6'xZ2' model, containing D9, D5 and \\bar D 5 branes. The cancellation of anomalies in these models is then studied locally in the internal space. These are found to cancel through an interesting generalization of the Green--Schwarz mechanism involving twisted Ramond--Ramond axions and 4-forms. The effect of the latter amounts to local counterterms from a low-energy effective field theory point of view. We also point out that the number of spontaneously broken U(1) gauge fields is in general greater than what expected from a four-dimensional analysis of anomalies. △ Less", "By employing D6-branes intersecting at angles in $D = 4$ type I strings, we construct the first examples of three generation string GUT models (PS-A class), that contain at low energy exactly the standard model spectrum with no extra matter and/or extra gauge group factors. They are based on the group $SU(4)_C \\times SU(2)_L \\times SU(2)_R$. The models are non-supersymmetric, even though SUSY is unbroken in the bulk. Baryon number is gauged and its anomalies are cancelled through a generalized Green-Schwarz mechanism. We also discuss models (PS-B class) which at low energy have the standard model augmented by an anomaly free U(1) symmetry and show that multibrane wrappings correspond to a trivial redefinition of the surviving global U(1) at low energies. There are no colour triplet couplings to mediate proton decay and proton is stable. The models are compatible with a low string scale of energy less that 650 GeV and are directly testable at present or future accelerators as they predict the existence of light left handed weak fermion doublets at energies between 90 and 246 GeV. The neutrinos get a mass through an unconventional see-saw mechanism. The mass relation $m_e = m_d$ at the GUT scale is recovered. Imposing supersymmetry at particular intersections generates non-zero Majorana masses for right handed neutrinos as well providing the necessary singlets needed to break the surviving anomaly free U(1), thus suggesting a gauge symmetry breaking method that can be applied in general left-right symmetric models. △ Less", "We analyze a recently constructed class of D-brane theories with the fermion spectrum of the SM at the intersection of D6-branes wrapping a compact toroidal space. We show how the SM Higgs mechanism appears as a brane recombination effect in which the branes giving rise to U(2)_L \\times U(1) recombine into a single brane related to U(1)_{em}. We also show how one can construct D6-brane models which respect some supersymmetry at every intersection. These are quasi-supersymmetric models of the type introduced in hep-th/0201205 which may be depicted in terms of SUSY-quivers and may stabilize the hierarchy between the weak scale and a fundamental scale of order 10-100 TeV present in low string scale models. Several explicit D6-brane models with three generations of quarks and leptons and different SUSY-quiver structure are presented. One can prove on general grounds that if one wants to build a (factorizable) D6-brane configuration with the SM gauge group and N = 1 SUSY (or quasi-SUSY), also a massless (B-L) generator must be initially present in any model. If in addition we insist on lef- and right-handed fermions respecting the same N=1 SUSY, the brane configurations are forced to have intersections giving rise to Higgs multiplets, providing for a rationale for the very existence of the SM Higgs sector. △ Less", "On the evaluation of $\\tanβ$ is revisited by the method of the renormalization group with the criteria of the bottom-tau unification in the SUSY SU(5) GUT model. Among the conventional supersymmetric theories, an energy-scale constant $M_{SUSY}$ is introduced by-hand to decouple the lower energy-scale region from the effects of the supersymmetric particles. Provided that $M_{SUSY}$ really exists, only small $\\tanβ \\simeq 2$ is allowed theoretically. While, medium value as $\\tanβ = 6 \\sim 25$ is also supported if $M_{SUSY}$ is vanished away from the model. △ Less", "We study the associated production of the charged Higgs boson and W^{\\pm} gauge boson in high energy e+e- collisions in the Minimal Supersymmetric Standard Model (MSSM). This associated production, which first arises at the one loop level, offers the possibility of producing the charged Higgs boson at the e+e- collider with mass more than half the center-of-mass energy, when the charged Higgs pair production is kinematically forbidden. We present analytic and numerical results for the cross section for e+e- --> W+ H- in the full MSSM, taking into account the previously uncalculated contributions from supersymmetric (SUSY) particles. We find that the contributions of the SUSY particles enhance the cross section over most of SUSY parameter space, especially when the SUSY particles are light, ~200 GeV. With favorable SUSY parameters, at small tan beta, this process can yield more than ten W^{\\pm}H^{\\mp} events for m_{H^{\\pm}} <~ 350 GeV in 500 fb-1 at a 500 GeV e+e- collider, or m_{H^{\\pm}} <~ 600 GeV in 1000 fb-1 at a 1000 GeV collider. 80% left-handed polarization of the e- beam improves these reaches to m_{H^{\\pm}} <~ 375 GeV and m_{H^{\\pm}} <~ 670 GeV, respectively. △ Less", "We present a detailed analysis on the possible maximal value of the muon (g-2) (= 2 a_mu) within the context of effective SUSY models with R parity conservation. First of all, the mixing among the second and the third family sleptons can contribute at one loop level to the a_mu(SUSY) and tau -> mu gamma simultaneously. One finds that the a_mu(SUSY) can be as large as (10-20)*10^-10 for any tan beta, imposing the upper limit on the tau -> mu gamma branching ratio. Furthermore, the two-loop Barr-Zee type contributions to a_mu(SUSY) can be significant for large tan beta, if a stop is light and mu and A_t are large enough (O(1) TeV). In this case, it is possible to have a_mu(SUSY) upto O(10)*10^-10 without conflicting with tau -> l gamma. We conclude that the possible maximal value for a_mu(SUSY) is about 20*10^-10 for any tan beta. Therefore the BNL experiment on the muon a_mu can exclude the effective SUSY models only if the measured deviation is larger than \\sim 30*10^-10. △ Less", "The flavor changing decay Z -> d_I \\bar{d}_J is investigated with special emphasis on the b \\bar{s} final state. Various models for flavor violation are considered: two Higgs doublet models (2HDM's), supersymmetry (SUSY) with flavor violation in the up and down-type squark mass matrices and SUSY with flavor violation mediated by R-parity-violating interaction. We find that, within the SUSY scenarios for flavor violation, the branching ratio for the decay Z -> b \\bar{s} can reach 10^{-6} for large \\tanβvalues, while the typical size for this branching ratio in the 2HDM's considered is about two orders of magnitudes smaller at best. Thus, flavor changing SUSY signatures in radiative Z decays such as Z -> b \\bar{s} may be accessible to future ``Z factories'' such as a Giga-Z version of the TESLA design. △ Less", "The sensitivity of the ATLAS detector to the discovery of a heavy charged Higgs boson is presented. Assuming a heavy SUSY spectrum, the most promising channels above the top quark mass are $H^\\pm\\to tb$ and $H^\\pm\\toτ^\\pmν_τ$ which provide coverage in the low and high $\\tanβ$ regions up to $\\sim 600$ GeV. The achievable precisions on the charged Higgs mass and $\\tanβ$ determination are also discussed. The $H^\\pm\\to W^\\pm h^0$ channel, though restricted to a small MSSM parameter space, shows a viable signal in NMSSM where the parameter space is less constrained. The observation of the channel $H^-\\toτ^-_Lν_τ+ c.c.$ may constitute a distinctive evidence for models with singlet neutrinos in large extra dimensions. △ Less", "In order to evade the proton decay which appears when the Zee model is embedded into a SUSY GUT scenario with R-parity violation, a new idea based on a discrete Z_2 symmetry is proposed. Under the symmetry Z_2, the quark and lepton mass matrices are tightly constrained. The admissible form of the radiatively-induced neutrino mass matrix is investigated. △ Less", "A measurement of the branching ratio for the rare decay mode B_s->mu mu at the Tevatron is an opportunity to test various supersymmetric scenarios. We investigate the prospects for studying this mode in Run II and estimate that CDF would be sensitive to this decay for a branching ratio > 1.2 \\times 10^{-8} with 15 \\invfb (or, if a similar analysis holds for D0, >6.5\\times 10^{-9} for the combined data). We calculate the branching ratio in minimal supergravity (mSUGRA) parameter space, and find that tanβ> 30 can be probed. (This mSUGRA parameter space cannot be probed by direct production of SUSY particles at Run II.) Including other experimental constraints on the mSUGRA parameter space, one finds that CDF \\bsmumu measurements would be able to cover the full mSUGRA parameter space for tanβ= 50 if the muon g_μ - 2 anomaly exceeds \\sim 11 \\times 10^{-10}, and about half the allowed parameter space for tanβ= 40. A large branching ratio > 7(14) \\times 10^{-8} (feasible with only 2 \\invfb) would be sufficient to exclude the mSUGRA model for tanβ\\leq 50(55). Dark matter neutralino-proton detection cross sections are examined in the allowed region, and should be large enough to be accessible to future planned experiments. Combined measurements of \\bsmumu the Higgs mass m_h and the muon g_μ-2 anomaly would be sufficient to determine the μ>0 mSUGRA parameters (or show the model is inconsistent with the data). We also briefly discuss the \\bsmumu decay in R parity violating models. There, for some models, the branching ratio can be large enough to be detected even for small tanβand large \\mhalf. △ Less", "We point out consequences of the assumption that supersymmetry breaking is of cosmological origin. △ Less", "The characteristic property of the Z2XZ2 orbifold compactification is the cyclic permutation symmetry between the three twisted sectors. We discuss how this property, which is retained in a class of realistic free fermionic string models, may be instrumental in enabling fermion mass hierarchy while ensuring sfermion mass degeneracy, irrespective of the dominant source of supersymmetry breaking. The cyclic symmetry is reflected in some models in the existence of a family universal anomalous U(1)_A. We analyze the FCNC and CP violation effects in a model with a dominant U(1)_A SUSY breaking. In this theories, new sources of FC are always suppressed with respect to the average sfermion masses. We make a phenomenological analysis of these effects and find that in most of the cases they are in qualitative agreement with the phenomenological limits. The most sensitive low-energy observables to these new FC sources are the $ε_K$ parameter, measuring indirect CP violation in neutral kaon mixing and EDMs. These observables set important constraints on the structure of the sfermion mass matrices, but do not require a large fine-tuning of the initial parameters and can be satisfied in most realistic constructions. △ Less", "We investigate the production of a heavy charged Higgs boson at hadron colliders within the context of the MSSM. A detailed study is performed for all important production modes and basic background processes for the t\\bar{t}b\\bar{b} signature. In our analysis we include effects of initial and final state showering, hadronization, and principal detector effects. For the signal production rate we include the leading SUSY quantum effects at high \\tanβ>~ mt/mb. Based on the obtained efficiencies for the signal and background we estimate the discovery and exclusion mass limits of the charged Higgs boson at high values of \\tanβ. At the upgraded Tevatron the discovery of a heavy charged Higgs boson (MH^+ >~ 200 GeV) is impossible for the tree-level cross-section values. However, if QCD and SUSY effects happen to reinforce mutually, there are indeed regions of the MSSM parameter space which could provide 3σevidence and, at best, 5σcharged Higgs boson discovery at the Tevatron for masses M_H^+<~ 300 GeV and M_H^+<~ 250 GeV, respectively, even assuming squark and gluino masses in the (500-1000) GeV range. On the other hand, at the LHC one can discover a H^+ as heavy as 1 TeV at the canonical confidence level of 5σ; or else exclude its existence at 95% C.L. up to masses ~ 1.5 TeV. Again the presence of SUSY quantum effects can be very important here as they may shift the LHC limits by a few hundred GeV. △ Less", "We use an n-dimensional projection method to calculate helicity amplitudes for photon-photon scattering up to the two-loop level, for massless particles inside the loop. We confirm the recent standard model results found by Bern et al using another calculational method. We further apply the method to N=1 and N=2 supersymmetric QED. As predicted by the supersymmetric Ward identity, two of the independent amplitudes vanish. The remaining amplitude simplifies as the number of supersymmetries increases. For N=2 SUSY QED, only contributions of weight 4 remain. △ Less", "Supersymmetric models often predict a lightest superpartner (LSP) which is electrically charged and stable on the timescales of collider experiments. If such a particle were to be observed experimentally, is it possible to determine whether or not it is stable on cosmological timescales? Charged, stable particles are usually considered to be excluded by cosmological arguments coupled with terrestrial searches for anomalously heavy water molecules. But when the cosmology is significantly altered, as can happen in models with large extra dimensions, these arguments are in turn significantly weakened. In this paper we suggest an alternate way to use searches for superheavy water to constrain the lifetimes of long-lived, charged particles, independent of most cosmological assumptions. By considering SUSY production by cosmic rays in the upper atmosphere, we are able to use current bounds on superheavy water to constrain the mass scale of squarks and gluinos to be greater than about 230 GeV, assuming a stable, charged LSP. This bound can be increased, but only by significantly increasing the size of the initial water sample tested. △ Less", "The ``Snowmass Points and Slopes'' (SPS) are a set of benchmark points and parameter lines in the MSSM parameter space corresponding to different scenarios in the search for Supersymmetry at present and future experiments. This set of benchmarks was agreed upon at the 2001 ``Snowmass Workshop on the Future of Particle Physics'' as a consensus based on different existing proposals. △ Less", "We analyse the contributions to the charge asymmetry in $K^\\pm\\toπ^\\pm\\ell^+\\ell^-$ decays induced by gluino-exchange diagrams in the context of supersymmetric models with generic flavour couplings. We show that sizeable deviations with respect to the Standard Model are possible only under special circumstances. Within this scenario we set an upper limit of about $10^{-3}$ for the relative charge asymmetry -- integrated for $M_{\\ell^+\\ell^-} > 2 M_π$ -- of both muon and electron channels. We also show that this limit is close to saturating a model-independent upper bound on the charge asymmetry derived from the present constraints on $Γ(K_L \\toπ^0 \\ell^+ \\ell^-)$. △ Less", "We analyse the CP violation in supersymmetric models with Hermitian Yukawa and trilinear couplings. We show that Hermitian Yukawa matrices can be implemented in supersymmetric models with SU(3) flavor symmetry. An important feature of this class of models is that the supersymmetric contributions to the EDM of the neutron and mercury atom are suppressed. In this framework, epsilon_K can be saturated by a small non--universality of the soft scalar masses through the gluino contribution. We perform a detailed analysis for the supersymmetric contributions to epsilon'/epsilon. Although, the gluino contribution is found to be negligible due to a severe cancellation between LR and RL mass insertions, the chargino contribution can be significant and accommodate the experimental results. Additionally, we find that the SUSY contributions to epsilon'/epsilon from the effective \\bar{s}dZ vertex and the ΔI =3/2 operators are insignificant. We point out that the standard model gives the leading contribution to the CP asymmetry in B -> ψK_S decay, while the dominant chargino contribution to this asymmetry is < 0.2 . Thus, no constraint is set on the non--universality of this model by the recent BaBar and Belle measurements. △ Less", "We discuss the decoupling solution to SUSY flavor problem in the fat brane scenario. We present a simple model to yield the decoupling sfermion spectrum in a five dimensional theory. Sfermion masses are generated by the overlap between the wave functions of the matter fields and the chiral superfields on the SUSY breaking brane. Two explicit examples of the spectrum are given. △ Less", "We suggest simple models which produce the suitable fermion mass hierarchies and flavor mixing angles based on the supersymmetric SO(10) grand unified theory in 6 dimensions compactified on a T^2/Z_2 orbifold. The gauge and Higgs fields propagate in 6 dimensions while ordinal chiral matter fields are localized in 4 dimensions. We introduce extra vector-like heavy fields in the extra dimensions. We show three models according to the configurations of vector-like fields in extra dimensions. The suitable fermion mass hierarchies and flavor mixings are generated by integrating out these vector-like heavy fields. △ Less", "We study the rare kaon decays in the framework of general SUSY models. Unlike the results in the literature, we find the contributions from the gluino exchange to the branching ratio of $K^+\\to π^+ ν\\barν$ can reach the central value ($\\sim 1.5 \\times 10^{-10}$) of the new E787 data while the predicted value of standard model is less than $10^{-10}$. We also find that the same effects also enhance the decays of $K_{L}\\to π^0 ν\\barν$, $K_L\\toπ^0e^{+} e^{-}$ and $K_L\\toμ^+ μ^-$. △ Less", "We consider N=1 SUSY gauge theory in six dimensions in components and show that provided the Dynkin indices of the matter fields representations satisfy the relation $\\sum T(R)= C_2(G)$, the gauge sector is completely one-loop finite. In the matter sector the UV divergences form several invariant structures some of which are cancelled in physical amplitudes. Thus, the theory which is in general non-renormalizable may be consistent and even finite. Consequences for the SUSY GUT models in the bulk are briefly discussed. △ Less", "The simplest unified extension of the Minimal Supersymmetric Standard Model with bilinear R-Parity violation provides a predictive scheme for neutrino masses which can account for the observed atmospheric and solar neutrino anomalies. Despite the smallness of neutrino masses R-parity violation is observable at present and future high-energy colliders, providing an unambiguous cross-check of the model. △ Less", "Measurement of Lepton-Flavor Violation (LFV) in the minimal SUSY Standard Model (MSSM) at Large Hadron Collider (LHC) is studied based on a realistic simulation. We consider the LFV decay of the second-lightest neutralino, $\\tildeχ^0_2 \\to \\tilde{l} l' \\to l l' \\tildeχ^0_1$, in the case where the flavor mixing exists in the right-handed sleptons. We scan the parameter space of the minimal supergravity model (MSUGRA) and a more generic model in which we take the Higgsino mass $μ$ as a free parameter. We find that the possibility of observing LFV at LHC is higher if $μ$ is smaller than the MSUGRA prediction; the LFV search at LHC can cover the parameter range where the $μ\\to e γ$ decay can be suppressed by the cancellation among the diagrams for this case. △ Less", "We study the T violating effects in the baryonic decays of $Λ_b\\toΛl^+l^- (l=e ,μ)$ with polarized $Λ$. We show that the transverse $Λ$ polarizations in these baryonic decays could be as large as 50% in CP violating theories beyond the standard model such as the SUSY models, which can be tested in various future hadron colliders. △ Less", "The radiative decay of neutrino,such as (\\bar{ν_τ}: \\longrightarrow: ν_μ+γ), in the minimal supersymmetric standard model with right-handed neutrinos (MSSMRN) and in the (SU(5)) grand unified theory with right-handed neutrinos((SU(5)RN))model is examined.In these models,the transition magnetic moment of neutrino is directly proportional to the neutrino mass.For different values on SUSY parameters (compatible with the relic density) and for large mixing angle solution to the atmospheric neutrino problem,the transition magnetic moment can be a few times greater than,or comparable to,the value of the standard model (with a right-handed neutrino singlet added). △ Less", "The chargino pair production processes at $e^+e^-$ collisions are explored to reconstruct the fundamental SUSY parameters: the SU(2) gaugino parameter $M_2$, the higgsino mass parameter $μ$ and $\\tanβ$. Both CP-conserving and CP-violating SUSY sectors are discussed. △ Less", "We study the direct CP asymmetry of the decays b -> s gamma and b -> d gamma in the context of two models: i) a supersymmetric (SUSY) model with unconstrained SUSY phases, and ii) a model with a single generation of vector quarks. In both the above models we show that b -> d gamma can sizeably influence the combined asymmetry (i.e. that of a sample containing both b -> s gamma and b -> d gamma), and in case (ii) may in fact be the dominant contribution. △ Less", "Noscale supersymmetry (SUSY) breaking model is investigated in the minimal extension of the minimal supersymmetric standard model (MSSM) with a gauged U(1)_{B-L} symmetry. We specifically consider a unification-inspired model with the gauge groups SU(3)_{C} \\times SU(2)_{L} \\times U(1)_Y \\times U(1)_{B-L} \\subset SU(5) \\times U(1)_{5} for illustration. While the noscale boundary condition at the grand unification scale (M_{G}\\simeq 2\\times 10^{16} GeV) in the MSSM is not consistent with phenomenological constraints, we show that it is if the gaugino of the U(1)_{5} multiplet is several times heavier than the gauginos of the MSSM. However, if SU(5) \\times U(1)_{5} is further embedded in a larger simple group, e.g. SO(10), the noscale boundary condition at M_{G} is inconsistent with phenomenological constraints. If we relax the noscale boundary condition and allow non-zero soft scalar masses for the Higgs fields which spontaneously break the U(1)_{5} symmetry, the resultant spectrum of SUSY particles becomes consistent with all the phenomenological constraints, even if we impose the GUT relation on the gauge coupling and the gaugino mass of the U(1)_{5}. In this case, the SUSY CP problem is also solved, since the condition Bμ=0 at the boundary can be imposed consistently with the electroweak symmetry breaking. △ Less", "One-loop SUSY QCD radiative correction to $gb \\to tH^{-}$ cross section is calculated in the Minimal Supersymmetric Standard Model. We found that SUSY QCD is non-decoupling if the gluino mass and the parameter $μ$, $A_t$ or $A_b$ are at the same order and get large. The non-decoupling contribution can be enhanced by large $\\tanβ$ and therefore large corrections to the hadronic production rates at the Tevatron and LHC are expected in the large $\\tanβ$ limit. The fundamental reason for such non-decoupling behavior is found to be some couplings in the loops being proportional to SUSY mass parameters. △ Less", "We investigate whether the Affleck-Dine mechanism can produce sufficient baryon number of the universe in the gauge-mediated SUSY breaking models, while evading the cosmological moduli problem by late-time entropy production. We find that the Q-ball formation makes the scenario difficult, irrespective of the detail mechanism of the entropy production. △ Less", "We present a class of simple scalar-tensor models of gravity with one scalar field (dilaton $Φ$) and only one unknown function (cosmological potential $U(Φ)$). These models might be considered as a stringy inspired ones with broken SUSY. They have the following basic properties: 1) Positive dilaton mass, $m_Φ$, and positive cosmological constant $Λ$, define two extremely different scales. The models under consideration are consistent with the known experimental facts if $m_Φ> 10^{-3} eV$ and $Λ=Λ^{obs}\\sim 10^{-56} cm^{-2}$. 2) Einstein week equivalence principle is strictly satisfied and extended to scalar-tensor theories of gravity using a novel form of principle of \"constancy of fundamental constants\". 3) The dilaton plays simultaneously role of inflation field and quintessence field and yields a sequential hyper-inflation with graceful exit to asymptotic de Sitter space-time which is an attractor, and is approached as $\\exp(-\\sqrt{3Λ^{obs}} ct/2)$. The time duration of inflation is $Δt_{infl} \\sim m_Φ^{-1}$. 4) Ultra-high frequency ($ω_Φ\\sim m_Φ$) dilatonic oscillations take place in asymptotic regime. 5) No fine tuning. (The Robertson-Walker solutions of general type have the above properties.) 6) A novel adjustment mechanism for cosmological constant problem seems to be possible: the huge value of cosmological constant in the stringy frame is re-scaled to its observed value by dilaton after transition to phenomenological frame. △ Less", "String and M-theory realizations of brane world supersymmetry breaking scenarios are considered in which visible sector Standard Model fields are confined on a brane, with hidden sector supersymmetry breaking isolated on a distant brane. In calculable examples with an internal manifold of any volume the Kahler potential generically contains brane--brane non-derivative contact interactions coupling the visible and hidden sectors and is not of the no-scale sequestered form. This leads to non-universal scalar masses and without additional assumptions about flavor symmetries may in general induce dangerous sflavor violation even though the Standard Model and supersymmetry branes are physically separated. Deviations from the sequestered form are dictated by bulk supersymmetry and can in most cases be understood as arising from exchange of bulk supergravity fields between branes or warping of the internal geometry. Unacceptable visible sector tree-level tachyons arise in many models but may be avoided in certain classes of compactifications. Anomaly mediated and gaugino mediated contributions to scalar masses are sub-dominant except in special circumstances such as a flat or AdS pure five--dimensional bulk geometry without bulk vector multiplets. △ Less", "We present a class of chiral non-supersymmetric D=4 field theories in which quadratic divergences appear only at two loops. They may be depicted as ``SUSY quivers'' in which the nodes represent a gauge group with extended e.g., N=4 SUSY whereas links represent bifundamental matter fields which transform as chiral multiplets with respect to different N=1 subgroups. One can obtain this type of field theories from simple D6-brane configurations on Type IIA string theory compactified on a six-torus. We discuss the conditions under which this kind of structure is obtained from D6-brane intersections. We also discuss some aspects of the effective low-energy field theory. In particular we compute gauge couplings and Fayet-Iliopoulos terms from the Born-Infeld action and show how they match the field theory results. This class of theories may be of phenomenological interest in order to understand the modest hierarchy problem i.e., the stability of the hierarchy between the weak scale and a fundamental scale of order 10-100 TeV which appears e.g. in low string scale models. Specific D-brane models with the spectrum of the SUSY Standard Model and three generations are presented. △ Less", "The Zee model is one of promising models of neutrino mass generation mechanism. However, the original Zee model is not on the framework of the ground unification scenario, and moreover, it is recently pointed out that the predicted value of $\\sin^2 2θ_{solar}$ must be satisfied the relation $\\sin^2 2θ_{solar} > 0.99$. We discuss whether possible GUT versions of the Zee model can be free from the severe constraint $\\sin^2 2θ_{solar} >0.99$ or not. We will conclude that the following two models are promising: an R-parity violating SUSY GUT model and an SO(10) model with a 126-plet scalar. △ Less", "A comparative study of supersymmetric particle spectra calculated by the programs ISAJET, SUSYGEN and PYTHIA is presented for various SUSY scenarios defined at the Snowmass 2001 workshop. △ Less", "We address the issue of the reconstruction of the scalar potential of a two-Higgs doublet model having in mind that of the MSSM. We first consider the general CP conserving dim-4 effective potential. To fully reconstruct this potential, we show that even if all the Higgs masses and their couplings to the standard model particles are measured one needs not only to measure certain trilinear Higgs self-couplings but some of the quartic couplings as well. We also advocate expressing the Higgs self couplings in the mass basis. We show explicitly, that in the so-called decoupling limit, the most easily accessible Higgs self-couplings are given in terms of the Higgs mass while all other dependencies on the parameters of the general effective potential are screened. This helps also easily explain how, in the MSSM, the largest radiative corrections which affect these self couplings are reabsorbed by using the corrected Higgs mass. We also extend our analysis to higher order operators in the effective Higgs potential. While the above screening properties do not hold, we argue that these effects must be small and may not be measured considering the foreseen poor experimental precision in the extraction of the SUSY Higgs self-couplings. △ Less", "A new release of the Monte Carlo program HERWIG (version 6.4) is now available. The main new features are: spin correlations between the production and decay of heavy fermions, i.e. top quarks, tau leptons and SUSY particles; polarization effects in SUSY production processes in lepton-lepton collisions; an interface to TAUOLA for tau decays; MSSM Higgs processes in lepton-lepton collisions. △ Less", "Direct detection experiments for neutralino dark matter in the Milky Way are examined within the framework of SUGRA models with R-parity invariance and grand unification at the GUT scale, M_G. Models of this type apply to a large number of phenomena, and all existing bounds on the SUSY parameter space due to current experimental constraints are included. For models with universal soft breaking at M_G (mSUGRA), the Higgs mass and b\\to sγconstraints imply that the gaugino mass, m_{1/2}, obeys m_{1/2} >(300-400)GeV putting most of the parameter space in the co-annihilation domain where there is a relatively narrow band in the m_0 - m_{1/2} plane. For $μ> 0$ we find that the neutralino -proton cross section >~ 10^{-10} pb for m_{1/2} < 1 TeV, making almost all of this parameter space accessible to future planned detectors. For μ< 0, however, there will be large regions of parameter space with cross sections < 10^{-12} pb, and hence unaccessible experimentally. If, however, the muon magnetic moment anomaly is confirmed, then μ>0 and m_{1/2}<~ 800 GeV. Models with non-universal soft breaking in the third generation and Higgs sector can allow for new effects arising from additional early universe annihilation through the Z-channel pole. Here cross sections that will be accessible in the near future to the next generation of detectors can arise, and can even rise to the large values implied by the DAMA data. Thus dark matter detectors have the possibility of studying the the post-GUT physics that control the patterns of soft breaking. △ Less", "We consider the Affleck-Dine baryogenesis comprehensively in the minimal supersymmetric standard model with gauge-mediated supersymmetry breaking. Considering the high temperature effects, we see that the Affleck-Dine field is naturally deformed into the form of the Q ball. In the natural scenario where the initial amplitude of the field and the A-terms are both determined by the nonrenormalizable superpotential, we obtain a narrow allowed region in the parameter space in order to explain the baryon number and the dark matter of the universe simultaneously. Therefore, the Affleck-Dine baryogenesis is successful, although difficult. △ Less", "A general analysis is made of the question whether the d=5 proton decay operators coming from exchange of colored Higgsinos can be completely eliminated in a natural way in supersymmetric grand unified models. It is shown that they can indeed be in SO(10) while at the same time naturally solving the doublet-triplet splitting problem, having only two light Higgs doublets, and using no more than a single adjoint Higgs field. Accomplishing all of this requires that the vacuum expectation value of the adjoint Higgs field be proportional to the generator I_{3R} rather than to B-L, as is usually assumed. It is shown that such models can give realistic quark and lepton masses. We also point out a new mechanism for solving the μproblem in the context of SO(10) SUSY GUTs. △ Less", "We show that with a good fit to the muon $g-2$ constraint, the CP asymmetry can be as large as 25% (15%) for $B^0_d \\to τ^+ τ^-$ ($B^0_d \\to μ^+ μ^-$) in SUGRA models with nonuniversal gaugino masses and MSSM. If tau events indentified at B factories the CP asymmetry in $B^0_d \\to τ^+τ^-$ can be a powerful probe on physics beyond SM. An interesting case is that new physics gives a prediction on the branching ratio which is still in the uncertain region of the SM prediction. The CP asymmetry for $B^0_d \\to l^+ l^-$ in this case can still reach 20%. So it is powerful to shed light on physics beyond SM while the CP asymmetry of $b \\to s γ$ in this case can only reach 2% at most which is too small to draw a definite conclusion on new physics effects at B factories. △ Less", "In a (0,1) supersymmetric (SUSY) six-dimensional gauge theory, a gauge fermion gives rise to box anomalies. These anomalies are completely canceled by assuming a vector multiplet of (1,1) SUSY. With a T^2/Z_3 orbifold compactification of the extra two dimensional space, the theory provides three chiral multiplets and three equivalent fixed points. We regard them as the origin of the three families of quarks and leptons. Quasi anarchy structure in the SU(5)-5^* representation sector and hence the bimaximal mixing in the neutrino oscillation are explained quite naturally in this framework. We also discuss a family symmetry as a remnant of the higher-dimensional R symmetry. △ Less", "In simple SO(10) SUSY GUTs the top, bottom and tau Yukawa couplings unify at the GUT scale. A naive renormalization group analysis, neglecting weak scale threshold corrections, leads to moderate agreement with the low energy data. However it is known that intrinsically large threshold corrections proportional to $\\tanβ\\sim m_t(M_Z)/m_b(M_Z) \\sim 50$ can nullify these $t, b$, $τ$ mass predictions. In this paper we turn the argument around. Instead of predicting fermion masses, we use the constraint of Yukawa unification and the observed values $M_t, m_b(m_b), M_τ$ to constrain SUSY parameter space. We find a narrow region survives for $μ> 0$ with $μ, M_{1/2} << m_{16}$, $A_0 \\approx - 1.9 m_{16}$ and $m_{16} > 1200$ \\gev. Demanding Yukawa unification thus makes definite predictions for Higgs and sparticle masses. In particular we find a light higgs with mass $m_h^0 = 114 \\pm 5 \\pm 3$ GeV and a light stop with $(m_{\\tilde t_1})_{MIN} \\sim 450$ GeV and $m_{\\tilde t_1} << m_{\\tilde b_1}$. In addition, we find a light chargino and a neutralino LSP. It is also significant that in this region of parameter space the SUSY contribution to the muon anomalous magnetic moment $a_μ^{SUSY} < 16 \\times 10^{-10}$. △ Less", "We analyze the inclusive semileptonic decays B -> X_s l^+ l^- in the framework of the supersymmetric standard model with non-universal soft-breaking terms at GUT scale. We show that the general trend of universal and non-universal models is a decreasing of branching ratio (BR) and increasing of energy asymmetry (AS). However, only non--universal models can have chances to get very large enhancements in BR and AS, corresponding to large (negative) SUSY contributions to the b -> s γamplitude. △ Less", "One can expect accessible lower bounds for dark matter detection rate due to restrictions on masses of the SUSY-partners. To explore this correlation one needs a new-generation large-mass detector. The absolute lower bound for detection rate can naturally be due to spin-dependent interaction. Aimed at detecting dark matter with sensitivity higher than $10^{-5}$ event/day/kg an experiment should have a non-zero-spin target. Perhaps, the best is to create a GENIUS-like detector with both Ge-73 (high spin) and Ge-76 nuclei. △ Less", "Exotic dark matter together with the vacuum energy or cosmological constant seem to dominate in the Universe. An even higher density of such matter seems to be gravitationally trapped in the Galaxy. Thus its direct detection is central to particle physics and cosmology. Current supersymmetric models provide a natural dark matter candidate which is the lightest supersymmetric particle (LSP). Such models combined with fairly well understood physics like the quark substructure of the nucleon and the nuclear structure (form factor and/or spin response function), permit the evaluation of the event rate for LSP-nucleus elastic scattering. The thus obtained event rates are, however, very low or even undetectable. So it is imperative to exploit the modulation effect, i.e. the dependence of the event rate on the earth's annual motion. Also it is useful to consider the directional rate, i.e its dependence on the direction of the recoiling nucleus. In this paper we study such a modulation effect both in non directional and directional experiments. We calculate both the differential and the total rates using both isothermal, symmetric as well as only axially asymmetric, and non isothermal, due to caustic rings, velocity distributions. We find that in the symmetric case the modulation amplitude is small. The same is true for the case of caustic rings. The inclusion of asymmetry, with a realistic enhanced velocity dispersion in the galactocentric direction, yields an enhanced modulation effect, especially in directional experiments. △ Less", "We review earlier proposals for $E_8$ family unification, and discuss why recent work of Kovner and Shifman on condensates in supersymmetric Yang-Mills theories suggests the reconsideration of $E_8$ supersymmetric Yang-Mills as a family unification theory. △ Less", "In theories in which SUSY is broken on a brane separated from the MSSM matter fields, supersymmetry breaking is naturally mediated in a variety of ways. Absent other light fields in the theory, gravity will mediate supersymmetry breaking through the conformal anomaly. If gauge fields propagate in the extra dimension they, too, can mediate supersymmetry breaking effects. The presence of gauge fields in the bulk motivates us to consider the effects of new messenger fields with holomorphic and non-holomorphic couplings to the supersymmetry breaking sector. These can lead to contributions to the soft masses of MSSM fields which dramatically alter the features of brane world scenarios of supersymmetry breaking. In particular, they can solve the negative slepton mass squared problem of anomaly mediation and change the predictions of gaugino mediation. △ Less", "The tiny neutrino masses measured in the neutrino oscillation experiments can be naturally explained by the supersymmetric see-saw mechanism. If the supersymmetry breaking is mediated by gravity, the see-saw models may predict observable lepton flavor violating effects. In this work, we investigate the lepton flavor violating process $μ\\to eγ$ in the kind of neutrino mass models based on the idea of the ``lopsided'' form of the charged lepton mass matrix. The constraints set by the muon anomalous magnetic moment are taken into account. We find the present models generally predict a much larger branching ratio of $μ\\to eγ$ than the experimental limit. Conversely, this process may give strong constraint on the lepton flavor structure. Following this constraint we then find a new kind of the charged lepton mass matrix. The feature of the structure is that both the elements between the 2-3 and 1-3 generations are ``lopsided''. This structure produces a very small 1-3 mixing and a large 1-2 mixing in the charged lepton sector, which naturally leads to small $Br(μ\\to eγ)$ and the LMA solution for the solar neutrino problem. △ Less", "We consider twisted moduli contributions to supersymmetry breaking in effective type I string constructions involving intersecting D5_i and D9-branes using Goldstino angles to parametrise the supersymmetry breaking. It is well known that twisted moduli enter at tree-level into the gauge kinetic functions, and can provide new sources of gaugino mass if they develop F-term vacuum expectation values. It is generally assumed that string states which are sequestered from the twisted moduli receive a zero soft mass in the twisted modulus domination limit, however the standard form of Kahler potential does not reproduce this expectation. We therefore propose a new form of the Kahler potential which is consistent at leading order with the sequestered form proposed by Randall and Sundrum, and show that it leads to exponentially suppressed sequestered soft masses. Including the effects of Green-Schwarz mixing, we write down the soft scalar masses and trilinears arising from a type I string construction involving intersecting D5_i and D9-branes in the presence of untwisted and twisted moduli. If the squarks and sleptons are identified with sequestered states then in the twisted moduli dominated limit this corresponds to gaugino mediated supersymmetry breaking, and we discuss two different scenarios for this. The general results will be useful for phenomenological studies involving a combination of gravity and gaugino mediated SUSY breaking due to the dilaton, untwisted and twisted moduli contributions, and enable the soft masses to be studied as a function of the different compactification radii. △ Less", "We scan the parameter space of the NMSSM for the observability of at least one Higgs boson at the LHC with $300\\fbi$ integrated luminosity, taking the present LEP2 constraints into account. We restrict the scan to those regions of parameter space for which Higgs boson decays to other Higgs bosons and/or supersymmetric particles are kinematically forbidden. We find that if $WW$-fusion detection modes for a light Higgs boson are not taken into account, then there are still significant regions in the scanned portion of the NMSSM parameter space where no Higgs boson can be observed at the $5σ$ level, despite the recent improvements in ATLAS and CMS procedures and techniques and even if we combine all non-fusion discovery channels. However, if the $WW$-fusion detection modes are included using the current theoretical study estimates, then we find that for all scanned points at least one of the NMSSM Higgs bosons will be detected. If the estimated $300\\fbi$ significances for ATLAS and CMS are combined, one can also achieve $5σ$ signals after combining just the non-$WW$-fusion channels signals. We present the parameters of several particularly difficult points, and discuss the complementary roles played by different modes. We conclude that the LHC will discover at least one NMSSM Higgs boson unless there are large branching ratios for decays to SUSY particles and/or to other Higgs bosons. △ Less", "In the framework of minimal supersymmetric model we examine the Z-peak constraints on the scenario of one light sbottom (2--5.5 GeV) and light gluino (12--16 GeV), which has been successfully used to explain the excess of bottom quark production in hadron collision. Such a scenario is found to be severely constrained by LEP Z-peak observables, especially by R_b, due to the large effect of gluino-sbottom loops. To account for the R_b data in this scenario, the other mass eigenstate of sbottom, i.e., the heavier one, must be lighter than 125 (195) GeV at 2-sigma (3-sigma) level, which should have been produced in association with the lighter one at LEP II and will probobaly be within the reach of Tevatron Run 2. △ Less", "We study the double-diffractive production of various heavy systems (e.g. Higgs, dijet, t tbar and SUSY particles) at LHC and Tevatron collider energies. In each case we compute the probability that the rapidity gaps, which occur on either side of the produced system, survive the effects of soft rescattering and QCD bremsstrahlung effects. We calculate both the luminosity for different production mechanisms, and a wide variety of subprocess cross sections. The results allow numerical predictions to be readily made for the cross sections of all these processes at the LHC and the Tevatron collider. For example, we predict that the cross section for the exclusive double-diffractive production of a 120 GeV Higgs boson at the LHC is about 3 fb, and that the QCD background in the b bbar decay mode is about 4 times smaller than the Higgs signal if the experimental missing-mass resolution is 1 GeV. For completeness we also discuss production via gamma gamma or WW fusion. △ Less", "We study the possibility of spontaneous CP violation in string models with the dilaton field stabilized at a phenomenologically acceptable value. We consider three mechanisms to stabilize the dilaton: multiple gaugino condensates, a nonperturbative Kahler potential, and a superpotential based on S-duality, and analyze consequent CP phases in the soft SUSY breaking terms. Due to non-universality forced upon the theory by requiring a non-trivial CKM phase, the EDM problem becomes more severe. Even if there are no complex phases in the VEVs of the SUSY breaking fields, the electric dipole moments are overproduced by orders of magnitude. We also address the question of modular invariance of the physical CP phases. △ Less", "We consider SUSY SO(10) models in which SUSY breaking occurs via an F-term which does not transform as an SO(10) singlet. This results in non-universal GUT-scale gaugino masses leading to a different pattern of sparticle masses from what is expected in the minimal supergravity model (mSUGRA). We study three breaking chains of SO(10) down to the standard model through SU(4)$\\timesSU(2)\\times$SU(2), SU(2)$\\times$SO(7) and `flipped' SU(5) achieved by the representations 54 and 210 which appear in the symmetric product of two SO(10) adjoints. We examine the phenomenological implications of the different boundary conditions corresponding to the different breaking chains and present the sparticle spectrum. △ Less", "Using the freedom in SO(10) GUT's one can generalize the existing models without changing the mass spectrum of fermions to obtain a significant suppression of proton decay resulting from the baryon number violating operators of dimension 5. In some limiting cases, their contributions can be made negligible compared to the dimension 6 operators resulting from the heavy gauge bosons exchange. △ Less", "An R-parity violating SUSY model with lepton-number violating couplings $λ'_{i33}$, i=2,3 can generate a neutrino mass spectrum that explains the recent results from neutrino oscillation experiments. These R-parity violating couplings lead to a clean signal with at least one isolated lepton and at least three tagged $b$ jets that is accessible in chargino and neutralino production at the Tevatron collider. This signature can be probed at $3 σ$ up to $m_{1/2} = 230$ GeV (320 GeV) with an integrated luminosity of $2 fb^{-1}$ ($30 fb^{-1}$). △ Less", "We investigate supersymmetric $SU(4)_c\\times SU(4)_{L+R}$ theory in 5 dimensions whose compactification on a $S^{(1)}/Z_2$ orbifold yields N=1 supersymmetric $SU(4)_c\\times SU(2)_L\\times SU(2)_R$ supplemented by a $\\tl{U}(1)$ gauge symmetry. We discuss how the $μ$ problem is resolved, a realistic Yukawa sector achieved, and a stable proton realized. Neutrino masses and oscillations are also briefly discussed. △ Less", "In this paper we study the Yukawa Higgs-quark-quark interactions that are generated from radiative corrections of squarks and gluinos, in the Minimal Supersymmetric Standard Model. We compute the corrections to the effective action for Higgs and quark fields that are produced by explicit integration, in the path integral formalism, of all the squarks and gluinos, at the one-loop level and order $α_s$. In addition, we consider the limit of nearly degenerate heavy squarks and gluinos, with masses much larger than the electroweak scale, and derive the effective Lagrangian containing all the relevant new local Higgs-quark-quark interactions. We show that these new interactions do remain non-vanishing, even in the case of infinitely heavy supersymmetric particles and, therefore, we demonstrate explicitly the non-decoupling behavior of squarks and gluinos in Higgs bosons physics. We present the set of new Yukawa couplings and finally derive the corresponding one-loop, order $α_s$, corrections to the Higgs bosons partial decay widths into quarks. △ Less", "We use $t, b, τ$ Yukawa unification to constrain SUSY parameter space. We find a narrow region survives for $μ> 0$ (suggested by \\bsgam and the anomalous magnetic moment of the muon) with $A_0 \\sim - 1.9 m_{16}$, $m_{10} \\sim 1.4 m_{16}$, $m_{16} \\sim 1200 -3000$ \\gev and $μ, M_{1/2} \\sim 100 - 500$ \\gev. Demanding Yukawa unification thus makes definite predictions for Higgs and sparticle masses. △ Less", "The supersymmetric evolution of the fragmentation functions (or timelike evolution) within N=1 $QCD$ is discussed and predictions for the fragmentation functions of the theory (into final protons) are given. We use a backward running of the supersymmetric DGLAP equations, using a method developed in previous works. We start from the usual QCD parameterizations at low energy and run the DGLAP back, up to an intermediate scale -assumed to be supersymmetric- where we switch-on supersymmetry. From there on we assume the applicability of an N=1 supersymmetric evolution (ESAP). We elaborate on possible application of these results to High Energy Cosmic Rays near the GZK cutoff. △ Less"]