["The Euler-Heisenberg effective action in a self-dual background is remarkably simple at two-loop. This simplicity is due to the inter-relationship between self-duality, helicity and supersymmetry. Applications include two-loop helicity amplitudes, beta-functions and nonperturbative effects. The two-loop Euler-Heisenberg effective Lagrangian for QED in a self-dual background field is naturally expressed in terms of one-loop quantities. This mirrors similar behavior recently found in two-loop amplitudes in N=4 SUSY Yang-Mills theory. △ Less", "When several sparticle masses are known, the kinematics of SUSY decay processes observed at the LHC can be solved if the cascade decays contain sufficient steps. We demonstrate four examples of this full reconstruction technique applied to channels involving leptons, namely a) gluino mass determination, b) sbottom mass determination, c) LSP momentum reconstruction, and d) heavy higgs mass determination. △ Less", "We report on the results of a phenomenological study of top squarks (stop_{1,2}) and bottom squarks (sbottom_{1,2}) in the Minimal Supersymmetric Standard Model (MSSM) with complex parameters A_t, A_b, mu and M_1. In particular we focus on the CP phase dependence of the branching ratios of stop_{1,2} and sbottom_{1,2} decays. We find that the effect of the phases on the stop_{1,2} and sbottom_{1,2} decays can be quite significant in a large region of the MSSM parameter space. We also study a CP asymmetry in sfermion decays. △ Less", "We consider the problem of trying to understand the recently measured neutrino data simultaneously with understanding the heirarchical form of quark and charged lepton Yukawa matrices. We summarise the data that a sucessful model of neutrino mass must predict, and then move on to attempting to do so in the context of spontaneously broken `family' symmetries. We consider first an abelian U(1) family symmetry, which appears in the context of a type I string model. Then we consider a model based on a non-abelian SU(3)_F, which is the maximal family group consitent with an SO(10) GUT. In this case the symmetry is more constraining, and is examined in the context of SUSY field theory. △ Less", "The charged-Higgs boson contributions to the Wilson coefficients C_7 and C_8, relevant for the decay B -> X_s gamma, are discussed in supersymmetric models at large tan beta. These contributions receive two-loop O(alpha_s tan beta) corrections by squark-gluino subloops, which are possibly large and nondecoupling in the limit of heavy superpartners. In previous studies, the relevant two-loop Feynman integrals were approximated by using an effective two-Higgs-doublet lagrangian. However, this approximation is theoretically justified only when the typical supersymmetric scale M_SUSY is sufficiently larger than the electroweak scale m_weak \\sim (m_W,m_t) and the mass of the charged-Higgs boson m_{H^\\pm}. Here we evaluate these two-loop integrals exactly and compare the results with the existing, approximated ones. We then examine the validity of this approximation beyond the region where it has been derived, i.e. for m_H \\gtap M_SUSY and/or M_SUSY \\sim m_weak. △ Less", "In this thesis we analyze the problem of symmetry breaking in models with extra dimensions compactified on orbifolds. In the first chapter we briefly review the main symmetry breaking mechanisms peculiar of extra dimensions such as the Scherk-Schwarz mechanism, the Hosotani mechanism and the orbifold projection. In the second chapter we study the most general boundary conditions for fields on the orbifold S^1/Z_2 and we apply them to gauge and SUSY breaking. In the third chapter we focus on flavour symmetry and we present a six dimensional toy model for two generations that can solve the fermion hierarchy problem. △ Less", "We discuss two models with 1 extra CP phase in $b\\leftrightarrow s$ transition. The CP phase $\\arg (V_{t^\\prime s}V_{t^\\prime b})$ with fourth generations, previously ignored, could impact on $b\\to s\\ell^+\\ell^-$, $Δm_{B_s}$ and $\\sin2Φ_{B_s}$, but does not affect EM and strong penguins. With SUSY at TeV scale, a right-handed ``$\\widetilde{sb}_{1}$'' squark can be driven light by flavor mixing. It does not affect $b\\to s\\ell^+\\ell^-$, but can generate $S_{φK_S} < 0$ while giving $S_{η^\\prime K_S} \\sim \\sin2Φ_{B_d} \\cong0.74$. $B_s$ mixing and $\\sin2Φ_{B_s}$ would likely be large, and $S_{K_Sπ^0γ}\\neq 0$ in $B^0\\to K^{*0}γ$ is promising. △ Less", "We propose a new scenario for solving the tachyonic slepton mass problem of anomaly mediated supersymmetry breaking models with a non-Abelian horizontal gauge symmetry broken at the TeV scale. A specific model based on SU(3)_{H} horizontal symmetry is presented wherein the sleptons receive positive mass-squared from the asymptotically free SU(3)_{H} gauge sector. Approximate global symmetries present in the model strongly suppress flavor changing processes induced by the horizontal vector gauge bosons. The model predicts m_{h} < 120 GeV for the lightest Higgs boson mass, tan{beta} nearly equal to 4, and M_V = 1-4 TeV for the SU(3)_{H} gauge boson masses. The lightest SUSY particle is found to be the neutral Wino, which is a candidate for cold dark matter. △ Less", "We perform a renormalisation group analysis of the SO(10) model proposed by Chang, Masiero and Murayama, which links the large atmospheric neutrino mixing angle to loop-induced transitions between right-handed b and s quarks. We compute the impact on B_s-B_s-bar mixing and find that the mass difference in the B_s system can exceed its Standard Model value by a factor of 16. △ Less", "We demonstrate how the interplay of a future e^+e^- LC at its first stage with sqrt{s} sim 500 GeV and of the LHC could lead to a precise determination of the fundamental SUSY parameters in the gaugino/higgsino sector without assuming a specific supersymmetry breaking scheme. We demonstrate this for the benchmark scenario SPS1a, taking into account realistic errors for the masses and cross sections measured at the LC with polarised beams, including errors coming from polarisation measurements, and mass measurements at the LHC. The results clearly demonstrate the complementarity of the LHC and LC, and the benefit from the joint analyses of their data. △ Less", "Diagrammatic rules are developed for simplifying two-loop QED diagrams with propagators in a constant self-dual background field. This diagrammatic analysis, using dimensional regularization, is used to explain how the fully renormalized two-loop Euler-Heisenberg effective Lagrangian for QED in a self-dual background field is naturally expressed in terms of one-loop diagrams. The connection between the two-loop and one-loop vacuum diagrams in a background field parallels a corresponding connection for free vacuum diagrams, without a background field, which can be derived by simple algebraic manipulations. It also mirrors similar behavior recently found for two-loop amplitudes in N=4 SUSY Yang-Mills theory. △ Less", "We argue that in the context of string theory a large number N of connected degenerate vacua that mix will lead to a ground state with much lower energy, essentially because of the standard level repulsion of quantum theory for the wavefunction of the Universe. We imagine a history where initial quantum fluctuations give an energy density $\\sim m_{susy}^2m_{Pl}^2$, but the universe quickly cascades to an energy density $\\sim m_{susy}^2m_{Pl}^2/N$. Then at various phase transitions there are large contributions to the energy density and rearrangement of levels, followed again by a rapid cascade to the ground state or near it. If this mechanism is correct, the ground state of the theory describing our world would be a superposition of a large number of connected string vacua,with shared superselection sets of properties such as three families etc. The observed value of the cosmological constant in terms of the Planck mass, the scale of supersymmetry breaking and the number of connected string vacua. △ Less", "It is known that hidden U(1) gauge factors can couple to visible U(1)'s through Kinetic Mixing. This phenomenon is shown generically to occur in nonsupersymmetric string set-ups, between branes and antibranes. Kinetic Mixing acts either to give millicharges (of e.g. hypercharge) to would-be hidden sector fermions, or to generate an enhanced communication of supersymmetry breaking that dominates over the usual gravitational suppression. In either case, the conclusion is that the string scale in nonsupersymmetric brane configurations has a generic upper bound of M_s <~ 10^8 GeV. △ Less", "We analyse supersymmetric contributions to B_s mixing and their impact on mixing-induced CP asymmetries, using the mass insertion approximation. We discuss in particular the correlation of SUSY effects in the CP asymmetries of B_s -> J/psi phi and B_d -> phi K_S and find that the mass insertions dominant in B_s mixing and B_d -> phi K_S are (delta_{23}^d)_{LL, RR} and (delta_{23}^d)_{LR, RL}, respectively. We show that models with dominant (delta_{23}^d)_{LR, RL} can accomodate a negative value of S_{phi K_S}, in agreement with the BELLE measurement of that observable, but yield a B_s mixing phase too small to be observed. On the other hand, models with dominant (delta_{23}^d)_{LL, RR} predict sizeable SUSY contributions to both Delta M_s and the mixing phase, but do not allow the asymmetry in B_d -> phi K_S to become negative, except for small values of the average down squark mass, which, in turn, entail a value of Delta M_s too large to be observed at the Tevatron and the LHC. We conclude that the observation of B_s mixing at hadron machines, together with the confirmation of a negative value of S_{phi K_S}, disfavours models with a single dominant mass insertion. △ Less", "A minimal renormalizable SUSY SO(10) model with B-L symmetry broken by {\\bf 126} Higgs field has recently been shown to predict all neutrino mixings and the ratio $Δm^2_{\\odot}/Δm^2_A$ in agreement with observations. Unlike models where B-L is broken by {\\bf 16} Higgs, this model guarantees automatic R-parity conservation and hence a stable dark matter as well as the absence of dim=4 baryon violating operator without any additional symmetry assumptions. In this paper, we discuss the predictions of the model for proton decay induced at the GUT scale. We scan over the parameter space of the model allowed by neutrino data and find upper bounds on the partial lifetime for the modes $τ(n\\to π^0\\barν)=~2τ(p\\to π^+\\barν)\\leq (5.7-13)\\times 10^{32}$ yrs and $τ(n\\to K^0\\barν)\\leq 2.97\\times 10^{33}$ yrs for the average squark mass of a TeV and wino mass of 200 GeV, when the parameters satisfy the present lower limits on $τ(p\\to K^+\\barν)$ mode. These results can be used to test the model. △ Less", "We know that neutrino mass and mixing provide a window to physics beyond the Standard Model. Now this window is open, at least partly. And the questions are: what do we see, which kind of new physics, and how far \"beyond\"? I summarize the present knowledge of neutrino mass and mixing, and then formulate the main open questions. Following the bottom-up approach, properties of the neutrino mass matrix are considered. Then different possible ways to uncover the underlying physics are discussed. Some results along the line of: see-saw, GUT and SUSY GUT are reviewed. △ Less", "Supersymmetric QCD and supersymmetric electroweak loop corrections to the violations of weak isospin to Yukawa couplings are investigated. Specifically it involves an analysis of the supersymmetric loop corrections to the Higgs couplings to the third generation quarks and leptons. Here we analyze the SUSY loop corrections to the charged Higgs couplings which are then compared with the supersymmetric loop corrections to the neutral Higgs couplings previously computed. It is found that the weak isospin violations can be quite significant, i.e, as much as 40-50% or more of the total loop correction to the Yukawa coupling. The effects of CP phases are also studied and it is found that these effects can either enhance or suppress the weak isospin violations. We also investigate the weak isospin violation effects on the branching ratio $BR(H^-\\to\\bar t b)/ BR(H^-\\to \\barν_ττ^-)$ and show that the effects are sensitive to CP phases. Thus an accurate measurement of this branching ratio along with the branching ratio of the neutral Higgs boson decays can provide a measure of weak isospin violation along with providing a clue to the presence of supersymmetry. △ Less", "We study the one-loop radiative corrections to pair production of the supersymmetric scalar partners of the standard fermions in e+e- annihilation. Both electroweak and SUSY-QCD corrections are considered. Applications are for production of scalar fermions of the third generation, $e^+e^-\\to \\wt{f}_i \\wt{f}_j^*$ (i,j=1,2), $f=t, b,τ$, as well as for production of scalar quarks of the first and second generation. Effects on integrated cross sections are discussed and also the one-loop induced forward-backward asymmetries are studied. It is found that at low energy, \\sqrt{s}\\approx 500 \\to 1000 GeV, the corrections are dominated by the QCD contributions, At high energy, $\\sqrt{s}\\geq 2$ TeV, the electroweak box diagrams give a substantial contribution and even dominate in some regions of parameters space. The purely loop-induced forward-backward asymmetry can reach values of several per cent. △ Less", "We review in this talk various SUSY SO(10) models. Specifically, we discuss how small neutrino masses are generated in and generic predictions of different SO(10) models. A comparison of the predictions of these models for sin^{2}(theta_{13}) is given. △ Less", "A series of exact BPS solutions are found for single and double domain walls in N=2 supersymmetric (SUSY) QED for finite gauge coupling constants. Vector fields are found to be massive, although it is localized on the wall. Massless modes can be assembled into a chiral scalar multiplet of the preserved N=1 SUSY, after an appropriate gauge choice. The low-energy effective Lagrangian for the massless fields is obtained for the finite gauge coupling. The inter-wall force is found to be much stronger than the known infinite coupling case. The previously proposed expansion in inverse powers of the gauge coupling has pathological oscillations, and does not converge to the correct finite coupling result. △ Less", "Massless localized vector field is obtained in five-dimensional supersymmetric (SUSY) QED coupled to tensor multiplets as a half BPS solution. The four-dimensional gauge coupling is obtained as a topological charge. We also find all the (bosonic) massive modes exactly for a particular value of a parameter, demonstrating explicitly the existence of a mass gap. The four-dimensional Coulomb law is shown to hold for sources placed on the wall. △ Less", "Several results obtained within the SUSY group of the ECFA/DESY linear collider study are presented: (i) a possibility to determine tan beta and the trilinear couplings A_f via polarisation in sfermion decays, (ii) the impact of complex MSSM parameters on the third generation sfermion decays, (iii) determination of CP violation in the complex MSSM via T-odd asymmetries in neutralino production and decay, and (iv) an analysis of the chargino and neutralino mass parameters at one-loop level. △ Less", "In the minimal supersymmetric standard model, tau sleptons $\\tilde τ_{1,2}$ and neutralinos $\\tilde χ^0_{1,2}$ are expected to be among the lightest supersymmetric particles that can be produced copiously at future $e^+e^-$ linear colliders. We analyze $\\tilde τ$ pair and $\\tilde χ_1^0 \\tilde χ_2^0$ production under the assumption $m_{\\tilde χ_1^0} < m_{\\tilde τ_1} < m_{\\tilde χ_2^0}$, allowing the relevant parameters of the SUSY Lagrangian to have complex phases. We show that the transverse and normal components of the polarization vector of the $τ$ lepton produced in $\\tilde χ_2^0$ decays offer sensitive probes of these phases. △ Less", "In supersymmetric (SUSY) models the misalignment between fermion and sfermion families introduces unsuppressed flavor-changing processes. Even if the mass parameters are chosen to give no flavor violation, family dependent radiative corrections make this adjustment not stable. In particular, due to the observed large neutrino mixings and potentially large neutrino Yukawa couplings, sizable lepton flavor violation (LFV) is expected. After introducing the basic concepts, the framework and the main assumptions, we report on a recent study of rare leptonic decays in a class of SUSY-GUT models with three quasi-degenerate neutrinos. We show that LFV effects are likely visible in forthcoming experiments. △ Less", "We study phenomenological aspects of the soft supersymmetry breaking parameters in a model with the extended gauge mediation supersymmetry breaking. In this model gaugino masses can be non-universal and as its result physical CP-phases remain in the gaugino sector even after the R-transformation. These phases contribute to the electric dipole moment (EDM) of an electron and a neutron. We show that their experimental bounds can be satisfied even for the situation such that there exist the order one CP-phases and the masses of superpartners are of the order of 100 GeV. △ Less", "We show that a new GUT scenario we proposed indicates that heterotic M-theory is one of the most interesting possibility to describe our world because of the two features in the scenario. The first feature is that E_6 unified group plays an essential role not only in understanding larger mixing angles in lepton sector than in quark sector but also in solving the SUSY flavor Problem by introducing non-abelian horizontal symmetry SU(2)_H or SU(3)_H. The second feature is that the cutoff scale must be taken as the usual GUT scale Λ_G\\sim 2\\times 10^{16} GeV to realize natural gauge coupling unification. Because this cutoff scale is smaller than the Planck scale or string scale, it may suggest the existence of extra dimension in which only gravity modes can propagate. This talk is based on a dozen papars, some of which are collaborated with T. Yamashita, M. Bando and Q. Shafi. △ Less", "We consider the curvaton scenario in the context of supersymmetry (SUSY) with gravity-mediated SUSY breaking. In the case of a large initial curvaton amplitude during inflation and a negative order H^2 correction to the mass squared term after inflation, the curvaton will be close to the minimum of its potential at the end of inflation. In this case the curvaton amplitude fluctuations will be damped due to oscillations around the effective minimum of the curvaton potential, requiring a large expansion rate during inflation in order to account for the observed energy density perturbations, in conflict with cosmic microwave background constraints. Here we introduce a new curvaton scenario, the phase-induced curvaton scenario, in which de Sitter fluctuations of the phase of a complex SUSY curvaton field induce an amplitude fluctuation which is unsuppressed even in the presence of a negative order H^2 correction and large initial curvaton amplitude. This scenario is closely related to the Affleck-Dine mechanism and a curvaton asymmetry is naturally generated in conjunction with the energy density perturbations. Cosmological energy density perturbations can be explained with an expansion rate H ~ 10^12 GeV during inflation. △ Less", "We compute the complete next-to-leading order (NLO) SUSY-QCD corrections for the associated production of a pseudoscalar Higgs boson with a bottom quark via bottom-gluon fusion at the CERN Large Hadron Collider (LHC) and the Fermilab Tevatron. We find that the NLO QCD correction in the MSSM reaches $40%\\sim50%$ at the LHC and $45%\\sim80%$ at the Tevatron in our chosen parameter space. △ Less", "Recent developments constraining the SUSY parameter space are reviewed within the framework of SUGRA GUT models. The WMAP data is seen to reduce the error in the density of cold dark matter by about a factor of four, implying that the lightest stau is only 5 -10 GeV heavier than the lightest neutralino when m_0, m_{1/2} < 1 TeV. The CMD-2 re-analysis of their data has reduced the disagreement between the Standard Model prediction and the Brookhaven measurement of the muon magnetic moment to 1.9 sigma, while using the tau decay data plus CVC, the disagreement is 0.7 sigma. (However, the two sets of data remain inconsistent at the 2.9 sigma level.) The recent Belle and BABAR measurements of the B -> phi K CP violating parameters and branching ratios are discussed. They are analyzed theoretically within the BBNS improved factorization method. The CP parameters are in disagreement with the Standard Model at the 2.7 sigma level, and the branching ratios are low by a factor of two or more over most of the parameter space. It is shown that both anomalies can naturally be accounted for by adding a non-universal cubic soft breaking term at M_G mixing the second and third generations. △ Less", "The Weakly Interacting Massive Particle (WIMP) is the main candidate for the relic dark matter. A set of exclusion curves currently obtained for cross sections of the spin-dependent WIMP-proton and WIMP-neutron interaction is given. A two-orders-of-magnitude improvement of the sensitivity of the dark matter experiment is needed to reach the SUSY predictions for relic neutralinos. It is noted that near-future experiments with the high-spin isotope Ge-73 can yield a new important constraint on the neutralino-neutron effective coupling and the SUSY parameter space. △ Less", "We discuss constraints on SUSY models with non-unified gaugino masses and R_P conservation. We derive a lower bound on the neutralino mass combining the direct limits from LEP, the indirect limits from gmuon, bsgamma, Bsmumu and the relic density constraint from WMAP. The lightest neutralino (mneutralino=6GeV) is found in models with a light pseudoscalar with MA<200GeV and a large value for $tanβ$. Models with heavy pseudoscalars lead to mneutralino>18(29)GeV for $\\tanβ=50(10)$. We show that even a very conservative bound from the muon anomalous magnetic moment can increase the lower bound on the neutralino mass in models with mu<0 and/or large values of $\\tanβ$. We then examine the potential of the Tevatron and the direct detection experiments to probe the SUSY models with the lightest neutralinos allowed in the context of light pseudoscalars with high $\\tanβ$. We also examine the potential of an e+e- collider of 500GeV to produce SUSY particles in all models with neutralinos lighter than the W. In contrast to the mSUGRA models, observation of at least one sparticle is not always guaranteed. △ Less", "We estimate the quark condensate in one-flavor massless QCD from the known value of the gluino condensate in SUSY Yang-Mills theory using our newly proposed \"orientifold\" large-N expansion. The numerical result for the quark condensate renormalized at the scale 2 GeV is then given as a function of alpha_s(2 GeV) and of possible corrections from sub-leading terms. Our value can be compared with the quark condensate in (quenched) lattice QCD or with the one extracted from the Gell-Mann--Oakes--Renner relation by virtue of non-lattice determinations of the quark masses. In both cases we find quite a remarkable agreement. △ Less", "We estimate the inclusive double diffractive production of SUSY particles at the LHC using a modified version of the POMWIG Monte Carlo event generator. The diffractive events are produced via the Ingelman-Schlein model for double pomeron exchange. The MSSM parameter space is scanned using the ``Snowmass benchmark points'' and it is shown that the lightest Higgs boson is the only SUSY particle with a large enough rate to be detected using these diffractive events. △ Less", "This report summarizes the progress in SUSY studies performed during the Extended ECFA/DESY Workshop since the TESLA TDR. Based on accurate future measurements of masses of SUSY particles and the determination of the couplings and mixing properties of sfermions and gauginos, we discuss how the low-energy Lagrangian parameters can be determined. In a bottom-up approach, by extrapolating to higher energies, we demonstrate how model assumptions on SUSY breaking can be tested. To this end precise knowledge of the SUSY spectrum and the soft SUSY breaking parameters is necessary to reveal the underlying supersymmetric theory. △ Less", "We investigate the enhancement of neutralino relic density in the context of a realistic cosmological scenario with Quintessence. The accurate relic density computation we perform allows us to be sensitive to both cases with shifts in the abundance at the percent level, and to enhancements as large as 10^6. We thoroughly analyze the dependence on the supersymmetric spectrum and on the mass and composition of the lightest neutralino. We point out that supersymmetric models yielding a wino or higgsino-like lightest neutralino become cosmologically appealing in the presence of Quintessence. △ Less", "The vertex H^+_αW^-h^0_β, involving the gauge boson W^+- and the charged (H^+-_α) and neutral Higgs bosons (h^0_β), arises within the context of many extensions of the SM, and it can be used to probe the quantum numbers of the Higgs multiplet. After presenting a general discusion for the expected form of this vertex with arbitrary Higgs representations, we discuss its strength for several specific models, which include: i) the Two-Higgs Doublet Model (THDM), both the generic and the SUSY case, and ii) models with additional Higgs triplets, including both SUSY and non-SUSY cases. We find that in these models, there are regions of parameters where the decay H^+_α-> W^+ h^0_β, is kinematically allowed, and reaches Branching Ratios (BR) that may be detectable, thus allowing to test the properties of the Higgs sector. △ Less", "We show that a mini-thermal inflation occurs naturally in a class of gauge mediation models of supersymmetry (SUSY) breaking, provided that the reheating temperature T_R of the primary inflation is much higher than the SUSY-breaking scale, say T_R > 10^{10} GeV. The reheating process of the thermal inflation produces an amount of entropy, which dilutes the number density of relic gravitinos. This dilution renders the gravitino to be the dark matter in the present universe. The abundance of the gravitinos is independent of the reheating temperature T_R, once the gravtinos are thermally produced after the reheating of the primary inflation. We find that the thermal leptogenesis takes place at T_L\\simeq 10^{12-14} GeV for m_{3/2}\\simeq 100 keV - 10 MeV without any gravitino problem. △ Less", "Two recent experimental developments, when combined, may have far reaching implications. $S_{φK_S} < 0$, if confirmed, would imply large $s$-$b$ mixing, a new CP phase, and right-handed dynamics. Large $Δm_{B_s}$ would be likely, making the $B_s$ program at hadron machines difficult. Reconstruction of $B$ vertex from $K_S$ at B factories, as shown by BaBar's first measurement of $S_{K_Sπ^0}$, makes $S_{K_Sπ^0γ}$ in $\\bar B\\to \\bar K^{*0}γ$ accessible. This would be a boon for B factory upgrades. Supersymmetric Abelian flavor symmetry, independently motivated, can realize all of this with a light $\\widetilde{sb}_1$ squark. B factory and collider studies of flavor, CP and SUSY may not be what we had expected. △ Less", "The correlation between the CP asymmetry in $B\\to φK_s$ ($S_{φK_s}$) and the chromoelectric dipole moment (CEDM) of strange quark ($d_s^C$), which is constrained by the electric dipole moment (EDM) of $^{199}$Hg, is studied in the supersymmetric (SUSY) models with the right-handed squark mixing. It is known that, if the right-handed bottom and strange squarks have a CP-violating mixing, such as in the SUSY SU(5) GUT with right-handed neutrinos, the induced gluon-penguin diagram may give a sizable contribution to $S_{φK_s}$. However, when the left-handed bottom and strange squarks also have a mixing, the conspiracy of the left and right-handed squarks may lead to a sizable $d_s^C$, which is enhanced by $m_b/m_s$. While the estimate for the EDM of $^{199}$Hg, induced by $d^C_s$, might have large uncertainties due to the hadron and nuclear dynamics, the current bound implies the gluon penguin contribution by the right-handed squarks to $S_{φK_s}$ should be suppressed and the deviation of $S_{φK_s}$ from the Standard Model may not be so large. Also, we discuss the constraint from the EDM of $^{199}$Hg in the SUSY SU(5) GUT with the right-handed neutrinos. △ Less", "It is shown that quarks and leptons can couple intrinsically to pure supergravity, preserving for this context the degeneracy of globally supersymmetric vacua, and specifically preserving the vacuum that is characterized by SU(4)XU(1). A fundamental representation of SUSY SU(4)XU(1) is constructed in terms of quarks, and it is demonstrated that the symmetry of this fundamental representation is invariant under supergravity interactions that produce quark-lepton transitions. The importance of this tensorial flavor structure is that it predicts a new, seventh quark of charge -1/3, a left-handed (non-strange) version of the strange quark. △ Less", "An estimate of the NNLO supersymmetric QCD effects for Higgs production at hadron colliders is given. Assuming an effective gluon-Higgs interaction, these corrections enter only in terms of process-independent, factorizable terms. We argue that the current knowledge of these terms up to NLO is sufficient to derive the NNLO hadronic cross section within the limitations of the standard theoretical uncertainties arising mainly from renormalization and factorization scale variations. The SUSY contributions are small with respect to the QCD effects, which means that the NNLO corrections to Higgs production are very similar in the Standard Model and the MSSM. △ Less", "In supergravity theories, a natural possibility is that neutralinos or sleptons freeze out at their thermal relic density, but then decay to gravitinos after about a year. The resulting gravitinos are then superWIMPs -- superweakly-interacting massive particles that naturally inherit the desired relic density from late decays of conventional WIMPs. SuperWIMP dark matter escapes all conventional searches. However, the late decays that produce superWIMPs provide new and promising early universe signatures for cold dark matter. △ Less", "We discuss a minimal Supersymmetric SO(10) model where B-L symmetry is broken by a {\\bf 126} dimensional Higgs multiplet which also contributes to fermion masses in conjunction with a {\\bf 10} dimensional superfield. This minimal Higgs choice provides a partial unification of neutrino flavor structure with that of quarks and has been shown to predict all three neutrino mixing angles and the solar mass splitting in agreement with observations, provided one uses the type II seesaw formula for neutrino masses. In this paper we generalize this analysis to include arbitrary CP phases in couplings and vevs. We find that (i) the predictions for neutrino mixings are similar with $U_{e3}\\simeq 0.18$ as before and other parameters in a somewhat bigger range and (ii) that to first order in the quark mixing parameter $λ$ (the Cabibbo angle), the leptonic mixing matrix is CP conserving. We also find that in the absence of any higher dimensional contributions to fermion masses, the CKM phase is different from that of the standard model implying that there must be new contributions to quark CP violation from the supersymmetry breaking sector. Inclusion of higher dimensional terms however allows the standard model CKM phase to be maintained. △ Less", "In this letter we consider the distinctive phenomenology of supersymmetric models in which the scale of SUSY breaking is very low, \\sqrt{F}= O(TeV), focusing on the Higgs sector and the process of electroweak breaking. Using an effective Lagrangian description of the interactions between the observable fields and the SUSY breaking sector, it is shown how the conventional MSSM picture can be substantially modified. For instance, the Higgs potential has non-negligible SUSY breaking quartic couplings that can modify completely the pattern of electroweak breaking and the Higgs spectrum with respect to that of conventional MSSM-like models. △ Less", "A brief review is given of recent analyses of the effects of CP phases on the supersymmetric QCD and supersymmetric electroweak contibutions to the $b$ and $t$ quark masses and to the $τ$ lepton mass in SUGRA models. The effects of CP phases on the supersymmetric contributions are found to be significanlty large for the b quark mass as they can change both its sign and its magnitude. Thus with the inclusion of CP phases the supersymmetric correction to the b quark mass can be as much as fifty percent or more of the total b quark mass. For the case of the $τ$ lepton, the effects of CP phases on the supersymmetric correction is also relatively large as it can again affect both the sign and the magnitude of the $τ$ mass correction. However, in this case the overall correction is found to be only a few percent. The effect of CP phases on SUSY contribution to the $t$ quark mass was also investigated. However, in this case the overall correction is less than a percent with or without the inclusion of phases. These results have important implications for $b-τ$ unification and for $b-t-τ$ unification in the context of unified theories. △ Less", "A study is made of what SUSY signals would be observable for mSUGRA models in a 500-GeV linear collider. All current experimental bounds on the mSUGRA parameter space are imposed. For m_0 < 1 TeV (or alternately if the current g_μ- 2 anomaly maintains) the only observable signals that remain are slepton pair production and neutralino production of {\\tildeχ^0_2}+{\\tildeχ^0_1}. Slepton pair production can occur for masses < 250 GeV which for the selectron and smuon pairs require tanbeta < 40. In this domain very accurate selectron and smuon masses could be measured. Light staus, \\tildeτ_1, with mass < 250 GeV can be pair produced for any tanbeta and the neutralino signal can be seen provided m_{1/2}<~400 GeV. However, the detection of these requires a much more complicated analysis due to the fact that the dark matter co-annihilation constraint requires that the \\tildeτ_1 and {\\tildeχ^0_1} mass difference be <~ 15 GeV. The point m_{1/2} = 360 GeV, A_0 = 0, μ>0 is analyzed in detail, and it is shown that the stau and neutralino signals can be detected provided an active mask down to 2^o is used. However, large parts of the mSUGRA parameter space exists where a 500-GeV machine would not be able to see any SUSY signal. △ Less", "We discuss a five dimensional inflationary scenario based on a supersymmetric SO(10) model compactified on $S^1/(Z_2\\times Z_2')$. Inflation is implemented through scalar potentials on four dimensional branes, and a brane-localized Einstein-Hilbert term is essential to make both brane vacuum energies positive during inflation. The orbifold boundary conditions break the SO(10) gauge symmetry to $SU(4)_c\\times SU(2)_L\\times SU(2)_R$ ($\\equiv H$). The inflationary scenario yields $δT/T\\propto (M/M_{\\rm Planck})^2$, which fixes $M$, the symmetry breaking scale of $H$ to be close to the SUSY GUT scale of $10^{16}$ GeV. The scalar spectral index $n$ is $0.98-0.99$, and the tensor to scalar ratio $r$ is $\\lapproxeq 10^{-4}$. The inflaton decay into the lightest right handed neutrinos yields the observed baryon asymmetry via leptogenesis. △ Less", "A model based on SUSY SO(10) combined with SU(2) family symmetry is constructed. In contrast with the commonly used effective operator approach, 126-dimensional Higgs fields are utilized to construct the Yukawa sector. R-parity symmetry is thus preserved at low energies. The symmetric mass textures arising from the left-right symmetry breaking chain of SO(10) give rise to very good predictions for quark and lepton masses and mixings. The prediction for sin(2beta) agrees with the average of current bounds from BaBar and Belle. In the neutrino sector, our predictions are in good agreement with results from atmospheric neutrino experiments. Our model accommodates the LMA solution to the solar neutrino anomaly. The prediction of our model for the |U(e nu_3)| element in the MNS matrix is close to the sensitivity of current experiments; thus the validity of our model can be tested in the near future. We also investigate the correlation between the |U(e nu_3)| element and tan^{2}(theta_odot) in a general two-zero neutrino mass texture. △ Less", "We calculate the full electroweak one-loop corrections to the decay of the CP-odd Higgs boson A^0 into scalar fermions in the minimal supersymmetric extension of the Standard Model. For this purpose many parameters of the MSSM have to be properly renormalized in the on-shell renormalization scheme. We have also included the SUSY-QCD corrections. For the decay into bottom squarks and tau sleptons, especially for large \\tan\\b, the corrections can be very large making the perturbation expansion unreliable. We solve this problem by an appropriate definition of the tree-level coupling in terms of running fermion masses and running trilinear couplings A_f. We also discuss the decay of heavy scalar fermions into light scalar fermions and A^0. We find that the corrections can be sizeable and therefore cannot be neglected. △ Less", "We study cosmic string formation within supersymmetric grand unified theories. We consider gauge groups having a rank between 4 and 8. We examine all possible spontaneous symmetry breaking patterns from the GUT down to the standard model gauge group. Assuming standard hybrid inflation, we select all the models which can solve the GUT monopole problem, lead to baryogenesis after inflation and are consistent with proton lifetime measurements. We conclude that in all acceptable spontaneous symmetry breaking schemes, cosmic string formation is unavoidable. The strings which form at the end of inflation have a mass which is proportional to the inflationary scale. Sometimes, a second network of strings form at a lower scale. Models based on gauge groups which have rank greater than 6 can lead to more than one inflationary era; they all end by cosmic string formation. △ Less", "We estimate contributions of the goldstino supermultiplet to the electric dipole moment (EDM) in the case that the SUSY breaking scale Λ_S is of order the TeV scale. We found that such contributions can saturate the experimental bound if Λ_S is close to the soft mass scale. We also discuss EDM in the gaugino mediated scenario on the warped geometry as an example of models with the TeV-scale SUSY breaking. △ Less", "We study the $D$-term contribution for anomalous U(1) symmetries in type I string models and derive general formula for the $D$-term contribution, assuming that the dominant source of SUSY breaking is given by $F$-terms of the dilaton, (overall) moduli or twisted moduli fields. On the basis of the formula, we also point out that there are several different features from the case in heterotic string models. The differences originate from the different forms of Kähler potential between twisted moduli fields in type I string models and the dilaton field in heterotic string models. △ Less", "We examine squark--gluino loop effects on the process $b \\to s γ$ in minimal supersymmetry with general flavor mixing in the squark sector. In the regime of heavy squarks and gluino, we derive analytic expressions for the beyond--LO corrections to the Wilson coefficients and find them to be often large, especially at large $\\tanβ$ and $μ>0$. The ensuing ranges of values of the Wilson coefficients are typically smaller than in the LO approximation, and sometimes even change sign. This has the effect of often reducing, relative to the LO, the magnitude of supersymmetric contributions to $BR(B \\to X_s γ)$. This ``focusing effect'' is caused by contributions from: (i) an RG evolution of the Wilson coefficients; (ii) a correction to the LO chargino contribution to the Wilson coefficients, which can considerably reduce the LO gluino contribution. This partial cancellation of the two contributions takes place only in the case of general flavor mixing. As a result, stringent lower bounds on the mass scale of superpartners, which apply in the case of minimal flavor violation, can be substantially reduced for even small departures from the scenario. The often disfavored case of $μ<0$ can also become allowed for $M_{SUSY}$ as small as $\\sim$ 200 GeV, compared to > $\\sim$ 500 GeV at LO and over 2 TeV in the case of minimal flavor violation. Limits on the allowed amount of flavor mixing among the 2nd and 3rd generation down--type squarks are also typically considerably weakened. The input CKM matrix element $K^{(0)}_{cb}$ can be larger than the experimental value by a factor of ten, or can be as small as zero. △ Less", "Radiatively-induced neutrino mass matrix is investigated within the framework of an SU(5) SUSY GUT model. The model has matter fields of three families \\bar{5}_{L(+)i}+5_{L(+)i} in addition to the ordinary matter fields \\bar{5}_{L(-)i}+10_{L(+)i} and Higgs fields H_{(+)}+\\bar{H}_{(0)}, where (+,0,-) denote the transformation properties (ω^{+1},ω^0,ω^{-1}) (ω^3=+1) under a discrete symmetry Z_3. R-parity violating terms are given by \\bar{5}_{L(+)} \\bar{5}_{L(+)} 10_{L(+)}, while the Yukawa interactions are given by \\bar{H}_{(0)} \\bar{5}_{L(-)} 10_{L(+)}, i.e. the \\bar{5}-fields in both are different from each other. The Z_3 symmetry is only broken by the terms \\bar{5}_{L(+)i}5_{L(+)i} softly, so that the \\bar{5}_{L(+)i}\\leftrightarrow \\bar{5}_{L(-)i} mixings appear at μ< M_X. Of the R-parity violating terms \\bar{5}_{L(+)} \\bar{5}_{L(+)} 10_{L(+)}, only the terms (e_Lν_-ν_Le_)e_R^c sizably appear at μ< M_X. △ Less", "We show that in a large class of models based on anomalous U(1) symmetry which addresses the fermion mass hierarchy problem, leptonic flavor changing processes are induced that are in the experimentally interesting range. The flavor violation occurs through the renormalization group evolution of the soft SUSY breaking parameters between the string scale and the U(1)_A breaking scale. We derive general expressions for the evolution of these parameters in the presence of higher dimensional operators. Several sources for the flavor violation are identified: flavor-dependent contributions to the soft masses from the U(1)_A gaugino, scalar mass corrections proportional to the trace of U(1)_A charge, non-proportional A-terms from vertex corrections, and the U(1)_A D-term. Quantitative estimates for the decays μ-> e γand τ-> μγare presented in supergravity models which accommodate the relic abundance of neutralino dark matter. △ Less", "We examine the potentially very promising signal $B_s\\to μ^{+}μ^{-}$ in supersymmetry with large $\\tanβ$ in a {\\em top-down} approach starting from the best fits of an SO(10)-like model studied recently. Our results go beyond minimal flavour violation investigated in previous works. We show that the absolute best fits provide a signal for $B_s\\to μ^{+}μ^{-}$ at the borderline of the present limits and hence the ongoing search at the Tevatron will start having an impact on the global analysis of this class of SUSY models. We discuss the implications of a measurement of $B_s\\to μ^{+}μ^{-}$ for restricting the parameter space of gauginos and sfermion masses, and of signals in other channels $B_{d,s}\\to l^{+}+l^{-}$. We also discuss correlations of $B_s\\to μ^{+}μ^{-}$ with the CP-odd Higgs mass, $\\sin (β-α)$ and $b\\to s γ$ in SO(10)-like models. △ Less", "In this talk I discuss the problems and virtues of SUSY GUTs in four dimensions. I then show how to solve some of these problems, without foregoing the virtues, by considering an SO(10) SUSY GUT in five dimensions. I discuss gauge coupling unification and neutrino masses. In particular, it is shown that the 5D compactification scale and cutoff scale are determined by fitting the low energy values of the three standard model gauge couplings. Neutrino masses can be accommodated. △ Less", "I review the phenomenological and cosmological constraints on the parameter space associated with the Constrained Minimal Supersymmetric Standard Model (CMSSM). The effect of the recent WMAP determination of the cold dark matter density will be discussed. A very constrained model (based on minimal supergravity relations between the bi- and tri-linear supersymmetry breaking mass terms) will be outlined. △ Less", "We discuss the twofold role of flavor and CP violation as a constraint in model building and as a signal of SUSY. Considering as an example b to s transitions, we analyze present bounds on SUSY parameters, discuss possible deviations from SM predictions in Bd and Bs physics and present strategies to reveal SUSY signals in present and future experiments in the CKM domain. △ Less", "We suggest a new large-N_c limit for multi flavor QCD. Since fundamental and two-index antisymmetric representations are equivalent in SU(3), we have the option to define SU(N_c) QCD keeping quarks in the latter. We can then define a new 1/N_c expansion (at fixed number of flavors N_f) that shares appealing properties with the topological (fixed N_f/N_c) expansion while being more suitable for theoretical analysis. In particular, for N_f=1, our large-N_c limit gives a theory that we recently proved to be equivalent, in the bosonic sector, to N=1 supersymmetric gluodynamics. Using known properties of the latter, we derive several qualitative and semi-quantitative predictions for N_f=1 massless QCD which can be easily tested in lattice simulations. Finally, we comment on possible applications for pure SU(3) Yang-Mills theory and real QCD. △ Less", "We calculate the next-to-leading order inclusive total cross sections for the associated production processes $pp\\to \\tilde{t}_i\\tildeχ_k^-+X$ in the Minimal Supersymmetric Standard Model at the CERN LHC. Our results provide the theoretical predictions for the total cross sections for the above processes. The NLO QCD corrections in general enhance the leading order total cross sections significantly, and vastly reduce the dependence of the total cross sections on the renormalization/factorization scale, which leads to increased confidence in predictions based on these results. △ Less", "It is explained why excessive mu to e gamma can be a problem in SUSY GUT see-saw models of neutrino mass, and ways that this problem might be avoided are discussed. △ Less", "This talk summarizes work by the ATLAS Collaboration at the CERN Large Hadron Collider on the search SUSY particles and Higgs bosons and on possible measurements of their properties. △ Less", "The first evidence for neutrinoless double beta decay has been observed in the HEIDELBERG-MOSCOW experiment, which is the most sensitive double beta decay experiment since ten years. This is the first evidence for lepton number violation and proves that the neutrino is a Majorana particle. It further shows that neutrino masses are degenerate. In addition it puts several stringent constraints on other physics beyond the Standard Model. The result from the HEIDELBERG-MOSCOW experiment is consistent with recent results from CMB investigations, with high energy cosmic rays, with the result from the g-2 experiment and with recent theoretical work. It is indirectly supported by the analysis of other Ge double beta experiments. The new project GENIUS will cover a wide range of the parameter space of predictions of SUSY for neutralinos as cold dark matter. Further it has the potential to be a real-time detector for low-energy ($pp$ and $^7$Be) solar neutrinos. A GENIUS Test Facility has come into operation on May 5, 2003. This is the first time that this novel technique for extreme background reduction in search for rare decays is applied under the background conditions of an underground laboratory. △ Less", "Embedding hidden sector supergravity models in the framework of string theory leads to the appearance of axion-like degrees of freedom. Among them is the model independent axion of heterotic string theory. It has a decay constant of order of the Planck scale and could play the role of a quintessence field. In models allowing for the required $μ$ term in the TeV range, the hidden sector dynamics leads to a vacuum energy of $(0.003 {\\rm eV})^4$ via a multiple see-saw effect. A solution to the strong CP-problem is provided by an additional hidden sector pseudoscalar with properties that make it an acceptable candidate for cold dark matter of the universe. △ Less", "We compute the supersymmetric (SUSY) corrections to the parity-violating, deep inelastic electron-deuteron asymmetry. Working with the Minimal Supersymmetric Standard Model (MSSM) we consider two cases: R parity conserving and R parity-violating. Under these scenarios, we compare the SUSY effects with those entering other parity-violating observables. For both cases of the MSSM, we find that the magnitude of the SUSY corrections can be as large as about 1% and that they are strongly correlated with the effects on other parity-violating observables. A comparison of various low-energy parity-violating observables thus provides a potentially interesting probe of SUSY. △ Less", "We argue that although at asymptotically high temperatures the QGP in bulk behaves as a gas of weakly interacting quasiparticles (modulo long-range magnetism), at temperatures up to few times the critical temperature $T_c$ it displays different properties. If the running of the QCD coupling constant continues in the Coulomb phase till the screening length scale, it reaches the strong coupling treshold $α_s(m_D)\\sim 1$. As a result, the Coulomb phase supports weakly bound Coulombic s-wave $\\bar c c$, light quark and even $gg$ states. The existence of shallow bound states dramatically increases the quasiparticle rescattering at low energies, reducing the viscosity and thereby explaining why heavy ion collisions at RHIC exhibit robust collective phenomena. In conformal gauge theories at finite temperature the Coulomb binding persists further in the strong coupling regime, as found for ${\\cal N}=4$ SUSY YM in the Maldacena regime. △ Less", "I review the effects of flavor conversion of neutrinos from stellar collapse due to masses and mixing, and discuss the motivations for their study. I consider in detail the sensitivity of certain observables (characteristics of the energy spectra of nu_e and antinu_e events) to the 13-mixing (sin^2θ_13) and to the type of mass hierarchy/ordering (sign[Delta m^2_13]). These observables are: the ratio of average energies of the spectra, r_E =<E>/<\\bar E >, the ratio of widths of the energy distributions, r_Gamma = Gamma/\\bar Gamma, the ratios of total numbers of nu_e and antinu_e events at low energies, S, and in the high energy tails, R_tail. I show that regions in the space of observables r_E, r_Gamma, R_tail exist in which certain mass hierarchy and intervals of sin^2θ_13 can be identified or discriminated. Finally, I discuss the potential of studying regeneration effects on nu_e and antinu_e in the matter of the Earth and point out that both the observation or exclusion of these effects lead to model-independent information on sin^2θ_13 and the mass hierarchy. The extraction of this information would highly benefit from the presence of a new, large, long lived nu_e detector, and from the progress of theoretical predictions of the fluxes and energy spectra of the neutrinos originally produced in the star. △ Less", "I present applications of a master formula for next-to-next-to-leading order soft and virtual QCD corrections to various electroweak, Higgs, and supersymmetric processes. They include Drell-Yan and charged Higgs production, single-top production in flavor-changing neutral-current processes, and squark and gluino production. △ Less", "We present a systematic study of the CP conserving and violating SUSY contributions to b to s processes in a generic MSSM, considering gluino exchange contributions. Experimental information on B to Xs gamma, B to Xs l+ l- and the Bs-Bsbar mass difference Delta Ms have been taken into account. We study the induced correlations among several observables: Delta Ms and the amount of CP violation in B to phi Ks, Bs to J/psi phi, B to Xs gamma. Our results show that b to s transitions represent a splendid opportunity to constrain different MSSM realizations and offer concrete prospects to exhibit SUSY signals at B factories and hadron colliders. △ Less", "We develop a bottom-up approach to constructing a theory of fermion masses and mixing angles based on the gauge group $SU(3)\\times G$ where SU(3) is a family symmetry and $G$ contains a unified group such as SO(10) or its Pati-Salam subgroup, together with other discrete symmetries. We construct a realistic model and show that it can provide an excellent description of quark and lepton masses and mixing angles, including almost maximal atmospheric mixing and the LMA MSW solar neutrino solution. We predict a neutrino mixing angle $θ_{13}$ near the current limit. The model provides the basis for a new solution to the flavour problem with a characteristic soft SUSY breaking mass spectrum. △ Less", "A generic form of the supersymmetric SM naturally gives rise to the lepton number violating neutrino masses and mixings, without the need for extra superfields beyond the minimal spectrum. Hence, SUSY can be consider the origin of beyond SM properties of neutrinos. We have developed a formulation under which one can efficiently analyze the model. Various sources of neutrino masses are discussed in details. Such mass contributions come from lepton number and flavor violating couplings that also give rise to a rich phenomenology of the neutrinos and other leptons, to be discussed. △ Less", "We examine the B -> phi K decays within the framework of SUGRA models making use of the improved QCD factorization method of Beneke et al. which allows calculations of non-factorizable contributions. All other experimental constraints (B -> X_S gamma, neutron and electron electric dipole moments, dark matter constraints, etc.) are imposed. We calculate the CP violating parameters S_{phi K_S}, C_{phi K_S} and A_{phi K^{-+}} as well as the branching ratios (BR) of B^0 and B^{+-}, Br[B -> phi K]. We find for the Standard Model(SM) and mSUGRA it is not possible to account for the observed 2.7 sigma deviation between S_{phi K_S} and S_{J/Psi K_S}. In general the BRs are also in 3 sigma disagreement with experiment, except in the parameter region where the weak annihilation terms dominate the decay (and hence where the theory is least reliable). Thus if future data confirm the current numbers, this would represent the first significant breakdown of both the SM and mSUGRA. We show then that adding a SUGRA non-universal A soft breaking left-right term mixing the second and third generations in either the down or up quark sector, all data can be accommodated for a wide range of parameters. The full 6x6 quark mass matrices are used and the SUSY contributions calculated without approximation. △ Less", "It is shown that \"right\" sneutrino can be the lightest supersymmetric particle. Clearly, this possibility will drastically change decay chains of SUSY particles. The sneutrino production at next linear colliders has been analyzed in this scenario. △ Less", "These lectures contain a pedagogical review of non-perturbative results from holomorphy and Seiberg duality with applications to dynamical SUSY breaking. Background material on anomalies, instantons, unitarity bounds from superconformal symmetry, and gauge mediation are also included. △ Less", "An exact solution of domain wall junction is obtained in N=2 supersymmetric (SUSY) QED with three massive hypermultiplets. The junction preserves two out of eight SUSY. Both a (magnetic) Fayet-Iliopoulos (FI) term and complex masses for hypermultiplets are needed to obtain the junction solution. There are zero modes corresponding to spontaneously broken translation, SUSY, and U(1). All broken and unbroken SUSY charges are explicitly worked out in the Wess-Zumino gauge in N=1 superfields as well as in components. The relation to models in five dimensions is also clarified. △ Less", "I give here a detailed user guide for the C++ program SHdecay, which has been developed for computing the final spectra of stable particles (protons, photons, LSPs, electrons, neutrinos of the three species and their antiparticles) arising from the decay of a super-heavy X particle. It allows to compute in great detail the complete decay cascade for any given decay mode into particles of the Minimal Supersymmetric Standard Model (MSSM). In particular, it takes into account all interactions of the MSSM during the perturbative cascade (including not only QCD, but also the electroweak and 3rd generation Yukawa interactions), and includes a detailed treatment of the SUSY decay cascade (for a given set of parameters) and of the non-perturbative hadronization process. All these features allow us to ensure energy conservation over the whole cascade up to a numerical accuracy of a few per mille. Yet, this program also allows to restrict the computation to QCD or SUSY-QCD frameworks. I detail the input and output files, describe the role of each part of the program, and include some advice for using it best. △ Less", "We study the decays of top squarks and bottom squarks in the Minimal Supersymmetric Standard Model with complex parameters A_t, A_b and mu. In a large region of the supersymmetric parameter space the branching ratios of stop_1 and sbottom_1 show a pronounced phase dependence. This could have an important impact on the search for stop_1 and sbottom_1 at a future linear collider and on the determination of the supersymmetric parameters. △ Less", "We investigate the one-loop supersymmetric QCD (SUSY-QCD) and electroweak (SUSY-EW) corrections to the top quark decay into a b-quark and a longitudinal or transverse W-boson. The corrections are presented in terms of the longitudinal ratio Γ(t-->W_L b)/Γ(t--> W b) and the transverse ratio Γ(t-->W_- b)/Γ(t--> W b). In most of the parameter space, both SUSY-QCD and SUSY-EW corrections to these ratios are found to be less than 1% in magnitude and they tend to have opposite signs. The corrections to the total width Γ(t-->W b) are also presented for comparison with the existing results in the literature. We find that our SUSY-EW corrections to the total width differ significantly from previous studies: the previous studies give a large correction of more than 10% in magnitude for a large part of the parameter space while our results reach only few percent at most. △ Less", "In the context of the minimal supersymmetric extension of the Standard Model with the right-handed Majorana neutrinos, we study lepton flavor violating processes including full renormalization group running effects. We systematically compare our results with the commonly used leading logarithmic approximation, resorting to a ``best fit'' approach to fix all the high energy Yukawa matrices. We find significant deviations in large regions of the SUSY parameter space, which we outline in detail. We also give, within this setting, some results on the cosmo-phenomenologically preferred stau coannihilation region. Finally, we propose a parametrization, in terms of the SUSY input parameters, of the common SUSY mass appearing in the leading log and mass insertion approximation formula for the charged lepton flavor violating decay rates, which fits our full renormalization group results with high precision. △ Less", "From a theoretical point of view it is not hard to imagine gaugino masses being much lighter than scalar masses. The dominant contributions to gaugino masses are then their anomaly-mediated values. Given current lower bounds on gauginos, which are near the W-mass scale, considering a little hierarchy between weak-scale gauginos and much heavier scalars requires suspending normal intuition on finetuning and naturalness of the Higgs potential. Nevertheless, tantalizing perks come from the hypothesis: lessened flavor and CP violation problems, more compatibility with gauge coupling unification and third generation Yukawa unification, suppressed dimension-five proton decay operators, and no problems satisfying the current Higgs mass constraint for any value of tan(beta) consistent with the top and bottom Yukawa couplings remaining finite up to the grand unified scale. The Tevatron has little chance of finding any evidence of this theory given current constraints. The LHC does well looking for pair production of gluinos which three-body decay into potentially spectacular final states. Dark matter relic abundance can be cosmologically interesting, but table-top experiments will not see LSPs scattering off nucleons. On the other hand, experiments looking for monochromatic photons from LSP annihilations in the galactic halo may find them. △ Less", "We study effects of supersymmetric particles in various rare B decay processes as well as in the unitarity triangle analysis. We consider three different supersymmetric models, the minimal supergravity, SU(5) SUSY GUT with right-handed neutrinos, and the minimal supersymmetric standard model with U(2) flavor symmetry. In the SU(5) SUSY GUT with right-handed neutrinos, we consider two cases of the mass matrix of the right-handed neutrinos. We calculate direct and mixing-induced CP asymmetries in the b to s gamma decay and CP asymmetry in B_d to phi K_S as well as the B_s--anti-B_s mixing amplitude for the unitarity triangle analysis in these models. We show that large deviations are possible for the SU(5) SUSY GUT and the U(2) model. The pattern and correlations of deviations from the standard model will be useful to discriminate the different SUSY models in future B experiments. △ Less", "We study the effect of SUSY phases on rare decays of leptons and on their magnetic and electric dipole moments. We consider the most general mass matrices for sleptons within the MSSM including left--right mixing, flavour mixing and complex phases. We show that the phases also affect CP even observables. Moreover, we demonstrate that contrary to common belief the phase of mu can be large even for slepton masses as small as 200 GeV provided the lepton flavour violating parameters are complex. △ Less", "Motivated by the simplicity and direct phenomenological applicability of field-theoretic orbifold constructions in the context of grand unification, we set out to survey the immensely rich group-theoretical possibilities open to this type of model building. In particular, we show how every maximal-rank, regular subgroup of a simple Lie group can be obtained by orbifolding and determine under which conditions rank reduction is possible. We investigate how standard model matter can arise from the higher-dimensional SUSY gauge multiplet. New model building options arise if, giving up the global orbifold construction, generic conical singularities and generic gauge twists associated with these singularities are considered. Viewed from the purely field-theoretic perspective, such models, which one might call conifold GUTs, require only a very mild relaxation of the constraints of orbifold model building. Our most interesting concrete examples include the breaking of E_7 to SU(5) and of E_8 to SU(4)xSU(2)xSU(2) (with extra factor groups), where three generations of standard model matter come from the gauge sector and the families are interrelated either by SU(3) R-symmetry or by an SU(3) flavour subgroup of the original gauge group. △ Less", "The hitherto unobserved purely leptonic decays B^\\pm -> τ^\\pm νand B^\\pm -> μ^\\pm νare of much interest at current and future runs of the e+e- B factories. Such decays are sensitive to charged Higgs bosons (H^\\pm) at the tree-level and provide essentially model independent constraints on \\tanβ/m_{H^\\pm}. We include the large corrections to the H^\\pm-ub coupling induced by virtual SUSY effects and show that the bounds on \\tanβ/m_{H^\\pm} can be significantly weakened or strengthened. △ Less", "The implementation of the Background Field Method (BFM) for quantum field theories is analysed within the Batalin-Vilkovisky (BV) formalism. We provide a systematic way of constructing general splittings of the fields into classical and quantum parts, such that the background transformations of the quantum fields are linear in the quantum variables. This leads to linear Ward-Takahashi identities for the background invariance and to great simplifications in multiloop computations. In addition, the gauge fixing is obtained by means of (anti)canonical transformations generated by the gauge-fixing fermion. Within this framework we derive the BFM for the N=2 Super-Yang-Mills theory in the Wess-Zumino gauge viewed as the twisted version of Donaldson-Witten topological gauge theory. We obtain the background transformations for the full BRST differential of N=2 Super-Yang-Mills (including gauge transformations, SUSY transformations and translations). The BFM permits all observables of the supersymmetric theory to be identified easily by computing the equivariant cohomology of the topological theory. These results should be regarded as a step towards the construction of a super BFM for the Minimal Supersymmetric Standard Model. △ Less", "There are many theories of quantum gravity, depending on asymptotic boundary conditions, and the amount of supersymmetry. The cosmological constant is one of the fundamental parameters that characterize different theories. If it is positive, supersymmetry must be broken. A heuristic calculation shows that a cosmological constant of the observed size predicts superpartners in the TeV range. This mechanism for SUSY breaking also puts important constraints on low energy particle physics models. This essay was submitted to the Gravity Research Foundation Competition and is based on a longer article, which will be submitted in the near future. △ Less", "It has been shown that hybrid inflation may end with the formation of non-topological solitons of inflaton field. As a first step towards a fully realistic picture of the post-inflation era and reheating in supersymmetric hybrid inflation models, we study the classical scalar field equations of a supersymmetric hybrid inflation model using a semi-analytical ansatz for the spatial dependence of the fields. Using the minimal D-term inflation model as an example, the inflaton field is evolved using the full 1-loop effective potential from the slow-rolling era to the U(1)_{FI} symmetry-breaking phase transition. Spatial perturbations of the inflaton corresponding to quantum fluctuations are introduced for the case where there is spatially coherent U(1)_{FI} symmetry breaking. The maximal growth of the dominant perturbation is found to depend only on the ratio of superpotential coupling λto the gauge coupling g. The inflaton condensate fragments to non-topological solitons for λ/g > 0.09. Possible consequences of non-topological soliton formation in fully realistic SUSY hybrid inflation models are discussed. △ Less", "Within the framework of an SU(5) SUSY GUT model, a mechanism which effectively induces R-parity-violating terms below the unification energy scale M_X is proposed. The model has matter fields \\bar{5}_{L(+)}+10_{L(-)} and Higgs fields H_{(-)} and \\bar{H}_{(+)} in addition to the ordinary Higgs fields H_{(+)} and \\bar{H}_{(-)} which contribute to the Yukawa interactions, where (\\pm) denote the transformation properties under a discrete symmetry Z_2. The Z_2 symmetry is only broken by the μ-term \\bar{H}_{(+)}H_{(-)} softly, so that the \\bar{5}_{(+)}\\leftrightarrow \\bar{H}_{(+)} \\leftrightarrow \\bar{H}_{(-)} mixing appears at μ< m_{SB}, i.e. R-parity violating terms \\bar{5}_L\\bar{5}_L 10_L are effectively induced from the Yukawa interactions \\bar{H}_{(-)}\\bar{5}_{L(+)}10_{L(-)}, so that the effective coupling constants λ_{ijk} of ν_{Li} e_{Lj} e_{Rk}^c and ν_{Li} d_{Rj}^c d_{Lk} are proportional to the mass matrices (M_e^*)_{jk} and (M_d^\\dagger)_{jk}, respectively. The parameter regions which are harmless for the proton decay are investigated. Possible forms of the radiatively induced neutrino mass matrix are also investigated. △ Less", "We present possible realizations of gauge inflation arising from a 5D ${\\cal N}=1$ supersymmetric U(1) model, where the extra dimension is compactified on a circle. A one-loop inflaton effective 4D potential is generated, with the inflaton being a 'Wilson-line field'. It relies on a SUSY breaking. We first consider SUSY breaking to occur spontaneously within a 'no-scale' model by a non zero $F$-term of the radion superfield which transmits SUSY breaking into the 'visible' sector. As an alternative, we study $D$-term SUSY breaking originating directly from the 5D gauge supermultiplet. Together with the usual KK resummation method, we present a calculation with the world-line formalism. The latter allows one to get the resulting effective potential directly as a sum over all winding modes. For both presented scenarios, the generated effective potentials have suitable forms for realizing successful inflation, i.e. are flat enough and give the needed number of ${\\rm e}$-foldings. In addition, there is a natural way to get strongly suppressed values for the potentials, which then could be associated with dark energy/quintessence. △ Less", "A short tour of supersymmetric dark matter and its connection to collider physics. △ Less", "We evaluate neutralino-nucleon scattering rates in several well-motivated supersymmetric models, and compare against constraints on the neutralino relic density, BF( b\\to sγ) as well as the muon anomalous magnetic moment a_μ. In the mSUGRA model, the indirect constraints favor the hyperbolic branch/focus point (HB/FP) region of parameter space, and in fact this region is just where neutralino-nucleon scattering rates are high enough to be detected in direct dark matter search experiments! In Yukawa unified SUSY SO(10) models with scalar mass non-universality, the relic density of neutralinos is almost always above experimental bounds, while the corresponding direct detection rates are below experimental levels. Conversely, in five dimensional SO(10) models where gauge symmetry breaking is the result of compactification of the extra dimension, and supersymmetry breaking is communicated via gaugino mediation, the relic density is quite low, while direct detection rates can be substantial. △ Less", "We study the curvaton scenario using the MSSM flat directions in the gauge-mediated SUSY breaking model. We find that the fluctuations in the both radial and phase directions can be responsible for the density perturbations in the universe through the curvaton mechanism. Although it has been considered difficult to have a successful curvaton scenario with the use of those flat directions, it is overcome by taking account of the finite temperature effects, which induce a negative thermal logarithmic term in the effective potential of the flat direction. △ Less", "We study the effect of departures from SUSY GUT gaugino universality on the neutralino relic density, and both its direct and neutrino indirect detection. We find that the most interesting models are those with a value of $M_3|_{GUT}$ lower than the universal case. △ Less", "We present an update of neutral Higgs boson decays into bottom quark pairs in the minimal supersymmetric extension of the Standard Model. In particular the resummation of potentially large higher-order corrections due to the soft SUSY breaking parameters A_b and mu is extended. The remaining theoretical uncertainties due to unknown higher-order SUSY-QCD corrections are analyzed quantitatively. △ Less", "The charged-Higgs contributions to the decay \\bar{B} -> X_s gamma are discussed in the minimal supersymmetric standard model at large tan beta. These contributions receive two-loop O(alpha_s tan beta) corrections by squark-gluino subloops, which are nondecoupling in the limit of heavy superpartners and possibly large. Their leading parts are already known and were evaluated by using an effective two-Higgs-doublet Lagrangian. Subleading corrections coming from higher-dimension operators in the effective Lagrangian were ignored, although this is not, a priori, justified when m_{H^\\pm} is not much smaller than the typical supersymmetric mass M_{SUSY}. Here, we calculate all subleading terms of the O(alpha_s tan beta) corrections up to O((m_t^2,m_{H^\\pm}^2/M_{SUSY}^2)^2), as well as all the exact two-loop diagrams with squark-gluino subloops, beyond the effective-Lagrangian approximation. Comments are made on the size of these corrections. △ Less", "We examine the soft supersymmetry breaking parameters in supersymmetric theories on a slice of AdS_5 which generate the hierarchical Yukawa couplings by dynamically localizing the bulk matter fields in extra dimension. Such models can be regarded as the AdS dual of the recently studied 4-dimensional models which contain a supersymmetric CFT to generate the hierarchical Yukawa couplings. In such models, if supersymmetry breaking is mediated by the bulk radion superfield and/or some brane chiral superfields, potentially dangerous flavor-violating soft parameters can be naturally suppressed, thereby avoiding the SUSY flavor problem. We present some models of radion-dominated supersymmetry breaking which yield a highly predictive form of soft parameters in this framework. △ Less", "The possibility of incorporating a chiral fourth generation into a SUSY-GUT is investigated. Precision fits to electroweak observables require us to introduce light supersymmetric particles, with masses less than mZ. These particles might also provide decay channels for fourth generation quarks of mass ~ 100 GeV. We also require tan(beta) to lie in the range 1.50 <~ tan(beta) <~ 1.75 and obtain an upper limit on the lightest Higgs boson mass in the MSSM4 of 152 GeV. △ Less", "In this talk, we summarize the collider phenomenology and recent experimental results for various models of extra dimensions, including the large extra dimensions (ADD model), warped extra dimensions (Randall-Sundrum model), TeV$^{-1}$-sized extra dimensions with gauge bosons in the bulk, universal extra dimensions, and an 5D SU(5) SUSY GUT model in AdS space. △ Less", "We propose a useful method for deriving the effective theory for a system where BPS and anti-BPS domain walls coexist. Our method respects an approximately preserved SUSY near each wall. Due to the finite width of the walls, SUSY breaking terms arise at tree-level, which are exponentially suppressed. A practical approximation using the BPS wall solutions is also discussed. We show that a tachyonic mode appears in the matter sector if the corresponding mode function has a broader profile than the wall width. △ Less", "{We present an updated assessment of the reach of the CERN LHC pp collider for supersymmetric matter in the context of the minimal supergravity (mSUGRA) model. In addition to previously examined channels, we also include signals with an isolated photon or with a leptonically decaying Z boson. For an integrated luminosity of 100 fb^{-1}, values of m_{1/2}\\sim 1400 GeV can be probed for small m_0, corresponding to a gluino mass of m_{\\tg}\\sim 3 TeV. For large m_0, in the hyperbolic branch/focus point region, m_{1/2}\\sim 700 GeV can be probed, corresponding to m_{\\tg}\\sim 1800 GeV. We also map out parameter space regions preferred by the measured values of the dark matter relic density, the b\\to sγdecay rate, and the muon anomalous magnetic moment a_μ, and discuss how SUSY might reveal itself in these regions. We find the CERN LHC can probe the entire stau co-annihilation region and also most of the heavy Higgs annihilation funnel allowed by WMAP data, except for some range of large m_0 and m_{1/2} if \\tanβ\\agt 50. △ Less", "We will present a method to decide a priori whether various supersymmetrical scenarios can be distinguished based on sparticle mass data alone. For each model, a scan over all free SUSY breaking parameters reveals the extent of that model's physically allowed region of sparticle-mass-space. Based on the geometrical configuration of these regions in mass-space, it is possible to obtain an estimate of the required accuracy of future sparticle mass measurements to distinguish between the models. We will illustrate this algorithm with an example. This talk is based on work done in collaboration with B.C. Allanach (LAPTH, Annecy) and F. Quevedo (DAMTP, Cambridge). △ Less", "We study the inclusive semileptonic rare decay $b \\to s l^+ l^-$ in minimal supergravity model (mSUGRA). If tan$β$ is large, down-type quark mass matrices and their Yukawa couplings cannot be diagonalized at the same basis. This induces the flavor violating neutral Higgs boson couplings. These couplings contribute significantly to decay $b \\to s mu^+ mu^-$ and $b \\to s tau^+ tau^-$, but negligible to $b \\to s e^+ e^-$ decay because of its negligible $m_e$ mass. The ratio $R \\equiv B(b \\to s mu^+ mu^-)/ B(b \\to s e^+ e^-)$ can be very different from its corresponding value in the Standard Model. We find that part of parameter space can accommodate a large R value, and that maximum R value can be larger than 2. We also present our results in $b \\to s tau^+ tau^-$ decay channel. Although it can be not detected now, it is potentially a new channel for the future observation of new physics. △ Less", "We compare the logarithmic Sudakov expansions of the process e+e- --> W+W- in the one-loop approximation and in the resummed version, to subleading order accuracy, in the SM case and in a light SUSY scenario for the MSSM. We show that the two expansions are essentially identical below 1 TeV, but differ drastically at higher (2,3 TeV) center of mass energies. Starting from these conclusions, we argue that a complete one-loop calculation in the energy region below 1 TeV does not seem to need extra two-loop corrections, in spite of the relatively large size of the one-loop effects. △ Less", "We consider the high energy behaviour of the amplitudes for pair production of charged leptons, quarks, Higgs bosons, sleptons, squarks and charginos at lepton colliders. We give the general expressions of the leading quadratic and subleading linear logarithms that appear at the one loop level, and derive the corresponding resummed expansions to \\underline{subleading} logarithmic order accuracy. Under the assumption of a relatively light SUSY scenario and choosing the MSSM as a specific model, we compare the predictions of the one-loop and of the resummed expansions at variable energy. We show that the two predictions are very close in the one TeV regime, but drastically differ in the few ($2,3$) TeV range. △ Less", "CMSSM boundary conditions are usually used when calculating cosmological dark matter densities. In this paper we calculate the cosmological density of dark matter in the MSSM using minimal $SO_{10}$ soft SUSY breaking boundary conditions. These boundary conditions incorporate several attractive features: they are consistent with $SO_{10}$ Yukawa unification, they result in a \"natural\" inverted scalar mass hierarchy and they reduce the dimension 5 operator contribution to the proton decay rate. With regards to dark matter, on the other hand, this is to a large extent an unexplored territory with large squark and slepton masses $m_{16}$, large $A_0$ and small $ \\{μ, M_{1/2} \\} $. We find that in most regions of parameter space the cosmological density of dark matter is considerably less than required by the data. However there is a well--defined, narrow region of parameter space which provides the observed relic density of dark matter, as well as a good fit to precision electroweak data, including top, bottom and tau masses, and acceptable bounds on the branching fraction of $B_s \\to μ^+ μ^-$. We present predictions for Higgs and SUSY spectra, the dark matter detection cross section and the branching ratio ${\\rm BR}(B_s\\to μ^+ μ^-)$ in this region of parameter space. △ Less", "Non-abelian horizontal symmetry has been considered to solve potentially SUSY flavor problem, but simple models are suffering from various problems. In this talk, we point out that (anomalous) U(1)_A gauge symmetry solves all the problems in a natural way, especially, in the E_6 grand unified theories. Combining the GUT scenario with anomalous U(1)_A gauge symmetry, in which doublet-triplet splitting and natural gauge coupling unification are realized, and realistic quark and lepton mass matrices are obtained including bi-large neutrino mixings, complete E_6* SU(3)_H (or E_6*SU(2)_H) GUTs can be obtained, in which all the three generation quarks and leptons are unified into a single multiplet (27,3) (or two multiplets (27,2+1)). This talk is based on Ref.[1]. △ Less", "In this talk I define what I call the minimal SO(10) SUSY model. I then discuss the phenomenological consequences of this theory, vis a vis gauge and Yukawa coupling unification, Higgs and super-particle masses, the anomalous magnetic moment of the muon, the decay $B_s \\to μ^+ μ^-$ and dark matter. △ Less", "We study the implications of minimal non-Universal Boundary Conditions in the sfermion Soft SUSY Breaking (SSB) masses of mSUGRA. We impose asymptotic b-tau Yukawa coupling Unification and we resort to a parameterization of the deviation from Universality in the SSB motivated by the multiplet structure of SU(5) GUT. A set of cosmo-phenomenological constraints, including the recent results from WMAP, determines the allowed parameter space of the models under consideration. We highlight a new coannihilation corridor where neutralino-sbottom and neutralino-tau sneutrino-stau coannihilations significantly contribute to the reduction of the neutralino relic density. △ Less", "We study the finite-temperature properties of the supersymmetric version of (2+1)D Georgi-Glashow model. As opposed to its nonsupersymmetric counterpart, the parity symmetry in this theory at zero temperature is spontaneously broken by the bilinear photino condensate. We find that as the temperature is raised, the deconfinement and the parity restoration occur in this model at the same point $T_c=g^2/8π$. The transition is continuous, but is not of the Ising type as in nonsupersymmetric Georgi-Glashow model, but rather of the Berezinsky-Kosterlitz-Thouless type as in $Z_4$-invariant spin model. △ Less", "I review the role played by baryon and lepton numbers and their discrete subgroups in determining the low energy effective theory relevant for TeV physics. △ Less", "In minimal supersymmetric model (SUSY) with a light Higgs sector, explicit CP violation and most general flavor mixings in the sfermion sector, integration of the superpartners out of the spectrum induces potentially large contributions to the Yukawa couplings of light quarks via those of the heavier ones. These corrections can be sizeable even for moderate values of tan(beta), and remain nonvanishing even if all superpartners decouple. When the SUSY breaking scale is close to the electroweak scale, the Higgs exchange effects can compete with the gauge boson and box diagram contributions to rare processes, and their partial cancellations can lead to relaxation of the existing bounds on flavor violation sources. In this case there exist sizeable enhancements in flavor-changing Higgs decays. When the superpartners completely decouple, however, the Higgs mediation becomes the dominant SUSY contribution to rare processes the saturation of which, without a strong suppression of the flavor mixings, prefers large tan(beta) and certain ranges for the CP-odd phases. The decay rate of the lightest Higgs into light down quarks become comparable with that into the bottom quark. Moreover, the Higgs decay into the up quark is significantly enhanced. There are observable implications for rare processes, atomic electric dipole moments, and collider searches for Higgs bosons. △ Less", "The present paper deals with a next-to-leading order analysis of the radiative $B \\to K^* γ$ decay. Working in the PQCD approach developed by Szczepaniak {\\it et al.}, we compute the correction, coming from a single gluon exchange with the spectator, to the essential form factor. Since the branching ratio gets much above the experimental data, although in agreement with other theoretical models predictions, we take into consideration the effects of complex flavour couplings in the squark sector. Finally, we discuss these SUSY implications on the branching ratio and direct CP asymmetry values and impose bounds on the squark mixing parameter $(δ_{23}^d)_{LR}$. △ Less", "It is commonly believed that unbroken supersymmetry (SUSY) implies that all members of a supermultiplet have the same mass. We demonstrate that this is not true, by exhibiting a simple counterexample. We employ the formalism of homeotic fermions, in a simple model where CPT conjugate fermions have different masses. This model can be supersymmetrized to a hypermultiplet of fields which form a representation of the conventional N=2 SUSY algebra. Nevertheless, CPT conjugate states in this hypermultiplet have different masses. These surprising results do not violate either the CPT theorem nor the Haag-Lopuszanski-Sohnius theorem. △ Less", "Exotic dark matter together with the vacuum energy (cosmological constant) seem to dominate in the flat Universe. Thus direct dark matter detection is central to particle physics and cosmology. Supersymmetry provides a natural dark matter candidate, the lightest supersymmetric particle (LSP). It is possible to obtain detectable rates, but realystically they are expected to be much lower than the present experimental goals. So one should exploit two characteristic signatures of the reaction, namely the modulation effect and the correlation with the sun's motion in directional experiments. In standard non directional experiments the modulation is small, less than two per cent. In the case of the directional experiments, the main subject of this paper, we find two novel features, which are essentially independent of the SUSY model employed, namely: 1) The forward-backward asymmetry, with respect to the sun's direction of motion, is very large and 2) The modulation observed in a plane perpendicular to the sun's motion can be higher than 20 per cent and is direction dependent. △ Less", "We consider the renormalization group approach to the SUSY flavor problem in the supersymmetric SU(5) model with one extra dimension. In higher dimensional SUSY gauge theories, it has been recently shown that power corrections due to the Kaluza-Klein states of gauge fields run the soft masses generated at the orbifold fixed point to flavor conserving values in the infra-red limit. In models with GUT breaking at the brane where the GUT scale can be larger than the compactification scale, we show that the addition of a bulk Higgs multiplet, which is necessary for the successful unification, is compatible with the flavor universality achieved at the compactification scale. △ Less", "We analyze neutrinoless double $β$-decay ($\\nbb$-decay) mediated by heavy particles from the standpoint of effective field theory. We show how symmetries of the $\\nbb$-decay quark operators arising in a given particle physics model determine the form of the corresponding effective, hadronic operators. We classify the latter according to their symmetry transformation properties as well as the order at which they appear in a derivative expansion. We apply this framework to several particle physics models, including R-parity violating supersymmetry (RPV SUSY) and the left-right symmetric model (LRSM) with mixing and a right-handed Majorana neutrino. We show that, in general, the pion exchange contributions to $\\nbb$-decay dominate over the short-range four-nucleon operators. This confirms previously published RPV SUSY results and allows us to derive new constraints on the masses in the LRSM. In particular, we show how a non-zero mixing angle $ζ$ in the left-right symmetry model produces a new potentially dominant contribution to $\\nbb$-decay that substantially modifies previous limits on the masses of the right-handed neutrino and boson stemming from constraints from $\\nbb$-decay and vacuum stability requirements. △ Less", "Recently, WMAP has measured the cosmological parameters to a much greater accuracy. We analyze the implications of this more precise measurement for supersymmetric dark matter and for the direct detection of supersymmetry at accelerators. We consider mSUGRA including also the hyperbolic branch in the radiative breaking of the electroweak symmetry. On the part of the hyperbolic branch where the lightest neutralino is dominantly a higgsino rather than being mostly a bino, the relic density constraints are satisfied by coannihilation with the next lightest neutralino and the light chargino. Including this branch the lightest neutralino mass satisfies $m_{χ_1^0}\\leq 1200$ GeV for $\\tanβ\\leq 50$. Constraints of $b\\to s+γ$ and of $g_μ-2$ are also analyzed. It is shown that the neutralino-proton cross section in each case will fall within the reach of dark matter experiments. Possibility for the direct detection of supersymmetry is discussed in the allowed regions of the parameter space consistent with WMAP constraints. A brief discussion of the hyperbolic branch and focus point region (HB/FP) is also given. △ Less", "I present a unified approach to calculating the next-to-next-to-leading order (NNLO) soft and virtual QCD corrections to cross sections for electroweak, Higgs, QCD, and SUSY processes. I derive master formulas that can be used for any of these processes in hadron-hadron and lepton-hadron collisions. The formulas are based on a unified threshold resummation formalism and can be applied to both total and differential cross sections for processes with either simple or complex color flows and for various factorization schemes and kinematics. As a test of the formalism, I rederive known NNLO results for Drell-Yan and Higgs production, deep inelastic scattering, and W+ gamma production, and I obtain expressions for several two-loop anomalous dimensions and other quantities needed in next-to-next-to-leading-logarithm (NNLL) resummations. I also present new results for the production of supersymmetric charged Higgs bosons; massive electroweak vector bosons; photons; heavy quarks in lepton-hadron and hadron-hadron collisions and in flavor-changing neutral current processes; jets; and squarks and gluinos. The NNLO soft and virtual corrections are often dominant, especially near threshold. Thus, a unified approach to these corrections is important in the search for new physics at present and future colliders. △ Less", "The requirement of Yukawa coupling unification highly constrains the SUSY parameter space. In several SUSY breaking scenarios it is hard to reconcile Yukawa coupling unification with experimental constraints from B(b->s gamma) and the muon anomalous magnetic moment a_mu. We show that b-tau or even t-b-tau Yukawa unification can be satisfied simultaneously with b->s gamma and a_mu in the non-universal gaugino mediation scenario. Non-universal gaugino masses naturally appear in higher dimensional grand unified models in which gauge symmetry is broken by orbifold compactification. Relations between SUSY contributions to fermion masses, b->s gamma and a_mu which are typical for models with universal gaugino masses are relaxed. Consequently, these phenomenological constraints can be satisfied simultaneously with a relatively light SUSY spectrum, compared to models with universal gaugino masses. △ Less", "The recent WMAP data provide a rather restricted range of the Cold Dark Matter (CDM) density $ Ω_{CDM} h^2 $ of unprecedented accuracy. We combine these new data along with data from BNL E821 experiment measuring $ {(g_μ-2)}$, $ $the {$b\\goes s γ$} branching ratio and the light Higgs boson mass bound from LEP, to update our analysis of the allowed boundaries in the parameter space of the Constrained Minimal Supersymmetric Standard Model (CMSSM). The prospects of measuring Supersymmetry at LHC look like a very safe bet, and the potential of discovering SUSY particles at a $ \\sqrt{s} = 1.1 \\mathrm{TeV} $ linear collider is enhanced considerably. The implications for Dark Matter direct searches are also discussed. △ Less", "I start with a brief summary of Higgs Mechanism and supersymmetry. Then I discuss the theoretical constraints, current limits and search strategies for Higgs boson(s) at LHC - first in the SM and then in the MSSM. Finally, I discuss the analogous constraints and search strategies for the superparticles, concentrating on the minimal supergravity model. Recent advances in identifying the most promising channels for Higgs and SUSY searches are emphasized. △ Less", "The construction of a Supersymmetric Grand Unified Model based on the Pati-Salam gauge group is briefly reviewed and the low energy consequences of the derived asymptotic Yukawa quasi-unification conditions are examined. In the framework of the resulting Constrained Minimal Supersymmetric Standard Model, the cosmological relic density of the bino-like LSP is calculated and the results are explicitly compared with {\\tt micrOMEGAs}. In addition to the Cold Dark Matter constraint, restrictions on the parameter space, arising from the Higgs boson masses, the SUSY corrections to $b$-quark mass, the muon anomalous magnetic moment and the inclusive decay $b\\to sγ$ are, also, investigated. For $μ>0$, a wide and natural range of parameters is allowed. On the contrary, the $μ<0$ case not only is disfavored from the present experimental data on the muon anomalous magnetic moment, but also, it can be excluded from the combination of the Cold Dark Matter and BR($b\\to s γ$) requirements. △ Less", "In the SUSY SU(5) GUT with the right-handed neutrinos, the neutrino Yukawa coupling induces the flavor-violating mass terms for the right-handed down squarks and left-handed sleptons, and they lead to imprint on the flavor physics in the hadronic and leptonic sectors. In this paper we study CP violation in $B_d^0$ and $B_s^0$, which is induced by the tau-neutrino Yukawa coupling. In particular, we notice the correlation of the CP asymmetries in $B_d^0\\to φK_s$ ($S_{φK_s}$) and $B_s^0\\to J/ψφ$ ($S_{J/ψφ}$) with other observables, such as $Br(τ\\toμγ)$, the muon EDM ($d_μ$), and the mixing-induced CP asymmetry in $B_d^0\\to M_s^0γ$ ($A_{bsg}$), since they have a common origin of the CP and flavor violation. The measurements are expected to play a significant role for consistency check of the SUSY SU(5) GUT. The hierarchical right-handed neutrino masses make the correlation better. We find that the current bound on $Br(τ\\toμγ)$ constrains the allowed region for $S_{φK_s}$ in this model. △ Less", "Grand unified theory defined on higher-dimensional orbifolds provides a new way to solve the hierarchy problem. In gauge theory on an orbifold many different sets of boundary conditions imposed at orbifold fixed points (branes) are related by large gauge transformations, forming an equivalent class of boundary conditions. Thanks to the Hosotani mechanism the physics remains the same in all theories in a given equivalent class, though the symmetry of boundary conditions differs from each other. Quantum dynamics of Wilson line phases rearranges the gauge symmetry. In the nonsupersymmetric SU(5) model the presence of bulk fermions leads to the spontaneous breaking of color SU(3). In the supersymmetric model with Scherk-Schwarz SUSY breaking, color SU(3) is spontaneously broken even in the absence of bulk fermions if there are Higgs multiplets. △ Less", "We confront the generally small cross sections for gluino pair production in e^+e^- annihilation with the much larger ones in photon-photon scattering at a multi-TeV linear collider like CERN CLIC. The larger rates and the steeper rise of the cross section at threshold may allow for a precise gluino mass determination in high-energy photon-photon collisions for a wide range of squark masses and post-LEP SUSY benchmark points. △ Less", "We show that the assumption of type II seesaw mechanism for small neutrino masses coupled with $b-τ$ mass unification in a minimal SUSY SO(10) model leads not only to a natural understanding of large atmospheric mixing angle ($θ_{23}$) among neutrinos, as recently pointed out, but also to large solar angle ($θ_{12}$) and a small $θ_{13}\\equiv U_{e3}$ as required to fit observations. This is therefore a minimal, completely realistic grand unified model for all low energy observations that naturally explains the diverse mixing patterns between the quark and leptons without any additional inputs such as extra global symmetries. The proposed long baseline neutrino experiments will provide a crucial test of this model since it predicts $U_{e3}\\simeq 0.16$ for the allowed range of parameters. △ Less", "The theory of inflation will be investigated as well as supersymmetry breaking in the context of supergravity, incorporating the target-space duality and the nonperturbative gaugino condensation in the hidden sector. We found an inflationary trajectory of a dilaton field and a condensate field which breaks supersymmetry at once. The model satisfies the slow-roll condition which solves the eta-problem. When the particle rolls down along the minimized trajectory of the potential V(S,Y) at a duality invariant point of T=1, we can obtain the e-fold value \\sim 57. And then the cosmological parameters obtained from our model well match the recent WMAP data combined with other experiments. This observation suggests one to consider the string-inspired supergravity as a fundamental theory of the evolution of the universe as well as the particle theory. △ Less", "We compute the one-loop supersymmetric (SUSY) contributions to the weak charges of the electron ($Q_W^e$), proton ($Q_W^p$), and cesium nucleus ($Q_W^{\\rm Cs}$) in the Minimal Supersymmetric Standard Model (MSSM). Such contributions can generate several percent corrections to the corresponding Standard Model values. The magnitudes of the SUSY loop corrections to $Q_W^e$ and $Q_W^p$ are correlated over nearly all of the MSSM parameter space and result in an increase in the magnitudes of these weak charges. In contrast, the effects on $Q_W^{\\rm Cs}$ are considerably smaller and are equally likely to increase or decrease its magnitude. Allowing for R-parity violation can lead to opposite sign relative shifts in $Q_W^e$ and $Q_W^p$, normalized to the corresponding Standard Model values. A comparison of $Q_W^p$ and $Q_W^e$ measurements could help distinguish between different SUSY scenarios. △ Less", "Superstring theory, models with extra dimensions and other SUSY models generically predict that the coupling constants are in fact vacuum expectation values of fields like the dilaton, moduli etc. Assuming some of these fields are light during inflation, we get generation of small classical inhomogeneities in these fields from inflation. Consequently, coupling constants inherit small inhomogeneities at scales much larger than the causal horizon in the early universe. After the moduli get pinned down to their minima, the spatial variations of coupling constants in the late time universe will be erased. However, inhomogeneities in coupling constants in the very early universe would generate modulated large scale fluctuations in all relic species that are produced due to interactions and freezing out. Moreover (p)reheating of the inflaton field results in modulated curvature fluctuations. Even if the standard inflaton fluctuations are suppressed, in this picture we may have pure curvature cosmological fluctuations entirely generated by the modulated spatial variations of the coupling constants during preheating. △ Less", "We compute the cross section for e+e- --> nu nu-bar A, where A is the CP-odd scalar, in the general CP-conserving type-II two-Higgs-doublet model. We sum the contributions from the ``t-channel'' e+e- --> nu nu-bar W W --> nu nu-bar A graphs and ``s-channel'' e+e- --> Z A --> nu nu-bar A graphs, including their interference. Higgs-triangle graphs and all box diagrams are included. For many parameter choices, especially those in the decoupling region of parameter space (light h and m_A, m_H, m_H^+ > 2 m_Z), the Higgs-triangle and box diagrams are found to be of minor importance, the main contributing loops being the top and bottom quark triangle diagrams. The predicted cross section is rather small for tan beta > 2 and/or m_A > 2 m_t. However, we also show that if parameters are chosen corresponding to large Higgs self-couplings then the Higgs-triangle graphs can greatly enhance the cross section. We also demonstrate that the SUSY-loop corrections to the b b-bar A coupling could be such as to greatly enhance this coupling, resulting in an enhanced nu nu-bar A cross section. Complete cross section expressions are given in the Appendices. △ Less", "We study the unitarity of the standard model (SM) in higher dimensions. We show that the essential features of SM unitarity remain after compactification, and place bounds on the highest Kaluza-Klein (KK) level N_KK and the Higgs mass m_H in the effective four-dimensional (4d) low-energy theory. We demonstrate these general observations by explicitly analyzing the effective 4d KK theory of a compactified 5d SM on S^1/Z_2. The nontrivial energy cancellations in the scattering of longitudinal KK gluons or KK weak bosons, a consequence of the geometric Higgs mechanism, are verified. In the case of the electroweak gauge bosons, the longitudinal KK states also include a small mixture from the KK Higgs excitations. With the analyses before and after compactification, we derive the strongest bounds on N_KK from gauge KK scattering. Applying these bounds to higher-dimensional SUSY GUTs implies that only a small number of KK states can be used to accelerate gauge coupling unification. As a consequence, we show that the GUT scale in the 5d minimal SUSY GUT cannot be lower than about 10^{14} GeV. △ Less", "In a wide class of NP models, which can be motivated through generic arguments and within SUSY, we obtain large contributions to $B^0_d$--$\\bar B^0_d$ mixing, but not to $ΔB=1$ processes. If we assume such a scenario, the solutions $φ_d\\sim 47^\\circ\\lor 133^\\circ$ for the $B^0_d$--$\\bar B^0_d$ mixing phase implied by $A_{CP}^{mix}(B_d\\to J/ψK_S)$ cannot be converted directly into a constraint in the $ρ$--$η$ plane. However, we may complement $φ_d$ with $|V_{ub}/V_{cb}|$ and the recently measured CP asymmetries in $B_d\\toπ^+ π^-$ to determine the unitarity triangle, with its angles $α$, $β$ and $γ$. To this end, we have also to control penguin effects, which we do by means of the $B_d\\toπ^\\mp K^\\pm$ branching ratio. Interestingly, the present data show a perfectly consistent picture not only for the ``standard'' solution of $φ_d\\sim 47^\\circ$, but also for $φ_d\\sim 133^\\circ$. In the latter case, the preferred region for the apex of the unitarity triangle is in the second quadrant, allowing us to accommodate conveniently $γ>90^\\circ$, which is also favoured by other non-leptonic B decays such as $B\\toπK$. Moreover, also the prediction for BR$(K^+\\toπ^+ν\\barν})$ can be brought to better agreement with experiment. Further strategies to explore this scenario with the help of $B_{d,s}\\toμ^+μ^-$ decays are discussed as well. △ Less", "The recently published cosmological bound on the absolute neutrino masses obtained from the Wilkinson Microwave Anisotropy Probe (WMAP) data has important consequences for neutrino experiments and models. Taken at face value, the new bound excludes the determination of the absolute neutrino mass in the KATRIN experiment and disfavors a neutrino oscillation interpretation of the LSND experiment. Combined with the KamLAND and Super-K data, the WMAP bound defines an accessible range for the neutrinoless double beta decay amplitude. The bound also impacts the Z-burst annihilation mechanism for resonant generation of extreme-energy cosmic rays on the cosmic neutrino background in two ways: it constrains the local overdensity of neutrino dark matter which is not helpful, but it also limits the resonant energy to a favorable range. In R-parity violating SUSY models neutrino masses are generated by trilinear and bilinear lepton number violating couplings. The WMAP result improves the constraints on these couplings over their existing values by an order of magnitude. △ Less", "We investigate the physics of the lightest CP-even MSSM Higgs boson at the Tevatron, the LHC, a linear e+e- collider, a gamma gamma collider and a mu+mu- collider. The analysis is performed in the three most prominent soft SUSY-breaking scenarios, mSUGRA, mGMSB and mAMSB. For all colliders the observability and parameter regions with suppressed production cross sections (compared to a SM Higgs boson with the same mass) are investigated. For the lepton and photon colliders the potential is analyzed of precision measurements of the branching ratios of the light CP-even Higgs boson for obtaining indirect bounds on the mass of the CP-odd Higgs boson and the high-energy parameters of the soft SUSY-breaking scenarios. In regions of the parameter space where the LHC can detect the heavy Higgs bosons, precision measurements of the properties of the light Higgs boson at the linear collider can provide valuable information for distinguishing between the mSUGRA, mGMSB and mAMSB scenarios. △ Less", "We present an updated assessment of the viability of t-b-tau Yukawa coupling unification in supersymmetric models. For the superpotential Higgs mass parameter mu>0, we find unification to less than 1% is possible, but only for GUT scale scalar mass parameter m_{16}~8-20 TeV, and small values of gaugino mass m_{1/2}<400 GeV. Such models require that a GUT scale mass splitting exists amongst Higgs scalars with m_{H_u}^2<m_{H_d}^2. Viable solutions lead to a radiatively generated inverted scalar mass hierarchy, with third generation and Higgs scalars being lighter than other sfermions. These models have very heavy sfermions, so that unwanted flavor changing and CP violating SUSY processes are suppressed, but may suffer from some fine-tuning requirements. While the generated spectra satisfy b->s gamma and (g-2)_mu constraints, there exists tension with the dark matter relic density unless m_{16}<3 TeV. These models offer prospects for a SUSY discovery at the Fermilab Tevatron collider via the search for chargino_1 neutralino_2 -> 3 leptons events, or via gluino pair production. If mu<0, Yukawa coupling unification to less than 5% can occur for m_{16} and m_{1/2}>1-2 TeV. Consistency of negative mu Yukawa unified models with b->s gamma, (g-2)_mu, and relic density all imply very large values of m_{1/2} typically greater than about 2.5 TeV, in which case direct detection of sparticles may be a challenge even at the LHC. △ Less", "We consider a plausible scenario in the Minimal Supersymmetric Standard Model (MSSM) where all the genuine supersymmetric (SUSY) particles are heavier than the electroweak scale. In this situation, indirect searches via their radiative corrections to low energy observables are complementary to direct searches, and they can be crucial if the SUSY masses are at the TeV energy range. We summarize the most relevant heavy SUSY radiative effects in Higgs boson physics and emphasize those that manifest a non-decoupling behaviour. We focus, in particular, on the SUSY-QCD non-decoupling effects in fermionic Higgs decays, flavour changing Higgs decays and Yukawa couplings. Some of their phenomenological implications at future colliders are also studied. △ Less", "We estimate the current theoretical uncertainty in sparticle mass predictions by comparing several state-of-the-art computations within the minimal supersymmetric standard model (MSSM). We find that the theoretical uncertainty is comparable to the expected statistical errors from the Large Hadron Collider (LHC), and significantly larger than those expected from a future e+e- Linear Collider (LC). We quantify the theoretical uncertainty on relevant sparticle observables for both LHC and LC, and show that the value of the error is significantly dependent upon the supersymmetry (SUSY) breaking parameters. We also present the theoretical uncertainty induced in fundamental-scale SUSY breaking parameters when they are fitted from LHC measurements. Two regions of the SUSY parameter space where accurate predictions are particularly difficult are examined in detail: the large tan(beta) and focus point regimes. △ Less", "The possibility of appearance of GUT precursors near the TeV scale (suggested by Dienes-Dudas-Gherghetta) is addressed within 5D GUTs compactified on an $S^{(1)}/Z_2\\tm Z_2'$ orbifold. For a low compactification scale (large radius), there is a significant non universal logarithmic contribution in the relative running of gauge couplings. This within 5D SU(5), with the minimal field content, gives wrong prediction for $\\al_3(M_Z)$ unless one goes beyond the minimal setting. The realization of the light precursors' idea thus requires some specific extensions. As a scenario alternative to SU(5) we also consider an SU(6) orbifold GUT, whose minimal non SUSY version gives natural unification. In all the presented unification scenarios with light precursors, various GUT scales are realized. This allows the model to be naturally embedded in either heterotic or Type ${\\rm I}$ string theories. △ Less", "In this letter we present a \"natural\" framework for obtaining bi-large neutrino mixing incorporating the FGY neutrino mass matrix ansatz. We show that an $SU(2) \\times U(1)$ family symmetry can provide the desired FGY neutrino mass ansatz in the MSSM. We also show how to obtain an approximate FGY ansatz in an SO(10) SUSY GUT. In this context, the same $SU(2) \\times U(1)$ family symmetry also generates the hierarchy of fermion masses as well as ameliorating SUSY flavor problems. △ Less", "Signal of lighter top squark has been looked for using Tevatron data in the di-electron plus di-jet channel. We find that the mass of the lighter top squark when it decays dominantly in the electron plus jet channel, can be ruled out up to 220 GeV at 95% C.L. using di-electron data. In the framework of R-parity breaking SUSY model we exclude relevant R-parity violating couplings for a range of top squark masses and other SUSY parameters. The bounds on R-parity violating couplings are very stringent for the parameter space where lighter top squark turns out to be the next to lightest supersymmetric particle. △ Less", "By using the anomalous magnetic and electric dipole moments of the $τ$ lepton in an effective lagrangian approach to the new physics, we investigate the lepton flavor violation (LFV) decays, $l\\to l'γ$, and $μ,τ$ anomalous magnetic and electric dipole moments in a lepton mass matrices ansatz which induced by SUSY GUT. We put very stringent constraints LFV decays and $τ$ anomalous magnetic and electric dipole moments. △ Less", "We compute the supersymmetric (SUSY) contributions to neutrino (antineutrino)-nucleus deep inelastic scattering in the Minimal Supersymmetric Standard Model (MSSM). We consider the ratio of neutral current to charged current cross sections, $R_ν$ and $R_{\\bar ν}$, and compare with the deviations of these quantities from the Standard Model predictions implied by the recent NuTeV measurement. After performing a model-independent analysis, we find that SUSY loop corrections generally have the opposite sign from the NuTeV anomaly. We discuss one scenario in which a right-sign effect arises, and show that it is ruled out by other precision data. We also study for R parity-violating (RPV) contributions. Although RPV effects could, in principle, reproduce the NuTeV anomaly, such a possibility is also ruled out by other precision electroweak measurements. △ Less", "The simplest extension of the MSSM that does not contradict LEP II experimental bound on the lightest Higgs boson mass at $\\tanβ\\sim 1$ is the modified Next-to-Minimal Supersymmetric Standard Model (MNSSM). We investigate the renormalization of Yukawa couplings and soft SUSY breaking terms in this model. The possibility of $b$-quark and $τ$-lepton Yukawa coupling unification at the Grand Unification scale $M_X$ is studied. The particle spectrum is analysed in the vicinity of the quasi-fixed point where the solutions of renormalization group equations are concentrated at the electroweak scale. △ Less", "We compute the supersymmetric QCD corrections to the polarization and the spin correlations of top quarks produced above threshold in e+e- collisions, taking into account arbitrary longitudinal polarization of the initial beams. △ Less", "We point out that supersymmetric warped geometry can provide a solution to the SUSY flavor problem, while generating hierarchical Yukawa couplings. In supersymmetric theories in a slice of AdS_5 with the Kaluza-Klein scale M_KK much higher than the weak scale, if all visible fields originate from 5D bulk fields and supersymmetry breaking is mediated by the bulk radion superfield and/or some brane chiral superfields, potentially dangerous soft scalar masses and trilinear $A$ parameters at M_KK can be naturally suppressed compared to the gaugino masses by small warp factor. We present simple models yielding phenomenologically interesting patterns of soft parameters in this framework. △ Less", "We consider supersymmetric scenarios in which the scale of SUSY breaking is low, sqrt{F}=O(TeV). Instead of studying specific models of this type, e.g. those with extra dimensions and low fundamental scale, we follow a model-independent approach based on a general effective Lagrangian, in which the MSSM supermultiplets are effectively coupled to a singlet associated to SUSY breaking. Our goal is to analyse the interplay bewteen SUSY breaking and electroweak breaking, generalizing earlier results. The conventional MSSM picture can be substantially modified, mainly because the Higgs potential contains additional effective quartic terms and resembles that of two-Higgs-doublet models, with an additional singlet. Novel opportunities to achieve electroweak breaking arise, and the electroweak scale may be obtained in a less fine-tuned way. Also the Higgs spectrum can be strikingly changed, and the lightest state can be much heavier than in usual supersymmetric scenarios. Other effects appear in the chargino and neutralino sectors, which contain the goldstino. Finally, we discuss the role of electroweak breaking in processes in which two goldstinos could be emitted, such as fermion-antifermion annihilation and the invisible decay of a Z boson or of neutral Higgs bosons. △ Less", "We compute supersymmetric QCD and supersymmetric electroweak corrections to the b and t quark masses and to the $τ$ lepton mass in the presence of CP phases valid for all $\\tanβ$. The analysis includes one loop diagrams arising from the exchange of gluinos, charginos and neutralinos. We find that the CP effects can change both the magnitude as well as the sign of the supersymmetric loop correction. In the region of parameter space studied we found that the numerical size of the correction to the b quark mass can be as large as 30 percent and to the $τ$ lepton mass as much as 5 percent. For the top quark mass the correction is typically less than a percent. These corrections are of importance in unified models since $b-τ$ and $b-t-τ$ unification is strongly affected by the size of these corrections. More generally these results will be of importance in analyses of quark-lepton textures with the inclusion of CP phases. Further, the analysis presented here is relevant in a variety of low energy phenomena where supersymmetric QCD and supersymmetric electroweak corrections on b mass enter prominently in B physics, e.g., in processes such as $B^0_{s,d}\\to l^+ł^-$. △ Less", "In a large class of SUSY GUT models with see-saw mechanism of neutrino mass generation, lepton flavor violating (LFV) decays $μ\\to e + γ$, $τ\\to μ+ γ$, etc., are predicted with rates that are within the reach of present and planned experiments. A crucial element in these predictions is the matrix of neutrino Yukawa couplings $\\ynu$ which can be expressed in terms of the light and RH heavy neutrino masses, the neutrino mixing PMNS matrix $U$, and an orthogonal matrix $\\mathbf{R}$. Leptogenesis can take place only if $\\mathbf{R}$ is complex. Considering the case of quasi-degenerate neutrinos and assuming that $\\mathbf{R}$ is complex, we derive simple analytical expressions for the $μ\\to e + γ$, $τ\\to μ+ γ$ and $τ\\to e + γ$ decay rates. Taking into account the leptogenesis constraints on the relevant parameters we show that the predicted rates of the LFV decays $μ\\to e + γ$, and $τ\\to e + γ$ are generically enhanced by a factor of $\\sim 10^{3}$ to $\\sim 10^{6}$ with respect to the rates calculated for real $\\mathbf{R}$, while the $τ\\to μ+ γ$ decay rate is enhanced approximately by two orders of magnitude. △ Less", "We present constraints on products of two leptoquark (LQ) coupling constants. The bounds are obtained from meson decays, in particular leptonic π, K, D, D_s, B, B_s decays. Furthermore semileptonic meson decays and mixing in neutral meson systems are discussed. We use the Buchmueller-Rueckl-Wyler-model for scalar and vector LQs. Bounds on R-parity violation can be extracted directly from the corresponding LQ bounds. Our results are listed in the Tables 6 (for LQs) and 7 (for SUSY particles) with english captions. The bounds of Davidson/Bailey/Campbell were updated. The SUSY-bounds of Dreiner/Polesello/Thormeier were reproduced. △ Less", "The considerable part of the parameter space in the MSSM corresponding to the infrared quasi fixed point scenario is excluded by LEP II bounds on the lightest Higgs boson mass. In the NMSSM the mass of the lightest Higgs boson reaches its maximum value in the strong Yukawa coupling limit when Yukawa couplings are essentially larger than gauge ones at the Grand Unification scale. In this case the renormalization group flow of Yukawa couplings and soft SUSY breaking terms is investigated. The quasi-fixed and invariant lines and surfaces are briefly discussed. The coordinates of the quasi-fixed points, where all solutions are concentrated, are given. △ Less", "Renormalization group approach to the SUSY flavor problem is elucidated. △ Less", "Contents (Part 2): 8.Renormalization of Coupling Constants in the Minimal SUSY Models (R. B. Nevzorov, K. A. Ter-Martirosyan and M. A. Trusov) 9.Multiple Point Model and Phase Transition Couplings ...(L.V. Laperashvili, D.A. Ryzhikh and H.B. Nielsen) 10.Family Replicated Fit of All Quark and Lepton Masses and Mixings (H. B. Nielsen and Y. Takanishi) 11.Family Replicated Calculation of Baryogenesis (H. B. Nielsen and Y. Takanishi) 12. Neutrino Oscillations in Vacuum on the Large Distance (D.A. Ryzhikh and K.A. Ter-Martirosyan) 13. Possibility of an Additional Source of Time Reversal Violation for Neutrinos (R. Erdem) 14.Quark-Lepton Masses and the Neutrino Puzzle in the AGUT Model (C.D. Froggatt) 15.Neutrinos in the Family Replicated Gauge Group Model (C.D. Froggatt) (Contents of Part 1 [hep-ph/0301029]: 1.Derivation of Lorentz Invariance and Three Space Dimensions in Generic Field Theory (C D. Froggatt and H. B. Nielsen) 2.Unitary Representations, Noncompact Groups SO(q; d - q)...(N. Mankoc Borstnik, H. B. Nielsen and D. Lukman) 3.Weyl Spinor of SO(1; 13), Families of Spinors ...(A. Borstnik Bracic and N. Mankoc Borstnik) 4.A Tight Packing Problem (A. Kleppe) 5.Why so Few Particle Species? ... (D.L. Bennett and A. Kleppe) 6.About Number of Families (D. Lukman, A. Kleppe and N.S. Mankoc Borstnik) 7.Coupling Constant Unification in Spin-Charge Unifying Model ....(N. Mankoc Borstnik and H. B. Nielsen)) △ Less", "Contents (Part 1): 1.Derivation of Lorentz Invariance and Three Space Dimensions in Generic Field Theory (C D. Froggatt and H. B. Nielsen) 2.Unitary Representations, Noncompact Groups SO(q; d - q)...(N. Mankoc Borstnik, H. B. Nielsen and D. Lukman) 3.Weyl Spinor of SO(1; 13), Families of Spinors ...(A. Borstnik Bracic and N. Mankoc Borstnik) 4.A Tight Packing Problem (A. Kleppe) 5.Why so Few Particle Species? ... (D.L. Bennett and A. Kleppe) 6.About Number of Families (D. Lukman, A. Kleppe and N.S. Mankoc Borstnik) 7.Coupling Constant Unification in Spin-Charge Unifying Model ....(N. Mankoc Borstnik and H. B. Nielsen) (Contents of Part 2 [hep-ph/0301030]: 8.Renormalization of Coupling Constants in the Minimal SUSY Models (R. B. Nevzorov, K. A. Ter-Martirosyan and M. A. Trusov) 9.Multiple Point Model and Phase Transition Couplings ...(L.V. Laperashvili, D.A. Ryzhikh and H.B. Nielsen) 10.Family Replicated Fit of All Quark and Lepton Masses and Mixings (H. B. Nielsen and Y. Takanishi) 11.Family Replicated Calculation of Baryogenesis (H. B. Nielsen and Y. Takanishi) 12. Neutrino Oscillations in Vacuum on the Large Distance (D.A. Ryzhikh and K.A. Ter-Martirosyan) 13. Possibility of an Additional Source of Time Reversal Violation for Neutrinos (R. Erdem) 14.Quark-Lepton Masses and the Neutrino Puzzle in the AGUT Model (C.D. Froggatt) 15.Neutrinos in the Family Replicated Gauge Group Model (C.D. Froggatt)) △ Less", "Most phenomenological analyses of searches for supersymmetric particles have been performed within the MSSM with real SUSY parameters and conserved R-parity and lepton flavour. Here we summarize recent results obtained in the (s)lepton sector when one of the above assumptions is relaxed. △ Less", "We analyze the construction of non-supersymmetric three generation six-stack Pati-Salam (PS) $SU(4)_C \\times SU(2)_L \\times SU(2)_R$ GUT classes of models, by localizing D6-branes intersecting at angles in four dimensional orientifolded toroidal compactifications of type IIA. Special role in the models is played by the presence of extra branes needed to satisfy the RR tadpole cancellation conditions. The models contain at low energy {\\em exactly the Standard model} with no extra matter and/or extra gauge group factors. They are build such that they represent deformations around the quark and lepton basic intersection number structure. The models possess the same phenomenological characteristics of some recently discussed examples (PS-A, PS-I; PS-II GUT classes; hep-th/0203187, hep-th/0209202; hep-th/0210004) of four and five stack PS GUTS respectively. Namely, there are no colour triplet couplings to mediate proton decay and proton is stable as baryon number is a gauged symmetry. The mass relation $m_e = m_d$ at the GUT scale is recovered. Even though more complicated, than in lower stack GUTS, the conditions of the non-anomalous U(1)'s to survive massless the generalized Green-Schwarz mechanism are solved consistently by the angle conditions coming from the presence of N=1 supersymmetric sectors involving the presence of {\\em extra} branes and also required for the existence of a Majorana mass term for the right handed neutrinos. △ Less", "The present unitarity triangle fit, whose essential input is represented by the s to d and b to d transition processes, fully agrees with the SM. However, most of the phenomena involving b to s transitions are still largely unexplored and hence b to s phenomenology still constitutes a place for new physics manifestations, in spite of the tremendous experimental and theoretical progress on B to X_s gamma. We perform a systematic study of the CP conserving and violating SUSY contributions to b to s processes in a generic MSSM. We consider gluino exchange contributions including NLO QCD corrections and lattice hadronic matrix elements for Delta B = 2 and Delta B = 1 processes. We take into account all available experimental information on processes involving b to s transitions (B to X_s gamma, B to X_s l^+ l^- and the lower bound on the B_s - bar B_s mass difference Delta M_s). We study the correlations among the relevant observables under scrutiny at present or in a not too far future: Delta M_s and the amount of CP violation in B to phi K_s, B_s to J/psi phi, B to X_s gamma. In particular we discuss the recent data by BaBar and BELLE on the time-dependent CP asymmetry in the decay B to phi K_s which suggest a deviation from the SM expectation. Our results show that the processes involving b to s transitions represent a splendid opportunity to constrain different MSSM realizations, and, even more important, that they offer concrete prospects to exhibit SUSY signals at B factories and hadron colliders in spite of all the past frustration in FCNC searches of new physics hints. △ Less", "We analyze a model based on SUSY SO(10) combined with SU(2) family symmetry and symmetric mass matrices constructed by the authors recently. Previously, only the parameter space for the LOW and vacuum oscillation (VO) solutions was investigated. We indicate in this note the parameter space which leads to large mixing angle (LMA) solution to the solar neutrino problem with a slightly modified effective neutrino mass matrix. The symmetric mass textures arising from the left-right symmetry breaking and the SU(2) symmetry breaking give rise to very good predictions for the quark and lepton masses and mixing angles. The prediction of our model for the |U_{eν_{3}}| element in the Maki-Nakagawa-Sakata (MNS) matrix is close to the sensitivity of current experiments; thus the validity of our model can be tested in the near future. We also investigate the correlation between the |U_{eν_{3}}| element and \\tan^{2}θ_{\\odot} in a general two-zero neutrino mass texture. △ Less", "Supersymmetric (SUSY) QCD corrections to the lightest neutral Higgs boson associated production with top quark pair are studied in the minimal supersymmetric standard model (MSSM) at Linear colliders. Our calculations show that the SUSY QCD effects generally are very moderate (say 10%) and under control, except for some rescattering effects which lead to a breakdown of perturbation theory and require a more detailed study. In the vicinity of the production threshold for the favorable model parameters under the framework of the on-shell renormalization scheme, SUSY QCD can be as large as about -50%. Such effects might be acted as the probe to determine the sign of $M_{LR}\\equiv A_t-μ/\\tanβ$. △ Less", "We consider the production, at future lepton colliders, of final fermion, sfermion, scalar pairs in SUSY models. For third family fermions and sfermions and for charged Higgses, the leading Yukawa effect at one loop for large c.m. energies comes from a linear logarithm of Sudakov type, that only depends, in the MSSM, on one SUSY mass scale and on tan(beta). Assuming a relatively light SUSY scenario, we illustrate a possible determination of tan(beta) at c.m. energies of about 1 TeV, working systematically at subleading logarithmic accuracy, at the one-loop level. △ Less", "We study soft supersymmetry breaking parameters in a supersymmetric unified model which potentially solves the doublet-triplet splitting problem. In the model the doublet-triplet splitting is solved by the discrete symmetry which is allowed to be introduced due to the direct product structure of the gauge group. The messenger fields for the gauge mediated supersymmetry breaking are naturally embedded in the model. The discrete symmetry required by the doublet-triplet splitting makes the gaugino masses non-universal and also induces a different mass spectrum for the scalar masses from the ordinary minimal gauge mediation model. Independent physical CP phases can remain in the gaugino sector even after the R-transformation. △ Less", "We study the O(at*as + at^2) two-loop corrections to the minimization conditions of the MSSM effective potential, providing compact analytical formulae for the Higgs tadpoles. We connect these results with the renormalization group running of the MSSM parameters from the grand unification scale down to the weak scale, and discuss the corrections to the Higgs mixing parameter mu and to the running CP-odd Higgs mass mA in various scenarios of gravity-mediated SUSY breaking. We find that the O(at*as) and O(at^2) contributions partially cancel each other in the minimization conditions. In comparison with the full one-loop corrections, the O(at*as + at^2) two-loop corrections significantly weaken the dependence of the parameters mu and mA on the renormalization scale at which the effective potential is minimized. The residual two-loop and higher-order corrections to mu and mA are estimated to be at most 1% in the considered scenarios. △ Less", "We discuss the structure of Yukawa couplings in D-brane models in which the SM fermion spectrum appears at the intersections of D-branes wrapping a compact space. In simple toroidal realistic examples one can explicitly compute the Yukawa couplings as a function of the geometrical data summing over world-sheet instanton contributions. A particular simple model with a N = 1 SUSY spectrum and three quark-lepton generations is studied in some detail. Remarkably, one can reproduce the observed spectrum of quark masses and mixings for particular choices of the compact radii and brane locations. In order to reproduce the smallness of up- and down-quark masses branes should be located in simple geometric configurations leading to some accidental global symmetries. We also find that the brane configurations able to reproduce the observed data may be considered as a deformation (by brane translation) of a configuration with Pati-Salam gauge symmetry. The origin of CP-violation in this formalism is quite elegant. It appears as a consequence of the generic presence of U(1) Wilson line backgrounds in the compact dimensions. One can reproduce the observed results for the CP-violation Jarlskog invariant J as long as the compact radii are of order of the string scale. DISCLAIMER: This paper is going to be substantially revised. Althought the physics and general concepts are still valid, the Yukawa couplings of the particular model presented in this paper have a simpler form than discussed here, as we recently pointed out in hep-th/0302105. A properly revised version will be eventually sent as the paper is appropriately corrected. △ Less", "The conventional signature for grand unified theories (GUT) is the proton decay. Recently, some models in extra dimensions or with specific discrete symmetries, which aim at solving the doublet-triplet problem, allow the color-triplet in the TeV mass region by suppressing the Yukawa couplings of the triplets to matter fermions. We study the hadronic production and detection of these TeV colored Higgs bosons as an alternative signature for GUT, which would behave like massive stable charged particles in particle detectors producing a striking signature of a charged track in the central tracking system and being ionized in the outer muon chamber. We found that the LHC is sensitive to a colored Higgs boson up to about 1.5 TeV. If the color-triplets are stable in cosmological time scale, they may constitute an interesting fraction of the dark matter. △ Less", "Gauge theory defined on the orbifold $M^4 \\times (S^1/Z_2)$ is investigated from the viewpoint of the Hosotani mechanism. Rearrangement of gauge symmetry takes place due to the dynamics of Wilson line phases. The physical symmetry of the theory, in general, differs from the symmetry of the boundary conditions. Several sets of boundary conditions having distinct symmetry can be related by gauge transformations, belonging to the same equivalence class. The Hosotani mechanism guarantees the same physics in all theories in one equivalent class. Examples are presented in the SU(5) theory. Zero modes of the extra-dimensional components, $A_y$, of gauge fields acquire masses by radiative corrections. In the nonsupersymmetric SU(5) model the presence of bulk fermions leads to the spontaneous breaking of color SU(3). In the supersymmetric model with Scherk-Schwarz SUSY breaking zero modes of $A_y$'s acquire masses of order of the SUSY breaking. △ Less", "BPS equations and wall solutions are studied keeping (part of) supersymmetry (SUSY) manifest. Using N=1 superfields, massive hyper-Kahler quotient is introduced to obtain massive N=2 (8 SUSY) nonlinear sigma models in four dimensions with T*CP(n) target manifold, which yield BPS wall solutions for the n=1 case. We also describe massive hyper-Kahler quotient of T*CP(n) by using the harmonic superspace formalism which preserves all SUSY manifestly, and BPS equations and wall solutions are obtained in the n=1 case. △ Less", "We review the current status of the Brookhaven muon g - 2 experiment, and it's effects on the SUSY parameter space when combined with dark matter relic density bounds, b->sγand Higgs mass constraints. If the 3σdeviation of g - 2 from the Standard Model value is correct, these data constrain the mSUGRA parameter space strongly, i.e. 300 GeV <~m_{1/2}<~850 GeV, and m_0 (at fixed \\tanβ, A_0) is tightly constrained (except at very large \\tanβ). Dark matter detection cross sections lie within the range accessible to future planned experiments. A non-universal gluino soft breaking mass however can greatly reduce the lower bound on m_{1/2} (arising from the b->sγconstraint) allowing for relatively light neutralinos, while non-universal Higgs H_2 mass can lead to new regions of allowed relic density where the detection cross sections can be increased by a factor of 10 or more. △ Less", "Decays of superheavy X particles with mass M_X ~ 10^12 - 10^16 GeV have been proposed as origin of the observed ultra high energy cosmic rays (UHECR). We describe in detail the physics involved in the different steps of the decay of such a particle. In particular, we give for the first time the complete set of splitting functions needed to model a parton shower in the minimal supersymmetric extension of the Standard Model (MSSM). We present our results in the form of fragmentation functions of any (s)particle of the MSSM into any final stable particle (proton, photon, electron, three types of neutrino, lightest superparticle LSP) at a virtuality Q = M_X, over a scaled energy range x = 2E/M_X in [10^{-13}, 1]. Extending the coverage to such small fractional energies is necessary since the energy region around 10^18 eV and below could be of considerable interest in testing this kind of model for generating UHECR. We explicitly demonstrate that our treatment conserves energy, and discuss the dependence of the final result on SUSY parameters. We also show that our results are essentially independent of the necessary extrapolation of the input fragmentation functions, which are known only for x >= 0.1, towards small x. Finally, we added a new treatment of the color coherence effects at very small x, using the analytic ``MLLA'' solution. Our computer code will soon be made available. △ Less", "We point out that slepton pairs produced via gauge boson fusion in anomaly mediated supersymmetry breaking (AMSB) model have very characteristic and almost clean signal at the Large Hadron Collider. In this article, we discuss how one lepton associated with missing energy and produced in between two high-$p_T$ and high-mass forward jets can explore quite heavy sleptons in this scenario. △ Less", "We give a thorough analysis of the correlation between the muon anomalous magnetic moment and the radiative lepton flavor violating (LFV) processes within the minimal supersymmetric standard model. We find that in the case when the slepton mass eigenstates are nearly degenerate, $δa_μ$, coming from SUSY contributions, hardly depends on the lepton flavor mixing and, thus, there is no direct relation between $δa_μ$ and the LFV processes. On the contrary, if the first two generations' sleptons are much heavier than the 3rd one, i.e., in the effective SUSY scenario, the two quantities are closely related. In the latter scenario, the SUSY parameter space to account for the experimental $δa_μ$ is quite different from the case of no lepton flavor mixing. Especially, the Higgsino mass parameter $μ$ can be either positive or negative. △ Less", "We discuss a five dimensional inflationary scenario based on a supersymmetric SO(10) model compactified on $S^1/(Z_2\\times Z_2')$. Inflation is implemented through scalar potentials on four dimensional branes, and a brane-localized Einstein-Hilbert term is essential to make both brane vacuum energies positive during inflation. The orbifold boundary conditions break the SO(10) gauge symmetry to $SU(4)_c\\times SU(2)_L\\times SU(2)_R$ ($\\equiv H$). The inflationary scenario yields $δT/T\\propto (M/M_{\\rm Planck})^2$, which fixes $M$, the symmetry breaking scale of $H$ to be close to the SUSY GUT scale of $10^{16}$ GeV. The scalar spectral index $n$ is $0.98-0.99$, while the gravitational wave contribution to the quadrupole anisotropy is negligible ($\\lapproxeq 1 {%}$). The inflaton decay into the lightest right handed neutrinos yields the observed baryon asymmetry via leptogenesis. △ Less", "In order to determine the fundamental MSSM parameters M_1, M_2, μand \\tanβthe tau polarization from stau decays can be explored as a `bridge' between the gaugino/higgsino and the stau sector in particular in the high \\tanβrange. Even in the case of high \\tanβan accuracy of δ(\\tanβ)\\approx 5% with an simultanous determination of A_τ is possible without assuming a specific SUSY breaking scheme. △ Less", "We study the quantum stability of Type IIB orbifold and orientifold string models in various dimensions, including Melvin backgrounds, where supersymmetry (SUSY) is broken {\\it à la} Scherk-Schwarz (SS) by twisting periodicity conditions along a circle of radius R. In particular, we compute the R-dependence of the one-loop induced vacuum energy density $ρ(R)$, or cosmological constant. For SS twists different from Z2 we always find, for both orbifolds and orientifolds, a monotonic $ρ(R)<0$, eventually driving the system to a tachyonic instability. For Z2 twists, orientifold models can have a different behavior, leading either to a runaway decompactification limit or to a negative minimum at a finite value R_0. The last possibility is obtained for a 4D chiral orientifold model where a more accurate but yet preliminary analysis seems to indicate that $R_0\\to \\infty$ or towards the tachyonic instability, as the dependence on the other geometric moduli is included. △ Less", "We systematically study VEVs of a gauge scalar field $Σ$ in a bulk U(1) vector multiplet and scalar fields in brane/bulk hypermultiplets charged under U(1) in the 5D $S^1/Z_2$ orbifold model with generic FI terms. A non-trivial VEV of $Σ$ generates bulk mass terms for U(1) charged fields, and their zero modes have non-trivial profiles. In particular, in the SUSY-breaking case, bosonic and fermionic zero modes have Gaussian profiles. Such non-trivial profiles are useful to explain hierarchical couplings. A toy model for SUSY breaking is studied, and it yields sizable $D$-term contributions to scalar masses. Because the overall magnitude of $D$-term contributions is the same everywhere in the bulk and also on both branes, we have to take into account these contributions and other SUSY-breaking terms to obtain a realistic description. We also give profiles and mass eigenvalues of higher modes. △ Less", "The Higgs boson production p p (p\\bar p) -> b h +X via b g -> b h at the LHC, which may be an important channel for testing the bottom quark Yukawa coupling, is subject to large supersymmetric quantum corrections. In this work the one-loop SUSY-QCD corrections to this process are evaluated and are found to be quite sizable in some parameter space. We also study the behavior of the corrections in the limit of heavy SUSY masses and find the remnant effects of SUSY-QCD. These remnant effects, which are left over in the Higgs sector by the heavy sparticles, are found to be so sizable (for a light CP-odd Higgs and large \\tanβ) that they might be observable in the future LHC experiment. The exploration of such remnant effects is important for probing SUSY, especially in case that the sparticles are too heavy (above TeV) to be directly discovered at the LHC. △ Less", "We study the effect of departures from SUSY GUT universality on the neutralino relic density and both its direct detection and indirect detection, especially by neutrino telescopes. We find that the most interesting models are those with a value of $M_3|_{GUT}$ lower than the universal case. △ Less", "That $μ\\to e, γ$ and $τ\\to μ,γ$ are sensitive probes of SUSY models with a see-saw mechanism is a well accepted fact. Here we propose a `top-down' approach in a general SUSY SO(10) scheme. In this framework, we show that at least one of the neutrino Yukawa couplings is as large as the top Yukawa coupling. This leads to a strong enhancement of these leptonic flavour changing decay rates. We examine two `extreme' cases, where the lepton mixing angles in the neutrino Yukawa couplings are either small (CKM-like) or large (PMNS-like). In these two cases, we quantify the sensitivity of leptonic radiative decays to the SUSY mass spectrum. In the PMNS case, we find that the ongoing experiments at the B-factories can completely probe the spectrum up to gaugino masses of 500 GeV (any tan $β$). Even in the case of CKM-like mixings, large regions of the parameter space will be probed in the near future, making these two processes leading candidates for indirect SUSY searches. △ Less", "We discuss the fermion mass hierarchy and the flavor mixings in the fat brane scenario of five dimensional SUSY theory. The decoupling solution of the sfermion mass spectrum can be realized by introducing the vector-like mirror fields in an extra dimension. In this scenario, both the left- and right-handed sleptons can have sizable flavor mixings. We point out that this sizable flavor mixings can induce the suitable magnitude of the muon anomalous magnetic moment ($g_μ-2$) within the experimental bounds of lepton flavor violating processes. △ Less", "We show that there are qualitative differences in correlations among $(g-2)_μ$, $B\\to X_s γ$, $B \\to X_{s} l^+ l^-$ and $B_s \\to μ^+ μ^-$ in various SUSY breaking mediation mechanisms: minimal supergravity (mSUGRA), gauge mediation (GMSB), anomaly mediation (AMSB), gaugino mediation ($\\tilde{g}$MSB), weakly and strongly interacting string theories, and $D$ brane models. After imposing the direct search limits on the Higgs boson and SUSY particle search limits and $B\\to X_s γ$ branching ratio, we find all the scenarios can accommodate the $a_μ\\equiv (g-2)_μ/2 $ in the range of (a few tens)$\\times 10^{-10}$, and predict that the branching ratio for $B\\to X_s l^+ l^-$ can differ from the standard model (SM) prediction by $\\pm 20 %$ but no more. On the other hand, the $B_s \\to μ^+ μ^-$ is sensitive to the SUSY breaking mediation mechanisms through the pseudoscalar and stop masses ($m_A$ and $m_{\\tilde{t}_1}$), and the stop mixing angle. In the GMSB with a small messenger number, the AMSB, the $\\tilde{g}$MSB and the noscale scenarios, one finds that $B(B_s \\to μ^+ μ^-) \\lesssim 2 \\times 10^{-8}$, which is below the search limit at the Tevatron Run II. Only the mSUGRA or string inspired models can generate a large branching ratio for this decay. △ Less", "We derive the low-energy effective theory on the BPS domain wall in 4D N=1 global SUSY theories in terms of the 3D superfields. Our derivation makes the preserved SUSY by the wall manifest and the procedure for integrating out the massive modes easier. Our procedure clarifies how the 3D superfields are embedded into the 4D chiral and vector superfields. We also point out a shortcoming of the conventional procedure for deriving the effective theory on the wall. △ Less", "Thermal inflation usually requires an inflationary potential with nonrenormalizable operators (NROs). We demonstrate how O'Raifeartaigh models with or without NROs can provide thermal inflation and a solution to the moduli problem, as well as provide SUSY breaking. We then discuss a scenario where generalized O'Raifeartaigh potentials (with NROs) are included in a SUGRA where the supergravity and O'Raifeartaigh potentials provide negative and a positive contributions to the cosmological constant respectively. Tuning these contributions to nearly cancel can provide the present value of the dark energy. △ Less", "In models where the ultra-high energy cosmic ray problem is solved by top-down scenarios, a significant flux of ultra-high energy neutralinos is predicted. We calculate the number of events expected from such particles in future experiments such as EUSO or OWL. We show that by using the Earth as a filter, showers generated by neutralinos can be separated from neutrino generated showers. We find that for many models, observable rates are expected. △ Less", "We study contributions of quark-squark-gluino interactions in Minimal Supersymmetric Standard Model (MSSM) to B->PP (PP =Kpi, pipi, KK) decays using QCD improved factorization method for the evaluation of the hadronic matrix elements and taking into account renormalization group running of the Wilson coefficients from SUSY scale (~ m_{\\tilde q}) to the low energy scale (= m_b) applicable to B decays. Using the most recent experimental data we obtain constraints on flavor changing Supersymmetric (SUSY) parameters (δ_{ij})_{LL, RR}. For ΔS = -1 processes, b-> s gamma is usually considered to give the strongest limits. We, however, find that in some part of the parameter space B-> Kpi processes give stronger bounds. Implications for B^0_s -\\bar B^0_s mixing is discussed. We also study cons traints obtained from ΔS = 0 processes B-> pipi, KK, rho gamma and B_d -\\bar B_d mixing. In this case, in a large part of the parameter space B_d - \\bar B_d provides the best bound, but B-> K^- K^0, rho gamma can still give interesting constraints in a complementary region of the parameter space. △ Less", "We discuss the perspectives of testing the right-handed Majorana mass scale M_R of the SUSY see-saw model in the mSUGRA framework. Lepton-flavor violating low energy processes are analyzed in recently proposed post-LEP benchmark scenarios, taking into account present uncertainties and future developments in the neutrino sector. Nonobservation of mu -> e gamma in the next-generation PSI experiment will provide upper bounds on M_R of the order of 10^(12-14) GeV, while on the other hand, a positive signal for tau -> mu gamma at SUPERKEKB or the LHC may determine M_R for a given mSUGRA scenario with an accuracy of a factor of 2. △ Less", "We consider $B_s \\to μ^+ μ^-$ and the muon $(g-2)_μ$ in various SUSY breaking mediation mechanisms. If the decay $B_s \\to μ^+ μ^-$ is observed at Tevatron Run II with a branching ratio larger than $\\sim 2 \\times 10^{-8} $, the noscale supergravity (including the gaugino mediation), the gauge mediation scenario with small number of messenger fields and low messenger scale, and a class of anomaly mediation scenarios will be excluded, even if they can accommodate a large muon $(g-2)_μ$. On the other hand, the minimal supergravity scenario and similar mechanisms derived from string models can accommodate this observation. △ Less", "We study the neutral Higgs boson production via the gluon fusion process with the $\\tautau$ final state at the upgraded Fermilab Tevatron, including a complete simulation of signal channels and leading background processes. For the SM Higgs boson, this $h\\to \\tautau$ channel may provide important addition for the Higgs boson discovery in the mass range 120-140 GeV. In minimal supersymmetric models, natural enhancement for the signal rate over the SM expectation makes the $h,H,A\\to \\tautau$ signal observable for large $\\tanβ$ and low $M_A$, which may lead to full coverage for SUSY Higgs parameters at the Tevatron with a moderate integrated luminosity. △ Less", "Recent experimental data indicates that the fine structure constant alpha may be varying on cosmological time scales. We consider the possibility that such a variation could be induced by a second order phase transition which occurs at late times (z ~ 1 - 3) and involves a change in the vacuum expectation value (vev) of a scalar with milli-eV mass. Such light scalars are natural in supersymmetric theories with low SUSY breaking scale. If the vev of this scalar contributes to masses of electrically charged fields, the low-energy value of alpha changes during the phase transition. The observational predictions of this scenario include isotope-dependent deviations from Newtonian gravity at sub-millimeter distances, and (if the phase transition is a sharp event on cosmological time scales) the presence of a well-defined step-like feature in the alpha(z) plot. The relation between the fractional changes in alpha and the QCD confinement scale is highly model dependent, and even in grand unified theories the change in alpha does not need to be accompanied by a large shift in nucleon masses. △ Less", "We study single Higgs boson production in gamma gamma collisions proceeding via the hadronic content of the photon. These processes complement previous studies of pair and single Higgs production at e^+e^- colliders. For SM Higgs masses of current theoretical interest, the resolved photon contributions are non-negligible in precision cross section measurements. The charged Higgs cross sections are not competitive with the gamma gamma -> H^+ H^- process and at best might offer some information about quark-Higgs couplings. Finally, resolved photon production of the heavier Higgs bosons, H^0 and A^0 of the MSSM, can probe regions of the SUSY parameter space that will complement other measurements. This last process shows some promise in SUSY Higgs searches and warrants further study. △ Less", "Supersymmetry breaking and compactification of extra space-time dimensions may have a common dynamical origin if our universe is spontaneously generated in the form of a four-dimensional topological or non-topological defect in higher dimensional space-time. Within such an approach the conventional particles are zero modes trapped in the core of the defect. In many cases solutions of this type spontaneously break all supersymmetries of the original theory, so that the low-energy observer from ``our'' universe inside the core would not detect supersymmetry. Since the extra dimensions are not compact but, rather, inaccessible to low-energy observers, the usual infinite tower of the Kaluza-Klein excitations does not exist. Production of superpartners at the energy scale of SUSY restoration will be accompanied by four-momentum non-conservation. (Depending on the nature of the solution at hand, the non-conservation may either happen above some threshold energy or be continuous). In either case, the door to extra dimensions may be not very far from the energies accessible at present colliders. △ Less"]