["We compute the SUSY-breaking soft terms in a magnetized D7-brane model with MSSM-like spectrum, under the general assumption of non-vanishing auxiliary fields of the dilaton and Kahler moduli. As a particular scenario we discuss SUSY breaking triggered by ISD or IASD 3-form fluxes. △ Less", "Supersymmetric models with Lorentz violation can be formulated in superspace. Two theories based on the Wess-Zumino model are discussed. A compactification of superspace can be employed to understand the chiral superfield that arises in the models. △ Less", "We demonstrate that electric dipole moments (EDMs) strongly constrain possible SUSY contributions to the CP asymmetries of B processes; LL and/or RR flavour mixings between second and third generations are severely restricted by the experimental limit on the mercury EDM, and so therefore are their possible contributions to the CP asymmetries of B --> φK and B --> η' K. We find that SUSY models with dominant LR and RL mixing through non-universal A-terms is the only way to accommodate the apparent deviation of CP asymmetries from those expected in the Standard Model without conflicting with the EDM bounds or with any other experimental results. △ Less", "We discuss the possibility of breaking the electroweak symmetry in theories with extra dimensions via boundary conditions, without a physical Higgs scalar in the spectrum. In these models the unitarity violation scale can be delayed via the exchange of massive KK gauge bosons. The correct W/Z mass ratio can be enforced in a model in warped space with a left-right symmetric gauge group in the bulk. Fermion masses can be similarly generated via boundary conditions. In the perturbative regime the S parameter is too large in the simplest model, however this can be alleviated in by changing the structure of the light fermions slightly. The major remaining issue is the inclusion of a heavy top quark without generating an unacceptably large shift in the Zbb coupling. △ Less", "It is argued that every quark flavor can be described as a lepton that has been excited by the absorption of a supernatural field, which is defined. In this context, a minimal irriducible representation of SUSY SU(5) is constructed exclusively of the chiral modes that correspond to three generations of leptons (or quarks) and their scaler superpartners. The proposed model predicts a new quark; a left-handed (non-strange) version of the strange quark. △ Less", "We discuss the global structure of pp events at LHC with hard processes (particle production in two-parton collisions) on the basis of the transverse spatial characteristics of the partonic initial state. Studies of hard exclusive processes in ep scattering have shown that the transverse area occupied by partons with x >= 10^{-2} is much smaller than the size of the nucleon as it appears in generic inelastic pp collisions at high energies (\"two-scale picture\"). We show that this is consistent with the observation that the elastic pp amplitude at the Tevatron energy is close to the black body limit at small impact parameters. Our picture implies that inclusive heavy particle production (Higgs, SUSY) happens only in central pp collisions. At LHC energies, the final state characteristics of such events are strongly influenced by the approach to the black body limit, and thus may differ substantially from what one expects based on the extrapolation of Tevatron results. Our two-scale picture also allows us to analyze several types of hard diffractive processes observable at LHC: i) Diffractive proton dissociation into three jets, which probes small-size configurations in the proton wave function; ii) exclusive diffractive Higgs production, in which we estimate the rapidity gap survival probability; iii) inclusive diffractive processes. △ Less", "We consider the top-antitop invariant mass distributions for production of unpolarized and polarized top quark pairs at LHC, in the theoretical framework of the MSSM. Assuming a \"moderately\" light SUSY scenario, we derive the leading logarithmic electroweak contributions at one loop in a region of large invariant mass, $M_{t\\bar t}\\simeq1$ TeV, for the unpolarized differential cross section $dσ/dM_{t\\bar t}$ and for the differential longitudinal top polarization asymmetry $A_t(M_{t\\bar t})$. We perform a realistic evaluation of the expected uncertainties of the two quantities, both from a theoretical and from an experimental point of view, and discuss the possibility of obtaining, from accurate measurements of the two mass distributions, stringent consistency tests of the model, in particular identifications of large $\\tanβ$ effects. △ Less", "I briefly review the physics of the Higgs sector in the Standard Model (SM) and its supersymmetric extension, in particular the MSSM, and discuss the prospects for discovering the Higgs particles at the Large Hadron Collider. Some emphasis will be put on the theoretical developments which occurred in the last few years. △ Less", "The current status of electroweak precision observables in the Minimal Supersymmetric Standard Model (MSSM) is reviewed. We focus in particular on the $W$ boson mass, M_W, the effective leptonic weak mixing angle, sin^2 theta_eff, the anomalous magnetic moment of the muon, (g-2)_μ, and the lightest CP-even MSSM Higgs boson mass, m_h. We summarize the current experimental situation and the status of the theoretical evaluations. An estimate of the current theoretical uncertainties from unknown higher-order corrections and from the experimental errors of the input parameters is given. We discuss future prospects for both the experimental accuracies and the precision of the theoretical predictions. Confronting the precision data with the theory predictions within the unconstrained MSSM and within specific SUSY-breaking scenarios, we analyse how well the data are described by the theory. The mSUGRA scenario with cosmological constraints yields a very good fit to the data, showing a clear preference for a relatively light mass scale of the SUSY particles. The constraints on the parameter space from the precision data is discussed, and it is shown that the prospective accuracy at the next generation of colliders will enhance the sensitivity of the precision tests very significantly. △ Less", "We investigated the lepton flavor violation processes $p\\bar{p} \\to eμ+X$ induced by R-parity violating interactions at the Tevatron hadron collider. The theoretical calculation and Monte Carlo simulation demonstrate that with a set of suitable cuts on experimental observables, one might be capable to reduce the standard model physical background to a controllable level so that the signals of R-parity violating interactions could be detected distinctively. Furthermore, clear sneutrino information could be abstracted from the purified event sample where other SUSY scalar quark 'pollution' is heavy suppressed. We conclude that with a reasonable assumption of $10fb^{-1}$ integrated luminosity, the Experiments at the Tevatron machine would have potential to discover sneutrino in the region of $m_{\\tildeν}\\le400GeV$ via lepton flavor violation $eμ$ production channels, or extend the mass scale constraint up to $m_{\\tildeν}\\ge 550 GeV$ at 95% CL. △ Less", "To date, the properties of Q-balls arising from an Affleck-Dine condensate in gravity-mediated SUSY breaking have been obtained primarily through numerical simulations. In this work, we will derive the expected charge of the Q-balls formed in such a scenario through an analytical treatment. We will also examine the numerically observed difference between Q-ball formation in weakly charged condensates and formation in strongly charged condensates. △ Less", "We study supersymmetry breaking effects induced on D3-branes at singularities by the presence of NSNS and RR 3-form fluxes. First, we discuss some local constructions of chiral models from D3-branes at singularities, as well as their global embedding in flux compactifications. The low energy spectrum of these constructions contains features of the supersymmetric Standard Model. In these models, both the soft SUSY parameters and the mu-term are generated by turning on the 3-form NSNS and RR fluxes. We then explore some model-independent phenomenological features as, e.g., the fine-tuning problem of electroweak symmetry breaking in flux compactifications. We also comment on other phenomenological features of this scenario. △ Less", "We summarize a recent strategy for a global analysis of the B -> pi pi, pi K systems and rare decays. We find that the present B -> pi pi and B -> pi K data cannot be simultaneously described in the Standard Model. In a simple extension in which new physics enters dominantly through Z^0 penguins with a CP-violating phase, only certain B -> pi K modes are affected by new physics. The B -> pi pi data can then be described entirely within the Standard Model but with values of hadronic parameters that reflect large non-factorizable contributions. Using the SU(3) flavour symmetry and plausible dynamical assumptions, we can then use the B -> pi pi decays to fix the hadronic part of the B -> pi K system and make predictions for various observables in the B_d -> pi^-+ K^+- and B^+- -> pi^+- K decays that are practically unaffected by electroweak penguins. The data on the B^+- -> pi^0 K^+- and B_d -> pi^0 K modes allow us then to determine the electroweak penguin component which differs from the Standard Model one, in particular through a large additional CP-violating phase. The implications for rare K and B decays are spectacular. In particular, the rate for K_L -> pi^0 nu \\bar nu is enhanced by one order of magnitude, the branching ratios for B_{d,s} -> mu^+ mu^- by a factor of five, and BR(K_L -> pi^0 e^+ e^-, pi^0 mu^+ mu^-) by factors of three. △ Less", "We study effects of SUSY particles in the unitarity triangle analysis and the CP asymmetries in b -> s decays. We consider three different SUSY models, the minimal supergravity, SU(5) SUSY GUT with right-handed neutrinos, and MSSM with U(2) flavor symmetry, and show that the patterns and correlations of deviations from the standard model will be useful to discriminate the different SUSY models in future B experiments. △ Less", "Hadronic and leptonic EDMs in SUSY GUTs are reviewed in this article. △ Less", "Lepton flavour violation is considered in two models, Standard Model with additional heavy Dirac neutrinos and minimal supersymmetric standard model (MSSM) with SO(10) theoretical frame and minimal SUGRA (mSUGRA) SUSY-breaking mediation mechanism. The models are briefly explained. The structure of the amplitudes for neutrinoless decays of the lepton into a lepton and semileptonic neutrinoless decays of a lepton is given. The method for identification of meson content in the quark currents is exposed. The comparison of the amplitudes is made showing which of the processes have the largest branching ratios. The numerical results for the dominant decay rates are presented. △ Less", "The observed pattern of lepton mixing does not give an evidence of the seesaw. It is easier to disprove seesaw showing that one of the alternatives gives dominant contribution to the neutrino mass. We consider alternative mechanisms based on (i) small (tree level) effective couplings, (ii) small VEV, (iii) radiative generation of masses, (iv) protection by SUSY breaking scale or by $μ$-term, (v) small overlap of wave functions of the left and right handed neutrino components in extra dimensions. Seesaw can be the mechanism of suppression of the Dirac mass terms and not dominant mechanism of the neutrino mass giving just a sub-leading contribution. △ Less", "We present a systematic analysis of the decay b --> s gamma at the leading log within the framework of Supersymmetry without R-parity. We point out some new contributions in the form of bilinear-trilinear combination of R-parity violating (RPV) couplings that are enhanced by large tanbeta. We also improve by a few orders of magnitude, bounds on several combinations of RPV parameters. △ Less", "A Majorana type of the neutrino mass matrix induces a class of lepton number violating processes. Cross sections of these reactions are given in terms of the neutrino mass matrix element, and a semi-realistic event rate is estimated. These processes provide mass and mixing parameters not directly accessible by the neutrino oscillation experiments. If these processes are discovered with a larger rate than given here, it would imply a new physics of the lepton number violation not directly related to the Majorana neutrino mass, such as R-parity violating operators in SUSY models. △ Less", "At the LHC, superpartners with the masses lighter than a few TeV may be found, and the masses of the supersymmetric (SUSY) particles and their interactions will be studied. The information would be the base to consider the SUSY breaking mechanism and cosmology related to the SUSY dark matter. We review the recent studies that aims for the ``precise SUSY study'' at the LHC. △ Less", "This talk presents the detection issues for the lightest slepton \\tildeτ_1 at a future e+e- TeV collider given the dark matter constraints set on the SUSY mass spectrum by the WMAP results. Two methods for measuring its mass m_{\\tildeτ_1} and the resulting precision on the dark matter density are briefly discussed in the SUSY mSUGRA scenario with R-parity conservation when the mass difference between m_{\\tildeτ_1} and that of the lightest neutralino is small (a few GeV). The analysis is performed with TESLA parameters in both head-on and crossing angle modes. △ Less", "A radiatively-induced neutrino mass matrix with a simple structure is proposed on the basis of an SU(5) SUSY GUT model with R-parity violation. The model has matter fields $\\bar{5}'_{L}+5'_{L}$ in addition to the ordinary matter fields $\\bar{5}_{L}+10_{L}$ and Higgs fields $H_u+\\bar{H}_d$. The R-parity violating terms are given by $\\bar{5}_{L} \\bar{5}_{L} 10_{L}$, while the Yukawa interactions are given by $\\bar{H}_d \\bar{5}'_{L} 10_{L}$. Since the matter fields $\\bar{5}'_L$ and $\\bar{5}_L$ are different from each other at the unification scale, the R-parity violation effects at a low energy scale appear only through the $\\bar{5}'_L \\leftrightarrow \\bar{5}_{L}$ mixings. In order to make this R-parity violation effect harmless for proton decay, a discrete symmetry Z_3 and a triplet-doublet splitting mechanism analogous to the Higgs sector are assumed. △ Less", "We show that the isocurvature perturbations imply that the gravitationally produced superheavy dark matter must have masses larger than few times the Hubble expansion rate at the end of inflation. This together with the bound on tensor to scalar contribution to the CMB induces a lower bound on the reheating temperature for superheavy dark matter to be about 10^7 GeV. Hence, if the superheavy dark matter scenario is embedded in supergravity models with gravity mediated SUSY breaking, the gravitino bound will squeeze this scenario. Furthermore, the CMB constraint strengthens the statement that gravitationally produced superheavy dark matter scenario prefers a relatively large tensor mode amplitude if the reheating temperature must be less than 10^9 GeV. △ Less", "We show that a unique, most probable and stable solution for the wavefunction of the universe, with a very small cosmological constant $Λ_1 \\simeq (\\fracπ{l_p N})^2$, can be predicted from the supersymmetric minisuperspace with $N$ vacua, of the landscape of string theory without reffering to the antropic principle. Due to the nearest neighbor tunneling in moduli space lattice, the $N$-fold degeneracy of vacua is lifted and a discrete spectrum of bound state levels over the whole minisuperspace emerges. $SUSY$ is spontaneously broken by these bound states, with discrete nonzero energy levels $Λ_s \\simeq (\\frac{s π}{l_p N})^2$, $s = 1,2,..$. △ Less", "In supersymmetric gluodynamics (N=1 super-Yang-Mills theory) we show that the spectral functions induced by the nonchiral operator Tr G_{αβ} \\barλ^2 are fully degenerate in the J^{PC}=1^{\\pm -} channels. The above operator is related to N=1/2 generalization of SUSY. Using the planar equivalence, this translates into the statement of degeneracy between the mesons produced from the vacuum by the operators (\\bar Ψ\\vec EΨ+ i\\bar Ψ\\vec B γ^5Ψ) and (\\bar Ψ\\vec BΨ- i\\bar Ψ\\vec E γ^5Ψ) in one-flavor QCD, up to 1/N corrections. Here Ψis the quark field, and \\vec E ,\\vec B are chromoelectric/chromomagnetic fields, respectively. △ Less", "We discuss applications of the perturbative QCD approach in the exclusive non-leptonic two body B-meson decays. We briefly review its ingredients and some important theoretical issues on the factorization approaches. PQCD results are compatible with present experimantal data for the charmless B-meson decays. We predict the possibility of large direct CP asymmetry in $B^0 \\to π^{+}π^{-}$ $(23\\pm7 %)$ and $B^0\\to K^{+}π^{-}$ $(-17\\pm5%)$. We also investigate the Branching ratios, CP asymmetry and isopsin symmetry breaking in $B \\to (K^*/ρ) γ$ decays and look for the possible new physics contribution via gluino mediation SUSY which can accomodate the large deviation of $S_{φK_s}$ from SM.} △ Less", "Supersymmetry remains compelling theory over 30 years in spite of lack of its discovery. It could be already near the corner our days, therefore present and upcoming experiments are crucial for constraining or even discovery of the supersymmetry. △ Less", "Since the expected rates for neutralino-nucleus scattering are expected to be small, one should exploit all the characteristic signatures of this reaction. Such are: (i) In the standard recoil measurements the modulation of the event rate due to the Earth's motion. (ii) In directional recoil experiments the correlation of the event rate with the sun's motion. One now has both modulation, which is much larger and depends not only on time, but on the direction of observation as well, and a large forward-backward asymmetry. (iii) In non recoil experiments gamma rays following the decay of excited states populated during the Nucleus-LSP collision. Branching ratios of about 6 percent are possible. △ Less", "Supersymmetric models have traditionally been assumed to be perturbative up to high scales due to the requirement of calculable unification. In this note I review the recently proposed `Fat Higgs' model which relaxes the requirement of perturbativity. In this framework, an NMSSM-like trilinear coupling becomes strong at some intermediate scale. The NMSSM Higgses are meson composites of an asymptotically-free gauge theory. This allows us to raise the mass of the Higgs, thus alleviating the MSSM of its fine tuning problem. Despite the strong coupling at an intermediate scale, the UV completion allows us to maintain gauge coupling unification. △ Less", "A simple extension of the minimal renormalizable supersymmetric SO(10) grand unified theory by adding a 120-dimensional Higgs representation is examined. This brings new antisymmetric contributions to the relevant quark and lepton mass sum rules and leads to a better fit of the measured values of lepton masses and mixings together with a natural completion of the renormalizable Higgs sector within the SUSY SO(10) framework. △ Less", "We study hadronic and leptonic flavor physics in a SUSY SO(10) model proposed by Chang, Masiero, and Murayama, which links b -> s transitions to the observed large atmospheric neutrino mixing angle. We find large effects in B_s-B_s-bar mixing and BR(tau -> mu gamma) and comment on B_d -> phi K_S. △ Less", "If supersymmetry (SUSY) is realized at the electroweak scale, its underlying structure and breaking mechanism may be explored with great precision by a future linear $e^+ e^-$ collider (LC) with a clean environment, tunable collision energy, high luminosity polarized beams, and additional $e^-e^-$, $eγ$ and $γγ$ modes. In this report we summarize four papers submitted to the ICHEP04 conference about the precise measurements of the top squark parameters and $\\tanβ$, the impacts of the CP phases on the search for top/bottom squarks, the Majorana nature and CP violation in the neutralino system, the implications of the SUSY dark matter scenario for the LC experiments, and the characteristics of the neutralino sector of the next--to--minimal supersymmetric standard model at the LC △ Less", "If supersymmetry (SUSY) is realized at the electroweak scale, its underlying structure and breaking mechanism may be explored with great precision by a future linear $e^+ e^-$ collider (LC) with a clean environment, tunable collision energy, high luminosity polarized beams, and additional $e^-e^-$, $eγ$ and $γγ$ modes. We review a few recent developments for determining fundamental SUSY and Higgs parameters, measuring CP violating $H/A$ mixing in the decoupling regime and probing the next--to--minimal supersymmetric standard model at the LC. △ Less", "The apparent unification of gauge couplings around 10^16 GeV is one of the strong arguments in favor of Supersymmetric extensions of the Standard Model (SM). In this contribution a new analysis, using the latest experimental data, is performed. The strong coupling alpha_s emerges as the key factor for evaluating the results of the fits, as the experimental and theoretical uncertainties in its measurements are substantially higher than for the electromagnetic and weak couplings. The present analysis pays special attention to numerical and statistical details. The results, combined with the current limits on the supersymmetric particle masses, favor a value for the SUSY scale <~ 150 GeV and for alpha_s = 0.118-0.119. △ Less", "Supersymmetric unification in warped space provides new possibilities for model building. I argue that the picture of warped supersymmetric unification arises naturally through the AdS/CFT correspondence from the assumption that supersymmetry is dynamically broken at a scale about (10 - 100) TeV, and present several fully realistic theories in this framework. In the minimal model, the bulk SU(5) gauge group is broken at the Planck brane by boundary conditions, while supersymmetry is broken at the TeV brane. The theory preserves the successes of conventional supersymmetric unification, and yet physics at accessible energies has a drastic departure from that of the conventional scenario. There are also several variations of the minimal model giving distinct phenomenologies. These theories can provide a basis for phenomenological studies of dynamical supersymmetry breaking at low energies. △ Less", "In the SUSY SO(10) GUT context, we study the exclusive processes $B \\to K^{(*)} l^+l^-(l=μ,τ)$. Using the Wilson coefficients of relevant operators including the new operators $Q_{1,2}^{(\\prime)}$ which are induced by neutral Higgs boson (NHB) penguins, we evaluate some possible observables associated with these processes like, the invariant mass spectrum (IMS), lepton pair forward backward asymmetry (FBA), lepton polarization asymmetries etc. In this model the contributions from Wilson coefficients $C_{Q_{1,2}}^\\prime$, among new contributions, are dominant. Our results show that the NHB effects are sensitive to the FBA, $dL/d\\hat{s}$, and $dT/d\\hat{s}$ of $B \\to K^{(*)} τ^+ τ^-$ decay, which are expected to be measured in B factories, and the average of the normal polarization $dN/d\\hat{s}$ can reach several percent for $B \\to K μ^+ μ^-$ and it is 0.05 or so for $B\\to K τ^+τ^-$, which could be measured in the future super B factories and provide a useful information to probe new physics and discriminate different models. △ Less", "We computed the complete gauge and chiral superheavy spectra and couplings in the Minimal Susy GUT and therefrom evaluated the dependence of 1-loop threshold corrections to the Weinberg angle and Unification scale as functions of the single complex parameter $ξ$ that controls MSGUT symmetry breaking. The corrections are generically within 10% showing that contrary to longstanding conjectures,{\\it{high precision calculations are not futile but necessary and feasible in the SO(10) MSGUT.}} Effective superpotentials for $B-L$ violation and mass formulae of the MSSM matter supermultiplets including neutrino Type I and II seesaws were derived. △ Less", "We revisit the standard argument to estimate the scale of new physics (NP) beyond the SM, based on the sensitivity of the Higgs mass to quadratic divergences. Although this argument is arguably naive, the corresponding estimate, Lambda_SM < 2-3 TeV, works reasonably well in most cases and should be considered a conservative bound, as it ignores other contributions to the Higgs mass which are potentially large. Besides, the possibility of an accidental Veltman-like cancellation does not raise significantly Lambda_SM. One can obtain more precise implications from fine-tuning arguments in specific examples of NP. Here we consider SUSY and right-handed (seesaw) neutrinos. SUSY is a typical example for which the previous general estimate is indeed conservative: the MSSM is fine-tuned a few %, even for soft masses of a few hundred GeV. In contrast, other SUSY scenarios, in particular those with low-scale SUSY breaking, can easily saturate the general bound on Lambda_SM. The seesaw mechanism requires large fine-tuning if M_R > 10^7 GeV, unless there is additional NP (SUSY being a favourite option). △ Less", "We consider the production of chargino, neutralino and charged Higgs boson pairs at future linear colliders for c. m. energies in the one TeV range within the MSSM. We compute the leading (double) and next-to leading (linear) supersymmetric logarithmic terms of the so-called \"Sudakov expansion\" at one-loop level. We show that a combined analysis of the slopes of the chargino, neutralino, and charged Higgs boson pair production cross sections would offer a simple possibility for determining \\tanβfor large (\\gsim 10) values, and the parameters M_1, M_2, and μ. This test could provide a strong consistency check of the considered supersymmetric model. △ Less", "We review our recent studies on the effects of CP-violating supersymmetric (SUSY) parameters on the phenomenology of neutralinos, charginos and third generation squarks. The CP-even branching ratios of the squarks show a pronounced dependence on the phases of A_t, A_b, mu and M_1 in a large region of the supersymmetric parameter space, which can be used to get information on these phases. In addition we have studied CP-odd observables, like asymmetries based on triple product correlations. In neutralino and chargino production with subsequent three-body decays these asymmetries can be as large as 20%. △ Less", "In this paper we explore the possibility that (a) fermion masses, (b) neutrino oscillations, (c) CP non-conservation and (d) flavor violations get intimately linked to each other within supersymmetric grand unification based on SO(10) or an effective G(224) = SU(2)_L\\times SU(2)_R\\times SU(4)^c symmetry. We extend the framework proposed previously by Babu, Pati and Wilczek (BPW) which successfully described fermion masses and neutrino oscillations, to include CP violation. Assuming flavor universal SUSY breaking parameters at M^* >~ M_{GUT}, and that CP violation arises through phases in the fermion mass matrices, we show how the presence of GUT threshold induces new and calculable CP and flavor violations. Including SM and SUSY contributions, we find that the BPW framework can correctly account for the observed flavor and/or CP violations in Δm_K, Δm_{B_d}, S(B_d-> J/ψK_S) and ε_K. While SUSY-contribution is small (<~ few%) for the first three quantities, that to ε_K is sizable (~ 20-25%) and negative (as desired) compared to that of the SM. The model predicts S(B_d-> φK_S) to be in the range +(0.65-0.73), close to the SM prediction. The model yields Re(ε'/ε)_{SUSY}\\approx +(4-14)\\times 10^{-4}; the relevance of this contribution can be assessed only when the associated matrix elements are known reliably. The model also predicts that the electric dipole moments of the neutron and the electron should be discovered with improvements in current limits by factors of 10 to 100. △ Less", "We propose a new mass reconstruction technique for SUSY processes at the LHC. The idea is to completely solve the kinematics of the SUSY cascade decay by using the assumption that the selected events satisfy the same mass shell conditions of the sparticles involved in the cascade decay. Using this technique, we study the measurement of the mass of the bottom squarks in the cascade decay of the gluino. Based on the final state including two high p_T leptons and two b-jets, we investigate different possible approaches to the mass reconstruction of the gluino and the two bottom squarks. In particular we evaluate the performance of different algorithms in discriminating two bottom squark states with a mass difference as low as 5%. △ Less", "The seesaw mechanism is attractive not only because it \"explains'' small neutrino mass, but also because of its packaging with the SUSY-GUT, leptogenesis, Dark Matter, and electroweak symmetry breaking. However, this package has the flavor, CP, and gravitino problems. I discuss two alternatives to the seesaw mechanism. In one of them, the anomaly-mediated supersymmetry breaking solves these problems, while predicts naturally light Dirac neutrinos. In the other, the light Majorana neutrinos arise from supersymmetry breaking with right-handed neutrinos below TeV, and the Dark Matter and collider phenomenology are significantly different. △ Less", "The accuracy in the measurement of the masses of sleptons and heavy Higgs bosons in cMSSM scenarios, compatible with the WMAP result on cold dark matter, has been re-analysed in view of the requirements for predicting this density to a few percent level from SUSY measurements at the linear collider. △ Less", "We present a case study for the synergy of combined LHC and LC analyses in Susy searches in which simultaneous running of both machines is very important. In this study only light non-coloured Susy particles are accessible at a Linear Collider with an initial energy of $\\sqrt{s}=500$ GeV. Nevertheless the precise analysis at the LC leads to an accurate Susy parameter determination and prediction of heavy Susy particles. Providing these LC results as input for the LHC analyses could be crucial for the identification of signals resulting in a direct measurement of the heavy neutralinos. The interplay of the LHC and LC will thus provide an important consistency test of the underlying model. △ Less", "Due to selection rules, new particles are sometimes discovered/predicted to be produced in pairs. In the current search for SUSY particles this will occur if R-parity is conserved. In local relativistic field theory, there can be identical particles which are neither bosons nor fermions which are associated with higher-dimensional representations of the permutation group. Such particles will generally be pair-produced and so empirical tests are required to exclude them. A parameter-free statistical model is used to study the unusual multiplicity signatures in coherent paraboson production versus the case of ordinary bosons. △ Less", "In supersymmetric (SUSY) extensions of the seesaw mechanism the neutrino Yukawa interaction induces the flavor and CP violating sfermion mass terms via the radiative correction. In this article we review the CP violating phenomena in the SUSY seesaw models. △ Less", "Bright bursts of gamma rays from outer space have been puzzling Astronomers for more than thirty years and there is still no conceptually complete model for the phenomenon within the standard model of particle physics. Is it time to consider a supersymmetric (SUSY) origin for these bursts to add to the astronomical indications of supersymmetry from dark matter? △ Less", "We extend the commonly used mSUGRA framework to allow complex soft terms. We show how these phases can induce large changes of the SUSY threshold corrections to the b quark mass and affect the neutralino relic density predictions of the model. We present some specific models with large SUSY phases which can accommodate the fermion electric dipole moment constraints and a neutralino relic density within the WMAP bounds. △ Less", "In this brief review, I summarize the current theoretical knowledge in supersymmetry on the lattice, with special emphasis on recent results in the framework of N=1 supersymmetric Yang Mills theory, Wess-Zumino model and Yang-Mills theory with extended supersymmetries. △ Less", "The dynamics of the inflaton field is studied in the context of its interaction with bosonic and fermionic fields modeled by a minimal SUSY like model. Our results are based on the observation that in typical multifield inflation models there are parameter regions for which nonlinear and nonperturbative effects can become important and that can lead to important changes in the dynamics of the inflaton field. In those parameter regions feasible to inflation, it is possible the emergence of effective strong dissipative effects that alone can sustain inflation long enough and with observational effects on density perturbations. △ Less", "Recently Babar and Belle collaborations have measured direct CP asymmetry $A_{CP}=-0.114\\pm 0.020$ in $\\bar B^0 \\to K^- π^+$. The experimental value is substantially different from QCD factorization prediction. We show that SUSY flavor changing neutral current interaction via gluonic dipole can explain the difference. CP asymmetries in other $B\\to Kπ$ decays are predicted to be sizeable. Taking this asymmetry as a constraint, we find that the allowed SUSY parameter space is considerably reduced compared with constraint from $B\\to X_s γ$ alone. We also find that the allowed time dependent CP asymmetries $S_f$ in $\\bar B^0 \\to \\bar K^{* 0}γ\\to π^0 K_S γ$ and $\\bar B^0\\to φK_S$ to be large. These predictions are quite different than those predicted in the Standard Model and can be tested in the near future. △ Less", "We review some recent developments in Higgs physics at a $γγ$ collider. We begin with single Higgs boson production in $γγ$ collisions proceeding via the hadronic content of the photon. For SM Higgs masses of current theoretical interest, the resolved photon contributions are non-negligible in precision cross section measurements. We found that production of the heavier Higgs bosons, $H^0$ and $A^0$, of the MSSM can probe regions of the SUSY parameter space that will complement other measurements. We showed that associated $t H^\\pm$ production in $γγ$ collisions can be used to make an accurate determination of $\\tanβ$ for low and high $\\tanβ$ by precision measurements of the $γγ\\to H^\\pm t +X $ cross section. We then reviewed recent progress on Higgs physics in direct photon processes in which the Higgs bosons are produced via virtual loops. Precision measurements of the magnitude and phase of the $Hγγ$ coupling at a photon collider can be used to determine Higgs parameters related to physics beyond the SM. △ Less", "In the MSSM with complex SUSY parameters we consider a specific case where the second heaviest Higgs boson H_2 is SM like, while H_1 and H_3 are both strongly mixed states of CP odd and CP even scalar fields. Such a scenario could be probed at a Linear Collider via the mechanism e^+e^-\\to H_1H_3. △ Less", "We consider cosmic microwave background (CMB) anisotropy in models with quintessence taking into account of isocurvature fluctuation in the quintessence. It is shown that, if the primordial fluctuation of the quintessence has a correlation with the adiabatic density fluctuations, CMB angular power spectrum $C_l$ at low multipoles can be suppressed. Possible scenario of generating correlated mixture of the quintessence and adiabatic fluctuations is also discussed. △ Less", "We studied single Higgs boson production in $γγ$ collisions proceeding via the hadronic content of the photon. For SM Higgs masses of current theoretical interest, the resolved photon contributions are non-negligible in precision cross section measurements. We found that production of the heavier Higgs bosons H^0 and A^0 of the MSSM can probe regions of the SUSY parameter space that will complement other measurements. Finally, we showed that associated t H^\\pm production in gamma-gamma collisions can be used to make an accurate determination of tan(beta) for low and high tan(beta)by precision measurements of the gamma gamma to H^\\pm t +X cross section. △ Less", "It is shown that hypothetical neutrino-majoron coupling can suppress neutrino flavor oscillations in the early universe, in contrast to the usual weak interaction case. This reopens a window for a noticeable cosmological lepton asymmetry which is forbidden for the large mixing angle solution in the case of standard interactions of neutrinos. △ Less", "We discuss some aspects of the radiative corrections in the phenomenology of the minimal SUSY standard model, by reviewing two recent studies. (1) The full one-loop corrections to the Higgs boson decays into charginos are presented, with emphasis on the renormalization of the chargino sector, including of their mixing matrices. (2) The two-loop O(alpha_s tan beta) corrections to the b -> s gamma decay in models with large tan beta, mainly those to the charged Higgs boson contributions, are discussed. Exact two-loop result is compared to an approximation used in previous studies. △ Less", "The neutrino flavor mixing may induce rich flavor and CP violating phenomena in the SUSY GUTs. In this paper we discuss the hadronic EDMs and the correlation among low-energy processes induced by the mixings between second and third generations in the SUSY SU(5) GUT with the right-handed neutrinos. △ Less", "We discuss possible realizations of the hypothesis that all the fundamental interactions of the elementary particles should be of gauge type, including the Yukawa and Higgs ones. In the minimal SUSY extension of the standard model, where the quartic Higgs couplings are ``gauged'' through the D-terms, it is also possible to generate radiatively the Yukawa matrices for the light generations, thus expressing them as functions of gauge couplings. The program can also be applied to the SUSY LR model, where the possibility to induce radiatively the mixing angles, can help to make viable the parity solution to the strong CP problem. The superpotential of the model still includes some non-gauge couplings, namely, the Yukawa for the third generation and the trilinear terms involving the Higgs bi-doublet and two pairs of doublets. Additional progress to relate these parameters to gauge couplings, can be made by embedding the LR model within a SUSY model SU(4)_WxU(1)_{B-L} in five dimensions, where the Higgs bi-doublet is identified as the extra component of the 5D gauge field. △ Less", "The little Higgs mechanism provides an alternative solution to the hierarchy problem, arguably fitting better into the phenomenological hint of the \"little hierarchy\" which may cause some fine-tuning for the case of supersymmetry. We discuss an aspect of little Higgs physics lacking proper attention -- the construction of an interesting and consistent chiral fermionic sector and its phenomenological implications. At least for the kind of example models to be discussed, the gauge and top sector structure of a model largely dictates, through gauge anomaly cancellation conditions, a specific chiral fermion spectrum. The spectrum has interesting, family non-universal, flavor structure. The implications for flavor physics are specially interesting. We also add a brief comment of little Higgs versus supersymmetry. △ Less", "A concrete model which can suppress FCNCs and CP violating phenomena is suggested. It is an $S_3$ symmetric extension of the MSSM in extra dimensions, where only SU(2) and SU(3) gauge multiplets are assumed to propagate in the bulk. They are suppressed due to $S_3$ flavor symmetry at $M_{SUSY}$, and the infrared attractive force of gauge interactions in extra dimensions are used to suppress them at the compactification scale. We find that O(1) disorders of the soft parameters are allowed at the cut-off scale to suppress sufficiently FCNCs and CP violating phenomena. △ Less", "I review briefly the notion of minimal flavor violation and its application to supersymmetry, with a special emphasis on a class of operators, so-called Higgs penguins, which can generate new and interesting flavor signals at large tan(beta). △ Less", "The Fortran code SDECAY calculates the decay widths and branching ratios of all supersymmetric (SUSY) particles in the Minimal Supersymmetric Standard Model (MSSM), including higher order effects. The usual two-body decays of sfermions and gauginos as well as the three-body decay modes of charginos, neutralinos and gluinos are included. Furthermore, the three-body stop and sbottom decays and even the four-body stop decays are calculated. The important loop-induced decays, the QCD corrections to the two-body widths involving strongly interacting particles and the dominant electroweak effects to all processes are evaluated as well. △ Less", "We discuss conditions under which bi-large mixing in the lepton sector is achieved assuming that all Yukawa matrices and the right-handed neutrino mass matrix have the same singular form in the leading order. Due to obvious quark lepton symmetry, this approach can be embedded into grand unified theories. The right-handed neutrino mass scale can be identified with the GUT scale and, as a consequence of third generation Yukawa coupling unification, the mass of the lightest neutrino is given as (m_{top}^2/M_{GUT})|U_{τ1}|^2 in the leading order. This relation does not depend on the exact form of mass matrices. △ Less", "We study the R-parity violating minimal supergravity models accounting for the observed neutrino masses and mixing, which can be tested in future collider experiments. The bi-large mixing can be explained by allowing five dominant tri-linear couplings $ λ'_{1,2,3}$ and $λ_{1,2}$. The desired ratio of the atmospheric and solar neutrino mass-squared differences can be obtained in a very limited parameter space where the tree-level contribution is tuned to be suppressed. In this allowed region, we quantify the correlation between the three neutrino mixing angles and the tri-linear R-parity violating couplings. Such a prediction on the couplings can be tested in the next linear colliders by observing the branching ratios of the lightest supersymmetric particle (LSP). For the stau or the neutralino LSP, the ratio $|λ_1|^2: |λ_2|^2: |λ_1|^2 + |λ_2|^2$ can be measured by establishing $Br(eν): Br(μν) : Br(τν)$ or $Br(νe^\\pm τ^\\mp): Br(νμ^\\pmτ^\\mp) : Br(ντ^\\pmτ^\\mp)$, respectively. The information on the couplings $λ'_i$ can be drawn by measuring $Br(l_i t \\bar{b}) \\propto |λ'_i|^2$ if the neutralino LSP is heavier than the top quark. △ Less", "We study the effects of supersymmetric contribution on both the B_d -> phi K^0 and B^\\pm -> phi K^\\pm modes using the perturbative QCD approach. We estimate the deviation of mixing-induced and direct CP asymmetries and discuss the strong-phase dependence of them. △ Less", "We obtain a new constraint on the CP-violating flavor mixing between the left-handed top scalar quark (\\tilde{t}_L) and charm scalar quark (\\tilde{c}_L), by considering a chargino loop contribution to chromo-electric dipole moment of strange quark, which is limited by the electric dipole moment of the neutron and atoms. It is found that the flavor mixing should be suppressed to the level of {\\cal O}(0.1) for the CP phase of order unity. Although it is much stronger than the known constraint from the chargino loop contribution to b \\to s γ, the moderate constraint we obtain here is argued to leave room for sizable supersymmetric contribution to the CP asymmetry in B_d^0 \\to φK^0. △ Less", "We perform the most attractive channel (MAC) analysis in the top mode standard model with TeV-scale extra dimensions, where the standard model gauge bosons and the third generation of quarks and leptons are put in D(=6,8,...) dimensions. In order to make the scenario viable, only the attractive force of the top condensate should exceed the critical coupling, while other channels such as the bottom and tau condensates should not. It turns out that the top condensate can be the MAC for D=8, whereas the tau condensation is favored for D=6. On the basis of the renormalization group equations for the top Yukawa and Higgs quartic couplings, we predict masses of the top quark and the Higgs boson for D=8 as m_t=172-175 GeV and m_H=176-188 GeV, respectively. △ Less", "We investigate the thermal relic density of a cold dark matter in the brane world cosmology. Since the expansion law in a high energy regime is modified from the one in the standard cosmology, if the dark matter decouples in such a high energy regime its relic number density is affected by this modified expansion law. We derive analytic formulas for the number density of the dark matter. It is found that the resultant relic density is characterized by the ``transition temperature'' at which the modified expansion law in the brane world cosmology is connecting with the standard one, and can be considerably enhanced compared to that in the standard cosmology, if the transition temperature is low enough. The implication to the neutralino dark matter also is mentioned. △ Less", "We present in this talk a model based on SO(10) x SU(2)_{F} having symmetric mass textures with 5 zeros constructed by us recently. The symmetric mass textures arising from the left-right symmetry breaking chain of SO(10) give rise to good predictions for the masses, mixing angles and CP violation measures in the quark and lepton sectors (including the neutrinos), all in agreement with the most up-to-date experimental data within 1 sigma. Various lepton flavor violating decays in our model are also investigated. Unlike in models with lop-sided textures, our prediction for the decay rate of mu -> e gamma is much suppressed and yet it is large enough to be probed by the next generation of experiments. The observed baryonic asymmetry in the Universe can be accommodated in our model utilizing soft leptogenesis. △ Less", "We present in this talk the one-loop electroweak precision constraints in the Littlest Higgs model, including the logarithmically enhanced contributions from both fermion and scalar loops. We find the one-loop contributions are comparable to the tree level corrections in some regions of parameter space. A low cutoff scale is allowed for a non-zero triplet VEV. Constraints on various other parameters in the model are also discussed. The role of triplet scalars in constructing a consistent renormalization scheme is emphasized. △ Less", "We present a Higgsless Standard Model in six dimensions, based on the Standard Model gauge group SU(2)xU(1), with two flat extra dimensions compactified on a rectangle. The electroweak symmetry is broken by boundary conditions and realistic gauge boson masses can be accomodated by proper choice of the compactification scales and brane kinetic terms. With respect to oblique corrections, the agreement with electroweak precision tests is somewhat improved compared to the simplest five-dimensional Higgsless models. △ Less", "Dynamical gauge-Higgs unification is presented in higher dimensional gauge theory, in which both adjoint and fundamental Higgs fields are a part of gauge fields. Dynamical gauge symmetry breaking is induced through the Hosotani mechanism. Gauge theory, including the U(3) x U(3) model, is examined on M^4 x (T^2/Z_2). △ Less", "In this talk, using deconstruction, we analyze the form of the corrections to the electroweak interactions in a large class of ``Higgsless'' models of electroweak symmetry breaking, allowing for arbitrary 5-D geometry, position-dependent gauge coupling, and brane kinetic energy terms. Many models considered in the literature, including those most likely to be phenomenologically viable, are in this class. By analyzing the asymptotic behavior of the correlation function of gauge currents at high momentum, we extract the exact form of the relevant correlation functions at tree-level and compute the corrections to precision electroweak observables in terms of the spectrum of heavy vector bosons. We determine when nonoblique corrections due to the interactions of fermions with the heavy vector bosons become important, and specify the form such interactions can take. In particular we find that in this class of models, so long as the theory remains unitary, S - 4 c^2_W T > O(1), where S and T are the usual oblique parameters. △ Less", "We investigate lepton flavor violating decays in a SUSY SO(10) model with symmetric textures recently constructed by us. Unlike the models with lop-sided textures which give rise to a large decay rate for mu -> e gamma, the decay rate we get is much suppressed and yet it is large enough to be accessible to the next generation of experiments. We have also investigated the possibility of baryogenesis resulting from soft leptogenesis. We find that with the soft SUSY masses assuming their natural values, B^\\prime \\equiv \\sqrt{BM_{1}} ~ 1.4 TeV and Im(A) ~ 1 TeV, the observed baryon asymmetry in the Universe can be accommodated in our model. We have also updated the predictions of our model for the masses, mixing angles and CP violating measures in both charged fermion and neutrino sectors, using the most up-to-date experimental data as input. △ Less", "In this talk, we discuss the idea of how Dirac or Pseudo-Dirac neutrino masses arise naturally with a correct size, after the breaking of local N=1 supersymmetry. △ Less", "The theory of inflation will be investigated as well as supersymmetry breaking in the context of supergravity, incorporating the target-space duality and the non-perturbative gaugino condensation in the hidden sector. The inflation and supersymmetry breaking occur at once by the interplay between the dilaton field as inflaton and the condensate gauge-singlet field. The model satisfies the slow-roll condition which solves the eta-problem. When the particle rolls down along the minimized trajectry of the potential V(S,Y) at a duality invariant fixed point T=1, we can obtain the e-fold value \\sim 57. And then the cosmological parameters obtained from our model well match with the recent WMAP data combined with other experiments. This observation is suggesting to consider the string-inspired supergravity as the fundamental of the theory of the evolution of the universe as well as the particle theory. △ Less", "After a brief review of orbifold grand unified theory, we discuss two topics related to the choice of boundary conditions on the orbifold $S^1/Z_2$: dynamical rearrangement of gauge symmetry and equivalence classes of boundary conditions. △ Less", "The minimal supersymmetric standard model, and extensions, predicts a relatively light higgs particle if one supposes perturbativity until high scales. That fact is in conflict with nowadays data coming from LEPII fruitless searches for the Higgs boson. This bound is sufficient to rule out a big portion of the parameter space of the MSSM. In this letter we propose two mechanism of raising the higgs mass at tree level, thus not needing very heavy sparticles that would reintroduce some fine-tuning in the problem. △ Less", "In this talk, we summarize the collider phenomenology and recent experimental results for various models of extra dimensions, including the large extra dimensions (ADD model), warped extra dimensions (Randall-Sundrum model), TeV$^{-1}$-sized extra dimensions with gauge bosons in the bulk, universal extra dimensions, and an 5D SU(5) SUSY GUT model in AdS space. △ Less", "We show how LHC Higgs boson production and decay data can be used to extract the gauge and fermion couplings of the Higgs boson. Incomplete input data leads to parameter degeneracies, which can be lifted by imposing theoretical assumptions. We show how successive theoretical assumptions affect the parameter extraction, starting with a general multi-Higgs doublet model and finishing with specific supersymmetric scenarios. △ Less", "We present results for Delta I=3/2 and Delta S=2 matrix elements relevant for CP violation in K->Pi Pi decays and for the K_S-K_L mass difference in the standard model and beyond. They were obtained with Neuberger fermions on quenched gauge configurations generated with the Wilson plaquette action at beta=6.0 on an 18^3x64 lattice. △ Less", "We provide a systematic and practical method of deriving 5D supergravity action described by 4D superfields on a general warped geometry, including a non-BPS background. Our method is based on the superconformal formulation of 5D supergravity, but is easy to handle thanks to the superfield formalism. We identify the radion superfield in the language of 5D superconformal gravity, and clarify its appearance in the action. We also discuss SUSY breaking effects induced by a deformed geometry due to the backreaction of the radius stabilizer. △ Less", "We construct the first D = 4 Minkowski string theory vacua of flux compactification which are (i) chiral, (ii) free of NSNS and RR tadpoles, and (iii) N = 1 or N = 0 supersymmetric. In the latter case SUSY is softly broken by the fluxes, with soft terms being generated in the gauge and chiral sectors of the theory. In addition, the low energy spectrum of the theory is MSSM-like, the dilaton/complex structure moduli are stabilized and the supergravity background involves a warped metric. △ Less", "We study the effect of RR and NSNS 3-form fluxes on the effective action of the worldvolume fields of Type IIB D7/D3-brane configurations. The D7-branes wrap 4-cycles on a local Calabi-Yau geometry. This is an extension of previous work on hep-th/0311241, where a similar analysis was applied to the case of D3-branes. Our present analysis is based on the D7- and D3-brane Dirac-Born-Infeld and Chern-Simons actions, and makes full use of the R-symmetries of the system, which allow us to compute explicitly results for the fields lying at the D3-D7 intersections. A number of interesting new properties appear as compared to the simpler case of configurations with only D3-branes. As a general result one finds that fluxes stabilize some or all of the D7-brane moduli. We argue that this is important for the problem of stabilizing Kahler moduli through non-perturbative effects in KKLT-like vacua. We also show that (0,3) imaginary self-dual fluxes, which lead to compactifications with zero vacuum energy, give rise to SUSY-breaking soft terms including gaugino and scalar masses, and trilinear terms. Particular examples of chiral MSSM-like models of this class of vacua, based on D3-D7 brane systems at orbifold singularities are presented. △ Less", "Provided SUSY is realized in Nature, future colliders like the Large Hadron Collider (LHC) and a future e+e- linear collider (LC) will provide a wealth of data on SUSY phenomena. One important task will be to extract the Lagrangian parameters at the electroweak scale from the numerous measured observables and to extrapolate them to a high scale to check whether unification takes place or to learn about the SUSY breaking mechanism. To accomplish such a task, two new programs, SFITTER and Fittino, have recently been developed. This talk introduces both programs and presents first results obtained with them. △ Less", "Lepton flavor and CP violation in supersymmetric models are briefly reviewed. After a short motivation and an introduction to the phenomenology, model independent constraints on mass insertions, predictions of SUSY GUT models and rates for several LFV and CPV processes are presented. △ Less", "In the context of supersymmetric theories, a weakly broken gauged SO(3) flavour symmetry is used to produce two highly degenerate right handed (RH) neutrinos. It is then shown that this SO(3) flavour symmetry is compatible with all fermion masses and mixings if it is supplemented with a further SU(3) flavour symmetry. A specific Susy breaking model is used to generate the light neutrino masses as well as a natural model of TeV scale resonant leptogenesis. △ Less", "We discuss a mechanism to generate hierarchy between masses of the top and bottom quarks without fine-tuning of the Yukawa coupling constants. In the framework of the two-Higgs-doublet model (THDM) with a discrete $Z_2$ symmetry, there exists the vacuum where only the top quark receives the mass of the order of the electroweak symmetry breaking scale $v(\\simeq 246 {GeV})$, while the bottom quark remains massless. We show a model in which a small sofb-breaking mass $m_3^2 [\\sim v^2/(4π)^2]$ for the $Z_2$ symmetry is generated by the dynamics above the cutoff scale of the THDM. The appearance of $m_3^2$ gives the small mass for the bottom quark, and explain the hierarchy $m_b/m_t \\ll 1$. △ Less", "A library for reading and writing data in the SUSY Les Houches Accord format is presented. The implementation is in native Fortran 77. The data are contained in a single array conveniently indexed by preprocessor statements. △ Less", "I introduce a new low energy effective description of Cosmological SUSY breaking. It requires the existence of a strongly interacting gauge theory at a scale of order $10^3$ GeV, some of whose fields carry standard model quantum numbers. SUSY breaking is communicated to the standard model through gaugino masses and the Higgs multiplets. The model also provides a possible new solution of the strong CP problem △ Less", "The weak boson fusion process for neutral Higgs boson production is investigated with particular attention to the accuracy with which the Higgs boson couplings to weak bosons can be determined in final states that contain a Higgs boson plus at least two jets at CERN Large Hadron Collider energies. We determine that an accuracy of δg/g ~ 10% on the effective coupling g may be possible after the accumulation of ~ 200 inverse fb of integrated luminosity. △ Less", "We summarize a study on the production, decay, and detection of the strange-beauty squark as light as 200 GeV at hadronic and $e^+ e^-$ colliders. It was motivated by nearly maximal mixing between strange and beauty squarks. △ Less", "Parton distribution functions for protons are devised in which a light gluino is included along with standard model quark, antiquark, and gluon constituents. A global analysis of a large set of hadronic scattering data provides empirical constraints on the allowed range of the gluino mass as a function of the value of the strong coupling strength alpha_s(M_Z). We find that the gluino mass m_{\\widetilde{g}} > 12 GeV for the standard model world-average value alpha_{s}(M_{Z})=0.118. Gluino masses as small as 10 GeV are admissible provided that alpha_s(M_Z) > 0.12, about one standard deviation above the world-average value. Current hadron scattering data are insensitive to the presence of gluinos heavier than about 100 - 150 GeV. △ Less", "A conventional graviton vertex operator is generated from the gauging of global supersymmetry. If the outgoing gravitino is replaced by a fermion-boson pair of like helicity, and if a new principle of equivalence associates supergravity with the introduction of color, then every quark flavor can be described as a gravitationally excited lepton. In this context, A SUSY SU(5)can be constructed exclusively of leptons and their scaler superpartners (or of quarks and their superpartners). This SUSY GUT flavor symmetry, which is preserved by the proposed supergravity interactions, accounts for three fermionic generations and predicts a new quark--aleft-handed (non-strange) version of the strange quark. △ Less", "We discuss one-loop contributions of supersymmetry (SUSY) particles to the process $e^+e^- \\to W^+W^-$ in the minimal supersymmetric standard model. The calculation is tested by using the sum rule among the form factors, which is based on the BRS invariance. The overall normalization factor of the amplitudes is tested by using the decoupling property of the SUSY particles in the large mass limit. The correction due to the one-loop effect of the sfermions can be of a few times $\\pm 0.1$ % level, whereas that of the charginos and neutralinos can be order 1%. We also study the CP-violating effects in the chargino and neutralino sector. △ Less", "Littlest Higgs model predicts some extra particles beyond the Standard Model. Among them, an extra neutral gauge boson A_H is lightest and its mass could be a few hundred GeV. We study production and decay of A_H at future e^+ e^- inear collider and compare them with those of Z' bosons in supersymmetric (SUSY) E_6 models. We find that, if the extra gauge boson mass is smaller than \\sqrt{s} of the linear collider, the forward-backward asymmetries of b- and c-quarks at the A_H pole differ significantly from those given by the Z' bosons, and are useful to test the littlest Higgs model and SUSY E_6 models. △ Less", "We investigate the limits on the higgs mass in variations of Split Supersymmetry, where the boundary value of the Higgs quartic coupling at the SUSY breaking scale ($m_s$) is allowed to deviate from its value in the minimal model of Arkani-Hamed and Dimopoulos. We show that it is possible for $λ(m_s)$ to be negative and use vacuum stability to put a lower bound on this coupling, and hence on the mass of the physical higgs. We also use the requirement of perturbativity of all couplings up to the cutoff to determine an upper limit for the higgs mass in models which are further modified by additional matter content. For $m_s\\geq 10^6$ GeV we find 110 GeV $\\lesssim m_h\\lesssim 280$ GeV if the new matter is not coupled to any Standard Model field; and 110 GeV $\\lesssim m_h\\lesssim 400$ GeV if it has Yukawa couplings to the higgs. △ Less", "Recent developemnts in string compactifications in the presence of antisymmetric field backgrounds suggest a new simple and predictive structure for soft terms in the MSSM depending only on two parameters. They give rise to a positive definite scalar potential, a solution to the $μ$-problem, flavor universality and absence of a SUSY-CP problem. △ Less", "Gauge fields and both adjoint and fundamental Higgs fields are unified in gauge theory defined on an orbifold. It is shown how the Hosotani mechanism at the quantum level resolves the problem of the arbitrariness in boundary conditions imposed at the fixed points of the orbifold. The role of adjoint Higgs fields in the standard GUT, which are extra-dimensional components of gauge fields in the current scheme, is taken by the Hosotani mechanism and additional dynamics governing the selection of equivalence classes of boundary conditions. The roles of fundamental Higgs fields, namely those of inducing the electroweak symmetry breaking and giving masses to quarks and leptons, are taken by the Hosotani mechanism and by extra twists in boundary conditions for matter. SUSY scenario nicely fits this scheme. Explicit models are given for the gauge groups U(3) x U(3), SU(5), and SU(6) on the orbifolds M^4 x (S^1/Z_2) and M^4 x (T^2/Z_2). △ Less", "We compute the 1-loop chiral corrections to the bag parameters which are needed for the discussion of the SUSY K-Kbar mixing problem in both finite and infinite volume. We then show how the bag parameters can be combined among themselves and with some auxiliary quantities and thus sensibly reduce the systematic errors due to chiral extrapolations as well as those due to finite volume artefacts present in the results obtained from lattice QCD. We also show that in some cases these advantages remain as such even after including the 2-loop chiral corrections. Similar discussion is also made for the K --> pi electro-weak penguin operators. △ Less", "In spite of the large lepton flavour violation (LFV) observed in neutrino oscillations, within the Standard Model, we do \\textit{not} expect any visible LFV in the charged lepton sector ($μ\\to e, γ$, $τ\\to μ, γ$, etc.). On the contrary, the presence of new physics close to the electroweak scale can enhance the amplitudes of these processes. We discuss this in general and focus on a particularly interesting case: the marriage of low-energy supersymmetry (SUSY) and seesaw mechanism for neutrino masses (SUSY seesaw). Several ideas presented in this context are reviewed both in the bottom-up and top-down approaches. We show that there exist attractive models where the rate for LFV processes can attain values to be probed in pre-LHC experiments. △ Less", "We study the $B\\to φK_S$ decay in a SUSY SO(10) GUT. We calculate the mass spectrum of sparticles for a given set of parameters at the GUT scale. We complete the calculations of the Wilson coefficients of operators including the new operators which are induced by NHB penguins at LO using the MIA with double insertions. It is shown that the recent experimental results on the time-dependent CP asymmetry $S_{φK}$ in $B\\to φK_S$, which is negative and can not be explained in SM, can be explained in the model where there are flavor non-diagonal right-handed down squark mass matrix elements of 2nd and 3rd generations whose size satisfies all relevant constraints from known experiments ($τ\\to μγ$, $B\\to X_Sγ, B_s\\to μ^+μ^-, B\\to X_s μ^+μ^-, B\\to X_s g, ΔM_s$, etc.). At the same time, the branching ratio for the decay can also be in agreement with experimental measurements. △ Less", "In this thesis, we study the hidden symmetries in the SM and also use discrete gauge symmetries as model building tools to solve various problems in the SM as well as the MSSM, such as R-parity, mu-term, stabilizing the axion solutions, etc. The flavor independent non-supersymmetric SM at the renormalizable level has a discrete Z_3 gauge symmetry known as baryon parity. It is anomaly free at the discrete level as a result of the existence of three generations. The symmetry can effectively act as the Baryon number up to the ΔB=3 mod 3 level which is also consistent with the prediction from non-perturbative processes corrections in the SM, such as electroweak instanton and sphaleron processes. This symmetry is not consistent with the simple GUTs since those theories explicitly break it. Thus this baryon parity provides a strong hint for new physics like GUTs. Quantum mechanically, we estimate the triple nucleon decay rate which is predicted by the existence of this symmetry. We find a simple U(1) realization with the presence of right-handed neutrinos, from which this baryon parity can naturally emerge. Gauged R-parity is studied in the following chapter. We also study various different approaches to the mu-term problem via a symmetry classification. One explicit example in terms of a Z_4 subgroup of the anomalous U(1) symmetry is given. Another solution arises from a SUSY version of QCD invisible axion. Discrete flavor gauge symmetries are discussed to explain the observed hierarchy fermion masses. D-term splitting problem can then be avoided. In the last part, we show how to use discrete gauge symmetries to stabilize the QCD invisible axion solutions, for both DFSZ and KSVZ invisible axion models. △ Less", "In the first part of the talk, three key ideas proposed in the 1970s, and in particular their combined role in providing an understanding of the neutrino-masses as well as of the baryon-asymmetry of the universe, are expounded. The ideas in question include: (i) The symmetry SU(4)-color, which introduces the right-handed neutrino as an essential member of each family and also provides (rather reliably) the Dirac mass of the tau-neutrino by relating it to the top quark mass; (ii) SUSY grand unification together with the scale of the meeting of the three gauge couplings, which provides the scale for the superheavy Majorana masses of the RH neutrinos; and (iii) the seesaw mechanism, which combines the Dirac and the superheavy Majorana masses of the neutrinos obtained as above to yield naturally light LH neutrinos and in particular the right magnitude for m(nu-tau). In the second part, an attempt is made, based in part on recent works, to show how a set of diverse phenomena including (a) fermion masses, (b) neutrino oscillations, (c) CP and flavor violations, and (d) baryogenesis via leptogenesis can fit together neatly within a single predictive framework based on an effective symmetry group G(224) = SU(2)_L x SU(2)_R x SU(4)-color or SO(10), possessing supersymmetry. CP and flavor violations arising within this framework include enhanced rates (often close to observed limits) for mu -> e + gamma and tau -> mu + gamma and also measurable electric dipole moments of the neutron and the electron. Expectations arising within the same framework for proton decay are summarized at the end. It is stressed that the two notable missing pieces of this framework, which is otherwise so successful, are supersymmetry and proton decay. △ Less", "We discuss constraints on supersymmetric models arising from the relic density measurements of WMAP as well as from direct and precision measurements, LEP, b-sgamma, g-2, Bs-mumu. We consider mSUGRA models and their extensions with non-universal gaugino masses. We find, as commonly known, that the relic density pinpoints towards very specific regions of the mSUGRA models: coannihilation, focus and Heavy Higgs annihilation. The allowed regions widen significantly when varying the top quark mass. Introducing some non-universality in the gaugino masses significantly changes this conclusion as in specific non-universal models the relic density upper limit can be easily satisfied. This occurs with models where M1>M2 at the GUT scale when the LSP has a high wino component. Models where M3<M2 favours the Higgs annihilation channel in large regions of parameter space and at large $\\tanβ$ also favours the annihilation of neutralinos in gauge bosons pairs.We discuss also the potential of direct detection experiments to probe supersymmetric models and point out at the main consequences for colliders based on the mass spectrum. Our calculation of the relic density of neutralinos is based on micrOMEGAs and the SUSY spectrum is generated with SoftSUSY △ Less", "By employing the QCD factorization approach, we calculate the new physics contributions to the branching radios of the two-body charmless $ B \\to PP$ decays in the framework of the minimal supergravity (mSUGRA) model. Within the considered parameter space, we find that (a) the supersymmetric (SUSY) corrections to the Wilson coefficients $C_k$ ($k=3-6$) are very small and can be neglected safely, but the leading order SUSY contributions to $C_{7γ}(M_W)$ and $C_{8g}(M_W)$ can be rather large and even change the sign of the corresponding coefficients in the standard model; (b) the possible SUSY contributions to those penguin-dominated decays in mSUGRA model can be as large as $30-50%$; (c) for the well measured $B \\to K π$ decays, the significant SUSY contributions play an important rule to improve the consistency of the theoretical predictions with the data; (d) for $B \\to K η'$ decays, the theoretical predictions of the corresponding branching ratios become consistent with the data within one standard deviation after the inclusion of the large SUSY contributions in the mSUGRA model. △ Less", "We discuss hadronic EDM constraints on the neutrino sector in the SUSY SU(5) GUT with the right-handed neutrinos. The hadronic EDMs are sensitive to the right-handed down-type squark mixings, especially between the second and third generations and between the first and third ones, compared with the other low-energy observables, and the flavor mixings are induced by the neutrino Yukawa interaction. The current experimental bound of the neutron EDM may imply that the right-handed tau neutrino mass is smaller than about 10^{14} GeV in the minimal supergravity scenario, and it may be improved furthermore in future experiments, such as the deuteron EDM measurement. △ Less", "Supersymmetric grand unified models based on the gauge group SO(10) are especially attractive in light of recent data on neutrino masses. The simplest SO(10) SUSY GUT models predict unification of third generation Yukawa couplings in addition to the usual gauge coupling unification. Recent surveys of Yukawa unified SUSY GUT models predict an inverted scalar mass hierarchy in the spectrum of sparticle masses if the superpotential mu term is positive. In general, such models tend to predict an overabundance of dark matter in the universe. We survey several solutions to the dark matter problem in Yukawa unified supersymmetric models. One solution-- lowering the GUT scale mass value of first and second generation scalars-- leads to u_R and c_R squark masses in the 90-120 GeV regime, which should be accessible to Fermilab Tevatron experiments. We also examine relaxing gaugino mass universality which may solve the relic density problem by having neutralino annihilations via the Z or h resonances, or by having a wino-like LSP. △ Less", "Strategy and results for complete one-loop computations in the Minimal Supersymmetric Standard Model are reviewed, with applications to the calculation of SUSY mass spectra and SUSY-particle processes. Determination of renormalization constants and counterterms are described in the on-shell renormalization scheme, and a translation between $\\bar{\\rm DR}$ and on-shell parameters is given. As an example, cross sections for chargino and neutralino pair production in $e^+e^-$ annihilation are presented, complete at the one-loop level. △ Less", "We show that in an $SU(2)\\otimes U(1)$ model with a DSF-like invisible axion it is possible to obtain (i) the convergence of the three gauge coupling constants at an energy scale near the Peccei-Quinn scale; (ii) the correct value for $\\sin^2\\hatθ_W(M_Z)$; (iii) the stabilization of the proton by the cyclic $Z_{13}\\otimes Z_3$ symmetries which also stabilize the axion as a solution to the strong CP problem. Concerning the convergence of the three coupling constants and the prediction of the weak mixing angle at the $Z$-peak, this model is as good as the minimal supersymmetric standard model with $μ_{\\rm SUSY}=M_Z$. We also consider the standard model with six and seven Higgs doublets. The main calculations were done in the 1-loop approximation but we briefly consider the 2-loop contributions. △ Less", "Coherent analyses at future LHC and LC experiments can be used to explore the breaking mechanism of supersymmetry and to reconstruct the fundamental theory at high energies, in particular at the grand unification scale. This will be exemplified for minimal supergravity. △ Less", "Soft supersymmetry breaking terms involving heavy singlet sneutrinos provide new sources of lepton number violation and of CP violation. In addition to the CP violation in mixing, investigated previously, we find that `soft leptogenesis' can be generated by CP violation in decay and in the interference of mixing and decay. These additional ways to leptogenesis can be significant for a singlet neutrino Majorana mass that is not much larger than the supersymmetry breaking scale, $M < 100 m_{SUSY}$. In contrast to CP violation in mixing, for some of these new contributions the sneutrino oscillation rate can be much faster than the decay rate, so that the bilinear scalar term need not be smaller than its natural scale. △ Less", "Tau tau fusion to light h and heavy H,A Higgs bosons is investigated in the Minimal Supersymmetric Standard Model (MSSM) at a photon collider as a promising channel for measuring large values of tan(beta). For standard design parameters of a photon collider an error close to unity, uniform for tan(beta) above 10, may be expected, improving on complementary measurements at LHC and e+e- linear colliders. △ Less", "Anomaly-mediated supersymmetry breaking in the context of 4D conformally sequestered models is combined with Poppitz-Trivedi D-type gauge-mediation. The implementation of the two mediation mechanisms naturally leads to visible soft masses at the same scale so that they can cooperatively solve the mu and flavor problems of weak scale supersymmetry, as well as the tachyonic slepton problem of pure anomaly-mediation. The tools are developed in a modular fashion for more readily fitting into the general program of optimizing supersymmetric dynamics in hunting for the most attractive weak scale phenomenologies combined with Planck-scale plausibility. △ Less", "The interplay of prospective experimental information from both the Large Hadron Collider (LHC) and the Linear Collider (LC) in the investigation of the MSSM Higgs sector is analyzed in the SPS~1a and SPS 1b benchmark scenarios. Combining LHC information on the heavy Higgs states of the MSSM with precise measurements of the mass and branching ratios of the lightest CP-even Higgs boson at the LC provides a sensitive consistency test of the MSSM. This allows to set bounds on the trilinear coupling A_t. In a scenario where LHC and LC only detect one light Higgs boson, the prospects for an indirect determination of M_A are investigated. In particular, the impact of the experimental errors of the other SUSY parameters is analyzed in detail. We find that a precision of about 20% (30%) can be achieved for M_A = 600 (800) GeV. △ Less", "We introduce genetic algorithms as a means to estimate the accuracy required to discriminate among different models using experimental observables. We exemplify the technique in the context of the minimal supersymmetric standard model. If supersymmetric particles are discovered, models of supersymmetry breaking will be fit to the observed spectrum and it is beneficial to ask beforehand: what accuracy is required to always allow the discrimination of two particular models and which are the most important masses to observe? Each model predicts a bounded patch in the space of observables once unknown parameters are scanned over. The questions can be answered by minimising a \"distance\" measure between the two hypersurfaces. We construct a distance measure that scales like a constant fraction of an observable. Genetic algorithms, including concepts such as natural selection, fitness and mutations, provide a solution to the minimisation problem. We illustrate the efficiency of the method by comparing three different classes of string models for which the above questions could not be answered with previous techniques. The required accuracy is in the range accessible to the Large Hadron Collider (LHC) when combined with a future linear collider (LC) facility. The technique presented here can be applied to more general classes of models or observables. △ Less", "We consider the production of neutralino, chargino, and charged Higgs boson pairs in the MSSM framework at future $e^+e^-$ colliders. We show that, for c.m. energies in the one TeV range and in a ``moderately'' light SUSY scenario, a combined analysis of the slopes of these production cross sections could lead to a strong consistency test involving the soft supersymmetric breaking parameters $M_1$, $M_2$, the Higgsino parameter $μ$, and $\\tanβ$. △ Less", "We review the theoretical status and the future perspectives of the most important electroweak precision observables in the MSSM. This comprises the mass of the W boson, M_W, the effective leptonic mixing angle, sin^2(theta_eff), the mass of the lightest MSSM Higgs boson, m_h, and the anomalous magnetic moment of the muon, a_μ. The impact of the parametric uncertainties from the experimental errors of the input parameters is studied, and an estimate for the remaining uncertainties from unknown higher-order corrections is given. The need for future improvements in the theory predictions is investigated. △ Less", "We present a case study for the synergy of combined LHC and LC analyses in Susy searches where simultaneous running of both machines is very important. In case that only light non-coloured Susy particles are accessible at a Linear Collider with an initial energy of $\\sqrt{s}=500$ GeV, the precise analysis at the LC nevertheless leads to an accurate Susy parameter determination. This allows the prediction of heavy Susy particles. Providing these LC results as input for LHC analyses could be crucial for the identification of signals resulting in a direct measurement of the heavy neutralinos. These results provide an important consistency test of the underlying model. Furthermore, feeding back the LHC results into LC analyses leads to an improvement in the parameter determination. △ Less", "Cosmic strings of the GUT scale, generically formed during the SSB of supersymmetric hybrid inflation, are compatible with the most recent CMB data. The strong constraints on the allowed cosmic strings contribution to the measured temperature anisotropies impose limits on the free parameters of the inflationary models, namely the mass scales and the couplings. △ Less", "The idea of GUT implies that the universe went through a series of phase transitions during which topological defects are expected to form. We investigate here the genericity of cosmic strings formation in realistic SUSY GUTs models. We conclude that all acceptable symmetry breaking schemes produce cosmic strings after the last inflationary phase. Generically, as they form at the end of inflation, they have a mass of order of the GUT scale. Since cosmological data coming from CMB measurements do not show evidence for such strings, they constrain GUT scale physics. △ Less", "We recalculate the branching ratios for $t\\to cV$ ($V=g,γ,Z$) induced by SUSY FCNC couplings within the general unconstrained MSSM framework using mass eigenstate approach. Our results show that the branching ratios for these decays are larger than ones reported in previous literatures in the MSSM with R-parity conservation, and they can reach $\\sim 10^{-4}$, $\\sim 10^{-6}$, and $\\sim 10^{-6}$, respectively, for favorable parameter values allowed by current precise experiments. Thus, the branching ratios for $t\\to cg$ and $t\\to cγ$ may be measurable at the LHC. △ Less", "The recent WMAP data have confirmed that exotic dark matter together with the vacuum energy (cosmological constant) dominate in the flat Universe. Thus the direct dark matter detection, consisting of detecting the recoiling nucleus, is central to particle physics and cosmology. Supersymmetry provides a natural dark matter candidate, the lightest supersymmetric particle (LSP). The relevant cross sections arise out of two mechanisms: i) The coherent mode, due to the scalar interaction and ii) The spin contribution arising from the axial current. In this paper we will focus on the spin contribution, which is expected to dominate for light targets. For both modes it is possible to obtain detectable rates, but in most models the expected rates are much lower than the present experimental goals. So one should exploit two characteristic signatures of the reaction, namely the modulation effect and, in directional experiments, the correlation of the event rates with the sun's motion. In standard non directional experiments the modulation is small, less than two per cent. In the case of the directional event rates we like to suggest that the experiments exploit two features, of the process, which are essentially independent of the SUSY model employed, namely: 1) The forward-backward asymmetry, with respect to the sun's direction of motion, is very large and 2) The modulation is much larger, especially if the observation is made in a plane perpendicular to the sun's velocity. In this case the difference between maximum and minimum can be larger than 40 per cent and the phase of the Earth at the maximum is direction dependent. △ Less", "A predictive framework for fermion masses and mixing is given by the supersymmetric SO(10) model with one 10, one bar126, one 126 and one 210 Higgs representations, and type II seesaw dominating the neutrino mass matrix. We investigate the origin of the tension between this model and lepton mixing data and refine previous numerical analyses. We discuss an extension of the minimal model that includes one 120 Higgs chiral superfield representation. This exhausts the possible renormalizable contributions to the Yukawa sector. In spite of the increase in the number of parameters the predictivity of the minimal setting is not spoiled. We argue that the contributions to fermion masses due to the doublet components of 120 can be naturally small compared to those of 10 and 126, thus acting as a perturbation in the fermion mass generation. The antisymmetric nature of the 120 Yukawa coupling affects at leading order the determination of the mixing angles and it allows to remove the inconsistencies between predictions and data on the neutrino parameters. An improvement in the experimental bound on |Ue3| can tell this scenario from the minimal model. △ Less", "Recent developments in thermal leptogenesis are reviewed. Neutrino mixing data favor a simple picture where the matter-anti matter asymmetry is generated by the decays of the heavy RH neutrinos mildly close to thermal equilibrium and, remarkably, in the full non relativistic regime. This results into predictions of the final baryon asymmetry not depending on the initial conditions and with minimized theoretical uncertainties. After a short outline of a geometrical derivation of the CP asymmetry bound, we derive analytic bounds on the lightest RH neutrino mass and on the absolute neutrino mass scale. Neutrino masses larger than 0.1 eV are not compatible with the minimal leptogenesis scenario. We discuss how the results get just slightly modified within the minimal supersymmetric standard model. In particular a conservative lower bound on the reheating temperature, T_R \\gtrsim 10^9 GeV, is obtained in the relevant effective neutrino mass range tilde{m}_1 \\gtrsim 3x10^{-3} eV. We also comment on the existence of a `too-short-blanket problem' in connection with the possibility of evading the leptogenesis neutrino mass bound. △ Less", "We consider hadronic CP violation induced by chromoelectric dipolemoments (CEDMs) of light quarks and the QCD theta parameter ($?overline{?theta}$). We concentrate on the strange quark CEDM especially in this paper. Using effective CP violating nucleon interactions induced by the CEDMs and $?overline{?theta}$ with the SU(3) chiral Lagrangian technique, we calculate the EDMs for the $^{199}$Hg atom, neutron and deuteron. We also discuss supersymmetric contributions to the electric dipole moments with the mass insertion approximations and give stringent constraints on the CP phases of the flavor changing SUSY breaking terms. △ Less", "Direct and indirect dark matter searches can potentially lead to the discovery of Supersymmetry. In the specific context of heterotic orbifold compactification scenarios, it is even possible to get some clues on the SUSY breaking mechanism of the more fundamental underlying theory. In this paper, we investigate the prospects for indirect detection of neutralino dark matter via gamma-ray (continuum and line) and synchrotron radiation from the Galactic center, in the context of AMSB scenarios in an effective heterotic framework, which constitutes a consistent SUSY model between high energy theory and low energy phenomenology. △ Less", "We analyze the antimatter yield of supersymmetric (SUSY) models with large neutralino annihilation cross sections. We introduce three benchmark scenarios, respectively featuring bino, wino and higgsino-like lightest neutralinos, and we study in detail the resulting antimatter spectral features. We carry out a systematic and transparent comparison between current and future prospects for direct detection, neutrino telescopes and antimatter searches. We demonstrate that often, in the models we consider, antimatter searches are the only detection channel which already constrains the SUSY parameter space. Particularly large antiprotons fluxes are expected for wino-like lightest neutralinos, while significant antideuteron fluxes result from resonantly annihilating binos. We introduce a simple and general recipe which allows to assess the visibility of a given SUSY model at future antimatter search facilities. We provide evidence that upcoming space-based experiments, like PAMELA or AMS, are going to be, in many cases, the unique open road towards dark matter discovery. △ Less", "This paper presents the detection issues for the lightest slepton \\tildeτ_1 at a future e^+e^- TeV collider given the dark matter constraints set on the SUSY mass spectrum by the WMAP results. It intends to illustrate the importance of an optimal detection of energetic electrons in the very forward region for an efficient rejection of the γγbackground. The TESLA parameters have been used in the case of head-on collisions and in the case of a 10, mrad half crossing angle. △ Less", "The cosmological constant problem is a failure of naturalness and suggests that a fine-tuning mechanism is at work, which may also address the hierarchy problem. An example -- supported by Weinberg's successful prediction of the cosmological constant -- is the potentially vast landscape of vacua in string theory, where the existence of galaxies and atoms is promoted to a vacuum selection criterion. Then, low energy SUSY becomes unnecessary, and supersymmetry -- if present in the fundamental theory -- can be broken near the unification scale. All the scalars of the supersymmetric standard model become ultraheavy, except for a single finely tuned Higgs. Yet, the fermions of the supersymmetric standard model can remain light, protected by chiral symmetry, and account for the successful unification of gauge couplings. This framework removes all the difficulties of the SSM: the absence of a light Higgs and sparticles, dimension five proton decay, SUSY flavor and CP problems, and the cosmological gravitino and moduli problems. High-scale SUSY breaking raises the mass of the light Higgs to about 120-150 GeV. The gluino is strikingly long lived, and a measurement of its lifetime can determine the ultraheavy scalar mass scale. Measuring the four Yukawa couplings of the Higgs to the gauginos and higgsinos precisely tests for high-scale SUSY. These ideas, if confirmed, will demonstrate that supersymmetry is present but irrelevant for the hierarchy problem -- just as it has been irrelevant for the cosmological constant problem -- strongly suggesting the existence of a fine-tuning mechanism in nature. △ Less", "A set of classical solutions of a singular type is found in a 5D SUSY bulk-boundary system. The \"parallel\" configuration, where the whole components of fields or branes are parallel in the iso-space, naturally appears. It has three {\\it free} parameters related to the {\\it scale freedom} in the choice of the brane-matter sources and the {\\it \"free\" wave} property of the {\\it extra component} of the bulk-vector field. The solutions describe brane, anti-brane and brane-anti-brane configurations depending on the parameter choice. Some solutions describe the localization behaviour even after the non-compact limit of the extra space. Stableness is assured. Their meaning in the brane world physics is examined in relation to the stableness, localization, non-singular (kink) solution and the bulk Higgs mechanism. △ Less", "We present the latest version of micromegas, a code that calculates the relic density of the lightest supersymmetric particle in the MSSM. All tree-level processes for the annihilation of the LSP are included as well as all possible coannihilation processes with neutralinos, charginos, sleptons, squarks and gluinos. The cross-sections extracted from CalcHEP are calculated exactly using loop-corrected masses and mixings as specified in the SUSY Les Houches Accord. Relativistic formulae for the thermal average are used and care is taken to handle poles and thresholds by adopting specific integration routines. The input parameters can be either the soft SUSY parameters in a general MSSM or the parameters of a SUGRA model specified at some high scale (GUT). In the latter case, a link with Suspect, Softsusy, Spheno and Isajet allows to calculate the supersymmetric spectrum, Higgs masses, as well as mixing matrices. Higher-order corrections to Higgs couplings to quark pairs including QCD as well as some SUSY corrections (deltaMb) are implemented. Routines calculating (g-2), bsgamma and bsmumu are also included. In particular the bsgamma routine includes an improved NLO for the SM and the charged Higgs while the SUSY large tan(beta) effects beyond leading-order are included. This new version also provides cross-sections for any 2->2 process as well as partial decay widths for two-body final states in the MSSM allowing for easy simulation at colliders. △ Less", "We present the decay widths of the heavier Higgs bosons $H^0$ and $A^0$ into chargino pairs in the minimal supersymmetric standard model, including full one-loop corrections. All parameters for charginos are renormalized in the on-shell scheme. The importance of the corrections to the chargino mass matrix and mixing matrices is pointed out. The full corrections are typically of the order of 10 %. △ Less", "Neutrino oscillation experiments suggest existence of new flavor-violating interactions in high energy scale. It may be possible to probe them by the flavor- and CP-violating processes in leptons and hadrons in the supersymmetric (SUSY) models. In this article the third-generation flavor violation is reviewed in the SUSY seesaw model and SUSY SU(5) GUT with the right-handed neutrinos. △ Less", "We review some recent results obtained by our group on models of neutrino masses and mixings in the general context of SUSY GUT's with an associated flavour symmetry. △ Less", "The longitudinal polarization of fermions (tops and taus) produced in sfermion decays to neutralinos or charginos can be a useful tool for the determination of SUSY parameters. We discuss this fermion polarization in the context of the MSSM with complex parameters. We show that the dependence on CP-violating phases can be large and that the fermion polarization may hence be used as a sensitive probe of CP phases in the MSSM. △ Less", "In supersymmetric scenarios with a low scale of SUSY breaking [sqrt{F}=O(TeV)] the conventional MSSM Higgs sector can be substantially modified, mainly because the Higgs potential contains additional effective quartic terms. The Higgs spectrum can be dramatically changed, and the lightest state can be much heavier than in usual SUSY scenarios. Novel opportunities for electroweak breaking arise, and the electroweak scale may be obtained in a less fine-tuned way for wide ranges of tan(beta) and the Higgs mass, offering a possible solution to the MSSM fine-tuning problem. △ Less", "In the context of SUSY GUTs, GUT scale cosmic strings formed at the end of hybrid inflation are compatible with currently available CMB measurements. The maximum allowed cosmic strings contribution to the CMB data constrains the free parameters (mass scales, couplings) of inflationary models. For F-term inflation either the superpotential coupling must be fine tuned or one has to invoke the curvaton mechanism. D-term inflation should be addressed in the framework of SUGRA. We find that the cosmic strings contribution is not constant, contrary to some previous results. Using CMB measurements we constrain the gauge and the superpotential couplings. △ Less", "We study the symmetric 2-zero texture of the neutrino mass matrix, which is obtained from the symmetric Dirac neutrino mass matrix with 2-zeros and right-handed Majorana neutrino mass matrix with the general form via the see-saw mechanism, for the SUSY SO(10) GUT model including the Pati-Salam symmetry. We show that the only one texture in our model, having degenerate mass spectrum for the 1st and 2nd generation of right-handed Majorana neutrino, can simultaneously explain the current neutrino experimental data, lepton flavor violating processes and baryon asymmetry of the Universe. Within such a framework, the predicted values of the light and heavy Majorana neutrino masses, together with $|U_{e3}|$, $J_{\\rm CP}$ and $|< M_{ee} >|$, are almost uniquely determined. △ Less", "A neutralino relic density in accord with WMAP measurements can be found in the minimal supergravity (mSUGRA) model in several regions of parameter space: the stau co-annihilation corridor at low m_0 and the hyperbolic branch/focus point (HB/FP) region at large m_0 at the edges of parameter space, and the bulk and Higgs boson funnel regions within. In the regions at the edge, the mass gap between the next-to-lightest SUSY particle (NLSP) and the lightest SUSY particle (LSP) becomes small, and backgrounds from $γγ\\to f\\bar{f}$ ($f$ is a SM fermion) become important for NLSP detection at an $e^+e^-$ linear collider. We evaluate these backgrounds from bremsstrahlung and beamstrahlung photons, and demonstrate that these do not preclude the observability of the signal for the cases where either the stau or the chargino is the NLSP. We also delineate the additional portion of the stau coannihilation region, beyond what can be accessed via a search for selectrons and smuons, that can be probed by a search for di-tau-jet events plus missing energy. The reach of a LC for SUSY in the HB/FP region is shown for an updated value of $m_t\\simeq 180$ GeV as recently measured by the $DØ$ experiment. △ Less", "If the fundamental Planck scale is near a TeV, then we should expect to see TeV scale black holes at the LHC. Similarly, if the scale of supersymmetry breaking is sufficiently low, then we might expect to see light supersymmetric particles in the next generation of colliders. If the mass of the supersymmetric particle is of order a TeV and is comparable to the temperature of a typical TeV scale black hole, then such sparticles will be copiously produced via Hawking radiation: The black hole will act as a resonance for sparticles, among other things. In this paper we compared various signatures for SUSY production at LHC, and we contrasted the situation where the sparticles are produced directly via parton fusion processes with the situation where they are produced indirectly through black hole resonances. We found that black hole resonances provide a larger source for heavy mass SUSY (squark and gluino) production than the direct pQCD-SUSY production via parton fusion processes depending on the values of the Planck mass and blackhole mass. Hence black hole production at LHC may indirectly act as a dominant channel for SUSY production. We also found that the differential cross section dσ/dp_t for SUSY production increases as a function of the p_t (up to p_t equal to about 1 TeV or more) of the SUSY particles (squarks and gluinos), which is in sharp contrast with the pQCD predictions where the differential cross section dσ/dp_t decreases as p_t increases for high p_t about 1 TeV or higher. This is a feature for any particle emission from TeV scale blackhole as long as the temperature of the blackhole is very high (~ TeV). Hence measurement of increase of dσ/dp_t with p_t for p_t up to about 1 TeV or higher for final state particles might be a useful signature for blackhole production at LHC. △ Less", "If signals suggesting supersymmetry (SUSY) are discovered at the LHC then it will be vital to measure the spin of the new particles to demonstrate that they are indeed the predicted super-partners. A method is discussed by which the spins of some of the SUSY particles can be investigated. Angular distributions in sparticle decays lead to charge asymmetry in lepton-jet invariant mass distributions. The size of the asymmetry is proportional to the primary production asymmetry between squarks and anti-squarks. Monte Carlo simulations are performed for a particular mSUGRA model point at the LHC. The resultant asymmetry distributions are consistent with a spin-0 slepton and a spin-half neutralino-two, but are not consistent with the pure phase-space decays one would obtain from both sparticles being scalars. △ Less", "After a quarter of century of intense search for new physics beyond the Standard Model (SM), two ideas stand out to naturally cope with (i) small neutrino masses and (ii) a light higgs boson : Seesaw and SUSY. The combination of these two ideas, i.e. SUSY seesaw exhibits a potentially striking signature: a strong (or even very strong) enhancement of lepton flavour violation (LFV), which on the contrary remains unobservable in the SM seesaw. Indeed, even when supersymmetry breaking is completely flavour blind, Renormalisation Group running effects are expected to generate large lepton flavour violating entries at the weak scale. In Grand Unified theories, these effects can be felt even in hadronic physics. We explicitly show that in a class of SUSY SO(10) GUTs there exist cases where LFV and CP violation in B-physics can constitute a major road in simultaneously confirming the ideas of Seesaw and low-energy SUSY. △ Less", "The synthesis of Li6 during the epoch of Big Bang nucleosynthesis (BBN) due to residual annihilation of dark matter particles is considered. By comparing the predicted Li6 to observations of this isotope in low-metallicity stars, generic constraints on s-wave dark matter annihilation rates into quarks, gauge bosons, and Higgs bosons are derived. It may be shown that, for example, wino dark matter in anomaly-mediated SUSY breaking scenarios with masses Mx < 250 GeV or light neutralinos with Mx < 20 GeV annihilating into light quarks are, taken face value, ruled out. These constraints may only be circumvented if significant Li6 depletion has occurred in all three low-metallicity stars in which this isotope has been observed to date. In general, scenarios invoking non-thermally generated neutralinos with enhanced annihilation rates for a putative explanation of cosmic ray positron or galactic center as well as diffuse background gamma-ray signals by present-day neutralino annihilation will have to face a stringent Li6 overproduction problem. On the other hand, it is possible that Li6 as observed in low-metallicity stars is entirely due to residual dark matter annihilation during BBN, even for neutralinos undergoing a standard thermal freeze-out. △ Less", "We present a systematic method to construct exactly all Bogomol'nyi-Prasad-Sommerfield (BPS) multi-wall solutions in supersymmetric (SUSY) U(N_C) gauge theories in five dimensions with N_F hypermultiplets in the fundamental representation for infinite gauge coupling. The moduli space of these non-Abelian walls is found to be the complex Grassmann manifold SU(N_F)/(SU(N_C)xSU(N_F-N_C)xU(1)) endowed with a deformed metric. △ Less", "SFITTER is a new analysis tool to determine supersymmetric model parameters from collider measurements. Using the set of supersymmetric mass measurements at the LC and at the LHC we show how both colliders probe different sectors of the MSSM Lagrangian. This observation is a strong motivation to move from a parameter fit assuming a certain model to the unconstrained weak-scale MSSM Lagrangian. We argue how the technical challenges can be dealt with in a combined fit/grid approach with full correlations. △ Less", "The dimuon plus dijet signal is analyzed in the top squark pair production at Tevatron Run-II experiment and the total event rate is compared with the existing dimuon data. This comparison rules out top squark mass upto 188(104) GeV for the branching fraction 100%(50%) of top squark decay into the muon plus quark via lepton number violating coupling. Interpretation of this limit in the framework of R-parity violating(RPV) SUSY model puts limit on relevant RPV coupling for a given top squark mass and other supersymmetric model parameters. If $\\MST \\lsim 180$ GeV we found that the RPV couplings are roughly restricted to be within $\\sim 10^{-4}$ which is at the same ballpark value obtained from the neutrino data. The limits are very stringent for a scenario where top squarks appear to be the next lightest supersymmetric particles. △ Less", "The LEP-II bound on the light Higgs mass rules out the vast majority of parameter space left to the Minimal Supersymmetric Standard Model (MSSM) with weak-scale soft-masses. This suggests the importance of exploring extensions of the MSSM with non-minimal Higgs physics. In this article, we explore a theory with an additional singlet superfield and an extended gauge sector. The theory has a number of novel features compared to both the MSSM and Next-to-MSSM, including easily realizing a light CP-even Higgs mass consistent with LEP-II limits, tan(beta) < 1, and a lightest Higgs which is charged. These features are achieved while remaining consistent with perturbative unification and without large stop-masses. Discovery modes at the Tevatron and LHC are discussed. △ Less", "We consider the conditions which must be satisfied for a Majorana RH sneutrino, a massive right-handed (RH) sneutrino associated with the see-saw mechanism of Majorana neutrino masses, to play the role of the curvaton. Planck-scale suppressed non-renormalizable terms in the RH neutrino superpotential must be eliminated to a high order if the RH sneutrino curvaton is to dominate the energy density before it decays, which can be achieved via an R-symmetry which is broken to R-parity by the Giudice-Maseiro mechanism. In order to satisfy the thermalization constraint, one RH neutrino mass eigenstate must have small Yukawa couplings to the Higgs and lepton doublets, corresponding to a lightest neutrino mass m_{nu_{1}} < 10^{-3} eV. A time-dependent lepton asymmetry will be induced in the RH sneutrino condensate by the Affleck-Dine mechanism driven by SUSY breaking B-terms associated with the RH neutrino masses. Requiring that the resulting baryon asymmetry and isocurvature perturbations are acceptably small imposes an upper bound on the RH neutrino mass. We show that a scenario consistent with all constraints is obtained for a RH neutrino mass in the range 10^{2} - 10^{4} GeV when the RH sneutrino decay temperature is greater than 100 GeV and lightest neutrino mass m_{nu_{1}} approx 10^{-3} GeV. Larger RH neutrino masses are possible for smaller m_{nu_{1}}. The resulting scenario is generally consistent with a solution of the cosmic string problem of D-term inflation. △ Less", "Since the calculation of $BR(B^- \\to η^{\\prime} K^-)$ in the framework of QCD improved factorization method, developed by Beneke et al., leads to numerical values much below the experimental data, we include two different contributions, in an alternative way. First, we find out that the spectator hard-scattering mechanism increases the $BR$ value with almost 50%, but the predictions depend on the combined singularities in the amplitude convolution. Secondly, by adding SUSY contributions to the Wilson coefficients, we come to a $BR$ depending on three parameters, whose values are constrained by the experimental data. △ Less", "We investigate ττfusion to light h and heavy H and A Higgs bosons in the Minimal Supersymmetric Standard Model (MSSM) at a photon collider as a promising channel for measuring large values of tan(beta). For standard design parameters of a photon collider an error Δtan(beta) \\sim 1, uniformly for tan(beta) \\gsim 10, may be expected, improving on complementary measurements at the LHC and e+e- linear colliders. △ Less", "The Weakly Interacting Massive Particle (WIMP) is one of the main candidates for the relic dark matter (DM).In the effective low-energy minimal supersymmetric standard model (effMSSM) the neutralino-nucleon spin and scalar cross sections in the low-mass regime were calculated. The calculated cross sections are compared with almost all experimental currently available exclusion curves for spin-dependent WIMP-proton and WIMP-neutron cross sections. It is demonstrated that in general about two-orders-of-magnitude improvement of the current DM experiment sensitivities is needed to reach the (effMSSM) SUSY predictions. At the current level of accuracy it looks reasonable to safely neglect sub-dominant spin WIMP-nucleon contributions analyzing the data from spin-non-zero targets. To avoid misleading discrepancies between data and SUSY calculations it is, however, preferable to use a mixed spin-scalar coupling approach.This approach is applied to estimate future prospects of experiments with the odd-neutron high-spin isotope Ge-73. It is noticed that the DAMA evidence favors the light Higgs sector in the effMSSM, a high event rate in a Ge-73 detector and relatively high upgoing muon fluxes from relic neutralino annihilations in the Earth and the Sun. △ Less", "We evaluate the $t\\bar{c}$ and $t\\bar{u}$ productions at the LHC within the general unconstrained MSSM framework. We find that these single top quark productions induced by SUSY-QCD FCNC couplings have remarkable cross sections for favorable parameter values allowed by current low energy data, which can be as large as a few pb. Once large rates of the $t\\bar{c}$ and $t\\bar{u}$ productions are detected at the LHC, they may be induced by SUSY FCNC couplings. We show that the precise measurement of single top quark production cross sections at the LHC is a powerful probe for the details of the SUSY FCNC couplings. △ Less", "Analyzing the $\\ell +n$-$jets+ \\met$ (where $n \\ge 2 $), data from Run-I of the Tevatron using the Bayesian technique, we obtain model independent limits on the product $\\br(\\lstop\\ra be^{+}ν_e \\lspone) \\times \\br(\\lstop^{*}\\ra \\bar{b}q\\bar{q^{\\prime}}\\lspone)$ for different values of the lighter top squark($\\lstop$) mass and the lightest supersymmetric particle($\\lspone$) mass. The SUSY signals have been simulated by interfacing the 4-body decay of $\\lstop$ at the parton level with the event generator PYTHIA. These limits have been translated into exclusion plots in the $\\mlstop$-$\\mlspone$ plane, which also turn out to be fairly model independent for fixed values of the BR of the competing loop decay mode $\\lstop\\ra c \\lspone$. Assuming the loop decay BR to be negligible and using the leading order cross section for $\\lstoplstop$ pair production, we obtain conservatively $\\mlstop \\ge $77.0 (74.5) GeV for $\\mlspone$=5(15) GeV, while for $\\br(\\lstop\\ra c \\lspone)$=20%, the corresponding limits are $\\mlstop \\ge $68.0 (65.0) GeV. Using the larger next to leading order cross-section stronger limits are obtained. For example, if $\\br(\\lstop\\ra c \\lspone)$=20%, $\\mlstop \\ge $73.0 (72.7) GeV for $\\mlspone$=5(15) GeV. Our limits nicely complement the ALEPH bounds which get weaker for low $\\mlspone$. △ Less", "We investigate SUSY breaking mediated through the deformation of the space-time geometry due to the backreaction of a nontrivial configuration of a bulk scalar field. To illustrate its features, we work with a toy model in which the bulk is four dimensions. Using the superconformal formulation of SUGRA, we provide a systematic method of deriving the 3D effective action expressed by the superfields, which can basically be extended to 5D SUGRA straightforwardly. △ Less", "We study N=1 supersymmetric SU(N) gauge theories with an antisymmetric tensor and F flavors using the recent proposal of a-maximization by Intriligator and Wecht. This theory had previously been studied using the method of \"deconfinement\", but such an analysis was not conclusive since anomalous dimensions in the non-perturbative regime could not be calculated. Using a-maximization we show that for a large range of F the theory is at an interacting superconformal fixed point. However, we also find evidence that for a range of F the theory in the IR splits into a free \"magnetic\" gauge sector and an interacting superconformal sector. △ Less", "A supersymmetric (SUSY) model of radius stabilization is constructed for the S^1/Z_2 warped compactifications with a hypermultiplet in five dimensions. Requiring the continuity of scalar field across the boundaries, we obtain radius stabilization preserving SUSY, realizing the SUSY extension of the Goldberger-Wise mechanism. Even if we allow discontinuities of the Z_2 odd field across the boundary, we always obtain SUSY preservation but obtain the radius stabilization only when the discontinuity is fixed by other mechanism. △ Less", "In the framework of a SUSY SO(10) model a phase is generated spontaneously for the B-L breaking VEV. Fitting this phase to the observed CP violating K,B decays all other CP breaking effects are uniquely predicted. In particular, the amount of Leptogenesis can be explicitly calculated and found to be in the right range and sign for the BAU. △ Less", "We suggest an approach to explain the observed pattern of the neutrino masses and mixing which employs the weakly broken quark-lepton symmetry and does not require introduction of an ad hoc symmetry of the neutrino sector. The mass matrices are nearly equal for all quarks and leptons. They have very small determinants and hierarchical form with expansion parameter lambda = 0.26. The latter can be realized, e.g., in the model with U(1) family symmetry. The symmetry is broken at the lambda^2 level. Large lepton mixing appears as a result of summation of the neutrino and charged lepton rotations which diagonalize the mass matrices in contrast with quark sector where the up quarks and down quarks rotations cancel each other. We show that the flip of the sign of rotation in the lepton sector is a result of the seesaw mechanism which also enhances the neutrino mixing. In this approach one expects, in general, deviation of the 2-3 mixing from maximal, s_{13} \\sim (1-3) lambda^2, hierarchical neutrino mass spectrum, and m_{ee} < 10^{-2} eV. The scenario is consistent with the thermal leptogenesis and (in SUSY context) bounds on lepton number violating processes, like mu to e gamma. △ Less", "We study the little hierarchy between mass parameters in the Higgs sector and other SUSY breaking masses. This type of spectrum can relieve the fine-tuning problem in the MSSM Higgs sector. Our scenario can be realized by superconformal dynamics. The spectrum in our scenario has significant implications in other phenomenological aspects like the relic abundance of the lightest neutralino and relaxation of the unbounded-from-below constraints. △ Less", "A new algorithm designed to reduce the model dependence in future SUSY searches at the LHC is described. This algorithm can dynamically adapt itself to a wide range of possible SUSY final states thus reducing the need for detailed model-driven analysis. Preliminary study of its performance on simulated MSSM, GMSB and AMSB final states is described, and a comparison with traditional search procedures, whenever available, is performed. △ Less", "We consider the process $e^+e^-\\to\\tiχ^+_i\\tiχ^-_j$ at a linear collider with transverse $e^{\\pm}$ beam polarization. We investigate the influence of the CP phases on azimuthal asymmetries in $e^+e^-\\to\\tiχ^+_i\\tiχ^-_j$ with subsequent two-body decays $\\tiχ^-_j\\to \\tiν_{\\ell}\\ell^-$ and $\\tiχ^-_j\\to W^-\\tiχ^0_1$. We show that triple product correlations involving the transverse $e^{\\pm}$ beam polarization vanish if at least one subsequent chargino decay is not observed. We derive this result within the Minimal Supersymmetric Standard Model (MSSM) with complex parameters, however, it holds also in the general MSSM with SUSY flavour violation. △ Less", "We study the vacuum structure in 5D SO(10) grand unified theory (GUT) compactified on $S^1/Z_2$ orbifold, where SO(10) is broken into $SU(3)\\times SU(2)\\times U(1)^2$ through the boundary conditions. Although a lot of people extended to 6D to avoid massless colored particle, we can show they obtain finite masses by the radiative corrections. In a supersymmetric case, the fermionic partner of the zero-mode can also acquire non-vanishing mass through the SUSY breaking effects, and the gauge coupling unification can be recovered by use of brane localized kinetic terms. △ Less", "We make a first study of the phenomenological implications of twisted moduli in type I intersecting D5-brane models, focussing on the resulting predictions at the LHC using SOFTSUSY to estimate the Higgs and sparticle spectra. Twisted moduli can play an important role in giving a viable string realisation of sequestering in the limit where supersymmetry breaking comes entirely from the twisted moduli. We focus on a particular string inspired version of gaugino mediation in which the first two families are localised at the intersection between D5-branes, whereas the third family and Higgs doublets are allowed to move within the world-volume of one of the branes. The soft supersymmetry breaking third family sfermion mass terms are then in general non-degenerate with the first two families. We place constraints upon parameter space and predictions of flavour changing neutral current effects. Twisted moduli domination is studied and, as well as solving the most serious part of the SUSY flavour problem, is shown to be highly constrained. The constraints are weakened by switching on gravity-mediated contributions from the dilaton and untwisted T-moduli sectors. In the twisted moduli domination limit we predict a stop-heavy MSSM spectrum and quasi-degenerate lightest neutralino and chargino states with wino-dominated mass eigenstates. △ Less", "Selectron decays constitute a source of 100% polarised neutralinos, whose helicity is fixed by the charge and \"chirality\" of the decaying selectron. In SUSY scenarios where the second neutralino X_2^0 has three-body decays, the cascade decay e_L -> e X_2^0 -> e X_1^0 mu+ mu- provides a clean place to study CP violation in the neutralino sector, through the analysis of CP-violating asymmetries involving the X_2^0 spin s and the momenta of the muons. We show that a CP-violating asymmetry in the triple product s . (p_mu- x p_mu+) could be observable at a 800 GeV linear collider provided the gaugino mass M_1 has a large phase at the electroweak scale. We compare our results with X_1^0 X_2^0 production, where a CP asymmetry is also observable within these scenarios. △ Less", "Recent experimental and theoretical determinations of (g-2)_muon, Omega*h^2 and BF(b->s,gamma) place exceedingly tight constraints on the minimal supergravity (mSUGRA) model. We advocate relaxing the generational universality of mSUGRA, so that GUT scale third generation scalar masses are greater than the (degenerate) first and second generation scalar masses (a normal scalar mass hierarchy (NMH)). The non-degeneracy allows for a reconciliation of all the above constraints, and also respects FCNC limits from B_d-B_dbar mixing and b -> s,gamma. The NMH SUGRA model leads to the prediction of relatively light first and second generation sleptons. This yields large rates for multilepton collider signatures at the CERN LHC and also possibly at the Fermilab Tevatron. The spectrum of light sleptons should be accessible to a sqrt{s}=0.5-1TeV linear e^+e^-$ collider. △ Less", "We present an update of previous work on charged lepton flavor violation (LFV) in the seesaw model. The most recent neutrino data fits and post WMAP mSUGRA benchmark scenarios are used as input. In this framework we compare the sensitivity of rare radiative decays on the right-handed Majorana mass scale M_R with the reach in slepton-pair production at a future linear collider. △ Less", "We consider the production of chargino and charged Higgs boson pairs at future linear colliders for c.m. energies in the one TeV range. Working in the MSSM under the assumption of a \"moderately\" light SUSY scenario, we compute the leading (double) and next-to leading (linear) supersymmetric logarithmic terms of the so-called \"Sudakov expansion\" at one loop. We show that a combined analysis of the slopes of the chargino and of the charged Higgs production cross sections would offer a simple possibility for determining $\\tanβ$ for large ($\\gtrsim 10$) values and an allowed strip in the ($M_2,μ$) plane. This could provide a strong consistency test of the considered supersymmetric model. △ Less", "This review illustrates by means of sample reactions the potential of a future global e+e- Linear Collider (LC) for precision measurements of Supersymmetric particles with emphasis on recent studies and addressing major research directions. △ Less", "Within the framework of an SU(5) SUSY GUT model, a possible general form of the neutrino mass matrix induced by R-parity violation is investigated. The model has matter fields \\bar{5}'_{L}+5'_{L} in addition to the ordinary matter fields \\bar{5}_{L}+10_{L} and Higgs fields H_u+\\bar{H}_d. The R-parity violating terms are given by \\bar{5}_{L} \\bar{5}_{L} 10_{L}, while the Yukawa interactions are given by \\bar{H}_d \\bar{5}'_{L} 10_{L}. Since the matter fields \\bar{5}'_L and \\bar{5}_L are different from each other at the unification scale, the R-parity violation effects at a low energy scale appear only through the \\bar{5}'_L \\leftrightarrow \\bar{5}_{L} mixings. In order to make this R-parity violation effect harmless for proton decay, a discrete symmetry Z_3 and a triplet-doublet splitting mechanism analogous to that in the 5-plet Higgs fields are assumed. △ Less", "In the event that R-Parity conserving supersymmetry (SUSY) is discovered at the LHC, a key issue which will need to be addressed will be the consistency of that signal with astrophysical and non-accelerator constraints on SUSY Dark Matter. This issue is studied for the SPS1a mSUGRA benchmark model by using measurements of end-points and thresholds in the invariant mass spectra of various combinations of leptons and jets in ATLAS to constrain the model parameters. These constraints are then used to assess the statistical accuracy with which quantities such as the Dark Matter relic density and direct detection cross-section can be measured. Systematic effects arising from the use of different mSUGRA RGE codes are also estimated. Results indicate that for SPS1a a statistical(systematic) precision on the relic abundance ~ 2.8% (3 %) can be obtained given 300 fb-1 of data. △ Less", "In this opening talk I first describe how we are entering a data-rich era, and what clues we might soon have to physics beyond the SM (on a time scale of several years). Then we turn to a number of the basic issues we hope to explain, and discuss what level of theory may address them, the SM or supersymmetric SM, or string theory, or \"other\". Next we consider some of the large number of fine-tunings we seem to have, and how they may be clues, focusing on how the fine-tuning of M$_{Z}$ and m$_{h}$ suggest the MSSM needs to be extended as the low scale theory, and on how flavor physics may be a powerful probe of string theory. Finally we examine using benchmark models to study all these issues. △ Less", "This article critically reviews the proposal for addressing the cosmological constant problem within the framework of supersymmetric large extra dimensions (SLED), as recently proposed in hep-th/0304256. After a brief restatement of the cosmological constant problem, a short summary of the proposed mechanism is given. The emphasis is on the perspective of the low-energy effective theory in order to see how it addresses the problem of why low-energy particles like the electron do not contribute too large a vacuum energy. This is followed by a discussion of the main objections, which are grouped into the following five topics: (1) Weinberg's No-Go Theorem. (2) Are hidden tunings of the theory required, and a problem? (3) Why should the mechanism not rule out earlier epochs of inflation? (4) How big are quantum effects, and which are the most dangerous? (5) Can the mechanism be consistent with cosmological constraints? It is argued that there are plausible reasons why the mechanism can thread the potential objections, but that a definitive proof that it does depends on addressing well-defined technical points. These points include identifying what fixes the size of the extra dimensions, checking how topological obstructions renormalize and performing specific calculations of quantum corrections. More detailed studies of these issues, which are well reach within our present understanding of extra-dimensional theories, are currently underway. As such, the jury remains out concerning the proposal, although the prospects for acquittal still seem good. △ Less", "We review the mechanism of gaugino condensation in the framework of the $d=10$ heterotic string and its $d=11$ extension of Horava and Witten. In particular we emphasize the relation between the gaugino condensate and the flux of the antisymmetric tensor fields of higher dimensional supergravity. Its potential role for supersymmetry breakdown and moduli stabilization is investigated. △ Less", "We study the effects of heavy Higgs bosons on the top-pair production process at photon linear colliders. The interference patterns between the resonant Higgs-production amplitudes and the continuum QED amplitudes are examined. The patterns tell us not only the CP nature of the Higgs bosons but also the phase of the $γγ$--Higgs vertex which gives new information about the Higgs couplings to new charged particles. △ Less", "Specific models of supersymmetry breaking predict relations between the trilinear and bilinear soft supersymmetry breaking parameters A_0 and B_0 at the input scale. Models with A_0 = B_0 + m_0 as well as the simplest Polonyi model with A_0 = (3 - \\sqrt{3}) m_0 are discussed. In such cases, the value of \\tanb can be calculated as a function of the scalar masses m_0 and the gaugino masses m_{1/2}, and various experimental constraints can be applied to constrain it. △ Less", "We classify compactifications of the type IIB superstring on AdS_{5} x S^{5}/Γ, where Γis an abelian group of order n<= 12. Appropriate embedding of Γin the isometry of S^5 yields both SUSY and non-SUSY chiral models that can contain the minimal SUSY standard model or the standard model. New non-SUSY three family models with Γ=Z_8 are introduced, which lead to the right Weinberg angle for TeV trinification. △ Less", "In the Minimal Supersymmetric Standard Model, the masses of the charged Higgs boson ($H^\\pm$) and the CP-odd scalar ($A$) are related by $M_{H^+}^2=M_A^2+m_W^2$ at the Born level. Because the coupling of $W^-$-$A$-$H^+$ is fixed by gauge interaction, the Born level production rate of $q \\bar q' \\to W^{\\pm \\ast} \\to A H^\\pm$ depends only on one supersymmetry parameter -- the mass ($M_A^{}$) of $A$. We illustrate how to test the mass relation between $A$ and $H^+$ in case that the signal is found at the LHC. If the signal is not found, the product of the decay branching ratios of $A$ and $H^\\pm$ predicted by the MSSM is bounded from above as a function of $M_A$. △ Less", "This study indicates that in E6 grand unified theories (GUTs), once a hierarchical structure of up-quark-type Yukawa couplings is given as a basic structure of flavor, larger lepton mixings than the quark mixings and milder down-quark-type (and charged-lepton-type) mass hierarchies than up-quark-type mass hierarchy can generically be obtained under a few natural assumptions. The basic flavor structure is compatible with non-Abelian horizontal symmetry, which can solve the SUSY flavor problem. It is shown that in solving the SUSY flavor problem, the E6 structure, which realizes bi-large neutrino mixings, also solves a problem that results from the large neutrino mixing angles. △ Less", "Unitarity of the 4d standard model is ensured by the conventional Higgs mechanism with a fundamental spin-0 Higgs boson, responsible for gauge boson mass-generations. On the contrary Kaluza-Klein (KK) compactification of extra spatial dimensions can geometrically realize the gauge boson mass generation without invoking a fundamental Higgs scalar. We reveal that massive gauge boson scattering in the compactified theories is unitary at low energies, and the unitarity violation is {\\it delayed} to the intrinsic ultraviolet (UV) scale of the higher dimensional gauge theory. We demonstrate that this is a generic consequence of the ``geometric Higgs mechanism'' (GHM), manifested via Kaluza-Klein equivalence theorem (KK-ET). We further show that the presence of many gauge KK states below the UV cutoff scale imposes strong bounds on the highest KK level (N_KK). Applying these bounds to higher-dimensional SUSY GUTs implies that only a small number of KK states can be used to accelerate gauge coupling unification, and suggests that the GUT scale in the 5d minimal SUSY SU(5) is above 10^{14} GeV. △ Less", "We consider supersymmetric scenarios, compatible with all cosmological and phenomenological requirements, where the lightest SUSY particles (LSPs) are the neutralino and a quasi degenerate gluino. We study the neutralino relic abundance, focusing on gluino (co-)annihilation effects. In case the neutralino is bino-like, in a wide mass window the relic abundance is naturally driven in the correct range for the LSP to be the main cold dark matter constituent. We show that the gluino is the strongest possible coannihilating partner of a bino-like neutralino in the general MSSM. Moreover, contrary to other coannihilation scenarios, gluino pair annihilations always dominate over coannihilation processes, even at relatively large gluino-neutralino mass splittings. Finally, we present prospects for neutralino dark matter detection in the outlined framework. △ Less", "Specific quasi-realistic superstring constructions often predict the existence of new TeV-scale physics which may be different in character from bottom-up motivated constructions. I describe examples of such beyond the MSSM physics, with special emphasis on heavy Z' gauge bosons and associated exotic particles. Implications of an extra U(1)' include a viable scienario for electroweak baryogenesis, a highly non-standard light Higgs sector, and Z'-mediated contributions to rare B decays. △ Less", "In this talk I describe the low energy effective theory of the (supersymmetric) Randall-Sundrum scenario with arbitrary brane tensions. The distance between the branes is stabilized, at the classical level, by a potential for the radion field. In the supersymmetric case, supersymmetry can be broken by a VEV for the fifth-component of the graviphoton. △ Less", "We estimate the upper bound of the Higgs mass and allowed parameter region in the anomaly mediated supersymmetry breaking models. There has been a difficulty that the parameter region cannot be determined precisely in almost SUSY models. However, we succeed to give strict constraints on the parameters from the recent results of the precision measurements of the muon g-2 (anomalous magnetic dipole moment). Especially, the upper bound of the Higgs mass is obtained as a function of only $\\tanβ$, and is estimated less than about 123 (GeV) for all the range of $\\tanβ<60$ . △ Less", "We study the dynamical symmetry breaking in the gauge-Higgs unification of the 5D ${\\mathcal N}=1$ SUSY theory, compactified on an orbifold, $S^1/Z_2$. This theory identifies Wilson line degrees of freedoms as ``Higgs doublets''. We consider $SU(3)_c \\times SU(3)_W$ and SU(6) models, in which the gauge symmetries are reduced to $SU(3)_c \\times SU(2)_L \\times U(1)_Y$ and $SU(3)_c \\times SU(2)_L \\times U(1)_Y \\times U(1)$, respectively, through the orbifolding boundary conditions. Quarks and leptons are bulk fields, so that Yukawa interactions can be derived from the 5D gauge interactions. We estimate the one loop effective potential of ``Higgs doublets'', and analyze the vacuum structures in these two models. We find that the effects of bulk quarks and leptons destabilize the suitable electro-weak vacuum. We show that the introduction of suitable numbers of extra bulk fields possessing the suitable representations can realize the appropriate electro-weak symmetry breaking. △ Less", "We have developed the system for the automatic computation of cross-sections, {\\tt GRACE/SUSY}, including the one-loop calculations for processes of the minimal supersymmetric extension of the the standard model. For an application, we investigate the process $e^+ e^- \\to Z^0 h^0$ . △ Less", "We have developed the system for the automatic computation of cross-sections, {\\tt GRACE/SUSY}, including the one-loop calculations for processes of the minimal supersymmetric extension of the the standard model. For an application, we investigate the pair-production of the heavy chargino in electron-positron collisions. △ Less", "In this talk I review the issues of supersymmetry breaking and radion stabilization in a five dimensional theory compactified on the Z_2 orbifold. Supersymmetry breaking by Scherk-Schwarz boundary conditions is interpreted as spontaneous breaking of local supersymmetry by the Hosotani mechanism. The auxiliary field responsible for spontaneous supersymmetry breaking is inside the five-dimensional off-shell minimal supergravity multiplet. Different ways of fixing the supersymmetry breaking order parameter are analyzed. In the presence of supersymmetry breaking the one-loop effective potential for the radion has a minimum that fixes its vacuum expectation value. The radion is stabilized in a metastable Minkowski_4 minimum (versus the AdS_4 vacuum) with a mass in the meV range making it interesting for future deviations from the gravitational inverse-square law. △ Less", "We present the full one-loop radiative corrections to pair production of neutralinos in e+e- collisions within the Minimal Supersymmetric Standard Model. Particular attention is paid to the definition of weak and QED corrections. The non-universal QED corrections are extracted by subtracting the initial state radiation. We give numerical results for two different SUSY scenarios for e+e- -> neu_1 neu_2 and e+e- -> neu_2 neu_2. The weak and QED corrections are up to several percent or even higher and need to be taken into account at future linear collider experiments. △ Less", "We show that a self-tuning mechanism of the cosmological constant could work in 5D non-compact space-time. The standard model matter fields live only on the 4D brane. The change of vacuum energy on the brane just gives rise to dynamical shifts of the profiles of the background metric and a bulk scalar field in the extra dimension, keeping 4D space-time flat. To obtain the Newtonian potential on the brane, we introduce an additional brane-localized 4D Einstein-Hilbert term. △ Less", "We discuss the energy scale profile of the bi-maximal mixing which is given at the GUT energy scale in the minimal SUSY model, associated with an assumption that Y_nu^dagger Y_nu is diagonal, where Y_nu is the neutrino-Yukawa coupling matrix. In this model, the Dirac mass matrix which appears in the seesaw neutrino mass matrix is determined by three neutrino masses, two relative Majorana phases and three heavy Majorana masses. All CP phases are related by two Majorana phases. We show that the requirement that the solar mixing angle moves from the maximal mixing at GUT to the observed one as the energy scale decreases by the renormalization effect. We discuss the leptogenesis, and the lepton flavor violation process by assuming the universal soft breaking terms. △ Less", "We study one-loop effects of charginos and neutralinos on the helicity amplitudes for the process $e^+e^-\\to W^+W^-$ in the MSSM. The calculation is tested by using two methods. First, the sum rules among form factors which result from BRS invariance. Second, the decoupling property in the large mass limit is used to test the overall normalization of the amplitudes. The one-loop contribution to the helicity amplitudes is shown as a function of $μ$ Higgs parameter and $\\sqrt{s}$. We also study the effects of the CP-violating phase. △ Less", "We discuss the B-physics signature of a supersymmetric U(2) flavor model in which the third generation scalars are relatively light (electroweak scale masses). We impose current experimental constraints on such a framework and obtain expectations for various B-physics processes. Here we present CP violation in (b->s gamma) and (b->phi K), and, Bs-Bsbar mixing. We show that if realized in nature, such a framework can be discovered in current and upcoming experiments. △ Less", "Adding radion perturbations (up to second order) to the static (RS) metric allows us to calculate the general first and second order interactions of the radion field with the electroweak vector bosons. We use these interactions to compute precision electroweak observables in the case of Higgs-radion mixing and compare with experiment. △ Less", "We show that the Standard Model Lagrangian, including small neutrino masses, has an anomaly-free discrete Z_6 symmetry. Anomaly cancellation requires the number of family to be 3 mod 6. This symmetry can ensure the stability of the nucleon even when the threshold of new physics Λis low as 10^2 GeV. All ΔB=1 and ΔB=2 (B is the baryon number) effective operators are forbidden by the Z_6 symmetry. ΔB=3 operators are allowed, but they arise only at dimension 15. We suggest a simple mechanism for realizing reasonable neutrino masses and mixings even with such a low scale for Λ. △ Less", "We study the Minimal Supersymmetric Standard Model (MSSM) constrained by unification assuming mSUGRA SUSY breaking. In particular this means that the three gauge couplings are unified at a {\\it per cent} level, third generation yukawa couplings are unified at a $10 $% level, and at the unification scale $M_U\\approx 10^{16}$ the SUSY breaking masses of squarks and sleptons are universal up to specific D-term contributions. At $M_U$ we also include right-handed neutrinos that are decoupled at their three respective scales. In a top-down global analysis we then find that there are two distinct best fits, primarily distinguished by the masses of the non-Standard Model Higgs states, and compute the predictions for flavour violating processes involving both leptons and quarks. The fit with the light Higgs spectrum is especially interesting with regards to the decay $B_s\\to μ^+μ^-$. We note that the latter results go beyond what is called minimal flavour violation in the MSSM. △ Less", "In minimal supersymmetric model with a light Higgs sector, explicit CP violation and most general flavor mixings in the sfermion sector, integration of the superpartners out of the spectrum induces potentially large contributions to the Yukawa couplings of light quarks via those of the heavier ones. These corrections can be sizeable even for moderate values of tan(beta), and remain nonvanishing even if all superpartners decouple. Then Higgs boson couplings to light quarks assume spectacular enhancements; in particular, couplings to down and strange quarks become degenerate with that to the bottom quark. There arise strikingly non-standard effects that can show up in both Higgs boson searches and FCNC observables. △ Less", "We consider the Higgs sector in an extension of the MSSM involving an extra U(1)' gauge symmetry and SM singlet U(1)' charged scalars, in which the effective $μ$ parameter is decoupled from the Z' mass. There are large mixings between Higgs doublets and singlets, significantly affecting the Higgs spectrum, production cross sections, decay modes, exclusion limits, and allowed parameters ranges. Scalars considerably lighter than 114 GeV are allowed, and the range $\\tan β\\sim 1$ is both allowed and theoretically favored. We concentrate on the lighter (least model dependent) Higgs particles with significant SU(2)-doublet components to their wave functions, for the case of no explicit CP violation in the Higgs sector. We consider their spectra, including the dominant radiative corrections to their masses in the large $\\tilde t$ mass limit; production cross sections and exclusion limits at LEP and a future linear collider; and decay properties. △ Less"]