["We reinterpret the Scherk-Schwarz (SS) boundary condition for SU(2)_R in a compactified five-dimensional (5D) Poincare supergravity in terms of the twisted SU(2)_U gauge fixing in 5D conformal supergravity. In such translation, only the compensator hypermultiplet is relevant to the SS twist, and various properties of the SS mechanism can be easily understood. Especially, we show the correspondence between the SS twist and constant superpotentials within our framework. △ Less", "The occurrence of the neutrinoless decay 0n-bb mode has fundamental consequences: first total lepton number is not conserved, and second, the neutrino is a Majorana particle. Further the effective mass measured allows to put an absolute scale of the neutrino mass spectrum. In addition, double beta experiments yield sharp restrictions also for other beyond standard model physics. These include SUSY models, leptoquarks (leptoquark-Higgs coupling),compositeness, left-right symmetric models (right-handed W boson mass), test of special relativity and of the equivalence principle in the neutrino sector and others. First evidence for neutrinoless double beta decay was given in 2001, by the HEIDELBERG-MOSCOW experiment. The HEIDELBERG-MOSCOW experiment is the by far most sensitive 0-nu-bb experiment since more than 10 years. It operated 11 kg of enriched 76Ge in the Gran Sasso. The collected statistics in the period 1990 - 2003 is 71.7 kgy. The background achieved in the energy region of the Q value for double beta decay is 0.11events/kgykeV. The two-neutrino accompanied half-life is determined on the basis of more than 100000 events to be (1.74. {+0.18}{-0.16})x10^{21}years. The confidence level for the neutrinoless signal is 4.2 sigma level (more than 5 sigma in the pulse-shape-selected spectrum). The half-life is T_{1/2}^{0ν}=(1.19{+0.37} {-0.23})x10^{25}years. The effective neutrino mass deduced is (0.2-0.6)eV (99.73% c.l.), i.e. neutrinos have degenerate masses, and consequently can considerably contribute to hot dark matter in the Universe. The sharp boundaries for other beyond SM physics, mentioned above, are comfortably competitive to corresponding results from high-energy accelerators like TEVATRON, HERA, etc. Some discussion is given on future beta-beta experiments. △ Less", "In the event that R-Parity conserving supersymmetry (SUSY) is discovered at the LHC, a key issue which will need to be addressed will be the consistency of that signal with astrophysical and non-accelerator constraints on SUSY Dark Matter. This issue is studied for the SPA benchmark model based on measurements of end-points and thresholds in the invariant mass spectra of various combinations of leptons and jets. These measurements are used to constrain the soft SUSY breaking parameters at the electroweak scale in a general MSSM model. Based on these constraints, we assess the accuracy with which the Dark Matter relic density can be measured. △ Less", "Given experimental evidence at the LHC for physics beyond the standard model, how can we determine the nature of the underlying theory? We initiate an approach to studying the \"inverse map\" from the space of LHC signatures to the parameter space of theoretical models within the context of low-energy supersymmetry, using 1808 LHC observables including essentially all those suggested in the literature and a 15 dimensional parametrization of the supersymmetric standard model. We show that the inverse map of a point in signature space consists of a number of isolated islands in parameter space, indicating the existence of \"degeneracies\"--qualitatively different models with the same LHC signatures. The degeneracies have simple physical characterizations, largely reflecting discrete ambiguities in electroweak-ino spectrum, accompanied by small adjustments for the remaining soft parameters. The number of degeneracies falls in the range 1<d<100, depending on whether or not sleptons are copiously produced in cascade decays. This number is large enough to represent a clear challenge but small enough to encourage looking for new observables that can further break the degeneracies and determine at the LHC most of the SUSY physics we care about. Degeneracies occur because signatures are not independent, and our approach allows testing of any new signature for its independence. Our methods can also be applied to any other theory of physics beyond the standard model, allowing one to study how model footprints differ in signature space and to test ways of distinguishing qualitatively different possibilities for new physics at the LHC. △ Less", "We note that hadronic susy (empirical quark-diquark) symmetry can be expanded into the lepton sector, and that for three generations the counting of degrees of freedom is the one we need to build charged supermultiplets. For this to cure hierarchy, Higgs modeling becomes restricted. △ Less", "Contents: 1. Can MPP Together with Weinberg-Salam Higgs Provide Cosmological Inflation? (D.L. Bennett and H.B. Nielsen) 2. Conserved Charges in 3d Gravity With Torsion (M. Blagojevic and B. Cvetkovic) 3. Mass Matrices of Quarks and Leptons in the Approach Unifying Spins and Charges (A. Borstnik Bracic and N.S. Mankoc Borstnik) 4. Dark Matter From Encapsulated Atoms (C.D. Froggatt and H.B. Nielsen) 5. Dirac Sea for Bosons Also and SUSY for Single Particles (Y. Habara, H.B. Nielsen and M. Ninomiya) 6. Searching for Boundary Conditions in Kaluza-Klein-like Theories (D. Lukman, N.S. Mankoc Borstnik and H. B. Nielsen) 7. Second Quantization of Spinors and Clifford Algebra Objects (N.S. Mankoc Borstnik and H. B. Nielsen) 8. Are there Interesting Problems That Could Increase Understanding of Physics and Mathematics? (R. Mirman) 9. Noncommutative Nonsingular Black Holes (P. Nicolini) 10. Compactified Time and Likely Entropy -- World Inside Time Machine: Closed Time-like Curve (H.B. Nielsen and M. Ninomiya) + Astri Kleppe's Song. △ Less", "The impact of the LHC, SLHC and the ILC on the precision of the determination of supersymmetric parameters is investigated. In particular, in the point SPS1a the measurements performed at the ILC will improve by an order of magnitude the precision obtained by the LHC alone. The SLHC with respect to the LHC has the potential to reduce the errors by a factor two. △ Less", "We re-examine the perturbative properties of four-dimensional non-commutative QED by extending the pinch techniques to the theta-deformed case. The explicit independence of the pinched gluon self-energy from gauge-fixing parameters, and the absence of unphysical thresholds in the resummed propagators permits a complete check of the optical theorem for the off-shell two-point function. The known anomalous (tachyonic) dispersion relations are recovered within this framework, as well as their improved version in the (softly broken) SUSY case. These applications should be considered as a first step in constructing gauge-invariant truncations of the Schwinger-Dyson equations in the non-commutative case. An interesting result of our formalism appears when considering the theory in two dimensions: we observe a finite gauge-invariant contribution to the photon mass because of a novel incarnation of IR/UV mixing, which survives the commutative limit when matter is present. △ Less", "In the production of very heavy final states - high Mandelstam s-hat - extra QCD radiation can play a significant role. By comparing several different parton shower approximations to results obtained with fixed-order perturbation theory, we quantify the degree to which these approaches agree (or disagree), focussing on initial state radiation above pT = 50 GeV, for top pair production at the Tevatron and at the LHC, and for SUSY pair production at the LHC. Special attention is paid to ambiguities associated with the choice of the maximum value of the ordering variable in parton shower models. △ Less", "Family symmetry could explain large mixing of the atmospheric neutrinos. The same symmetry could explain why the flavor changing current processes in supersymmetric standard models can be so suppressed. It also may be able to explain why the proton is so stable. We investigate these questions in a supersymmetric, renormalizable extension of the standard model, which possess a family symmetry based on a binary dihedral group Q_6. We find that the amplitude for μ\\to e+γenjoys a suppression factor proportional to |(V_{MNS})_{e3}| ~ m_e/(\\sqrt{2}m_μ) ~ 3.4\\times 10^{-3}, and that B(p \\to K^0 μ^+)/B(p \\to K^0 e^+) ~ |(V_{MNS})_{e3}|^2 ~ 10^{-5}, where V_{MNS} is the neutrino mixing matrix. △ Less", "We analyze a minimal bottom-up seesaw scenario where we require the theory to satisfy three phenomenological conditions: (i)it is supersymmetric; (ii) it has a local B-L symmetry as part of the SU(2)_L x SU(2)_R x U(1)_{B-L} gauge theory to implement the seesaw mechanism and (iii) B-L symmetry breaking is such that it leaves R-parity unbroken giving a naturally stable dark matter. We show that in such a theory, one can predict the seesaw scale for neutrino masses to be M_R ~ \\sqrt{M_{SUSY} M_{Pl}} ~ 10^{11} GeV. We show that the ground state with this property is a stable minimum and is lower than possible electric charge violating minimum in this theory. Such models in their generic version are known to predict the existence of a light doubly charged Higgs boson and Higgsino which can be searched for in collider experiments. We give expressions for their masses in this minimal version. We then indicate how one can get different expectation values for the MSSM Higgs doublets in the theory required to have realistic quark masses. △ Less", "The LENA (Low Energy Neutrino Astronomy) detector is proposed to be a large-volume liquid-scintillator device which will be highly suitable for the investigation of a variety of topics in astrophysics, geophysics and particle physics. In this paper, the potential of such a detector concerning the search for proton decay in the SUSY favored decay channel p->K+antineutrino is investigated. Based on Geant4, Monte Carlo simulations of the proton decay in the LENA detector as well as of the background radiation in the detection energy windows have been developed. From these simulations an efficiency of 65% for the detection of a possible proton decay has been determined. Within ten years of measuring time a lower limit for the proton lifetime, concerning the decay channel investigated, of tau>4.10^{34} y could be reached. △ Less", "In string compactification preserving N=1 SUSY, moduli fields are plausible candidates for the messenger of SUSY breaking at low energy scales. In a scenario that moduli-mediated SUSY breaking is significant, the pattern of soft SUSY breaking terms depends crucially on how the light moduli with mass m \\lesssim O(8π^2 m_{3/2}) are stabilized. We discuss the correspondence between the pattern of soft terms and the stabilization mechanism of light moduli within the framework of 4D effective supergravity which is generalized to include a SUSY-breaking uplifting potential which might be necessary to get the phenomenologically viable de-Sitter (or Minkowski) vacuum. In some special case, light moduli can be stabilized by controllably small perturbative corrections to the Kähler potential, yielding the soft terms dominated by the moduli-mediated contribution. In more generic situation, light moduli are stabilized by non-perturbative effects encoded in the superpotential and a quite different pattern of soft terms emerges: the anomaly-mediated soft terms become comparable to the moduli-mediated ones. Such mixed moduli-anomaly mediated soft terms lead to low energy superparticle masses qualitatively different from those of other mediation models such as mSUGRA scenario, gauge-mediation, and anomaly-mediation. △ Less", "This article presents the results of a realistic global fit of the Lagrangian parameters of the Minimal Supersymmetric Standard Model with no assumptions on the SUSY breaking mechanism using the fit program Fittino. The fit is performed using the precision of future mass measurements of superpartners at the LHC and mass and polarized topological cross-section measurements at the ILC. Higher order radiative corrections are accounted for wherever possible to date. Results are obtained for a modified SPS1a MSSM benchmark scenario (general MSSM without assumptions on the breaking mechanism) and for a specific mSUGRA scenario. Exploiting a simulated annealing algorithm, a stable result is obtained without any {\\it a priori} assumptions on the fit parameters. Most of the Lagrangian parameters can be extracted at the percent level or better if theoretical uncertainties are neglected. Neither LHC nor ILC measurements alone will be sufficient to obtain a stable result. △ Less", "We take a critical view of the treatment of threshold effects in SUSY spectrum computations from high-scale input. We discuss the two principal methods of (a) renormalization at a common SUSY scale versus (b) integrating out sparticles at their own mass scales. We point out problems in the implementations in public spectrum codes, together with suggestions for improvements. In concrete examples, we compare results of Isajet7.72 and Spheno2.2.3, and present the improvements done in Isajet7.73. We also comment on theoretical uncertainties. Last but not least, we outline how a consistent multiscale approach may be achieved. △ Less", "We study radiative corrections to third generation scalar fermions into gauge bosons $Z$ and $W^\\pm$. We include both SUSY-QCD, QED and full electroweak corrections. It is found that the electroweak corrections can be of the same order as the SUSY-QCD corrections and interfere destructively in some region of parameter space. The full one loop correction can reach 10% in some SUGRA scenario, while in general MSSM, the one loop correction can reach 20% for large $\\tanβ$ and large trilinear soft breaking terms $A_b$. △ Less", "In supersymmetric models with non-universal gaugino masses, it is possible to have opposite-sign SU(2) and U(1) gaugino mass terms. In these models, the gaugino eigenstates experience little mixing so that the lightest SUSY particle remains either pure bino or pure wino. The neutralino relic density can only be brought into accord with the WMAP measured value when bino-wino co-annihilation (BWCA) acts to enhance the dark matter annihilation rate. We map out parameter space regions and mass spectra which are characteristic of the BWCA scenario. Direct and indirect dark matter detection rates are shown to be typically very low. At collider experiments, the BWCA scenario is typified by a small mass gap m_{\\tilde Z_2}-m_{\\tilde Z_1} ~ 20-80 GeV, so that tree level two body decays of \\tilde Z_2 are not allowed. However, in this case the second lightest neutralino has an enhanced loop decay branching fraction to photons. While the photonic neutralino decay signature looks difficult to extract at the Fermilab Tevatron, it should lead to distinctive events at the CERN LHC and at a linear e^+e^- collider. △ Less", "If supersymmetric particles are produced at the Large Hadron Collider it becomes very important not only to identify them, but also to determine their masses with the highest possible precision, since this may lead to an understanding of the SUSY-breaking mechanism and the physics at some higher scale. We here report on studies of how such mass measurements are obtained, and how the precision can be optimized. △ Less", "We present the results of a realistic global fit of the Lagrangian parameters of the Minimal Supersymmetric Standard Model assuming universality for the first and second generation and real parameters. No assumptions on the SUSY breaking mechanism are made. The fit is performed using the precision of future mass measurements of superpartners at the LHC and mass and polarized topological cross-section measurements at the ILC. Higher order radiative corrections are accounted for whereever possible to date. Results are obtained for a modified SPS1a MSSM benchmark scenario but they were checked not to depend critically on this assumption. Exploiting a simulated annealing algorithm, a stable result is obtained without any a priori assumptions on the values of the fit parameters. Most of the Lagrangian parameters can be extracted at the percent level or better if theoretical uncertainties are neglected. Neither LHC nor ILC measurements alone will be sufficient to obtain a stable result. The effects of theoretical uncertainties arising from unknown higher-order corrections and parametric uncertainties are examined qualitatively. They appear to be relevant and the result motivates further precision calculations. The obtained parameters at the electroweak scale are used for a fit of the parameters at high energy scales within the bottom-up approach. In this way regularities at these scales are explored and the underlying model can be determined with hardly any theoretical bias. Fits of high-scale parameters to combined LHC+ILC measurements within the mSUGRA framework reveal that even tiny distortions in the low-energy mass spectrum already lead to inacceptable chi^2 values. This does not hold for ``LHC only'' inputs. △ Less", "The LFV charged lepton decays mu to e + gamma, tau to e + gamma and tau to mu + gamma and thermal leptogenesis are analysed in the MSSM with see-saw mechanism of neutrino mass generation and soft SUSY breaking with universal boundary conditions. The case of hierarchical heavy Majorana neutrino mass spectrum, M_1 << M_2 << M_3, is investigated. Leptogenesis requires M_1 > 10^9 GeV. Considering the natural range of values of the heaviest right-handed Majorana neutrino mass, M_3 > 5*10^{13} GeV, and assuming that the soft SUSY breaking universal gaugino and/or scalar masses have values in the range of few 100 GeV, we derive the combined constraints, which the existing stringent upper limit on the mu to e + gamma decay rate and the requirement of successful thermal leptogenesis impose on the neutrino Yukawa couplings, heavy Majorana neutrino masses and SUSY parameters. Results for the three possible types of light neutrino mass spectrum -- normal and inverted hierarchical and quasi-degenerate -- are obtained. △ Less", "We have constructed a SUSY SO(10) x SU(2)_F model in which a set of symmetric mass matrices with five texture zeros (having 11 parameters) leads to 22 measurable fermion masses, mixing angles and CP phases, all in agreement with available experimental data within one sigma. The LMA solution for solar neutrinos is obtained as well as neutrino mixing angles and absolute values of neutrino masses. We have investigated the possibility of baryogenesis resulting from soft leptogenesis. We find that, with soft SUSY masses assuming their natural values of the order of a TeV, the observed baryon asymmetry in the Universe can be accommodated in our model. Unlike models with lop-sided textures which give rise to a dangerously large decay rate for mu -> e + gamma, the decay rate we get is much suppressed and yet it is large enough to be accessible to the next generation of experiments. △ Less", "The complete one-loop electroweak corrections to charged Higgs boson pair production in $γγ$ collision mode at linear colliders in the minimal supersymmetric standard model (MSSM), are calculated in this paper. We discuss the dependence of the corrections to the subprocess $γγ\\to H^{+}H^{-}$ on the related parameters, such as the colliding energy, charged Higgs boson mass $M_{H^{\\pm}}$ and some supersymmetric parameters $\\tan β$, $M_{SUSY}$ and gaugino mass parameter $M_2$. We find that the corrections generally reduce the Born cross sections and the relative one-loop corrections to both the subprocess typically in the range of -10% to -30%. We also present the numerical results at the SPS1a' point from the SPA project. We conclude that the full one-loop electroweak corrections to subprocess $γγ\\to H^{+}H^{-}$ and the parent process $e^+e^- \\to γγ\\to H^{+}H^{-}$ are significant and therefore should be considered in precise analysis of charged Higgs boson pair productions via $γγ$ collision at future linear colliders. △ Less", "If a signal for physics beyond the Standard Model is observed at the Tevatron collider or LHC, we will be eager to interpret it. Because only certain observables can be studied at a hadron collider, it will be difficult or impossible to measure masses and spins that could easily establish what physics was being seen. Nevertheless, different underlying physics implies different signatures. We examine the main signatures for supersymmetry, with some emphasis on recognizing supersymmetry in parts of parameter space where generic signatures are reduced or absent. We also consider how to distinguish supersymmetry from alternatives that most closely resemble it, such as Universal Extra Dimensions (UED). Using the robust connection between spins and production cross section, we think it will not be difficult to distinguish UED from supersymmetry. We expect that by considering patterns of signatures it is very likely that it will not be difficult to find a compelling interpretation of any signal of new physics. △ Less", "I present a low energy Lagrangian implementing the idea of Cosmological SUSY breaking (CSB). The model predicts ${\\rm tan}β\\sim 1$, and incorporates a new mechanism for breaking of $SU(2)\\times U(1)$. The Higgs mass is determined by new physics and can evade the bounds of the MSSM. The model resolves the CP and flavor problems of SUSY. The up quark mass is non-vanishing. An axion-like particle, with TeV scale decay constant, appears inevitably. Such a particle is experimentally ruled out if it has conventional QCD axion couplings. The problem {\\it may} be avoided by adding dimension 5 operators, which explicitly break the axial symmetry, but this probably introduces a strong CP problem. △ Less", "In this paper, six SUSY scenarios with heavy sfermions, mainly based on theoretical arguments and on experimental indications for new physics, are defined. These scenarios, consistent with the amount of dark matter (DM) measured by WMAP, are then analysed in detail providing pertinent examples of the potential of ILC. It is shown that in most cases ILC, with its high precision based on the chargino analysis and in spite of an incomplete coverage of the gaugino and slepton mass spectrum, can predict the amount of DM in our universe with an accuracy which matches the WMAP results. △ Less", "New version of MSSM scales is discussed. In this version mu << M_{SUSY} ~ M_0 \\~ M_{1/2}, where mu is the Higgsino mass, M_0 is the mass scale of sleptons and squarks, M_{1/2} is the mass scale of gaugino. Renormalization group motivation of this MSSM version is proposed. Analysis of Split Supersymmetry ideas in this case together with the Dark Matter arguments results in the statement that the formation of residual neutralino concentration occurs in the high symmetric phase of cosmological plasma. The value of Higgsino mass is estimated. The recharging process for high energy neutralinos in the neutralino-nucleus scattering is considered. There has been reported the possibility to check-up of the model predictions at modern experimental facilities NUSEL and GLAST. △ Less", "SUSY breaking and its mediation are among the most important problems of supersymmetric generalizations of the standard model. The idea of gravity-mediated SUSY breaking, proposed in 1982 by Arnowitt, Chamseddine and Nath, and independently by Barbieri, Ferrara and Savoy, fits naturally into superstring theory, where it can be realized at both classical as well as quantum levels. This talk is dedicated to Pran Nath on his 65th birthday. △ Less", "We calculate the SUSY-QCD corrections to the inclusive total cross sections of the associated production processes $pp\\to W^{\\pm}H^{\\mp}+X$ in the Minimal Supersymmetric Standard Model(MSSM) at the CERN Large Hadron Collider(LHC). The SUSY-QCD corrections can increase and decrease the total cross sections depending on the choice of the SUSY parameters. When $μ<0$ the SUSY-QCD corrections increase the leading-order (LO) total cross sections significantly for large tan$β$ ($\\sim 40$), which can exceed 10% and have the opposite sign with respect to the QCD and the SUSY-EW corrections, and thus cancel with them to some extent. Moreover, we also investigate the effects of the SUSY-QCD on the differential distribution of cross sections in transverse momentum $p_T$ and rapidity Y of W-boson, and the invariant mass $M_{W^+H^-}$. △ Less", "In the light of new experimental results on $B \\to Kπ$ decays, we study the decay processes $B \\to K π$ in the framework of both R-parity conserving (SUGRA) and R-parity violating supersymmetric models. We find that any possible deviations from the Standard Model indicated by the current data for the branching ratios and the direct CP asymmetries of $B \\to Kπ$ can be explained in both R-parity conserving SUGRA and R-parity violating SUSY models. However, there is a difference between the predictions of both models to the time-dependent CP asymmetry observable $S_{K_{_S} π^0}$ whose current experimental results include large uncertainties. We demonstrate that this difference can be useful for testing both models with more accurate data for $S_{K_{S} π^0}$ and $A_{CP}^{+-}$ in the near future. △ Less", "We extend our models for conformal sequestering of dynamical supersymmetry breaking with decoupling vector-like matter in several different ways. These extensions enable us to simplify concrete model building, in particular, rendering large gauge group and ad hoc global symmetry for sequestering unnecessary. Conformal sequestering appears highly natural in such circumstances. △ Less", "The phases in a generic low-energy supersymmetric model are severely constrained by the experimental upper bounds on the electric dipole moments of the electron and the neutron. Coupled with the requirement of radiative electroweak symmetry breaking, this results in a large degree of fine tuning of the phase parameters at the unification scale. In supergravity type models, this corresponds to very highly tuned values for the phases of the bilinear Higgs coupling parameter $B$ and the universal trilinear coupling $A_0$. We identify a cancellation/enhancement mechanism associated with the renormalization group evolution of $B$, which, in turn, reduces such fine-tuning quite appreciably without taking recourse to very large masses for the supersymmetric partners. We find a significant amount of reduction of this fine-tuning in nonuniversal gaugino mass models that do not introduce any new phases. △ Less", "In the string landscape picture, the effective potential is characterized by an enormous number of local minima of which only a minuscule fraction are suitable for the evolution of life. In this \"multiverse\", random transitions are continually made between the various minima with the most likely transitions being to minima of lower vacuum energy. The inflationary era in the very early universe ended with such a transition to our current phase which is described by a broken supersymmetry and a small, positive vacuum energy. However, it is likely that an exactly supersymmetric (susy) phase of zero vacuum energy as in the original superstring theory also exists and that, at some time in the future, there will be a transition to this susy world. In this article we make some preliminary estimates of the consequences of such a transition. △ Less", "The loop level lepton flavor violating signals $γγ\\to \\ell \\ell' (\\ell=e,μ,τ, \\ell \\neq \\ell^\\prime)$ are studied in a scenario of low-energy, R-parity conserving, supersymmetric seesaw mechanism within the context of a high energy photon collider. Lepton flavor violation is due to off diagonal elements in the left s-lepton mass matrix induced by renormalization group equations. The average slepton masses ${\\widetilde{m}}$ and the off diagonal matrix elements $Δm$ are treated as model independent free phenomenological parameters in order to discover regions in the parameter space where the signal cross section may be observable. At the energies of the $γγ$ option of the future high-energy linear collider the signal has a potentially large standard model background, and therefore particular attention is paid to the study of kinematical cuts in order to reduce the latter at an acceptable level. We find, for the ($eτ$) channel, non-negligible fractions of the parameter space ($δ_{LL}=Δm^2/\\widetilde{m}^2 \\gtrsim 10^{-1}$) where the statistical significance ($SS$) is $SS \\gtrsim 3$. △ Less", "We consider the MSSM with see-saw mechanism of neutrino mass generation and soft SUSY breaking with flavour-universal boundary conditions at the GUT scale, in which the lepton flavour violating (LFV) decays μ\\to e + γ, τ\\to μ+ γ, etc.,are predicted with rates that can be within the reach of present and planned experiments. These predictions depend critically on the matrix of neutrino Yukawa couplings \\bf{Y_ν} which can be expressed in terms of the light and heavy right-handed (RH) neutrino masses, neutrino mixing matrix U_{PMNS}, and an orthogonal matrix \\bf{R}. We investigate the effects of Majorana CP-violation phases in U_{PMNS}, and of the RG running of light neutrino masses and mixing angles from M_Z to the RH Majorana neutrino mass scale M_R, on the predictions for the rates of LFV decays μ\\to e + γ, τ\\to μ+ γand τ\\to e + γ. Results for neutrino mass spectrum with normal hierarchy, values of the lightest ν-mass in the range 0 \\leq m_1 \\leq 0.30 eV, and quasi-degenerate heavy RH Majorana neutrinos in the cases of \\bf{R} = \\bf{1} and complex matrix \\bf{R} are presented. We find that the effects of the Majorana CP-violation phases and of the RG evolution of neutrino mixing parameters can change by few orders of magnitude the predicted rates of the LFV decays μ\\to e + γand τ\\to e + γ. The impact of these effects on the τ\\to μ+ γdecay rate is typically smaller and only possible for m_1 > 0.10 eV. If the RG running effects are negligible, in a large region of soft SUSY breaking parameter space the ratio of the branching ratios of the μ\\to e + γand τ\\to e + γ(τ\\to μ+ γ) decays is entirely determined in the case of \\bf{R} \\cong \\bf{1} by the values of the neutrino mixing parameters at M_Z. △ Less", "We analyse the precision electroweak observables MW and sin^2θ_eff and their correlations in the recently proposed Split SUSY model. We compare the results with the Standard Model and Minimal Supersymmetric Standard Model predictions, and with present and future experimental accuracies. Present experimental accuracies in (MW, sin^2θ_eff) do not allow constraints to be placed on the Split SUSY parameter space. We find that the shifts in (MW, sin^2θ_eff) induced by Split SUSY can be larger than the anticipated accuracy of the GigaZ option of the International Linear Collider, and that the most sensitive observable is sin^2θ_eff. These large shifts are possible also for large chargino masses in scenarios with small tan(β) =~ 1. △ Less", "Precision measurements, now and at a future linear electron-positron collider (ILC), can provide indirect information about the possible scale of supersymmetry. Performing a chi^2 analysis, we illustrate the present-day and possible future ILC sensitivities within the constrained minimal supersymmetric extension of the Standard Model (CMSSM), varying the parameters so as to obtain the cold dark matter density allowed by WMAP and other cosmological data. The current data are in very good agreement with the CMSSM prediction for tan beta = 10, with a clear preference for relatively small values of the universal gaugino mass, m_{1/2} \\sim 300 GeV. In this case, there would be good prospects for observing supersymmetry directly at both the LHC and the ILC, and some chance already at the Tevatron collider. For tan beta = 50, the quality of the fit is worse, and somewhat larger m_{1/2} values are favoured. With the prospective ILC accuracies the sensitivity to indirect effects of supersymmetry greatly improves. This may provide indirect access to supersymmetry even at scales beyond the direct reach of the LHC or the ILC. △ Less", "This report summarizes the progress in SUSY studies performed since the last International Linear Collider Workshop in Paris (LCWS04). △ Less", "We address the problem of mass measurements of supersymmetric particles at the Large Hadron Collider, using the ATLAS detector as an example. By using Markov Chain sampling techniques to combine standard measurements of kinematic edges in the invariant mass distributions of decay products with a measurement of a missing $p_T$ cross-section, we show that the precision of mass measurements at the LHC can be dramatically improved, even when we do not assume that we have measured the kinematic endpoints precisely, or that we have identified exactly which particles are involved in the decay chain causing the endpoints. The generality of the technique is demonstrated in a preliminary investigation of a non-universal SUGRA model, in which we relax the requirements of mSUGRA by breaking the degeneracy of the GUT scale gaugino masses. The model studied is compatible with the WMAP limits on dark matter relic density. △ Less", "A large part of the mSUGRA parameter space satisfying the WMAP constraint on the dark matter relic density corresponds to a higgsino LSP of mass $\\simeq 1$ TeV. We find a promising signal for this LSP at CLIC, particularly with polarized electron and positron beams. One also expects a viable monochromatic $γ$-ray signal from its pair annihilation at the galactic center at least for cuspy DM halo profiles. All these results hold equally for the higgsino LSP of other SUSY models like the non-universal scalar or gaugino mass models and the so-called inverted hierarchy and more minimal supersymmetry models. △ Less", "Motivated by the KKLT string compactification involving a supersymmetry-breaking uplifting potential, we examine 4D effective supergravity with a generic form of uplifting potential, focusing on the possibility that the resulting mixed modulus-anomaly mediated soft terms realize the little hierarchy between the Higgs boson masses $m_H$ and the sparticle masses $m_{SUSY}$. It is noted that for some type of uplifting potential, the anomaly-mediated contribution to $m_H^2$ at $M_{GUT}$ can cancel the subsequent renormalization group evolution of $m_H^2$ down to TeV scale, thereby the model can naturally realize the little hierarchy $m_H^2\\sim m_{SUSY}^2/8π^2$ which is desirable for the lightest Higgs boson mass to satisfy the experimental bound. In such models, the other Higgs mass parameters $μ$ and $B$ can have the desirable size $μ\\sim B \\sim m_H$ without severe fine-tuning of parameters, although the gravitino is much heavier than the Higgs boson. Those models for the little hierarchy avoid naturally the dangerous SUSY flavor and CP violations, and predict nearly degenerate low energy gaugino masses, pure Higgsino LSP, and also a specific relation between the stop and gaugino masses. △ Less", "We analyze the possibility of probing the supersymmetric flavor structure through the constraints of the K and B meson systems and those of the electric dipole moments. We show that combining these constraints would favor SUSY models with large flavor mixing either in LR(RL) or LL but with a very small RR and intermediate/large tan beta. Large LR mixing requires specific patterns for trilinear A-terms, while LL mixing seems quite natural and easier to obtain. We present an example for this class of models and show how it can accommodate the current CP asymmetries experimental results. △ Less", "Motivated by the interpretation of the recent results on the TeV gamma radiation from the Galactic center, including the new 2004 HESS data, as a by-product of dark matter particles annihilations, we address the question of the largest possible neutralino masses and pair annihilation cross sections in supersymmetric models. Extending the parameter space of minimal models, such as the mSUGRA and the mAMSB scenarios, to general soft SUSY breaking Higgs masses gives access to the largest possible pair annihilation rates, corresponding to resonantly annihilating neutralinos with maximal gaugino-higgsino mixing. Adopting a model-independent approach, we provide analytical and numerical upper limits for the neutralino pair annihilation cross section. A possible loophole is given by the occurrence of non-perturbative electro-weak resonances, a case we also consider here. We then show that a thorough inclusion of QCD effects in gluino (co-)annihilations can, in extreme scenarios, make neutralinos with masses in the hundreds of TeV range, well beyond the s-wave unitarity bound, viable dark matter candidates. Finally, we outline the ranges of neutralino masses and cross sections for models thermally producing a WMAP relic abundance, thus providing reference values for ``best-case'' indirect SUSY dark matter detection rates. △ Less", "dS/CFT gives a perturbatively gauge invariant definition of particle masses in de Sitter (dS) space. We show, in a toy model in which the graviton is replaced with a minimally coupled massless scalar field, that loop corrections to these masses are infrared (IR) divergent. We argue that this implies anomalous dependence of masses on the cosmological constant, in a true theory of quantum gravity. This is in accord with the hypothesis of Cosmological SUSY Breaking (CSB). △ Less", "During the past year, a minimal renormalizable supersymmetric SO(10) model has been proposed with the following properties: it predicts a naturally stable dark matter and neutrino mixing angles theta_atm and theta_13 while at the same time accommodating CKM CP violation among quarks with no SUSY CP problem. Suppression of proton decay for all allowed values of tan beta strongly restricts the flavor structure of the model making it predictive for other processes as well. We discuss the following predictions of the model in this paper, e.g. down-type quark masses, and neutrino oscillation parameters, U_e3, delta_MNSP, which will be tested by long baseline experiments such as T2K and subsequent experiments using the neutrino beam from JPARC. We also calculate lepton flavor violation and the lepton asymmetry of the Universe in this model. △ Less", "In the first part of this talk it is discussed why observed neutrino oscillations (which suggest the existence of right-handed neutrinos with certain Dirac and Majorana masses) seem to select out the route to higher unification based on the symmetry SU(4)-color. This in turn selects out the effective symmetry in 4D near the GUT/string scale to be either SO(10) or minimally G(224)= SU(2)_L\\times SU(2)_R \\times SU(4)^c. The same conclusion is reached by the likely need for leptogenesis as the means for baryogenesis and also by the success of certain fermion mass-relations including m_b(M_{GUT})\\approx m_τ, together with m(ν^τ)_{Dirac}\\approx m_{top}(M_{GUT}). In the second part, an attempt is made to provide a unified picture of a set of diverse phenomena based on an effective G(224) symmetry or SO(10), possessing supersymmetry. The phenomena in question include: (a) fermion masses and mixings, (b) neutrino oscillations, (c) CP non-conservation, (d) flavor violations in quark and lepton sectors, as well as (e) baryogenesis via leptogenesis. Including SM and SUSY contributions, the latter being sub-dominant, the framework correctly accounts for Δm_K, Δm_{B_d}, S(B_d -> J/ψK_s) and ε_K, and predicts S(B_d-> φK_s) to be in the range +(0.65-0.73), close to the SM-prediction. It also quite plausibly accounts for the observed baryon excess Y_B\\approx 10^{-10}. Furthermore the model predicts enhanced rates for mu -> e gamma, tau-> mu gamma and mu N-> e N and also measurable electric dipole moment for the neutron. Expectations arising within the same framework for proton decay are summarized at the end. It is stressed that the potential for discovering proton decay in a megaton-size detector would be high. △ Less", "A comparative study of two predictive SO(10) models, namely the BPW model (proposed by Babu, Pati and Wilczek) and the AB model (proposed by Albright and Barr) is done based on their predictions regarding CP and flavor violations. The values of Δm_K, ε_K, Δm_{B_d} and S(B_d\\to J/ψK_S) are found, in both models, to be close to SM predictions, in good agreement with data. Both models predict that S(B_d\\to φK_S) should lie in the range +0.65-0.74, close to the SM prediction and that the EDM of the neutron \\approx (few\\times 10^{-26})e-cm. It is found that $Br(μ\\to eγ)$ in the AB model is generically much larger than that in the BPW model, being consistent with the experimental limit only with a rather heavy SUSY spectrum. The BPW model, on the other hand, is consistent with a much lighter SUSY spectrum. In the AB model d_e lies in the range 10^{-27}-10^{-28}e-cm. The BPW model gives d_e to be typically 100 times lower than that in the AB case. Thus the two models can be distinguished based on their predictions regarding CP and flavor violating processes, and can be tested in future experiments. △ Less", "We present a precise calculation of the lightest neutral Higgs boson production associated with top quark pair at a linear collider. The full one-loop electroweak ${\\cal O}(α_{ew})$ contributions to the process $e^+e^- \\to t\\bar t h^0$ within the minimal supersymmetric standard model (MSSM) are included. We analyze the dependence of the electroweak corrections on the MSSM parameters such as $M_{A^0}$, $\\tanβ$, $M_2$, $A_{f}$, $M_{SUSY}$ and $μ$. The results show that the full one-loop electroweak radiative corrections turn out to be about -20% quantitatively and thus are important for future $e^+e^-$ linear colliders. △ Less", "The focus point region of supersymmetric models is compelling in that it simultaneously features low fine-tuning, provides a decoupling solution to the SUSY flavor and CP problems, suppresses proton decay rates and can accommodate the WMAP measured cold dark matter (DM) relic density through a mixed bino-higgsino dark matter particle. We present the focus point region in terms of a weak scale parameterization, which allows for a relatively model independent compilation of phenomenological constraints and prospects. We present direct and indirect neutralino dark matter detection rates for two different halo density profiles, and show that prospects for direct DM detection and indirect detection via neutrino telescopes such as IceCube and anti-deuteron searches by GAPS are especially promising. We also present LHC reach prospects via gluino and squark cascade decay searches, and also via clean trilepton signatures arising from chargino-neutralino production. Both methods provide a reach out to m_{\\tg}\\sim 1.7 TeV. At a TeV-scale linear e^+e^- collider (LC), the maximal reach is attained in the \\tz_1\\tz_2 or \\tz_1\\tz_3 channels. In the DM allowed region of parameter space, a \\sqrt{s}=0.5 TeV LC has a reach which is comparable to that of the LHC. However, the reach of a 1 TeV LC extends out to m_{\\tg}\\sim 3.5 TeV. △ Less", "We update and extend to larger masses our previous analysis of the MSSM with minimal $SO_{10}$ [MSO$_{10}$SM] soft SUSY breaking boundary conditions. We find a well--defined, narrow region of parameter space which provides the observed relic density of dark matter, in a domain selected to fit precision electroweak data, including top, bottom and tau masses. The model is highly constrained which allows us to make several predictions. We find the light Higgs mass $m_h \\leq 121 \\pm 3$ GeV and also upper bounds on the mass of the gluino $\\mgluino\\lsim3.1$ TeV and lightest neutralino $\\mchi\\lsim450$ GeV. As the CP odd Higgs mass $m_A$ increases, the region of parameter space consistent with WMAP data is forced to larger values of $M_{1/2}$ and smaller values of $m_h$. Hence, we find an upper bound $m_A \\lsim 1.3$ TeV. This in turn leads to lower bounds on ${\\rm BR}(B_s\\to μ^+ μ^-) > 10^{-8}$ (assuming minimal flavor violation) and on the dark matter spin independent detection cross section $\\sigsip > 10^{-9}$ pb. Finally, we extend our previous analysis to include WIMP signals in indirect detection and find prospects for WIMP detection generally much less promising than in direct WIMP searches. △ Less", "In split-supersymmetry (split-SUSY), gluino is a metastable particle and thus can freeze out in the early universe. The late decay of such a long-life gluino into the lightest supersymmetric particle (LSP) may provide much of the cosmic dark matter content. In this work, assuming the LSP is gravitino produced from the late decay of the metastable gluino, we examine the WMAP dark matter constraints on the gluino mass. We find that to provide the full abundance of dark matter, the gluino must be heavier than about 14 TeV and thus not accessible at the CERN Large Hadron Collider (LHC). △ Less", "We discuss the mass varying neutrino scenario in the supersymmetric theory. In the case of the model with the single superfield, one needs the soft SUSY breaking terms or the $μ$ term. However, fine-tunings of some parameters are required to be consistent with the cosmological data. In order to avoid the fine-tuning, we discuss the model with two superfields, which is consistent with the cosmological data. However, it is found that the left-handed neutrino mixes with the neutrino of the dark sector maximally. Adding a right- handed neutrino, which does not couple to the dark sector, we obtain a favorable model in the phenomenology of the neutrino experiments. In this model, the deceleration of the cosmological expansion converts to the acceleration near $z\\simeq 0.5$. The speed of sound $c_s$ becomes imaginary if we put $ω_0=-0.9$, which corresponds to $m_ν^0=3.17\\eV$. On the other hand, if we take $ω_0=-0.998$, which leads to $m_ν^0=0.05\\eV$, $c_s^2$ becomes positive since $ω$ evolves rapidly near the present epoch in our model. △ Less", "By employing the QCD factorization approach, we calculate the new physics contributions to the branching radios of the two-body charmless $ B \\to PV$ and $B \\to VV$ decays in the framework of the minimal supergravity (mSUGRA) model. we choose three typical sets of the mSUGRA input parameters in which the Wilson coefficient $C_{7γ}(m_b)$ can be either SM-like (the case A and C) or has a flipped-sign (the case B). We found numerically that (a) the SUSY contributions are always very small for both case A and C; (b) for those tree-dominated decays, the SUSY contributions in case B are also very small; (c) for those QCD penguin-dominated decay modes, the SUSY contributions in case B can be significant, and can provide an enhancement about $30% \\sim 260%$ to the branching ratios of $B \\to K^*(π,φ,ρ)$ and $K φ$ decays, but a reduction about $30% \\sim 80%$ to $ B\\to K(ρ, ω)$ decays; and (d) the large SUSY contributions in the case B may be masked by the large theoretical errors dominated by the uncertainty from our ignorance of calculating the annihilation contributions in the QCD factorization approach. △ Less", "In the scenario recently proposed by Arkani-Hamed and Dimopoulos, the supersymmetric scalar particles are all very heavy, at least of the order of $10^9$ GeV but the gauginos, higgsino, and one of the CP-even neutral Higgs bosons remain light under a TeV. In addition to gluino production, the first SUSY signature would be pair production of neutralinos and/or charginos. Here we study, with explicit CP violation, the production of neutralinos and charginos at hadronic colliders as well as the possible decay modes. We notice that the branching ratio of the neutralino radiative decay can be sizable unlike the case with light sfermions. In particular, the decay of N3->N1+gamma has a branching ratio of the order O(1) percent. In colliders, it would give rise to signatures of an isolated single photon plus missing energy. △ Less", "The reconstruction of non pointing photons is a key feature for studying gauge mediated supersymmetry breaking (GMSB) models at the LHC. In this article the angular resolution of the ATLAS electromagnetic calorimeter is characterized from a detailed simulation of the detector. Resulting performances are used to reconstruct GMSB events with a fast simulation program, taking into account reconstruction effects. Finally, the sensitivity to extract the sparticles masses and the lightest neutralino lifetime is estimated. △ Less", "We calculate squared helicity amplitudes for non-diagonal and mixed squark pair production at hadron colliders, taking into account not only loop-induced QCD diagrams, but also previously unconsidered electroweak channels, which turn out to be dominant. Mixing effects are included for both top and bottom squarks. Numerical results are presented for several SUSY benchmark scenarios at both the CERN LHC and the Fermilab Tevatron, including the possibilities of light stops or sbottoms. The latter should be easily observed at the Tevatron in associated production of stops and sbottoms for a large range of stop masses and almost independently of the stop mixing angle. Asymmetry measurements for light stops at the polarized BNL RHIC collider are also briefly discussed. △ Less", "We construct a simple SO(10) SUSY GUT with $D_3$ family symmetry and low energy R parity. The model describes fermion mass matrices with 14 parameters and gives excellent fits to 20 observable masses and mixing angles in both quark and lepton sectors, giving 6 predictions. Bi-large neutrino mixing is obtained with hierarchical quark and lepton Yukawa matrices; thus avoiding the possibility of large lepton flavor violation. The model naturally predicts small 1-3 neutrino mixing, $\\sin θ_{13} \\simeq 0.05$, and a CP violating phase $δ$ close to $π/2$. Among other interesting predictions is a tiny effective Majorana mass for neutrinoless double-beta decay. Leptogenesis is also possible with the decay of the lightest right-handed neutrino giving an acceptable CP violating asymmetry $ε_1$ of order $10^{-6}$, {\\em and with the correct sign for the resultant baryon asymmetry}. We also show how similar models with the non-abelian symmetry groups SU(2) or $D_4$, instead of $D_3$, can be constructed. △ Less", "It is well known that in single step breaking of R-parity conserving SUSY SO(10) that needs the Higgs representations $126+\\bar 126$ the GUT-gauge coupling violates the perturbative constraint at mass scales few times larger than the GUT scale. Therefore, if the SO(10) gauge coupling is to remain perturbative up the Planck scale(=2x10^{18} GeV), the scale $M_U$ of GUT symmetry breaking is to be bounded from below. The bound depends upon specific Higgs representations used for SO(10) symmetry breaking but, as we find, can not be lower than $1.5x10^{17}$ GeV. In order to obtain such high unification scale we propose a two-step SO(10) breaking through $SU(2)_LXSU(2)_RXU(1)_{B-L}XSU(3)_C(g_{2L} \\neq g_{2R})$ intermediate gauge symmetry. We estimate potential threshold and gravitational corrections to the running of gauge couplings and show that they can make the picture of perturbative GUT- gauge coupling running consistent at least up to the Planck scale. We also show that when $SO(10) \\to G_{2213}$ by $210 + 54$, gravitational corrections alone with negligible threshold effects may guarantee such perturbative gauge coupling. The lifetime of the proton is found to increase by nearly 6 orders over the current experimental limit for $p \\to e^+π^0$. For the proton decay mediated by dim.5 operator a wide range of lifetimes is possible extending from the current experimental limit up to values 2-3 orders longer. △ Less", "FeynHiggs is a program for computing MSSM Higgs-boson masses and related observables, such as mixing angles, branching ratios, and couplings, including state-of-the-art higher-order contributions. The centerpiece is a Fortran library for use with Fortran and C/C++. Alternatively, FeynHiggs has a command-line, Mathematica, and Web interface. The command-line interface can process, besides its native format, files in SUSY Les Houches Accord format. FeynHiggs is an open-source program and easy to install. △ Less", "Recent high precision calculations for production processes of the SUSY particles at the next linear collider are reviewed. Special attention is paid to the input parameter definition. Numerical results for the SPS1a' benchmark point as proposed in the SPA project, are presented. △ Less", "We review the development of minimal renormalizable SO(10) Susy GUTs. Using our $SO(10) \\to G_{Pati-Salam} $ label decomposition we calculated the complete GUT scale spectra and couplings and the threshold effects therefrom. The corrections to $α_G, Sin^2θ_W $ and $ M_X $ are sensitive functions of the single parameter $ξ$ that controls symmetry breaking and slow funtions of the others. Scans of the parameter space to identify regions compatible with gauge unification are shown. The tight connection between the phenomenology of neutrino oscillations and exotic ($ΔB\\neq 0 $) processes predicted by Susy SO(10) GUTs is discussed in the context of the recent successful fits of all available fermion mass/mixing data using the ${\\bf{10 \\oplus {\\bar {126}}}}$ Higgs representations and Type I/II seesaw mechanisms for neutrino mass. We emphasize that {\\it{the true output of these calculations should be regarded as the unitary matrices that specify the orientation of the embedding of the MSSM within the MSGUT}}. Fermion Mass fitting constraints combined with GUT spectra can falsify/constrain the MSGUT and its near relatives. An initial survey indicates that Type I Seesaw neutrino masses dominate Type II and both are too small in the perturbative MSGUT even when the mixing and mass squared splitting ratios are as per data. This motivates a detailed study of the MSGUT constraints using the outputs of the fitting of fermion data, as well as consideration of modifications/extensions of the MSGUT scenario. △ Less", "We consider diffractive processes which can be measured at the LHC. Analysis of diffractive events will give unique information about the high energy asymptotics of hadron scattering. In semihard diffraction one may study the partonic structure of the Pomeron. Central Exclusive Diffractive production provides a possibility to investigate the new particles (Higgs bosons, SUSY particles,...) in an exceptionally clean environment. △ Less", "The pole mass of the gluino is diagrammatically calculated to the two-loop order in SUSY QCD as a function of the running parameters in the lagrangian, for the gluino and squarks sufficiently heavier than the quarks. The O(alpha_s^2) correction shifts the gluino mass by typically 1-2 %, which may be larger than the expected accuracy of the mass determination at future colliders. △ Less", "We calculate cross sections for mixed stop-sbottom pair production at the LHC, analogous to single-top production, a weak process involving the W-t(i)-b(j) vertex. While coupling-suppressed relative to QCD same-flavor squark pair production, the signal is distinctive due to heavy-flavor tagging along with a possible same-sign lepton pair in the final state. SUSY backgrounds can often be suppressed many orders of magnitude by taking advantage of distinct kinematic differences from the signal. Measuring the rate of this process would add significant additional information to that gathered from other SUSY processes. If the stop and sbottom mixings can be determined elsewhere, stop-sbottom production would provide for a measurement of the weak squark gauge coupling and super-CKM vertex factor. △ Less", "The compatibility of producing the observed amount of dark matter, as indicated by the WMAP data, through the relic abundance of neutralinos with Yukawa unification and with the measured rate of $b\\to s γ$ is analyzed in mSUGRA and extended SUGRA unified models with the inclusion of CP phases. The CP phases affect the analysis in several ways, e.g., through the threshold corrections to the b-quark mass, via their effects on the neutralino relic density and through the SUSY contribution to the BR($b\\to s γ$) which is sensitive to the CP phases. We present some specific models with large SUSY phases, which can accommodate the fermion electric dipole moment constraints and give a neutralino relic density in agreement with observations as well as with the b-$τ$ unification constraint. The possibility of achieving WMAP relic density constraints with full Yukawa unification is also explored. △ Less", "In a dense star, the Pauli exclusion principle functions as an enormous energy storage mechanism. Supersymmetry could provide a way to recapture this energy. If there is a transition to an exactly supersymmetric (susy) phase, the trapped energy can be released with consequences similar to gamma ray burst observations. Previous zeroth order calculations have been based on the behavior in a prototypical white dwarf of solar mass and earth radius (such as Sirius B) and have neglected density inhomogeneity. In this article we show that the effects of density inhomogeneity and of variations in masses and radii are substantial enough to encourage further exploration of the susy star model. In addition, the effects discussed here have possible applications to the growth of bubbles in other phase transition models in dense matter. △ Less", "Assuming that supersymmetry is realized with parameters in the hyperbolic branch/focus point (HB/FP) region of the minimal supergravity (mSUGRA) model, we show that by searching for multijet + missing E_T events with tagged b jets the reach of experiments at the LHC may be extended by as much as 20% from current projections. The reason for this is that gluino decays to third generation quarks are enhanced because the lightest neutralino has substantial higgsino components. Although we were motivated to perform this analysis because the HB/FP region is compatible with the recent determination of the relic density of cold dark matter, our considerations may well have a wider applicability since decays of gluinos to third generation quarks are favoured in a wide variety of models. △ Less", "Lepton flavor violating Higgs boson decays (LFVHD) are studied in the context of the Minimal Supersymmetric Standard Model (MSSM) being embeded in a mSUGRA scenario that is enlarged with three right handed neutrinos and their supersymmetric partners, and with the neutrino masses being generated by the seesaw mechanism. We compute the partial widths for these decays to one-loop order and analyze numerically the corresponding branching ratios in terms of the mSUGRA and seesaw parameters. We analyze in parallel the lepton flavor changing $ł_j\\to l_i γ$ decays and explore the maximum predicted rates for LFVHD, mainly for $H^0,A^0 \\to τ{\\bar μ}$ decays, by requiring compatibility with neutrino and $BR(ł_j\\to l_i γ)$ data. We find LFVHD ratios of up to $10^{-5}$ in some regions of the MSSM-seesaw parameter space. △ Less", "We study the possibility that dark matter is a baryon of a new strongly interacting gauge theory, which was introduced in the low energy theory of Cosmological SUSY Breaking (CSB). This particle can fit the observed dark matter density if an appropriate cosmological asymmetry is generated. The same mechanism can also explain the dark/baryonic matter ratio in the universe. The mass of the dark matter particle is in the multiple TeV range, and could be as high as 20 TeV. △ Less", "We present a quantitative analysis of the flavor physics of a SUSY SO(10) model proposed by Chang, Masiero, and Murayama, linking b -> s transitions to the large observed atmospheric neutrino mixing. We consider B_s-B_s-bar mixing and tau -> mu gamma and discuss their correlation paying careful attention to their different dependences on model parameters. Our analysis shows that an order-of-magnitude enhancement of the mass difference with respect to the Standard Model is possible and can be reconciled with the most stringent bounds on lepton flavor violation. The situation for various Delta B=1 decays is discussed qualitatively. △ Less", "We point out that the null results of the hadronic electric dipole moment (EDM) searches constrain orbifold grand unified theories (GUTs), where the GUT symmetry and supersymmetry (SUSY) are both broken by boundary conditions in extra dimensions and it leads to rich fermion and sfermion flavor structures. A marginal chromoelectric dipole moment (CEDM) of the up quark is induced by the misalignment between the CP violating left- and right-handed up-type squark mixings, in contrast to the conventional four-dimensional SUSY GUTs. The up quark CEDM constraint is found to be as strong as those from charged lepton flavor violation (LFV) searches. The interplay between future EDM and LFV experiments will probe the structures of the GUTs and the SUSY breaking mediation mechanism. △ Less", "In supersymmetric models with gravity-mediated SUSY breaking and gaugino mass unification, the predicted relic abundance of neutralinos usually exceeds the strict limits imposed by the WMAP collaboration. One way to obtain the correct relic abundance is to abandon gaugino mass universality and allow a mixed wino-bino lightest SUSY particle (LSP). The enhanced annihilation and scattering cross sections of mixed wino dark matter (MWDM) compared to bino dark matter lead to enhanced rates for direct dark matter detection, as well as for indirect detection at neutrino telescopes and for detection of dark matter annihilation products in the galactic halo. For collider experiments, MWDM leads to a reduced but significant mass gap between the lightest neutralinos so that chi_2^0 two-body decay modes are usually closed. This means that dilepton mass edges-- the starting point for cascade decay reconstruction at the CERN LHC-- should be accessible over almost all of parameter space. Measurement of the m_{\\tz_2}-m_{\\tz_1} mass gap at LHC plus various sparticle masses and cross sections as a function of beam polarization at the International Linear Collider (ILC) would pinpoint MWDM as the dominant component of dark matter in the universe. △ Less", "These notes are an expanded version of a short course of lectures given for graduate students in particle physics at Oxford. The level was intended to be appropriate for students in both experimental and theoretical particle physics.The purpose is to present an elementary and self-contained introduction to SUSY that follows on, relatively straightforwardly, from graduate-level courses in relativistic quantum mechanics and introductory quantum field theory. The notation adopted, at least initially, is one widely used in RQM courses, rather than the `spinor calculus' (dotted and undotted indices) notation found in most SUSY sources, though the latter is introduced in optional Asides. There is also a strong preference for a `do-it-yourself' constructive approach, rather than for a top-down formal deductive treatment. The main goal is to provide a practical understanding of how the softly broken MSSM is constructed. Relatively less space is devoted to phenomenology, though simple `classic' results are covered, including gauge unification, the bound on the mass of the lightest Higgs boson, and sparticle mixing. By the end of the course students (readers) should be provided with access to the contemporary phenomenological literature. △ Less", "We calculate NLO QCD corrections to the lightest neutral Higgs boson production associated with top quark pair at hadron colliders in the minimal supersymmetric standard model(MSSM). Our calculation shows that the total QCD correction significantly reduces its dependence on the renormalization/factorization scale. The relative correction from the SUSY QCD part approaches to be a constant, if either $M_S$ or $m_{\\tilde{g}}$ is heavy enough. The corrections are generally moderate(in the range of few percent to 20%) and under control in most of the SUSY parameter space. The relative correction is obviously related to $m_{\\tilde{g}}$, $A_t$ and $μ$, but not very sensitive to $\\tanβ$, $M_S$ at both the Tevatron and the LHC with our specified parameters. △ Less", "We study the constraints on flavour violating terms in low energy SUSY coming from several processes as li -> lj gamma, li -> lj lj lj and mu -> e in Nuclei. We show that a combined analysis of the processes allows us to extract additional information with respect to an individual analysis of all the processes. In particular, it makes possible to put bounds on sectors previously unconstrained by li -> lj gamma. We perform the analysis both in the mass eigenstate and in the mass insertion approximations clarifying the limit of applicability of these approximations. △ Less", "We study the inflationary scenarios driven by a Wilson line field - the fifth component of a 5D gauge field and corresponding modulus field, within S^1/Z_2 orbifold supergravity (SUGRA). We use our off shell superfield formulation and give a detailed description of the issue of SUSY breaking by the F-component of the radion superfield. By a suitably gauged U(1)R symmetry and including couplings with compensator supermultiplets and a linear multiplet, we achieve a self consistent radion mediated SUSY breaking of no scale type. The inflaton 1-loop effective potential has attractive features needed for successful inflation. An interesting feature of both presented inflationary scenarios are the red tilted spectra with ns~0.96. For gauge inflation we obtain a significant tensor to scalar ratio r~0.1 of the density perturbations, while for the modulus inflation r is strongly suppressed. △ Less", "We propose a new selection criteria for predicting the most probable wavefunction of the universe that propagates on the string landscape background, by studying its dynamics from a quantum cosmology view. Previously we applied this proposal to the $SUSY$ sector of the landscape. In this work the dynamic selection criterion is applied to the investigation of the non-$SUSY$ sector.In the absence of detailed information about its structure, it is assumed that this sector has a stochastic distribution of vacua energies.The calculation of a distribution probability for the cosmological constants $Λ_{eff}$, obtained from the density of states $ρ$, indicates that the most probable wavefunction is peaked around universes with zero $Λ_{eff}$. In contrast to the {\\it extended wavefunction} solutions found for the $SUSY$ sector with $N$-vacua and peaked around $Λ_{eff}\\simeq \\frac{1}{N^2}$, wavefunctions residing on the non-$SUSY$ sector exhibit {\\it Anderson localization}.Although minisuperspace is a limited approach it presently provides a dynamical quantum selection rule for the most probable vacua solution from the landscape. △ Less", "It is well known that the Casimir energy of bulk fields induces a non-trivial potential for the compactification radius of higher-dimensional field theories. On dimensional grounds, the 1-loop potential is ~ 1/R^4. Since the 5d gauge coupling constant g^2 has the dimension of length, the two-loop correction is ~ g^2/R^5. The interplay of these two terms leads, under very general circumstances (including other interacting theories and more compact dimensions), to a stabilization at finite radius. Perturbative control or, equivalently, a parametrically large compact radius is ensured if the 1-loop coefficient is small because of an approximate fermion-boson cancellation. This is similar to the perturbativity argument underlying the Banks-Zaks fixed point proposal. Our analysis includes a scalar toy model, 5d Yang-Mills theory with charged matter, the examination of S^1 and S^1/Z_2 geometries, as well as a brief discussion of the supersymmetric case with Scherk-Schwarz SUSY breaking. 2-Loop calculability in the S^1/Z_2 case relies on the log-enhancement of boundary kinetic terms at the 1-loop level. △ Less", "It has been proposed recently that, within the framework of split Supersymmetry, long lived gluinos generated in astrophysical sources could be detected using the signatures of the air showers they produce, thus providing a lower bound for their lifetime and for the scale of SUSY breaking. We present the longitudinal profile and lateral spread of $G$-hadron induced extensive air showers and consider the possibility of measuring them with a detector with the characteristics of the Pierre Auger Observatory. △ Less", "We investigate the role of CP phases within the renormalizable SUSY SO(10) GUT with one 10_H, one 126bar_H one 126_H and one 210_H Higgs representations and type II seesaw dominating the neutrino mass matrix. This framework is non trivially predictive in the fermionic sector and connects in a natural way the GUT unification of b and tau Yukawa couplings with the bi-large mixing scenario for neutrinos. On the other hand, existing numerical analysis claim that consistency with quark and charged lepton data prevents the minimal setup from reproducing the observed CP violation via the Cabibbo-Kobayashi-Maskawa (CKM) matrix. We re-examine the issue and find by inspection of the fermion mass sum rules and a detailed numerical scan that, even though the CKM phase takes preferentially values in the second quadrant, the agreement of the minimal model with the data is actually obtained in a non negligible fraction of the parameter space. We then consider a recently proposed renormalizable extension of the minimal model, obtained by adding one chiral 120-dimensional Higgs supermultiplet. We show that within such a setup the CKM phase falls naturally in the observed range. We emphazise the robust predictivity of both models here considered for neutrino parameters that are in the reach of ongoing and future experiments. △ Less", "Radiative corrections to neutrino mixings in seesaw models depend on the nature of new physics between the weak and the GUT-seesaw scales and can be taken into account using the renormalization group equations. This new physics effect becomes particularly important for models with quasi-degenerate neutrino masses where small neutrino mixings at the seesaw scale can get magnified by radiative renormalization effects alone to match observations. This mechanism of radiative magnification which provides a simple understanding of why lepton mixings are so different from quark mixings was demonstrated by us for the standard supersymmetry scenario where the particle spectrum becomes supersymmetric above the weak scale. In this paper, we examine this phenomenon in split supersymmetry scenarios and find that the mechanism works also for this scenario provided the SUSY scale is at least 2-3 orders below the GUT-seesaw scale and one has larger values of ${\\tanβ}$. △ Less", "We give an overview of recent progress in the study of fermion mass and flavor mixing phenomena. Mass matrix ansatze are considered within the SM and SUSY GUTs where some predictive frameworks based on SU(5) and SO(10) are reviewed. We describe a variety of schemes to construct quark mass matrices in extra dimensions focusing on four major classes: models with the SM residing on 3-brane, models with universal extra dimensions, models with split fermions and models with warped extra dimensions. We outline how realistic patterns of quark mass matrices could be derived from orbifold models in heterotic superstring theory. Finally, we address the fermion mass problem in intersecting D-branes scenarios, and present models with D6-branes able to give a good quantitatively description of quark masses and mixing. The role of flavor/CP violation problem as a probe of new physics is emphasized. △ Less", "Leptonic decays of $B$-mesons are theoretically very clean probes for testing the Standard Model (SM) and possible physics beyond it. Amongst the various leptonic decays of the $B$-meson, the pure dileptonic decay $B \\to \\ell^+ \\ell^-$ is very important as this mode is helicity suppressed in the SM but can be substantially enhanced in some of the models beyond the SM, such as supersymmetric (SUSY) theories and the two Higgs doublet model (2HDM). Although the purely dileptonic decay mode is helicity suppressed in the SM its associated mode $B \\to \\ell^+ \\ell^- γ$ does not have the same suppression, due to the presence of the $γ$ in the final state. In this paper we will also analyse the effects of enhanced $Z$-penguins on these two decay modes. △ Less", "Supersymmetric flavor models for the radiative generation of fermion masses offer an alternative way to solve the SUSY-CP problem. We assume that the supersymmetric theory is flavor and CP conserving. CP violating phases are associated to the vacuum expectation values of flavor violating susy-breaking fields. As a consequence, phases appear at tree level only in the soft supersymmetry breaking matrices. Using a U(2) flavor model as an example we show that it is possible to generate radiatively the first and second generation of quark masses and mixings as well as the CKM CP phase. The one-loop supersymmetric contributions to EDMs are automatically zero since all the relevant parameters in the lagrangian are flavor conserving and as a consequence real. The size of the flavor and CP mixing in the susy breaking sector is mostly determined by the fermion mass ratios and CKM elements. We calculate the contributions to epsilon, epsilon^{prime} and to the CP asymmetries in the B decays to psi Ks, phi Ks, eta^{\\prime} Ks and Xs gamma. We analyze a case study with maximal predictivity in the fermion sector. For this worst case scenario the measurements of Delta mK, Delta mB and epsilon constrain the model requiring extremely heavy squark spectra. △ Less", "To avoid misleading discrepancies between results of different dark matter search experiments as well as between the data and SUSY calculations it is in general preferable to use a mixed spin-scalar coupling approach in which spin-independent and spin-dependent WIMP-nucleon couplings are both non-zero. On the other hand one may, however, to safely neglect the subdominant spin WIMP-nucleon contribution in comparison with the spin-independent one in analysis of data from experiments with heavy enough non-zero-spin target nuclei. The mixed coupling approach is applied to estimate future prospects of experiments with the odd-neutron high-spin isotope Ge-73. △ Less", "In supersymmetric models with gravity-mediated SUSY breaking, universality of soft SUSY breaking sfermion masses m_0 is motivated by the need to suppress unwanted flavor changing processes. The same motivation, however, does not apply to soft breaking Higgs masses, which may in general have independent masses from matter scalars at the GUT scale. We explore phenomenological implications of both the one-parameter and two-parameter non-universal Higgs mass models (NUHM1 and NUHM2), and examine the parameter ranges compatible with Omega_CDM h^2, BF(b --> s,gamma) and (g-2)_mu constraints. In contrast to the mSUGRA model, in both NUHM1 and NUHM2 models, the dark matter A-annihilation funnel can be reached at low values of tan(beta), while the higgsino dark matter annihilation regions can be reached for low values of m_0. We show that there may be observable rates for indirect and direct detection of neutralino cold dark matter in phenomenologically aceptable ranges of parameter space. We also examine implications of the NUHM models for the Fermilab Tevatron, the CERN LHC and a Sqrt(s)=0.5-1 TeV e+e- linear collider. Novel possibilities include: very light s-top_R, s-charm_R squark and slepton_L masses as well as light charginos and neutralinos and H, A and H^+/- Higgs bosons. △ Less", "We examine the structure of soft supersymmetry breaking terms in KKLT models of flux compactification with low energy supersymmetry. Moduli are stabilized by fluxes and nonperturbative dynamics while a de Sitter vacuum is obtained by adding supersymmetry breaking anti-branes. We discuss the characteristic pattern of mass scales in such a set-up as well as some features of 4D N=1 supergravity breakdown by anti-branes. Anomaly mediation is found to always give an important contribution and one can easily arrange for flavor-independent soft terms. In its most attractive realization, the modulus mediation is comparable to the anomaly mediation, yielding a quite distinctive sparticle spectrum. In addition, the axion component of the modulus/dilaton superfield dynamically cancels the relative CP phase between the contributions of anomaly and modulus mediation, thereby avoiding dangerous SUSY CP violation. △ Less", "We have proposed a very attractive scenario of Grand Unified Theories (GUTs). It employs the supersymmetry (SUSY) and an anomalous U(1) symmetry whose anomaly is canceled via the Green-Schwarz mechanism. In this scenario, the doublet-triplet splitting problem is solved and the success of the gauge coupling unification in the minimal SU(5) GUT is naturally explained with sufficiently stable nucleon. Realistic fermion Yukawa matrices can also be realized simultaneously. In addition, a horizontal symmetry helps to solve the SUSY-flavor problem. △ Less", "In this paper we present the renormalization group equations to one-loop order for all the parameters of two supersymmetric left-right theories that are softly broken. Both models are based upon the gauge group SU(3)^c x SU(2)_L x SU(2)_R x U(1)_{B - L} and both contain an arbitrary number of bidoublets as well as singlets; however, one model uses doublets to break SU(2)_R and the other uses triplets. △ Less", "We have calculated the full one-loop electroweak (EW) and QCD corrections to the third generation scalar-fermion pair production processes $e^+e^- \\to γγ\\to \\tilde{f_i}\\bar{\\tilde{f_i}} (f=t,b,τ)$ at an electron-positron linear collider(LC) in the minimal supersymmetric standard model (MSSM). We analyze the dependence of the radiative corrections on the parameters such as the colliding energy $\\sqrt{\\hat s}$ and the SUSY fundamental parameters $A_f$, $\\tan β$, $μ$, $M_{SUSY}$ and so forth. The numerical results show that the EW corrections to the squark-, stau-pair production processes and QCD corrections to the squark-pair production processes give substantial contributions in some parameter space. The EW relative corrections to squark-pair production processes can be comparable with QCD corrections at high energies. Therefore, these EW and QCD corrections cannot be neglected in precise measurement of sfermion pair productions via $γγ$ collision at future linear colliders. △ Less", "We probe the stau-neutralino co-annihilation domain of the parameter space allowed by the current experimental bounds on the light Higgs mass, the b-> s γdecay, and the amount of neutralino cold dark matter within the framework of minimal SUGRA models at a 500 GeV e+e- linear collider. The most favorable signals of SUSY are stau pair production and neutralino pair production where the small mass difference between the lighter stau and the lightest neutralino in the co-annihilation region is ~5-15 GeV and hence generates low-energy tau leptons in the final state. This small mass difference would be a striking signal of many SUGRA models. We find that a calorimeter covering down to 1^o from the beams is crucial to reduce the two-photon background and the mass difference could be measured at a level of 10% with 500 fb^-1 of data where an invariant mass of two-tau jets and missing energy is used as a discriminator. △ Less", "In a SUSY GUT seesaw scenario, the largeness of the atmospheric neutrino mixing can reflect itself into an enhanced flavor changing mixing of beauty and strange right-handed scalar quarks. If the CP violating phase in such down type squark RR insertion is the main source of CP asymmetry in B_d -> phi K_S and the gluino contributions to K0-K0 bar and B0-B0 bar mixing are negligible, there is a correlation between Re (epsilon'/epsilon_K) and B_d -> phi K_S CP asymmetry, in addition to that with the strange quark CEDM. The current data on Re (epsilon'/epsilon_K) = (16.7 +- 2.6) 10^-4 imply that S_{phi K} should be greater than \\sim 0.5 (0.25) for mu tan beta = 1 (5) TeV, assuming the RR dominance in b -> s transition and the minimal supergravity type boundary conditions for soft parameters. △ Less", "In this talk I discuss possibilities of probing the CP violation (CPV) in the Minimal Supersymmetric Standard Model (MSSM), at the LHC as well as its effects on the LHC SUSY phenomenology. In the latter case I mainly discuss its effect on the Higgs-sector and hence on Higgs Phenomenology at the LHC. After outlining the possibilities that a study of the $\\ch_1 \\nt_2$ production at the LHC might offer, I will summarise the effects of the CPV in MSSM on the Higgs searches at the LHC. Further, I will discuss how a study of the process $H^\\pm \\to W^+ φ_1$ may be able to plug a 'hole\" in the $\\tan β$-$\\mh{+}$ plane, where the LEP has no sensitivity and where the searches in the usual discovery channels at the LHC are likely to fail as well. △ Less", "The achievable precision of the cross section times branching ratio measurement from the event rates is estimated for the MSSM H/A -> tau tau decay in the associated production process gg -> b bbar H/A at large tan beta in CMS. This work demonstrates that the above production and decay process exhibit a large sensitivity to tan beta and thus add as a significant observable to a global fit of the SUSY parameters. To illustrate this potential an example is given concerning the achievable tan beta determination accuracy that could be reached from the event rates and for a given set of SUSY parameters and uncertainties. △ Less", "Production of the lightest MSSM Higgs boson h is studied at the LHC. Isorate contours for the h -> gamma gamma and h -> tau+tau- decay channels are shown in the m_A,tan(beta) parameter space. Effects of the SUSY parameters, in particular the stop mixing and stop quark mass, are investigated. Search strategies at the LHC are discussed and the discovery potential is calculated for the CMS experiment. The MSSM parameter space for m_A > 150-200 GeV is expected to be covered with at least one decay channel with an integrated luminosity of 60 fb^{-1}. A light stop quark with large stop mixing can affect seriously the discovery potential in the h -> gamma gamma and h -> ZZ* decay channels. △ Less", "We clarify classical inflaton models by considering them as effective field theories `a la Ginzburg-Landau. In this approach, the WMAP statement excluding the pure phi^4 potential implies the presence of an inflaton mass term at the scale m ~ 10^{13}GeV.Chaotic, new and hybrid inflation models are studied in an unified manner.In all cases the inflaton potential takes the form V(phi)=m^2 M_{Pl}^2 v(phi/M_{Pl}), where all coefficients in v(varphi) are of order one.If such potential corresponds to supersymmetry breaking, the susy scale is sqrt{m M_{Pl}}~10^{16}GeV which coincides with the GUT scale. For red tilted spectrum new inflation turns to be favoured while for blue tilted spectrum, hybrid inflation turns to be the best choice.In both cases, we find an analytic formula relating the inflaton mass with r (tensor/scalar ratio) and the scalar spectral index ns: 10^6 m/M_{Pl} = 127 sqrt{r|1-n_s|} where the numerical coefficient follows from the WMAP amplitude. We review quantum phenomena during inflation which contribute to relevant observables in the CMB anisotropies and polarization and we focus on inflaton decay.The deviation from the scale invariant power spectrum is measured by a small parameter Delta.Delta regulates the infrared divergences too.In slow roll inflation, Delta is a simple function of the slow roll parameters. The quantum fluctuations can selfdecay in the inflationary expansion through processes forbidden in Minkowski. We compute the self-decay of the inflaton quantum fluctuations during slow roll:superhorizon fluctuations decay as eta^{Gamma} in conformal time where the new scaling dimension Gamma is expressed in terms of the amplitude, n_s and r. we discuss the implications for scalar and tensor perturbations as well as for non gaussianities. △ Less", "In this talk, I first discuss $b\\to d$, $b\\to s$ and $s\\to d$ transitions including time-dependent CP asymmetries in $B_d \\to φK_s$ and Re ($ε^{'}/ε_K$). Then I show that the decay $B_s \\to μ^+ μ^-$ is useful to distinguish various SUSY breaking mechanisms. I will also describe some possible connections between B physics and cosmology: (i) B physics and electroweak baryogenesis within SUSY models, and (ii) the correlation between the neutralino dark matter scattering and $B (B_s \\to μ^+ μ^-)$. In particular, we point out that the current upper bound on $B (B_s \\to μ^+ μ^-)$ form CDF and D0 collaborations can constrain the spin-independent neutralino scattering cross section more strongly than the CDMS bound. △ Less", "We present the complete one-loop corrections to the sfermion pair production process e+e- -> sf_i sf_j (f = t, b, tau, nu_tau, u, d, s, c) in the Minimal Supersymmetric Standard Model. Our results also include the previously calculated SUSY-QCD corrections. We present some details of the renormalization scheme used. It is found that the weak corrections are of the same magnitude as the SUSY-QCD corrections at higher energies (sqrt(s) ~ 1 Tev). At these energies an important part of the weak corrections stems from the box contribution. We also include cross-sections for polarized beams and left-right asymmetry. △ Less", "We derive in detail a condition on the Higgs mass parameters that is necessary for the recently proposed ``split supersymmetry'' (split SUSY) scenario to provide a realistic magnitude of $\\tan β$. The nature of this condition can be understood by showing how the Higgs sector of the minimal supersymmetric Standard Model reduces to that of the Standard Model in the heavy limit of the soft supersymmetry breaking Higgs mass parameters. Based on this condition, we present some simple supersymmetry breaking models that each provides a realistic split-SUSY mass spectrum, in accordance with the scale of the gravitino mass ($m_{3/2}$) in relation to those of the soft scalar mass ($\\tilde{m}$) and the gaugino mass ($M_{1/2}$) employed in each, namely $m_{3/2} \\geq \\tilde{m}$, $\\tilde{m} \\geq m_{3/2} \\geq M_{1/2}$ and $M_{1/2} \\geq m_{3/2}$, respectively, with the relation $\\tilde{m} \\gg M_{1/2}$ of the split-SUSY mass spectrum. △ Less", "Lepton flavor violation (LFV) is studied within a realistic unified framework, based on supersymmetric SO(10) or an effective G(224) = SU(2)_L\\times SU(2)_R\\times SU(4)^c symmetry, that successfully describes (i) fermion masses and mixings, (ii) neutrino oscillations, as well as (iii) CP violation. LFV emerges as an important prediction of this framework, bringing no new parameters, barring the few SUSY parameters, which are assumed to be flavor-universal at M^*>= M_{GUT}. We study LFV (i.e. μ-> eγ, τ-> μγ, τ-> eγand μN -> e N) within this framework by including contributions both from the presence of the right handed neutrinos as well as those arising from renormalization group running in the post-GUT regime (M^* to M_{GUT}). Typically the latter, though commonly omitted in the literature, is found to dominate. Our predicted rates for μ-> eγshow that while some choices of (m_o, m_{1/2}) are clearly excluded by the current empirical limit, this decay should be seen with an improvement of the current sensitivity by a factor of 10--100, even if sleptons are moderately heavy (<= 800 GeV, say). For the same reason, μ-e conversion (μN -> e N) should show in the planned MECO experiment. Implications of WMAP and (g-2)_μ-measurements are noted, as also the significance of the measurement of parity-odd asymmetry in the decay of polarized μ^+ into e^+ γ. △ Less", "We analyze the phenomenology of a set of minimal supersymmetric standard model (MSSM) soft terms inspired by flux-induced supersymmetry (SUSY)-breaking in Type IIB string orientifolds. The scheme is extremely constrained with essentially only two free mass parameters: a parameter M, which sets the scale of soft terms, and the mu parameter. After imposing consistent radiative electro-weak symmetry breaking (EWSB) the model depends upon one mass parameter (say, M). In spite of being so constrained one finds consistency with EWSB conditions. We demonstrate that those conditions have two solutions for mu<0, and none for mu>0. The parameter tan beta results as a prediction and is approximately 3-5 for one solution, and 25-40 for the other, depending upon M and the top mass. We examine further constraints on the model coming from b->s gamma, the muon g-2, Higgs mass limits and WMAP constraints on dark matter. The MSSM spectrum is predicted in terms of the single free parameter M. The low tan beta branch is consistent with a relatively light spectrum although it is compatible with standard cosmology only if the lightest neutralino is unstable. The high tan beta branch is compatible with all phenomenological constraints, but has quite a heavy spectrum. We argue that the fine-tuning associated to this heavy spectrum would be substantially ameliorated if an additional relationship mu=-2M were present in the underlying theory. △ Less", "In this talk, a supersymmetric (SUSY) composite model of color superconductivity is discussed. In this model, quark and diquark supermultiplets are dynamically generated as massless composites by a newly introduced confining gauge dynamics. It is analytically shown that the scalar component of diquark supermultiplets develops vacuum expectation value (VEV) at a certain critical chemical potential. We believe that our model well captures aspects of the diquark condensate behavior and helps our understanding of its dynamics in real QCD. The results obtained here might be useful when we consider a theory composed of quarks and diquarks. △ Less", "We discuss IR limit of four-fermion scattering amplitudes in braneworld models including intersecting-branes and SUSY SU(5) GUT version of it. With certain compactification where instanton effect is negligible, grand unification condition in D6-D6 intersecting-branes scenario subject to experimental constraint on proton decay provides possibility for upper limit on the string scale, $M_S$, through relationship between the string coupling, $g_s$, and the string scale. We discuss how IR divergence is related to number of twisted fields we have to introduce into intersection region and how it can change IR behaviour of tree-level amplitudes in various intersecting-branes models. Using number of twisted fields, we identify some intersecting-branes models whose tree-level amplitudes are purely stringy in nature and automatically proportional to $g_s/M^2_{S}$ at low energy. They are consequently suppressed by the string scale. For comparison, we also derive limit on the lower bound of the string scale from experimental constraint on proton decay induced from purely stringy contribution in the coincident-branes model, the limit is about $10^5$ TeV. △ Less", "Grand unified theories can lead to non-universal boundary conditions for the gaugino masses at the unification scale. We consider the implications of such non-universal boundary conditions for the composition of the lightest neutralino as well as for the upper bound on its mass in the simplest supersymmetric grand unified theory based on the SU(5) gauge group. We derive sum rules for neutralino and chargino masses in different representations of SU(5) which lead to different non-universal boundary conditions for the gaugino masses at the unification scale. We also consider the phenomenological implications of the non-universal gaugino masses arising from a grand unified theory in the context of Large Hadron Collider. In particular we investigate the detection of heavy neutral Higgs bosons $H^0, A^0$ from $H^0, A^0 \\to \\tildeχ_2^0 \\tildeχ_2^0 \\to 4l $, and study the possibilities of detecting the neutral Higgs bosons in cascade decays, including the decays $\\tildeχ_i^0 \\to h^0 (H^0, A^0) \\tildeχ_1^0 \\to b\\bar{b} \\tildeχ_1^0$. △ Less", "We study one loop supersymmetric corrections to precision observables. Adding LEP2 e ebar --> f fbar cross sections to the data-set removes previous hints for SUSY and the resulting constraints are in some cases stronger than direct bounds on sparticle masses. We consider specific models: split SUSY, CMSSM, gauge mediation, anomaly and radion mediation. Beyond performing a complete one-loop analysis, we also develop a simple approximation, based on the Shat, That, W, Y `universal' parameters. SUSY corrections give W,Y > 0 and mainly depend on the left-handed slepton and squark masses, on M_2 and on mu. △ Less", "We compare results of four public supersymmetric (SUSY) spectrum codes, Isajet, Softsusy, Spheno and Suspect to estimate the present-day uncertainty in the calculation of the relic density of dark matter in mSUGRA models. We find that even for mass differences of about 1% the spread in the obtained relic densities can be 10%. In difficult regions of the parameter space, such as large tan(beta) or large m_0, discrepancies in the relic density are much larger. We also find important differences in the stau co-annihilation region. We show the impact of these uncertainties on the bounds from WMAP for several scenarios, concentrating on the regions of parameter space most relevant for collider phenomenology. We also discuss the case of non-zero A_0 and the stop co-annihilation region. Moreover, we present a web application for the online comparison of the spectrum codes. △ Less", "Modern Terrestrial Cerenkov Telescopes and Array Scintillators facing the Horizons may soon reveal far Cosmic Rays or nearer PeVs-EeVs Neutrino Showers Astronomy. Indeed UHE neutrino interactions in air, leading to Horizontal Showers, may take place through several channels: the main Glashow resonant one, the charged nuclear interactions and the neutral current events. Analogous events occur also for the neutrino-nucleon events. These interactions are producing hadronic or electromagnetic showers at the far horizons and their correlated secondaries Cerenkov flashes. Comparable interactions are producing, inside the Earth, the Horizontal, but Up-going ultra-relativistic tau, whose decay in flight is source of tau Air Showers (Uptaus and HorTaus); Horizontal Tau Air-Showers are rarely (one-two order of magnitude) enhanced by highest mountain chains at horizons, as in AUGER experimental site; their hadronic or electromagnetic traces are preferentially at PeV-EeV energies; their tracks are amplified by their muon-gamma bundles whose signals are above the random noises and better disentangled by Cerenkov flashes in time coincidence. More exotic UHE SUSY interactions at tens PeVs-EeV energy may blaze at Horizons. Anyway common High Energy Cosmic rays at PeVs-EeVs energy must traces their presence in Magic-like Cerenkov Telescopes at horizons. Present Magic Telescopes facing the Horizons are, at equal given time, almost comparable with the Amanda underground neutrino detector. △ Less", "We shortly review our new superfield formalism in the framework of Fujita, Kugo, Ohashi 5D conformal supergravity, in particular with an $S^1/Z_2$ orbifold. The radion of the fifth dimension is embedded in two related superfields, a chiral and a general multiplet and is linked to the radion superfield of rigid SUSY. The superspace action of the gauge sector is of the Chern-Simons type. We also present the superspace action for hypermultiplets and discuss the role of compensators. The presented formalism should be very useful for applications. We demonstrate this for obtaining the RS solution. △ Less", "We present a through discussion of motivations for and phenomenological issues in supersymmetric models with minimal matter content and non-holomorphic soft-breaking terms. Using the unification of the gauge couplings and assuming SUSY is broken with non-standard soft terms, we provide semi-analytic solutions of the RGEs for low and high choices of tanβwhich can be used to study the phenomenology in detail. We also present a generic form of RGIs in mSUGRA framework which can be used to derive new relations in addition to those existing in the literature. Our results are mostly presented with respect to the conventional minimal supersymmetric model for ease of comparison. △ Less", "In split supersymmetry, the supersymmetric scalar particles are all very heavy, at least at the order of 10^9 GeV, but the gauginos, Higgsinos, and one of the neutral Higgs bosons remain below a TeV. Here we further split the split supersymmetry by taking the Higgsino mass parameter μto be very large. In this case, the μproblem is avoided and we keep the wino as a dark matter candidate. A crude gauge coupling unification is still preserved. Dark matter signals and collider phenomenology are discussed in this μ-split SUSY scenario. The most interesting dark matter signal is the annihilation into monochromatic photons. In colliders, chargino-pair and the associated chargino-neutralino production cross sections have a certain ratio due to gauge couplings, and the chargino has long decays. △ Less", "Non-renormalizable operators both account for the failure of down quark and charged lepton Yukawa couplings to unify and reduce the proton decay rate via dimension-five operators in minimal SUSY SU(5) GUT. We extend the analysis to SUSY SO(10) GUT models. △ Less", "The anomalous magnetic moment of the muon has been measured to 0.5 ppm in a series of precision experiments at the Brookhaven Alternating Gradient Synchrotron. The individual results for each sign: a(mu+)= 11 659 204(7)(5) E-10 and a(mu-) = 11 659 214(8)(3) E-10 are consistent with each other, so that we can write the average anomaly as a(mu)(exp) = 11 659 208(6) E-10 (0.5 ppm). A discrepancy between the measured value and the Standard Model (Delta a(mu)) is a signal for new physics. Assuming that such a discrepancy is due to contributions from supersymmetric particles provides a framework which can be used to constrain the mass of the dark matter particles, assumed to be the lightest neutral supersymmetric particles. The deviation from the standard model has varied between 1.5 sigma and 3 sigma significance, dominated by uncertainties in the hadronic contribution to the standard model calculation. Currently the standard model prediction is calculated to 0.6 ppm precision and Delta a(mu) = 23.5 (9.0) E-10, representing a 2.6 sigma deviation. We expect that the error on a(mu)(SM) will be reduced by a factor of two within the next decade. To fully utilize this improvement, a new g-2 run is proposed for the near future. If the mean Delta a(mu) remains the same, this would result in close to a 6 sigma discrepancy. In this case, we would expect to see SUSY particles at the LHC and use the g-2 results to measure tan beta. If, instead, the Standard Model is confirmed to this precision, gauginos must have masses higher than ~ 500 GeV/c2 and simple SUSY dark matter models will be severely constrained. △ Less", "The processes e+e- -> t tbar/b bbar + Higgs allow to measure the Yukawa couplings between Higgs bosons and heavy quarks in supersymmetric theories. The complete set of next-to-leading order SUSY-QCD corrections to the cross sections of these processes have been determined in the minimal supersymmetric extension of the Standard Model. They turn out to be O(10-20%) and thus important for future linear e+e- colliders. △ Less", "If supersymmetry (SUSY) is not for stabilizing the electroweak energy scale, what is it used for in particle physics? We propose that it is for flavor problems. A cyclic family symmetry is introduced. Under the family symmetry, only the $τ$-lepton is massive due to the vacuum expectation value (VEV) of the Higgs field. This symmetry is broken by a sneutrino VEV which results in the muon mass. The comparatively large sneutrino VEV does not result in a large neutrino mass due to requiring heavy gauginos. SUSY breaks at a high scale $\\sim 10^{13}$ GeV. The electroweak energy scale is unnaturally small. No additional global symmetry, like the R-parity, is imposed. Other aspects of the model are discussed. △ Less", "For several decades the energy source powering supernovae and gamma ray bursts has been a troubling mystery. Many articles on these phenomena have been content to model the consequences of an unknown \"central engine\" depositing a large amount of energy in a small region. In the case of supernovae this is somewhat unsettling since the type 1a supernovae are assumed to be \"standardizable candles\" from which important information concerning the dark energy can be derived. It should be expected that a more detailed understanding of supernovae dynamics could lead to a reduction of the errors in this relationship. Similarly, the current state of the standard model theory of gamma ray bursts, which in some cases have been associated with supernovae, has conceptual gaps not only in the central engine but also in the mechanism for jet collimation and the lack of baryon loading. We discuss here the Supersymmetric (susy) phase transition model for the central engine. △ Less", "We introduce the idea of bosonic see-saw mechanism in analogy with the see-saw mechanism. Bosonic see-saw is a new symmetry breaking mechanism and we apply it to explain electroweak symmetry breaking as an inevitable consequence of supersymmetry breaking. The breaking of electroweak symmetry occurs at tree level once supersymmetry is broken. Absence of color/charge breaking in this model is related to doublet-triplet splitting in grand unified theory. An extension of MSSM with a weak triplet shows very interesting results especially when mu =0. It provides the most natural understanding of why we have only electroweak symmetry breaking rather than having color/charge breaking. In the limit mu=0, the model predicts very light chargino mass, 104 GeV while Higgs is heavy, 130 GeV. △ Less", "We calculate one-loop R-parity violating corrections to the top quark decay into a bottom quark and a polarized W-gauge boson. The corrections are presented according to the total corrections, the longitudinal corrections and the transverse corrections, respectively. We compared our results with the ${\\cal O}(α_s)$ QCD corrections, the ${\\cal O}(α)$ electroweak (EW) and finite width corrections, and also the supersymmetric (SUSY) corrections with R-parity conservation, respectively. △ Less", "We discuss the construction of chiral four dimensional ${\\bf T^6/(Z_3 \\times Z_3)}$ orientifold compactifications of IIA theory, using D6-branes intersecting at angles and not aligned with the orientifold O6 planes. Cancellation of mixed U(1) anomalies requires the presence of a generalized Green-Schwarz mechanism mediated by RR partners of closed string untwisted moduli. In this respect we describe the appearance of three quark and lepton family $SU(3)_C \\times SU(2)_L \\times U(1)_Y$ non-supersymmetric orientifold models with only the massless spectrum of the SM at low energy that can have either no exotics present and three families of $ν_R$'s (A$^{\\prime}$-model class) or the massless fermion spectrum of the N=1 SM with a small number of massive non-chiral colour exotics and in one case with extra families of $ν_R$'s (B$^{\\prime}$-model class). Moreover we discuss the construction of SU(5), flipped SU(5) and Pati-Salam $SU(4)_c \\times SU(2)_L \\times SU(2)_R$ GUTS - the latter also derived from adjoint breaking - with only the SM at low energy. Some phenomenological features of these models are also briefly discussed. All models are constructed with the Weinberg angle to be 3/8 at the string scale. △ Less", "Detection of gamma rays from dark matter annihilation in the galactic center is one of the feasible techniques to search for dark matter. We evaluate the gamma ray flux in the case that the dark matter has an electroweak SU(2)_L charge. Such dark matter is realized in the minimal supersymmetric standard model (MSSM) when the lightest SUSY particle is the Higgsino- or Wino-like neutralino. When the dark matter is heavy compared to the weak gauge bosons, the leading-order calculation of the annihilation cross sections in perturbation breaks down due to a threshold singularity. We take into account non-perturbative effects by using the non-relativistic effective theory for the two-body states of the dark matter and its SU(2)_L partner(s), and evaluate precise cross sections relevant to the gamma ray fluxes. We find that the annihilation cross sections may be enhanced by several orders of magnitude due to resonances when the dark matter mass is larger than 1 TeV. Furthermore, the annihilation cross sections in the MSSM may be changed by factors even when the mass is about 500 GeV. We also discuss sensitivities to gamma ray signals from the galactic center in the GLAST satellite detector and the large Air Cerenkov Telescope arrays. △ Less", "The connection between the axion and right-handed neutrinos is explored in the framework of the minimal SUSY SO(10) model. The former is related to the Peccei-Quinn (PQ) solution to the strong CP problem and the latter is to the light Majorana neutrinos through the see-saw mechanism. In this model, a relative phase between $({\\bf 10,1,3}) (\\equiv {\\bf \\barΔ}_R) \\subset {\\bf \\bar{126}}$ and $({\\bf \\bar{10},1,3}) (\\equiv {\\bf Δ}_R) \\subset {\\bf 126}$ multiplets of ${\\rm SU}(4) \\times {\\rm SU}(2)_L \\times {\\rm SU}(2)_R \\subset {\\rm SO}(10)$ becomes a physical degree of freedom identified with the axion. Then, the PQ symmetry breaking scale ($Λ_{\\rm PQ}$) and the $B-L$ symmetry breaking scale ($Λ_{\\rm B-L}$) coincide through the VEV of ${\\bf \\barΔ}_R$. The scalar partner of the lightest right-handed neutrino is regarded as the inflaton, which gives a consistent density fluctuation for the CMB. △ Less", "The complete one-loop radiative corrections to third generation scalar fermions into gauge bosons Z and W^\\pm is considered. We focus on \\wt{f}_2 \\to Z \\wt{f}_1 and \\wt{f}_i \\to W^\\pm \\wt{f'}_j (f,f'=t,b). We include both SUSY-QCD, QED and full electroweak corrections. It is found that the electroweak corrections can be of the same order as the SUSY-QCD corrections. The two sets of corrections interfere destructively in some region of parameter space. The full one loop correction can reach 10% in some SUGRA scenario, while in model independent analysis like general MSSM, the one loop correction can reach 20% for large \\tanβand large trilinear soft breaking terms A_b. △ Less", "We explicitly show that minimal SUSY SO(10) Higgs-Higgsino mass matrices evaluated by various groups are mutually consistent and correct. We comment on the corresponding results of other authors. We construct one-to-one mappings of our approach to the approaches of other authors. △ Less", "In the minimal supersymmetric standard model extended by including right-handed neutrinos with see-saw mechanism, the neutrino Yukaka couplings can be as large as the top-quark Yukawa couplings and thus the neutrino/sneutrino may cause sizable effects in Higgs boson self-energy loops. Our explicit one-loop calculations show that the neutrino/sneutrino effects may have an opposite sign to top/stop effects and thus lighten the lightest Higgs boson. If the soft-breaking mass of the right-handed neutrino is very large (at the order of Majorana mass scale), such as in the split-SUSY scenario, the effects can lower the lightest Higgs boson mass by a few tens of GeV. So the Higgs mass bound of about 150 GeV in split-SUSY may be lowered significantly if right-handed neutrinos come into play with see-saw mechanism. △ Less", "We analyze the parameter space of the (mu > 0, A_0 = 0) CMSSM at large tan beta with a small degree of non-universality originating from D-terms and Higgs-sfermion splitting inspired by SO(10) GUT models. The effects of such non-universalities on the sparticle spectrum and observables such as (g-2)_mu, B(b -> X_s gamma), the SUSY threshold corrections to the bottom mass and Omega_CDM h^2 are examined in detail and the consequences for the allowed parameter space of the model are investigated. We find that even small deviations to universality can result in large qualitative differences compared to the universal case; for certain values of the parameters, we find, even at low m_16, that radiative electroweak symmetry breaking fails as a consequence of either |mu|^2 < 0 or m_(A^0)^2 < 0. We find particularly large departures from the mSugra case for the neutralino relic density, which is sensitive to significant changes in the position and shape of the A^0 resonance and a substantial increase in the Higgsino component of the LSP. However, we find that the corrections to the bottom mass are not sufficient to allow for Yukawa unification. △ Less", "In recently introduced Split Susy theories, in which the scale of Susy breaking is very high, the requirement that the relic abundance of the Lightest SuperPartner (LSP) provides the Dark Matter of the Universe leads to the prediction of fermionic superpartners around the weak scale. This is no longer obviously the case if the LSP is a hidden sector field, such as a Gravitino or an other hidden sector fermion, so, it is interesting to study this scenario. We consider the case in which the Next-Lightest SuperPartner (NLSP) freezes out with its thermal relic abundance, and then it decays to the LSP. We use the constraints from BBN and CMB, together with the requirement of attaining Gauge Coupling Unification and that the LSP abundance provides the Dark Matter of the Universe, to infer the allowed superpartner spectrum. As very good news for a possible detaction of Split Susy at LHC, we find that if the Gravitino is the LSP, than the only allowed NLSP has to be very purely photino like. In this case, a photino from 700 GeV to 5 TeV is allowed, which is difficult to test at LHC. We also study the case where the LSP is given by a light fermion in the hidden sector which is naturally present in Susy breaking in Extra Dimensions. We find that, in this case, a generic NLSP is allowed to be in the range 1-20 TeV, while a Bino NLSP can be as light as tens of GeV. △ Less", "Provided that Supersymmetry (SUSY) is realized, the Large Hadron Collider (LHC) and the future International Linear Collider (ILC) may provide a wealth of precise data from SUSY processes. An important task will be to extract the Lagrangian parameters. On this basis the goal is to uncover the underlying symmetry breaking mechanism from the measured observables. In order to determine the SUSY parameters, the program Fittino has been developed. It uses an iterative fitting technique and a Simulated Annealing algorithm to determine the SUSY parameters directly from the observables without any a priori knowledge of the parameters, using all available loop-corrections to masses and couplings. Simulated Annealing is implemented as a stable and efficient method for finding the optimal parameter values. The theoretical predictions can be provided from any program with SUSY Les Houches Accord interface. As fit result, a set of parameters including the full error matrix and two-dimensional uncertainty contours are obtained. Pull distributions can automatically be created and allow an independent cross-check of the fit results and possible systematic shifts in the parameter determination. A determination of the importance of the individual observables for the measurement of each parameter can be performed after the fit. A flexible user interface is implemented, allowing a wide range of different types of observables and a wide range of parameters to be used. △ Less", "We clarify inflaton models by considering them as effective field theories in the Ginzburg-Landau spirit.In this new approach, the precise form of the inflationary potential is constructed from the present WMAP data, and a useful scheme is prepared to confront with the forthcoming data. In this approach, the WMAP statement excluding the pure phi^4 potential implies the presence of an inflaton mass term at the scale m sim 10^{13}GeV. Chaotic, new and hybrid inflation is studied in an unified way. In all cases the inflaton potential takes the form V(phi) = m^2 M_{Pl}^2 v(phi/M_{Pl}), where all coefficients in the polynomial v(x) are of order one. If such potential corresponds to super symmetry breaking, the susy breaking scale is sqrt{m M_{Pl}} \\sim 10^{16}GeV which turns to coincide with the GUT scale. The inflaton mass is therefore given by a see-saw formula m sim M_{GUT}^2/M_{Pl}. The observables turn to be two valued functions: one branch corresponds to new inflation and the other to chaotic inflation,the branch point being the pure quadratic potential.For red tilt spectrum, the potential which fits the best the present data and which best prepares the way for the forthcoming data is a trinomial polynomial withnegative quadratic term (new inflation).For blue tilt spectrum, hybrid inflation turns to be the best choice. In both cases we find a formula relating the inflaton mass with the ratio r of tensor/scalar perturbations and the spectral index ns of scalar perturbations: 10^6 m/M_{Pl}= 127 sqrt{r|1-n_s|} ;(the coefficient 127 follows from the WMAP amplitude.Implications for string theory are discussed. △ Less", "We argue that in the simplest version of the KKLT model, the maximal value of the Hubble constant during inflation cannot exceed the present value of the gravitino mass, H< m_{3/2}. This may have important implications for string cosmology and for the scale of the SUSY breaking in this model. If one wants to have inflation on high energy scale, one must develop phenomenological models with an extremely large gravitino mass. On the other hand, if one insists that the gravitino mass should be O(1 TeV), one will need to develop models with a very low scale of inflation. We show, however, that one can avoid these restrictions in a more general class of KKLT models based on the racetrack superpotential with more than one exponent. In this case one can combine a small gravitino mass and low scale of SUSY breaking with the high energy scale of inflation. △ Less", "The common belief that the lightest supersymmetric particle (LSP) might be a neutralino, providing also the main Dark Matter (DM) component, calls for maximal detail in the study of the neutralino properties. Motivated by this, we consider the direct production of a single neutralino $\\tchi^0_i$ at a high/energy hadron collider, focusing on the $\\tchi^0_1$ and $\\tchi^0_2$ cases. At Born level, the relevant subprocesses are $q\\bar q\\to \\tchi^0_i \\tilde g$, $g q\\to \\tchi^0_i \\tilde q_{L,R}$ and $q\\bar q'\\to \\tchi^0_i\\tchi^\\pm_j$; while at 1-loop, apart from radiative corrections to these processes, we consider also $gg\\to \\tchi^0_i\\tilde{g}$, for which a numerical code named PLATONgluino is released. The relative importance of these channels turns out to be extremely model dependent. Combining these results with an analogous study of the direct $\\tchi^0_i\\tchi^0_j$ pair production, should help in testing the SUSY models and the Dark Matter assignment. △ Less", "In SUSY models, it is still possible to have large signals even if the current data on $K$ and $B$ systems are consistent with the CKM paradigm for flavor mixing and CP violation. I first discuss $b\\to d$ and $b\\to s$ transitions including time-dependent CP asymmetries in $B_d \\to φK_s$, and usefulness of $B_s \\to μ^+ μ^-$ to distinguish various SUSY breaking mechanisms. Then I will discuss some possible connections between B physics and cosmology: (i) B physics and electroweak baryogenesis within SUSY models, and (ii) the correlation between the neutralino dark matter scattering and $B (B_s \\to μ^+ μ^-)$. △ Less", "In many SUSY models the first SUSY signal in the proposed International Linear Collider is expected to come from the pair production of $\\tildeτ_1$, followed by its decay into $τ$+LSP. We study a simple and robust method of measuring the polarization of this $τ$ in its 1-prong hadronic decay channel,and show how it can be used to discriminate between SUSY models and to determine SUSY parameters. △ Less", "Little Higgs models offer an interesting approach to weakly coupled electroweak symmetry breaking without fine tuning. The original little Higgs models were plagued by strong constraints from electroweak precision data which required a fine tuning to be reintroduced. An economical solution to this problem is to introduce a discrete symmetry (analogous to R-parity of SUSY) called T-parity. T-parity not only eliminates most constraints from electroweak precision data, but it also leads to a promising dark matter candidate. In this paper we investigate the dark matter candidate in the littlest Higgs model with T-parity. We find bounds on the symmetry breaking scale f as a function of the Higgs mass by calculating the relic density. We begin the study of the LHC phenomenology of the littlest Higgs model with T-parity. We find that the model offers an interesting collider signature that has a generic missing energy signal which could \"fake\" SUSY at the LHC. We also investigate the properties of the heavy partner of the top quark which is common to all littlest Higgs models, and how its properties are modified with the introduction of T-parity. We include an appendix with a list of Feynman rules specific to the littlest Higgs with T-parity to facilitate further study. △ Less", "We consider F and D-term cosmic strings formed in supersymmetric theories. Supersymmetry is broken inside the string core, but restored outside. In global SUSY, this implies the existence of goldstino zero modes, and the string potentially carries fermionic currents. We show that these zero modes do not survive the coupling to gravity, due to the super Higgs mechanism. Therefore the superconductivity and chirality properties are different in global and local supersymmetry. For example, a string formed at the end of D-term inflation is chiral in supergravity but non-chiral in global SUSY. △ Less", "The gauge-Higgs unification theory identifies the zero mode of the extra dimensional component of the gauge field as the usual Higgs doublet. Since this degree of freedom is the Wilson line phase, the Higgs does not have the mass term nor quartic coupling at the tree level. Through quantum corrections, the Higgs can take a vacuum expectation value, and its mass is induced. The radiatively induced mass tends to be small, although it can be lifted to ${\\mathcal O}(100)$ GeV by introducing the ${\\mathcal O}(10)$ numbers of bulk fields. Perturbation theory becomes unreliable when a large number of bulk fields are introduced. We reanalyze the Higgs mass based on useful expansion formulae for the effective potential and find that even a small number of bulk field can have the suitable heavy Higgs mass. We show that a small (large) number of bulk fields are enough (needed) when the SUSY breaking mass is large (small). We also study the case of introducing the soft SUSY breaking scalar masses in addition to the Scherk-Schwarz SUSY breaking and obtain the heavy Higgs mass due to the effect of the scalar mass. △ Less", "Recently BABAR and Belle have measured anomalous large transverse polarizations in some pure penguin $B \\to VV$ decays, which might be inconsistent with the Standard Model expectations. We try to explore its implications for R-parity violating (RPV) supersymmetry. The QCD factorization approach is employed for the hadronic dynamics of B decays. We find that it is possible to have parameter spaces solving the anomaly. Furthermore, we have derived stringent bounds on relevant RPV couplings from the experimental data, which is useful for further studies of RPV phenomena. △ Less", "The SUSY hybrid inflation model is found to dissipate radiation during the inflationary period. Analysis is made of parameter regimes in which these dissipative effects are significant. The scalar spectral index, its running, and the tensor-scalar ratio are computed in the entire parameter range of the model. A clear prediction for strong dissipative warm inflation is found for n_S-1 \\simeq 0.98 and a low tensor-scalar ratio much below 10^{-6}. The strong dissipative warm inflation regime also is found to have no η-problem and with the field amplitude much below the Planck scale. As will be discussed, this has important theoretical implications in permitting a much wider variety of SUGRA extensions to the basic model. △ Less", "We present some phenomenology of a new class of intersecting D-brane models. Soft SUSY breaking terms for these models are calculated in the u - moduli dominant SUSY breaking approach (in type IIA). In this case, the dependence of the soft terms on the Yukawas and Wilson lines drops out. These soft terms have a different pattern compared to the usual heterotic string models. Phenomenological implications for dark matter are discussed. △ Less", "The SUSY signals in the dominant stau-neutralino coannihilation region at a 500(800) GeV linear collider are investigated. The region is consistent with the WMAP measurement of the cold dark matter relic density as well as all other current experimental bounds within the mSUGRA framework. The signals are characterized by an existence of very low-energy tau leptons in the final state due to small mass difference between stau_1 and chi_1 (5-15 GeV). We study the accuracy of the mass difference measurement with a 1^deg active mask to reduce a huge SM two-photon background. △ Less", "We discuss the structure of the soft supersymmetry breaking terms in a MSSM like model, which can be derived from D7-branes with chiral matter fields from 2-form f-fluxes and supersymmetry breaking from 3-form G-fluxes. △ Less", "If R-parity conserving supersymmetry exists below the TeV-scale, new particles will be produced and decay in cascades at the LHC. The lightest supersymmetric particle will escape the detectors, thereby complicating the full reconstruction of the decay chains. In this paper we expand on existing methods for determining the masses of the particles in the cascade from endpoints of kinematical distributions. We perform scans in the mSUGRA parameter space to delimit the region where this method is applicable. From the examination of theoretical distributions for a wide selection of mass scenarios it is found that caution must be exerted when equating the theoretical endpoints with the experimentally obtainable ones. We provide analytic formulae for the masses in terms of the endpoints most readily available. Complications due to the composite nature of the endpoint expressions are discussed in relation to the detailed analysis of two points on the SPS~1a line. Finally we demonstrate how a Linear Collider measurement can improve dramatically on the precision of the masses obtained. △ Less", "In the Top-down scenarios, the decay of super-heavy particles (m~10^{12-16}GeV), situated in dark-matter halos not very far from our Galaxy, can explain the ultra-high-energy (UHE) cosmic-ray spectrum beyond the Griesen-Zatasepin-Kuzmin cut-off. In the MSSM, a major component of the UHE cosmic-ray flux at PeV-EeV energies could be given by the lightest neutralino χ, that is the lightest stable supersymmetric particle. Then, the signal of UHE χ's on earth might emerge over the interactions of a comparable neutrino component. We compute the event rates for the resonant production of \"right\" selectrons and \"right\" squarks in mSUGRA, when UHE neutralinos of energy larger than 10^5 GeV scatter off electrons and quarks in an earth-based detector like IceCube. When the resonant channel dominates in the total χ-e,χ-q scattering cross section, the only model parameters affecting the corresponding visible signal rates turn out to be the physical masses of the resonant right-scalar and of the lightest neutralino. We compare the expected number of supersymmetric events with the rates corresponding to the expected Glashow W resonance and to the continuum UHE ν-N scattering for realistic power-law spectra. We find that the event rate in the leptonic selectron channel is particularly promising, and can reach a few tens for a one-year exposure in IceCube. Finally, we note that UHE neutralinos at much higher energies (up to hundreds ZeV) may produce sneutrino resonances by scattering off relic neutrinos in the Local Group hot dark halo. The consequent \\tildeν-burst into hadronic final states could mimic Z-burst events, although with quite smaller conversion efficiency. △ Less", "We consider various processes of single top production at LHC in the theoretical framework of the MSSM and examine the role of the supersymmetric electroweak one-loop corrections in a special moderately light SUSY scenario, in an initial parton-pair c.m. high energy range where a logarithmic asymptotic expansion of Sudakov type can be used. We show that the electroweak virtual effects are systematically large, definitely beyond the relative ten percent size, particularly for a final $tH^-$ pair where a special enhancement is present. We show then in a qualitative way the kind of precision tests of the model that would be obtainable from accurate measurements of the energy distributions of the various cross sections and of the top polarization asymmetries. △ Less", "New version of the MSSM scales is discussed. In this version mu << M_{SUSY} ~ M_0 ~ M_{1/2}, where mu is the Higgsino mass, M_0 is the mass scale of sleptons and squarks, M_{1/2} is the mass scale of gaugino. Renormalization group motivation of this MSSM version is proposed. The radiation corrections give main contribution to the splitting of neutralino and chargino masses if M_{SUSY} > 10^7 GeV. Calculation of the mass difference has led to the value M_{chi_1^\\pm}-M_{chi_{1,2}^0} ~ 360 MeV at M_{chi} ~ mu ~ 3 TeV. The mean life time of charged Higgsino in this model is tau_{chi_1^\\pm} ~ 0.4 * 10^{-9} s. The analysis of the residual neutralino concentration in the cosmological plasma is developed and the value of Higgsino mass is estimated: M_{chi} ~ 3 TeV. Formation of the residual neutralino concentration occurs in the high symmetric phase of the cosmological plasma. Problems of the relic Higgsinos searches at the underground laboratory NUSEL and Galactic neutralino annihilation radiation at the satellite detector GLAST are discussed. △ Less", "We derive an off-shell formulation for the boundary Fayet-Iliopoulos (FI) terms in locally supersymmetric U(1) gauge theory on 5D $S^1/Z_2$ orbifold. Some physical consequences of such FI terms, e.g., the supersymmetry breaking and the generation of 5D kink mass for hypermultiplet are studied within the full supergravity framework. We especially find that the supersymmetry is broken by the FI term without charged hypermultiplet for models giving an AdS$_5$ geometry. △ Less", "Supersymmetric contributions to the neutron electric dipole moment (EDM) are studied taking account of the flavor changing interactions. We found that the gluino contribution is sensitive to the flavor changing interaction. Enhancement of neutron EDM via flavor mixing effects is possible when the squark mass difference between the different generations is sizable. As an example, the results of the SUSY SU(5) GUT with right-handed neutrinos are briefly discussed. △ Less", "We study new physics effects on B decay processes including a final $τ$ particle, namely $B \\to D τν$ and $B \\to τν$. An important feature of these processes is that a charged Higgs boson can contribute to the decay amplitude at the tree level in models such as Two Higgs Doublet Model and the Minimal Supersymmetric Standard Model (MSSM). We derive a resummed effective Lagrangian for charged-Higgs mediated interactions in the MSSM with the Minimal Flavor Violation. Including supersymmetric (SUSY) loop corrections for down-type-quark and charged-lepton Yukawa couplings, we calculate the branching ratios of the $B \\to D τν$ and $B \\to τν$ processes. We find that SUSY correction due to gluino-sbottom diagrams can change the Higgs exchange contribution by $\\pm50$%, whereas stau-neutralino diagrams can make corrections up to 20%. We also discuss relationship between SUSY corrections in the tauonic decays and flavor changing neutral current processes such as $B_s \\to μ^+μ^-$ and $b \\to s γ$. △ Less", "In the standard model, energy release in dense stars is severely restricted by the Pauli exclusion principle. However, if, in regions of space of high fermion degeneracy, there is a phase transition to a state of exact supersymmetry (SUSY), fermion to sfermion pair conversion followed by radiative transitions to the Bose ground state could lead to a highly collimated gamma ray burst. We calculate the cross section for electron to selectron pair conversion in a SUSY bubble and construct a monte carlo for the resulting sfermion amplification by stimulated emission. △ Less", "We propose that the radion chiral supermultiplet of five dimensional compactified supergravity is obtained by reduction of the graviphoton gauge multiplet to N=1 superfields in the off shell 5D superconformal gravity formalism of Fujita, Kugo and Ohashi. We present a superfield Lagrangian of Chern-Simons type (similar to global SUSY), which reproduces all component couplings of gauge fields and the radion. A hypermultiplet superspace action is also proposed which correctly accounts for the coupling of matter multiplets with gauge and radion superfields. 4D supergravity enters by the coupling to the 4D Weyl multiplet, an even orbifold parity multiplet embedded in the 5D Weyl multiplet. We apply this formalism to a discussion of Fayet-Iliopolous terms, and the gauging of orbifold SUGRA to obtain warped solutions. △ Less", "A striking aspect of the recently proposed split supersymmetry is the existence of heavy gluinos which are metastable because of the very heavy squarks which mediate their decay. In this paper we correlate the expected flux of these particles with the accompanying neutrino flux produced in inelastic $pp$ collisions in distant astrophysical sources. We show that an event rate at the Pierre Auger Observatory of approximately 1 yr$^{-1}$ for gluino masses of about 500 GeV is consistent with existing limits on neutrino fluxes. The extremely low inelasticity of the gluino-containing hadrons in their collisions with the air molecules makes possible a distinct characterization of the showers induced in the atmosphere. Should such anomalous events be observed, we show that their cosmogenic origin, in concert with the requirement that they reach the Earth before decay, leads to a lower bound on their proper lifetime of the order of 100 years, and consequently, to a lower bound on the scale of supersymmetry breaking, $Λ_{\\rm SUSY} >2.6 \\times 10^{11}$ GeV. Obtaining such a bound is not possible in collider experiments. △ Less", "In the framework of the CMSSM we study the gravitino as the lightest supersymmetric particle and the dominant component of cold dark matter in the Universe. We include both a thermal contribution to its relic abundance from scatterings in the plasma and a non--thermal one from neutralino or stau decays after freeze--out. In general both contributions can be important, although in different regions of the parameter space. We further include constraints from BBN on electromagnetic and hadronic showers, from the CMB blackbody spectrum and from collider and non--collider SUSY searches. The region where the neutralino is the next--to--lightest superpartner is severely constrained by a conservative bound from excessive electromagnetic showers and probably basically excluded by the bound from hadronic showers, while the stau case remains mostly allowed. In both regions the constraint from CMB is often important or even dominant. In the stau case, for the assumed reasonable ranges of soft SUSY breaking parameters, we find regions where the gravitino abundance is in agreement with the range inferred from CMB studies, provided that, in many cases, a reheating temperature $\\treh$ is large, $\\treh\\sim10^{9}\\gev$. On the other side, we find an upper bound $\\treh\\lsim 5\\times 10^{9}\\gev$. Less conservative bounds from BBN or an improvement in measuring the CMB spectrum would provide a dramatic squeeze on the whole scenario, in particular it would strongly disfavor the largest values of $\\treh\\sim 10^{9}\\gev$. The regions favored by the gravitino dark matter scenario are very different from standard regions corresponding to the neutralino dark matter, and will be partly probed at the LHC. △ Less", "A general coupling of the Goldstino to the matter field and the weak gravitational field is constructed based on the standard and the nonlinear Volkov-Akulov realization of SUSY. The resulting Lagrangian, which is invariant under SUSY transformations, can give rise to explicit interactions which couple the helicity +-1/2 states of the gravitino with the gravitational field as well as the matter field. △ Less", "We investigate the split supersymmetry (SUSY) scenario recently proposed by Arkani-Hamed and Dimopoulos, where the scalars are heavy but the fermions are within the TeV range. We show that the sparticle spectrum in such a case crucially depends on the specific details of the mechanism underlying the SUSY breaking scheme, and the accelerator signals are also affected by it. In particular, we demonstrate in the context of a braneworld-inspired model, used as illustration in the original work, that a new fermion $ψ_X$, arising from the SUSY breaking sector, is shown to control low-energy phenomenology in several cases. Also, SUSY signals are characterised by the associated production of the light neutral Higgs. In an alternative scenario where the gauginos are assumed to propagate in the bulk, we find that gluinos can be heavy and short-lived, and the SUSY breaking scale can be free of cosmological constraints △ Less", "The neutralino-nucleon (\\tildeχ^0-N) scattering is an important process for direct dark matter searches. In this paper we discuss one-loop contributions to the cross section in the wino-like and Higgsino-like LSP cases. The neutralino-nucleon scattering mediated by the Higgs \\tildeχ^0\\tildeχ^0 and Z\\tildeχ^0\\tildeχ^0 couplings at tree level is suppressed by the gaugino-Higgsino mixing at tree level when the neutralino is close to a weak eigenstate. The one-loop contribution to the cross section, generated by the gauge interaction, is not suppressed by any SUSY particle mass or mixing in the wino- and Higgsino-like LSP cases. It may significantly alter the total cross section when σ_{\\tildeχ^0 N}\\sim 10^{-45} cm^2 or less. △ Less", "The Fortran code NMHDECAY computes the masses, couplings and decay widths of all Higgs bosons of the NMSSM in terms of its parameters at the electroweak (SUSY breaking) scale: the Yukawa couplings lambda and kappa, the soft trilinear terms A_lambda and A_kappa, and tan(beta) and mu_eff = lambda*<S>. The computation of the spectrum includes leading two loop terms, electroweak corrections and propagator corrections. The computation of the decay widths is carried out as in HDECAY, but (for the moment) without three body decays. Each point in parameter space is checked against negative Higgs bosons searches at LEP, including unconventional channels relevant for the NMSSM. One version of the program uses generalized SLHA conventions for input and output. △ Less", "The requirement that the supersymmetric scalar potential be stable in the minimal supergravity (mSUGRA) model imposes an upper bound on the universal gaugino mass $m_{1/2}$ as function of the common scalar mass $m_0$. Combining this with the experimental lower bound on $m_{1/2}$ from LEP data, we find a new lower bound on $m_0$, stronger than the one that comes from experimental data alone. If the corresponding upper and lower limits on the superparticle masses, presented in this letter, are found to be violated at Tevatron Run II or at the LHC, it would imply that we are living on a false vacuum. Special attention has been paid in estimating the uncertainties in these predictions due to the choice of the renormalization scale. The implications of our limits for the constraints obtained by indirect methods(SUSY dark matter, g - 2 of the muon, $ b \\to s γ$....) are briefly discussed. △ Less", "Within the context of SUSY GUTs, cosmic strings are generically formed at the end of hybrid inflation. However, the WMAP CMB measurements strongly constrain the possible cosmic strings contribution to the angular power spectrum of anisotropies. We investigate the parameter space of SUSY hybrid (F- and D- term) inflation, to get the conditions under which theoretical predictions are in agreement with data. The predictions of F-term inflation are in agreement with data, only if the superpotential coupling $κ$ is small. In particular, for SUSY SO(10), the upper bound is $κ\\lsim 7\\times 10^{-7}$. This fine tuning problem can be lifted if we employ the curvaton mechanism, in which case $κ\\lsim 8\\times 10^{-3}$; higher values are not allowed by the gravitino constraint. The constraint on $κ$ is equivalent to a constraint on the SSB mass scale $M$, namely $M \\lsim 2\\times 10^{15}$ GeV. The study of D-term inflation shows that the inflaton field is of the order of the Planck scale; one should therefore consider SUGRA. We find that the cosmic strings contribution to the CMB anisotropies is not constant, but it is strongly dependent on the gauge coupling $g$ and on the superpotential coupling $λ$. We obtain $g\\lsim 2\\times 10^{-2}$ and $λ\\lsim 3\\times 10^{-5}$. SUGRA corrections induce also a lower limit for $λ$. Equivalently, the Fayet-Iliopoulos term $ξ$ must satisfy $\\sqrtξ\\lsim 2\\times 10^{15}$ GeV. This constraint holds for all allowed values of $g$. △ Less", "We study the finely tuned SSM, recently proposed by Arkani-Hamed and Dimopoulos, at the one loop level. The runnings of the four gaugino Yukawa couplings, the mu term, the gaugino masses, and the Higgs quartic coupling are computed. The Higgs mass is found to be 130 - 170 GeV for M_s > 10^6 GeV. If the Yukawa coupling constants are measured at the 1% level, this can determine the SUSY breaking scale to within an order of magnitude. Measuring the relationships between the couplings to this accuracy provides a striking signal for this model. △ Less", "It is pointed out that there is a strong correlation between the neutralino dark matter scattering cross section $σ_{\\tildeχ p}$ and the branching ratio for $B_s \\to μ^+ μ^-$ within minimal supergravity (mSUGRA) and its extensions. This correlation arises mainly from $\\tanβ$ and heavy neutral Higgs mass dependence, and shows a nice interplay between vastly different two observables within supersymmetric models. Current upper limit on $B(B_s \\to μ^+ μ^-) < 5.8 \\times 10^{-7}$ excludes substantial parameter space where $σ_{\\tildeχ p}$ is within the CDMS sensitivity region. △ Less", "The complete tables of Clebsh-Gordan (CG) coefficients for a wide class of SO(10) SUSY grand unified theories (GUTs) are given. Explicit expression of all states and corresponding multiplets under standard model gauge group G_{321} = SU(3)_C x SU(2)_L x U(1)_Y, necessary for evaluation of the CG coefficients are presented. The SUSY SO(10) GUT model considered here incudes most of the Higgs irreducible representations usually used in the literature: 10, 45, 54, 120, 126 126-bar and 210. Mass matrices of all G_{321} multiplets are found for the most general superpotential. These results are indispensible for the precision calculations of the gauge coupling unification and proton decay, etc. △ Less", "We compute the genuine SUSY one-loop quantum contributions to flavour-changing MSSM Higgs-boson decays into $b \\bar s$ and $s \\bar b$ using the full diagrammatic approach that is valid for all $\\tan β$ values and do not rely on the mass-insertion approximation for the characteristic flavour-changing parameter. We analyze in full detail the dependence of these flavour-changing partial widths on all the relevant MSSM parameters and also study the non-decoupling behaviour of these widths with the SUSY mass parameters. We find that these contributions are sizable as compared to the SM ones, and can be very efficient as an indirect method in the future search for Supersymmetry. △ Less", "We compute the complete gauge and chiral superheavy mass spectrum and couplings of the Minimal Susy GUT (based on the $ \\bf {210- \\oot- 126-10}$ irreps as the Higgs system) by decomposing SO(10) labels in terms of Pati Salam subgroup labels. The spectra are sensitive functions of the single complex parameter that controls MSGUT symmetry breaking. We scan for the dependence of the threshold corrections to the Weinberg angle and Unification scale as functions of this parameter. We find that for generic values of the GUT scale parameters the modifications are within 10% of the one loop values and can be much smaller for significant regions of the parameter space. This shows that contrary to longstanding conjectures, high precision calculations are not futile but rather necessary and feasible in the MSGUT. The couplings of the matter supermultiplets are made explicit and used to identify the channels for exotic ($ΔB\\neq 0$) processes and to write down the associated bare $d=5$ operators (some of both are novel). The mass formulae for all matter fermions are derived. This sets the stage for a comprehensive RG based phenomenological analysis of the MSGUT. △ Less", "Supersymmetric extensions of the Standard Model contain non-topological solitons, Q-balls, which can be stable and can be a form of cosmological dark matter. Understanding the interaction of SUSY Q-balls with matter fermions is important for both astrophysical limits and laboratory searches for these dark matter candidates. We show that a baryon scattering off a baryonic SUSY Q-ball can convert into its antiparticle with a high probability, while the baryon number of the Q-ball is increased by two units. For a SUSY Q-ball interacting with matter, this process dominates over those previously discussed in the literature. △ Less", "We present results for the three-loop universal anomalous dimension of Wilson twist-2 operators in the N=4 Supersymmetric Yang-Mills model. These results are obtained by extracting the most complicated contributions from the three loop non-singlet anomalous dimensions in QCD which were calculated recently. Their singularities at j=1 agree with the predictions obtained from the BFKL equation for N=4 SYM in the next-to-leading order. The asymptotics of universal anomalous dimension at large j is in an agreement with the expectations based on an interpolation between weak and strong coupling regimes in the framework of the AdS/CFT correspondence. △ Less", "The seesaw mechanism that explains the small neutrino masses comes naturally with supersymmetric (SUSY) grand unification and leptogenesis. However, the framework suffers from the SUSY flavor and CP problems, and has a severe cosmological gravitino problem. We propose anomaly mediation as a simple solution to all these problems, which is viable once supplemented by the D-terms for U(1)_Y and U(1)_{B-L}. Even though the right-handed neutrino mass explicitly breaks U(1)_{B-L} and hence reintroduces the flavor problem, we show that it lacks the logarithmic enhancement and poses no threat to the framework. The thermal leptogenesis is then made easily consistent with the gravitino constraint. △ Less", "Inspired by the exotic measurements on the CP asymmetry in $B\\to φK_{s}$, we study a new diagram in supersymmetric models which can make the difference $\\sin2φ^{eff}_{1}(J/ΨK_{s})-\\sin2φ^{eff}_{1}(φK_{s})$ to be $20-50%$ after satisfying the constraint from $b\\to s γ$. We also find that the direct CP asymmetry of $b\\to s γ$ could be $\\sim 10%$ and testable at $B$ factories. △ Less", "A spontaneously broken non-Abelian SU(3) family symmetry can generate a realistic form for quark, charged lepton and neutrino masses and mixing angles. It also gives a new solution to the SUSY flavour problem by ensuring near family degeneracy of the soft mass SUSY breaking terms. However the need to generate large third generation fermion masses means that the group must be strongly broken to SU(2) giving significant corrections to the third family squark and slepton masses. We investigate the phenomenological implications of such breaking and show that it leads to new solutions capable of fitting all present experimental measurements and bounds as well as the dark matter abundance. △ Less", "The flavor changing top quark decays t -> cV (V=Z,photon,gluon) induced by R-parity-violating couplings in the minimal supersymmetric standard model (MSSM) are evaluated. We find that the decays t -> cV can be significantly enhanced relative to those in the R-parity conserving SUSY model. Our results show that the top quark FCNC decay can be as large as Br(t->cg)=10^-3, Br(t->cZ)=10^-4 and Br(t-> cγ)= 10^-5, which may be observable at the upgraded Tevatron and/or the LHC. △ Less"]