["We construct universal parton evolution equation that produces space- and time-like anomalous dimensions for the maximally super-symmetric N=4 Yang--Mills field theory model, and find that its kernel satisfies the Gribov--Lipatov reciprocity relation in three loops. Given a simple structure of the evolution kernel, this should help to generate the major part of multi-loop contributions to QCD anomalous dimensions, due to classical soft gluon radiation effects. △ Less", "We address the question of dark matter in the context of gauge mediated supersymmetry breaking models. In contrast with mSUGRA scenarios, the messenger of the susy breaking to the visible sector can play an important role allowing a relic gravitino in the $\\sim {keV}$ to $10 {MeV}$ mass range to account for the cold dark matter in the Universe. △ Less", "We construct a calculable model of low-energy direct gauge mediation making use of the metastable supersymmetry breaking vacua recently discovered by Intriligator, Seiberg and Shih. The standard model gauge group is a subgroup of the global symmetries of the SUSY breaking sector and messengers play an essential role in dynamical SUSY breaking: they are composites of a confining gauge theory, and the holomorphic scalar messenger mass appears as a consequence of the confining dynamics. The SUSY breaking scale is around 100 TeV nevertheless the model is calculable. The minimal non-renormalizable coupling of the Higgs to the DSB sector leads in a simple way to a mu-term, while the B-term arises at two-loop order resulting in a moderately large tan beta. A novel feature of this class of models is that some particles from the dynamical SUSY breaking sector may be accessible at the LHC. △ Less", "$τ$ leptons emitted in cascade decays of supersymmetric particles are polarized. The polarization may be exploited to determine spin and mixing properties of the neutralinos and stau particles involved. △ Less", "In minimal supergravity, the parameter space where the slepton is the LSP is usually neglected, because of strong constraints on charged dark matter. When the gravitino is the true LSP, this region avoids these constraints and offers spectacular collider signals. We investigate this scenario for the LHC and find that a large portion of the ignored mSugra parameter space can lead to discovery within the first physics run, with 1-4 $\\text{fb}^{-1}$ of data. We find that there are regions where discovery is feasible with only 1 day of running. △ Less", "We re-examine the constraints on continuous family symmetries coming from flavour changing neutral current limits on the D-term contributions to squark and slepton masses. We show that, for a restricted choice of the familon sector, continuous family symmetries are consistent with even the most conservative limits both for the case of gauge mediated supersymmetry breaking and the case of gravity mediated supersymmetry breaking. △ Less", "The current status of axion physics is presented. There still exists the axion window 10^9 GeV < F_a < 10^{12} GeV. The recent CAST solar axion search experiment on the axion-photon-photon coupling strength has to be improved by a factor of 100 to reach down to the region of superstring axions. The calculable theta and m_u=0 cases for strong CP solutions, and axino cosmology in SUSY extension of axion are also commented. △ Less", "NMSPEC is a Fortran code that computes the sparticle and Higgs masses, as well as Higgs decay widths and couplings in the NMSSM, with soft SUSY breaking terms specified at MGUT. Exceptions are the soft singlet mass m_s^2 and the singlet self coupling kappa, that are both determined in terms of the other parameters through the minimization equations of the Higgs potential. We present a first analysis of the NMSSM parameter space with universal SUSY breaking terms at MGUT -- except for m_s and A_kappa -- that passes present experimental constraints on sparticle and Higgs masses. We discuss in some detail a region in parameter space where a SM-like Higgs boson decays dominantly into two CP odd singlet-like Higgs states. △ Less", "We consider fermion masses and mixings in a renormalizable SUSY SO(10) GUT with Yukawa couplings of scalar fields in the representation 10 + 120 + 126 bar. We investigate a scenario defined by the following assumptions: i) A single large scale in the theory, the GUT scale. ii) Small neutrino masses generated by the type I seesaw mechanism with negligible type II contributions. iii) A suitable form of spontaneous CP breaking which induces hermitian mass matrices for all fermion mass terms of the Dirac type. Our assumptions define an 18-parameter scenario for the fermion mass matrices for 18 experimentally known observables. Performing a numerical analysis, we find excellent fits to all observables in the case of both the normal and inverted neutrino mass spectrum. △ Less", "We investigate the pure penguin process $B^-\\to π^-φ$ using QCD factorization approach to calculate hadronic matrix elements to the $α_s$ order in some well-known NP models. It is shown that the NP contributions in R-parity conserved SUSY models and 2HDMs are not enough to saturate the experimental upper bounds for $B\\to φπ$. We have shown that the flavor changing $Z^\\prime$ models can make the branching ratios of $B\\to φπ$ to saturate the bound under all relevant experimental constraints. △ Less", "Supersymmetry (SUSY) remains one of the leading candidates for physics beyond the Standard Model, and the search for SUSY will be a central focus of future collider experiments. Complementary information on the viability and character of SUSY can be obtained via the analysis of precision electroweak measurements. In this review, we discuss the prospective implications for SUSY of present and future precision studies at low energy. △ Less", "String theoretic axion is a prime candidate for the QCD axion solving the strong CP problem. For a successful realization of the QCD axion in string theory, one needs to stabilize moduli including the scalar partner (saxion) of the QCD axion, while keeping the QCD axion unfixed until the low energy QCD instanton effects are turned on. We note that a simple generalization of KKLT moduli stabilization provides such set-up realizing the axion solution to the strong CP problem. Although some details of moduli stabilization are different from the original KKLT scenario, this set-up leads to the mirage mediation pattern of soft SUSY breaking terms as in the KKLT case, preserving flavor and CP as a consequence of approximate scaling and axionic shift symmetries. The set-up also gives an interesting pattern of moduli masses which might avoid the cosmological moduli, gravitino and axion problems. △ Less", "We investigate the effects of quantum entanglement between our horizon patch and others due to the tracing out of long wavelength modes in the wavefunction of the Universe as defined on a particular model of the landscape. In this, the first of two papers devoted to this topic, we find that the SUSY breaking scale is bounded both above {\\em and} below: $10^{-10} M_{\\rm P}\\leq M_{\\rm SUSY}\\leq 10^{-8} M_{\\rm P}$ for $GUT$ scale inflation. The lower bound is at least five orders of magnitude larger than the expected value of this parameter and can be tested by LHC physics. △ Less", "It was recently shown in hep-th/0610334 that in the context of the ISS models with a metastable supersymmetry breaking vacuum, thermal effects generically drive the Universe to the metastable vacuum even if it began after inflation in the supersymmetry-preserving one. We continue this programme and specifically take into account two new effects. First is the effect of the mass-gap of the gauge degrees of freedom in the confining supersymmetry preserving vacua, and second, is the effect of the back reaction of the MSSM sector on the SUSY breaking ISS sector. It is shown that, even though the mass-gap is parametrically smaller than the <φ> vevs, it drastically reduces the temperature required for the Universe to be driven to the metastable vacuum: essentially any temperature larger than the supersymmetry breaking scale μis sufficient. On the other hand we also find that any reasonable transmission of SUSY breaking to the MSSM sector has no effect on the vacuum transitions to, and the stability of the SUSY breaking vacuum. We conclude that for these models the early Universe does end up in the SUSY breaking vacuum. △ Less", "In the post-LEP2 era, and in light of recent measurements of the cosmic abundance of cold dark matter (CDM) in the universe from WMAP, many supersymmetric models tend to predict 1. an overabundance of CDM and 2. pessimistically low rates for direct detection of neutralino dark matter. However, in models with a ``well-tempered neutralino'', where the neutralino composition is adjusted to give the measured abundance of CDM, the neutralino is typically of the mixed bino-wino or mixed bino-higgsino state. Along with the necessary enhancement to neutralino annihilation rates, these models tend to give elevated direct detection scattering rates compared to predictions from SUSY models with universal soft breaking terms. We present neutralino direct detection cross sections from a variety of models containing a well-tempered neutralino, and find cross section asymptotes with detectable scattering rates. These asymptotic rates provide targets that various direct CDM detection experiments should aim for. In contrast, in models where the neutralino mass rather than its composition is varied to give the WMAP relic density via either resonance annihilation or co-annihilation, the neutralino remains essentially bino-like, and direct detection rates may be below the projected reaches of all proposed experiments. △ Less", "The well-known hierarchy between the Planck scale (~10^{19}GeV) and the TeV scale, namely a ratio of ~10^{16} between the two, is coincidentally repeated in a inverted order between the TeV scale and the dark energy scale at \\~10^{-3}eV implied by the observations. We argue that this is not a numerical coincidence. The same brane-world setups to address the first hierarchy problem may also in principle address this second hierarchy issue. Specifically, we consider supersymmetry in the bulk and its breaking on the brane and resort to the Casimir energy induced by the bulk graviton-gravitino mass-shift on the brane as the dark energy. For the ADD model we found that our notion is sensible only if the number of extra dimension n=2. We extend our study to the Randall-Sundrum model. Invoking the chirality-flip on the boundaries for SUSY-breaking, the zero-mode gravitino contribution to the Casimir energy does give rise to the double hierarchy. Unfortunately since the higher Kaluza-Klein modes acquire relative mass-shifts at the TeV level, the zero-mode contribution to Casimir energy is overshadowed. △ Less", "Review of recent developments in attempts to go beyond the Standard Model is given. We concentrate on three main unresolved problems: mechanism of electroweak symmetry breaking, expected new physics at the TeV scale (mainly SUSY) and the origin of the Dark matter. △ Less", "It has recently been pointed out that the 511 keV emission line detected by INTEGRAL/SPI from the bulge of our galaxy could be explained by annihilations of light dark matter particles into $e^+ e^-$. We present the possibility that dark matter could be made of scalar candidates, namely, of the Higgs bosons in the models based on ${SU}(3)_C\\otimes {SU}(3)_L \\otimes {U}(1)_N$ (3-3-1) gauge group. These particles are singlet of the ${SU}(2)_L \\otimes {U}(1)_Y$ group, so they do not interact with the ordinary particles, exept the Higgs boson in the standard model. The Spergel-Steinhardt condition for self-interacting dark matter gives a bound on the mass of the candidates to be a few MeVs. Besides the scalar candidates, which exist in both non-SUSY and SUSY 3-3-1 models with right-handed neutrinos, the spin $\\fr 1 2$ candidate exists in a variant 3-3-1 version with exotic neutral lepton. In contrast to the singlet models, where an extra symmetry must be imposed to account the stability of the dark matter, here the decay of the candidates is automatically forbidden in all orders of perturbative expansion. This is because of the following feature: these scalars are singlets, i.e., in bottom of the Higgs triplet. Therefore, the standard model fermions and the standard gauge bosons cannot couple with them. △ Less", "In SUSY scenarios with invisible LSP, sparticle masses can be determined from fits to the endpoints of invariant mass distributions. Here we discuss possible improvements by using the shapes of the distributions. Positive results are found for multiple-minima situations and for mass regions where the endpoints do not contain sufficient information to obtain the masses. △ Less", "We show that the gravitino-overproduction problem is prevalent among inflation models in supergravity. An inflaton field generically acquires (effective) non-vanishing auxiliary field, if the Kahler potential is non-minimal. The inflaton field then decays into a pair of the gravitinos, thereby severely constraining many of the inflation models especially in the case of the gravity-mediated SUSY breaking. △ Less", "FDCSUSYDecay is a FORTRAN program package generated by FDC (Feynman Diagram Calculation) system fully automatically. It is dedicated to calculate at tree-level all the possible 2-body decays of SUSY and Higgs particles in the Minimal Supersymmetric extension of the Standard Model (MSSM). The format of its output files complies with SUSY Les Houches Accord and can be easily imported by other packages. △ Less", "We study the prospects of detecting the signal in the stau neutralino co-annihilation region at the LHC using tau leptons. The co-annihilation signal is characterized by the stau and neutralino mass difference (dM) to be 5-15 GeV to be consistent with the WMAP measurement of the cold dark matter relic density as well as all other experimental bounds within the minimal supergravity model. Focusing on tau's from neutralino_2 --> tau stau --> tau tau neutralino_1 decays in gluino and squark production, we consider inclusive MET+jet+3tau production, with two tau's above a high E_T threshold and a third tau above a lower threshold. Two observables, the number of opposite-signed tau pairs minus the number of like-signed tau pairs and the peak position of the di-tau invariant mass distribution, allow for the simultaneous determination of dM and M_gluino. For dM = 9 GeV and M_gluino = 850 GeV with 30 fb^-1 of data, we can measure dM to 15% and M_gluino to 6%. △ Less", "We consider a supersymmetric extension of the standard model, which possess a family symmetry based on a binary dihedral group Q6, and investigate the consequences of the family symmetry on the mixing of fermions, FCNCs and the stability of proton. △ Less", "High-precision data from observation of the cosmic microwave background and the large scale structure of the universe provide very tight constraints on the effective parameters that describe cosmological inflation. Indeed, within a constrained class of LambdaCDM models, the simple lambda phi^4 chaotic inflation model already appears to be ruled out by cosmological data. In this paper, we compute constraints on inflationary parameters within a more general framework that includes other physically motivated parameters such as a nonzero neutrino mass. We find that a strong degeneracy between the tensor-to-scalar ratio r and the neutrino mass prevents lambda phi^4 from being excluded by present data. Reversing the argument, if lambda phi^4 is the correct model of inflation, it predicts a sum of neutrino masses at 0.3-0.5 eV, a range compatible with present experimental limits and within the reach of the next generation of neutrino mass measurements. We also discuss the associated constraints on the dark matter density, the dark energy equation of state, and spatial curvature, and show that the allowed regions are significantly altered. Importantly, we find an allowed range of 0.094 < Omega_c h^2 < 0.136 for the dark matter density, a factor of two larger than that reported in previous studies. This expanded parameter space may have implications for constraints on SUSY dark matter models. △ Less", "This paper develops the computation of soft supersymmetry breaking terms for chiral D7 matter fields in IIB Calabi-Yau flux compactifications with stabilised moduli. We determine explicit expressions for soft terms for the single-modulus KKLT scenario and the multiple-moduli large volume scenario. In particular we use the chiral matter metrics for Calabi-Yau backgrounds recently computed in hep-th/0609180. These differ from the better understood metrics for non-chiral matter and therefore give a different structure of soft terms. The soft terms take a simple form depending explicitly on the modular weights of the corresponding matter fields. For the large-volume case we find that in the simplest D7 brane configuration, scalar masses, gaugino masses and A-terms are very similar to the dilaton-dominated scenario. Although all soft masses are suppressed by ln(M_P/m_{3/2}) compared to the gravitino mass, the anomaly-mediated contributions do not compete, being doubly suppressed and thus subdominant to the gravity-mediated tree-level terms. Soft terms are flavour-universal to leading order in an expansion in inverse Kahler moduli. They also do not introduce extra CP violating phases to the effective action. We argue that soft term flavour universality should be a property of the large-volume compactifications, and more generally IIB flux models, in which flavour is determined by the complex structure moduli while supersymmetry is broken by the Kahler moduli. For the simplest large-volume case we run the soft terms to low energies and present some sample spectra and a basic phenomenological analysis. △ Less", "In these proceedings we present the results for lepton flavour violating tau and muon decays within the SUSY seesaw scenario. Specifically, we consider the Constrained Minimal Supersymmetric Standard Model extended by three right handed neutrinos, $ν_{R_i}$ and their corresponding SUSY partners, ${\\tilde ν}_{R_i}$, ($i=1,2,3$), and use the seesaw mechanism for neutrino mass generation. We include the predictions for the branching ratios of two types of lepton flavour violating channels, $l_j \\to ł_i γ$ and $l_j \\to 3 l_i$, and compare them with the present bounds and future experimental sensitivities. We first analyse the dependence of the branching ratios with the most relevant SUSY seesaw parameters, and we then focus on the particular sensitivity to $θ_{13}$, which we find specially interesting on the light of its potential future measurement. We further study the constraints from the requirement of successfully producing the baryon asymmetry of the Universe via thermal leptogenesis, which is another appealing feature of the SUSY seesaw scenario. We conclude with the impact that a potential measurement of $θ_{13}$ can have on lepton flavour violating physics. This is a very short summary of the works in Refs. \\cite{Arganda:2005ji} and \\cite{Antusch:2006vw} to which we refer the reader for more details. △ Less", "In this letter we study the low-energy phenomenology and cosmological implications of supersymmetric grand unified theory with asymmetric flavor structure, which is suggested by the recent observation of fermion masses and mixing angles. The predictions of the scenario are rather dependent on a Yukawa parameter fixed by group-theoretical argument. A reduced value of the parameter gives a resolution to the sign problem of supersymmetric Higgs mass μ, with which the theory becomes simultaneously consistent with the experimental data of bottom/tau mass ratio, flavor-changing rare decay of bottom quark, and the muon anomalous magnetic moment. The relic abundance of the lightest superparticle as cold dark matter of the universe is also investigated in light of the three-years WMAP result. A new source of flavor violation is found in the D-term induced scalar masses, that is a distinctive signature of the generation asymmetry. △ Less", "The SUSY CP problem is one of serious problems in construction of realistic supersymmetric standard models. We consider the problem in a framework in which adjoint chiral multiplets are introduced and gauginos have Dirac mass terms induced by a U(1) gauge interaction in the hidden sector. This is realized in hidden sector models without singlet chiral multiplets, which are favored from a recent study of the Polonyi problem. We find that the dominant contributions to electron and neutron electric dipole moments (EDMs) in the model come from phases in the supersymmetric adjoint mass terms. When the supersymmetric adjoint masses are suppressed by a factor of \\sim 100 compared with the Dirac ones, the electron and neutron EDMs are suppressed below the experimental bound even if the SUSY particle masses are around 1 TeV. Thus, this model works as a framework to solve the SUSY CP problem. △ Less", "We discuss the effect of the supersymmetry breaking on the Mass Varying Neutrinos(MaVaNs) scenario. Especially, the effect mediated by the gravitational interaction between the hidden sector and the dark energy sector is studied. A model including a chiral superfield in the dark sector and the right-handed neutrino superfield is proposed. Evolutions of the neutrino mass and the equation of state parameter are presented in the model. △ Less", "Associated production of a Higgs boson with a heavy, i.e. top or bottom, quark-anti-quark pair provide observation channels for Higgs bosons at the LHC which can be used to measure the respective Yukawa couplings. For the light supersymmetric Higgs boson we present SUSY-QCD corrections at the one-loop level, which constitute a significant contribution to the cross section. △ Less", "For hybrid inflationary potentials, we derive the tunneling rate from field configurations along the flat direction towards the waterfall regime. This process competes with the classically rolling evolution of the scalar fields and needs to be strongly subdominant for phenomenologically viable models. Tunneling may exclude models with a mass scale below 10^12 GeV, but can be suppressed by small values of the coupling constants. We find that tunneling is negligible for those models, which do not require fine tuning in order to cancel radiative corrections, in particular for GUT-scale SUSY inflation. In contrast, electroweak scale hybrid inflation is not viable, unless the inflaton-waterfall field coupling is smaller than approximately 10^-11. △ Less", "Without supersymmetry, the gauge couplings in the standard model with five Higgs doublets unify around 10^14 GeV. In this case, the trinified model, SU(3)_C x SU(3)_L x SU(3)_R x Z_3, with the minimal Higgs sector required for symmetry breaking, is the ideal grand-unified candidate. Small neutrino masses are generated via a radiative seesaw mechanism, without the need for intermediate scales, additional Higgs fields, or higher-dimensional operators. The proton lifetime is above the experimental limits, with the decay modes p -> \\barνK^+ and p -> mu^+ K^0 potentially observable. The split-SUSY version of the model, with one light Higgs doublet, is equally attractive. △ Less", "In supersymmetric models where the magnitude of the GUT scale gaugino mass parameter M_3 is suppressed relative to M_1 and M_2, the lightest neutralino can be a mixed higgsino-bino state with a thermal relic abundance in agreement with the WMAP central value for Ω_{\\rm CDM} h^2 and consistent with all other phenomenological constraints. In these models, the gluino can be as light as 200 GeV without conflicting with the LEP2 bounds on the chargino mass. Thus, gluino pair production can be accessible at the Fermilab Tevatron at high rates. In this framework, gluinos decay radiatively with a large branching fraction to a gluon plus a neutralino. We find that experiments at the Fermilab Tevatron, with 5 fb^{-1} of integrated luminosity, will be sensitive to gluino pair production in the m_{\\tg}\\sim 200-350 GeV range via the multi-jet +etmissing and multi-jet +\\ell^+\\ell^- + etmissing channels at the 5σlevel, while trilepton signatures are expected to be below this level of detectability. Dilepton mass edges from both \\tz_2 and \\tz_3 decays may be measurable in the dilepton + multi-jet +etmissing channel. △ Less", "The Minimal Supersymmetry Standard Model contains several hundreds of D- and F-flat directions that are lifted by soft susy breaking terms as well as by non-renormalizable terms. In a recent paper we find that only two of these directions, {\\bf LLe} and {\\bf udd} can accommodate inflation. The model predicts more than $10^3$ e-foldings with an inflationary scale of $H_{\\rm inf}\\sim 1$ GeV, provides a tilted spectrum compatible with WMAP3, and a negligible tensor perturbation. The reheating temperature could be as low as $T_{rh}\\sim 1$ TeV. The model is stable under radiative as well as supergravity corrections, although a significant finetunning has to be imposed on the ratio of two parameters of the model. The RGE equations allow us to relate the model parameters with slepton and gaugino masses explorable in the LHC, while the neutralino in this model could well be within reach of present dark matter searches in the laboratory. △ Less", "We compute the supersymmetric (SUSY) contributions to the observables in Bs-->K+K- and Bs-->K0 anti-K0 decays. The hadronic parameters in the standard-model (SM) amplitudes are obtained from the Bd-->K0 anti-K0 decay using a recent approach that combines flavor SU(3) symmetry and a controlled input from QCD factorization. The latest experimental data for BR(Bs-->K+K-) is in agreement with the SM prediction. We study how the branching ratios and the direct and mixing-induced CP asymmetries of both Bs-->KK decay modes are affected with the inclusion of SUSY, after imposing constraints from BR(B--> Xs gamma), B--> pi K and Delta Ms over the parameter space. While the branching ratios remain unaffected by SUSY, we identify the CP asymmetries of the Bs-->KK decays as the most promising observables to look for large deviations from the SM. △ Less", "An inclusive search for low mass SUSY using the top plus missing transverse energy signature at CMS is presented. A 5$σ$ excess can be observed with $\\sim$250 pb$^{-1}$ at a particular low mass SUSY point. With the same analysis selection the 5$σ$ discovery reach contours in the mSUGRA parameter space for 1 and 10 fb$^{-1}$ are obtained. △ Less", "We study radiative neutralino production e^+e^- \\to \\tildeχ^0_1 \\tildeχ^0_1γat the linear collider with longitudinally polarised beams. We consider the Standard Model background from radiative neutrino production e^+e^- \\to ν\\barνγ, and the supersymmetric radiative production of sneutrinos e^+e^- \\to \\tildeν\\tildeν^\\ast γ, which can be a background for invisible sneutrino decays. We give the complete tree-level formulas for the amplitudes and matrix elements squared. In the Minimal Supersymmetric Standard Model, we study the dependence of the cross sections on the beam polarisations, on the parameters of the neutralino sector, and on the selectron masses. We show that for bino-like neutralinos longitudinal polarised beams enhance the signal and simultaneously reduce the background, such that statistics is significantly enhanced. We point out that there are parameter regions where radiative neutralino production is the only channel to study SUSY particles, since heavier neutralinos, charginos and sleptons are too heavy to be pair-produced in the first stage of the linear collider with \\sqrt{s}=500 GeV. △ Less", "The event rates for the direct detection of dark matter for various types of WIMPs are presented. In addition to the neutralino of SUSY models, we considered other candidates (exotic scalars as well as particles in Kaluza-Klein and technicolour theories) with masses in the TeV region. Then one finds reasonable branching ratios to excited states. Thus the detection of the WIMP can be made not only by recoil measurements, but by measuring the de-excitation $γ$-rays as well. △ Less", "In this talk we discuss an $E_6$ inspired supersymmetric (SUSY) model with an extra $U(1)_{N}$ gauge symmetry under which right-handed neutrinos have zero charge. In this exceptional supersymmetric standard model (E$_6$SSM) the $μ$-term is generated dynamically after the electroweak symmetry breaking. We specify the particle content of the model and argue that the presence of a $Z'$ and exotic particles predicted by E$_6$SSM allows the lightest Higgs boson to be significantly heavier than in the MSSM and NMSSM. Other possible manifestations of E$_6$SSM at the LHC are also discussed. △ Less", "We discuss a GUT realization of the supersymmetric triplet seesaw mechanism(recently proposed by us in hep-ph/0604083 and further analyzed in hep-ph/0607298) where the exchange of the heavy triplet states generates both neutrino masses and soft SUSY breaking terms. △ Less", "This working group focused mainly on the complementarity among particle physics and astrophysics. The analysis of data from both fields will better constrain theoretical models. Much of the discussion focused on detecting dark matter and susy particles, and on the potential of neutrino and gamma-ray astrophysics for seeking or constraining new physics. △ Less", "In R-parity conserving supersymmetric (SUSY) models the lightest SUSY particle (LSP) is stable and a candidate for dark matter. Depending on the coupling and mass of this particle the life time of the next-to-lightest SUSY particle (NLSP) may be large compared to experimental time scales. In particular, if the NLSP is a charged particle and its decay length is of the order of the Earth's diameter Cherenkov telescopes might observe parallel muon-like tracks of NLSP pairs produced in neutrino-nucleon interactions in the Earth's interior. We have investigated two SUSY scenarios with a long-lived stau NLSP and a gravitino LSP in view of the observability at the IceCube detector. △ Less", "We present the program package SUSY-HIT for the computation of supersymmetric particle decays within the framework of the Minimal Supersymmetric extension of the Standard Model. The code is based on two existing programs HDECAY and SDECAY for the calculation of the decay widths and branching ratios of, respectively, the MSSM Higgs bosons and the SUSY particles, and calls a program for the calculation of the SUSY particle spectrum such as SuSpect. Including all important higher order effects, the package allows the consistent calculation of the MSSM particle spectrum and decays with the presently highest level of precision. △ Less", "In the context of SUSY grand unification a link is established between the hadronic and leptonic soft breaking sectors. Such relation is here exploited in particular for FCNC processes in B physics. It is shown how bounds on leptonic FCNC involving the third generation translate into constraints on FC B decays. In the second part of the contribution we show that tests of lepton universality in K and B decays can represent an interesting handle to obtain relevant information on the amount of FCNC in the second and third fermion generation. △ Less", "We analyze the Higgs intense--coupling regime, in which all Higgs particles of the Minimal Supersymmetric Standard Model are light with masses of the same order and the value of $\\tb$ the ratio of vacuum expectation values of the two Higgs fields is large, in the framework of Supergravity scenarios with non--universal soft Supersymmetry breaking scalar masses in the Higgs sector. In particular, we calculate the relic density abundance of the lightest neutralino candidate for cold dark matter and the rates in direct and indirect detection at present and future experiments. We first show that while in the mSUGRA model this regime is disfavored by present data, there are regions in the parameter space of models with non--universal Higgs masses where it can occur. We then show that because of the large value of $\\tanβ$ and the relatively low values of the neutral Higgs boson masses, the cross section for neutralino--nucleon scattering is strongly enhanced in this regime and would allow for the observation of a signal in direct detection experiments such as CDMS--Soudan. The expected sensitivity of gamma--ray detectors like GLAST might be also sufficient to observe the annihilation of neutralinos in such a regime. △ Less", "We compute the complete one loop electroweak effects in the MSSM for the eight processes of single top (and single antitop) production in the $t$-channel at hadron colliders, generalizing a previous analysis performed for the dominant $dt$ final state. The results are quite similar for all processes, showing an impressively large Standard Model effect and a generally modest genuine SUSY contribution in the mSUGRA scenario. The one loop effect on the total rate is shown and the possibility of measuring it at LHC is discussed. △ Less", "In order to establish supersymmetry (SUSY) at future colliders, the identity of gauge couplings and the corresponding Yukawa couplings between gauginos, sfermions and fermions needs to be verified. Here a first phenomenological study for determining the Yukawa coupling of the SUSY-QCD sector is presented, using a method which combines information from LHC and ILC. △ Less", "In this talk we analyse the claim that supersymmetry (SUSY) naturally accounts for the observed dark matter density. In many cases, it is necessary to tune the parameters of a SUSY model to fit the WMAP data. We provide a quantitative analysis of the degree of tuning required for different annihilation channels. Some regions are natural, requiring no tuning at all, whereas others require tuning at the 0.1% level. △ Less", "We consider the split extended (N=2) supersymmetry scenario recently proposed by Antoniadis et al. [hep-ph/0507192] as a realistic low energy framework arising from intersecting brane models. While all scalar superpartners and charged gauginos are naturally at a heavy scale, the model low energy spectrum contains a Higgsino-like chargino and a neutralino sector made out of two Higgsino and two Bino states. We show that the lightest neutralino is a viable dark matter candidate, finding regions in the parameter space where its thermal relic abundance matches the latest determination of the density of matter in the Universe by WMAP. We also discuss dark matter detection strategies within this model: we point out that current data on cosmic-ray antimatter already place significant constraints on the model, while direct detection is the most promising technique for the future. Analogies and differences with respect to the standard split SUSY scenario based on the MSSM are illustrated. △ Less", "We implement soft leptogenesis in a warped five dimensional scenario with two branes on the orbifold boundaries coming from an S^{1}/Z_{2} symmetry, and supersymmetry broken on the IR brane. The SM hypermultiplet fields (fermions and Higgs) live in the UV brane and we allow the vector supermultiplets corresponding to the gauge bosons and a hypermultiplet corresponding to the right handed neutrino to live in the bulk. We assume that there are Majorana mass terms for the right handed neutrino superfield fixed on each brane and that there is a Yukawa term involving the right handed neutrino, the left handed neutrino and the Higgs fixed on the UV brane. Supersymmetry is broken by a constant ``superpotential'' on the IR brane, which induces an F-term for the radion hypermultiplet. This F-term leads to a B-term for the right handed sneutrinos as well as a soft SUSY breaking gaugino mass in the 4D theory for the zero modes. The gaugino mass naturally induces an A-term for the right handed sneutrino, left handed sneutrino and the Higgs to be formed through gaugino mediation with a non-trivial CP violating phase. Moreover, we show that within the context of extra dimensions, the condition of out-of-equilibrium decay and the phenomenological constraints on the neutrino mass are both satisfied in a natural way, for UV Majorana masses of the order of the fundamental scale of the theory. Thus all necessary elements for soft leptogenesis are at hand and we are able to predict a correct value for the baryon asymmetry. △ Less", "We present a detailed study of radion stabilization within 5D conformal SUGRA compactified on an $S^{(1)}/Z_2$ orbifold. We use an effective 4D superfield description developed in our previous work. The effects of tree level bulk and boundary couplings, and in particular of one loop contributions and of a non perturbative correction on the radion stabilization are investigated. We find new examples of radion stabilization in non SUSY and (meta-stable) SUSY preserving Minkowski vacua. △ Less", "We modify the first ISS model (hep-th/0602239) by gauging a diagonal flavour symmetry. We add additional multiplets transforming as fundamentals and anti-fundamentals under the gauged flavour group. Their number is chosen such that the microscopic theory is asymptotically free whereas in the Seiberg dual (w.r.t. the colour group) it changes to an infrared free theory. Non perturbative effects within the flavour group can correct the location of the supersymmetric vacuum. Statements about meta-stability of the susy breaking vacuum would require a two loop calculation. For general couplings, the question whether gauging flavour destabilises susy breaking remains open. △ Less", "We propose a natural framework of SU(5) supersymmetric grand unified theory with the minimal particle contents, which does not contain dimension five proton decay operators. The suitable fermion mass hierarchy can be reproduced by higher dimensional operators of an adjoint Higgs field which breaks SU(5) gauge symmetry. △ Less", "In this talk I briefly review the status of SUSY GUTs in 4, 5, 6 and 10 dimensions, focusing on the issue of gauge coupling unification and proton decay. I then discuss the predictions of the minimal SO(10) SUSY model [MSO$_{10}$SM]. △ Less", "The LHC (CMS) discovery potential of the $e^{\\pm}μ^{\\mp} + E^{miss}_T$ signature in the search for supersymmetry and lepton flavour violation in neutralino decays is studied. A detailed study is done for the CMS test points LM1-LM9. It is shown that for the point LM1 it is possible to detect lepton flavour violation in neutralino decays with lepton flavour violating branching $Br(\\tildeχ^0_2 \\to μ^{\\pm}e^{\\mp}\\tildeχ^0_1) \\geq 0.04 Br(\\tildeχ^0_2 \\to e^{+}e^{-}\\tildeχ^0_1, μ^{+}μ^{-} \\tildeχ^0_1)$ for an integral luminosity $10 fb^{-1}$. A discovery potential in the mSUGRA-SUSY scenario with $\\tan β= 10, ~sign(μ) = +$ in the $(m_0, m_{1/2})$ plane using the $e^{\\pm}μ^{\\mp} + E^{miss}_T$ signature is determined. △ Less", "We study the SUSY SO(10) GUT with the symmetric two-zero textures of quark/lepton mass matrix which realize the Georgei-Jarlskog relations in down-type quark and charged lepton masses. We show that the important constraints to such framework come from the bottom-tau unification and the observed value of $\\sin2β$, one of the angles in the CKM unitarity triangle. We investigate the symmetric two-zero textures assumed at the GUT scale by solving the MSSM renormalization group equations with right-handed neutrino threshold effects. As a result, the value of $\\tan\\tildeβ$ is constrained to be large enough and the representation of Higgs field which couples to the third generation of left- and right-handed neutrinos is restricted by the bottom-tau unification condition. The textures with vanishing 1-2 (and 2-1) element for up-type quarks and vanishing 1-3 (and 3-1) element for down-type quarks are favored by the observation of $\\sin2β$. △ Less", "We consider the role of supersymmetric flat directions in reheating the Universe after inflation. One or more flat directions can develop large vevs during inflation, which can potentially affect reheating by slowing down scattering processes among inflaton decay products or by coming to dominate the energy density of the Universe. Both effects occur only if flat directions are sufficiently long-lived. The computation of their perturbative decay rate, and a simple estimate of their nonperturbative decay have led to the conclusion that this is indeed the case. In contrast, we show that flat directions can decay quickly through nonperturbative channels in realistic models. The mass matrix for MSSM excitations around flat directions has nondiagonal entries, which vary with the phase of the (complex) flat directions. The quasi-periodic motion of the flat directions results in a strong parametric resonance, leading to the rapid depletion of the flat direction within its first few rotations. This may preclude any significant role for the flat directions in reheating the Universe after inflation in models in which the inflaton decays perturbatively. △ Less", "We compute the SUSY effective hamiltonian that describes the |ΔS|=1 semileptonic decays of tau leptons. We provide analytical expressions for supersymmetric contribution to tau --> u bar{s} nu_{tau} transition in mass insertion approximation. We show that SUSY contributions may enhance the CP asymmetry of tau --> K pi nu_{tau} decays by several orders of magnitude than the standard model expectations. However, the resulting asymmetry is still well below the current experimental limits obtained by CLEO collaborations. We emphasize that measuring CP rate asymmetry in this decay larger than 10^{-6} would be a clear evidence of physics beyond the supersymmetric extensions of the standard model. △ Less", "D-term inflation is one of the most interesting and versatile models of inflation. It is possible to implement naturally D-term inflation within high energy physics, as for example SUSY GUTs, SUGRA, or string theories. D-term inflation avoids the $η$-problem, while in its standard form it always ends with the formation of cosmic strings. Given the recent three-year WMAP data on the cosmic microwave background temperature anisotropies, we examine whether D-term inflation can be successfully implemented in non-minimal supergravity theories. We show that for all our choices of Kähler potential, there exists a parameter space for which the predictions of D-term inflation are in agreement with the measurements. The cosmic string contribution on the measured temperature anisotropies is always dominant, unless the superpotential coupling constant is fine tuned; a result already obtained for D-term inflation within minimal supergravity. In conclusion, cosmic strings and their rôle in the angular power spectrum cannot be easily hidden by just considering a non-flat Kähler geometry. △ Less", "Up to now chiral type IIA vacua have been mostly based on intersecting D6-branes wrapping special Lagrangian 3-cycles on a CY three-fold. We argue that there are additional BPS D-branes which have so far been neglected, and which seem to have interesting model-building features. They are coisotropic D8-branes, in the sense of Kapustin and Orlov. The D8-branes wrap 5-dimensional submanifolds of the CY which are trivial in homology, but contain a worldvolume flux that induces D6-brane charge on them. This induced D6-brane charge not only renders the D8-brane BPS, but also creates D=4 chirality when two D8-branes intersect. We discuss in detail the case of a type IIA Z2 x Z2 orientifold, where we provide explicit examples of coisotropic D8-branes. We study the chiral spectrum, SUSY conditions, and effective field theory of different systems of D8-branes in this orientifold, and show how the magnetic fluxes generate a superpotential for untwisted Kahler moduli. Finally, using both D6-branes and coisotropic D8-branes we construct new examples of MSSM-like type IIA vacua. △ Less", "We show that previous proposals to accommodate the MSSM with string theory N=0 non-supersymmetric compactifications coming from intersecting D6-branes may be made fully consistent with the cancellation of RR tadpoles. In this respect we present the first examples of non-supersymmetric string Pati-Salam model vacua with starting observable gauge group $SU(4)_c \\t SU(2)_L \\t SU(2)_R$ (SU(2) from Sp(2)'s) that accommodate the spectrum of the 3 generation MSSM with a gauged baryon number with all extra exotics (either chiral or non-chiral) becoming massive and all MSSM Yukawas realized. The N=1 supersymmetry of the visible sector is broken by an extra supersymmetry messenger breaking sector that preserves a different N$^{\\prime}$=1 susy, exhibiting the first examples of stringy gauge mediated models. Due to the high scale of the models, these models are also the first realistic examples of carriers of stringy split supersymmetry exhibiting universal slepton/squark masses, massive string scale gauginos, {\\em unification of SU(3), SU(2) gauge couplings at} $2.04 \\times 10^{16}$ GeV, a stable proton and the appearance of a landscape split SM with chiral fermions and only Higgsinos below the scale of susy breaking; the LSP neutralino candidate could also be only Higgsino or Higgsino-Wino mixture. We also add RR, NS and metric fluxes as every intersecting D-brane model without fluxes can be accommodated in the presence of fluxes. The addition of metric fluxes in the toroidal lattice also stabilizes the expected real parts of all in AdS closed string moduli (modulo D-term affects), leaving unfixed only the imaginary parts of Kähler moduli. △ Less", "We attempt to quantify the widely-held belief that large hierarchies induced by strongly-warped geometries are common in the string theory landscape. To this end, we focus on the arguably best-understood subset of vacua -- type IIB Calabi-Yau orientifolds with non-perturbative Kaehler stabilization and a SUSY-breaking uplift (the KKLT setup). Within this framework, vacua with a realistically small cosmological constant are expected to come from Calabi-Yaus with a large number of 3-cycles. For appropriate choices of flux numbers, many of these 3-cycles can, in general, shrink to produce near-conifold geometries. Thus, a simple statistical analysis in the spirit of Denef and Douglas allows us to estimate the expected number and length of Klebanov-Strassler throats in the given set of vacua. We find that throats capable of explaining the electroweak hierarchy are expected to be present in a large fraction of the landscape vacua while shorter throats are essentially unavoidable in a statistical sense. △ Less", "We find a class of four dimensional deformed conformal field theories which appear extra dimensional when their gauge symmetries are spontaneously broken. The theories are supersymmetric moose models which flow to interacting conformal fixed points at low energies, deformed by superpotentials. Using a-maximization we give strong nonperturbative evidence that the hopping terms in the resulting latticized action are relevant deformations of the fixed point theories. These theories have an intricate structure of RG flows between conformal fixed points. Our results suggest that at the stable fixed points each of the bulk gauge couplings and superpotential hopping terms is turned on, in favor of the extra dimensional interpretation of the theory. However, we argue that the higher dimensional gauge coupling is generically small compared to the size of the extra dimension. In the presence of a brane the topology of the extra dimension is determined dynamically and depends on the numbers of colors and bulk and brane flavors, which suggests phenomenological applications. The RG flows between fixed points in these theories provide a class of tests of Cardy's conjectured a-theorem. △ Less", "Grand unified theories (GUTs) can lead to non-universal gaugino masses at the unification scale. We study the implications of such non-universal gaugino masses for the composition of the lightest neutralino in supersymmetric (SUSY) theories based on SU(5) gauge group. We also consider the phenomenological implications of non-universal gaugino masses for the phenomenology of Higgs bosons in the context of Large Hadron Collider. △ Less", "We show that in supersymmetric grand unified theories new effective D=4 and D=5 operators for proton decay are induced by soft SUSY-breaking terms, when heavy GUT gauge bosons are integrated out, in addition to the standard D=6 ones. As a result, the proton lifetime in gauge mediated channels can be enhanced or even suppressed depending on the size of the heavy Higgses soft terms. △ Less", "We thoroughly discuss a new supersymmetric grand unified scenario of the triplet seesaw mechanism where the exchange of heavy SU(2)_W triplet states generates both neutrino masses and soft supersymmetry breaking terms. This framework, recently proposed by us in a previous work, is highly predictive since it contains only three free parameters connecting low-energy neutrino parameters, lepton and quark flavour violation, sparticle and Higgs boson spectra and electroweak symmetry breakdown. These three parameters are the triplet mass M_T, the effective supersymmetry breaking scale B_T and a coupling constant lambda. We perform a complete analysis of the parameter space taking into account the present experimental constraints and considering different types of neutrino spectrum. A special emphasis is given to the particular features of the sparticle and Higgs spectra and to the model independent predictions obtained for the processes mu-> e X, mu-> e conversion in nuclei, tau-> e Y and tau-> mu Y (X = gamma, e e, Y= gamma, e e, mu mu). In the appendices, we present some technical aspects relevant for our analysis. △ Less", "We calculate the electric dipole moments (EDM) of the neutral Hg(199) atom, deuteron, nucleons and neutral hyperons Lambda, Sigma(0) and Xi(0) in the framework of a generic SUSY model without R-parity conservation (RPV SUSY) on the basis of the SU(3) version of chiral perturbation theory (ChPT). We consider CP-violation in the hadronic sector induced by the chromoelectric quark dipole moments and CP-violating 4-quark effective interactions. From the null experimental results on the neutron and Hg(199) atom EDMs we derive limits on the imaginary parts of certain products Im(lambda' lambda'*) of the trilinear RPV-couplings and demonstrate that they are more stringent than those existing in the literature. Using these limits we give predictions for the EDMs of neutral hyperons. We also estimate the prospects of future storage ring experiments on the deuteron EDM and show that the expected improvement of the above limits in these experiments may reach several orders of magnitude. △ Less", "We study the impact of neutrino masses and mixings on LFV processes within the context of the supersymmetric seesaw scenario, where the CMSSM is extended by three right-handed (s)neutrinos. A hierarchical spectrum is considered for both heavy and light neutrinos. We systematically analyse the interesting relation between the leptonic mixing angle $θ_{13}$ and LFV muon and tau decays, namely $l_j \\to l_i γ$ and $l_j \\to 3 l_i$, and discuss the interplay with the other relevant parameters. We require compatibility with low energy neutrino data, bounds on both LFV decays and charged lepton electric dipole moments, and impose a successful baryogenesis via thermal leptogenesis. Particular emphasis is given to the implications that a future $θ_{13}$ measurement can have on our knowledge of the heavy neutrino sector. △ Less", "We present examples of fits of fermion mass data using the $\\mathbf{10-120-\\oot}$ FM Higgs system in Susy SO(10) GUTs that follow the scenario\\cite{blmdoom,nmsgutI} in which the $\\mathbf{120}$ -plet collaborates with the $ \\mathbf{10}$-plet to fit the charged fermion masses while small $\\mathbf{\\oot} $-plet couplings enhance the Type I seesaw neutrino masses to viable values and make the fit to light fermions accurate. Restricting ourselves to the CP conserving case we use a linear perturbative technique to obtain accurate charged fermion fits ($χ^2_{tot} < .2 $) to all the charged fermion masses and angles. The resulting fits imply Type I neutrino masses that are generically $10^2- 10^3$ times larger than those obtained in the $\\mathbf{10-\\oot}$ scenario precisely because of the small $\\mathbf{\\oot} $ coupling. Thus the difficulty of obtaining sufficiently large neutrino masses in the context of these Next to Minimal Susy GUTs is essentially removed. The remaining free parameters allow one to obtain the correct ratio of neutrino mass squared splitting and a large($θ_{23}^{PMNS}$) and small($θ_{13}^{PMNS}$) mixing angle. The $θ_{12}^{PMNS}$ is however small and this indicates that -as in the Type I $\\mathbf{10-\\oot}$ case - a fully realistic fit to the lepton mixing data also \\emph{requires} CP violation. △ Less", "Objective, Signal cross section, SM background and chosen cuts, Event-shape variables, Results and discussion. △ Less", "We investigate a scenario in a supersymmetric SO(10) Grand Unified Theory in which the fermion mass matrices are generated by renormalizable Yukawa couplings of the $\\mathbf{10} \\oplus \\mathbf{120} \\oplus \\bar{\\mathbf{126}}$ representation of scalars. We reduce the number of parameters by assuming spontaneous CP violation and a $\\mathbbm{Z}_2$ family symmetry, leading to nine real Yukawa coupling constants for three families. Since in the ``minimal SUSY SO(10) GUT'' an intermediate seesaw scale is ruled out and our scenario lives in the natural extension of this theory by the $\\mathbf{120}$, we identify the vacuum expectation value (VEV) $w_R$ of $(\\mathbf{10}, \\mathbf{1}, \\mathbf{3}) \\in \\bar{\\mathbf{126}}$ with the GUT scale of $2 \\times 10^{16}$ GeV. In order to obtain sufficiently large neutrino masses, the coupling matrix of the scalar $\\bar{\\mathbf{126}}$ is necessarily small and we neglect type II seesaw contributions to the light-neutrino mass matrix. We perform a numerical analysis of this 21-parameter scenario and find an excellent fit to experimentally known fermion masses and mixings. We discuss the properties of our numerical solution, including a consistency check for the VEVs of the Higgs-doublet components in the SO(10) scalar multiplets. △ Less", "We study the complete one loop contribution to H^\\pm\\to W^\\pm V, V= Z, γ, both in the Minimal Supersymmetric Standard Model (MSSM) and in the Two Higgs Doublet Model (2HDM). We evaluate the MSSM contributions and compare them with the 2HDM ones taking into account b\\to sγconstraint, vacuum stability and unitarity constraints in the case of 2HDM, as well as experimental constraints on the MSSM and 2HDM parameters. In the MSSM, we found that in the intermediate range of \\tanβ\\la 10 and for large A_t, the branching ratio of H^\\pm \\to W^{\\pm} Z can be of the order 10^{-3} while the branching ratio of H^\\pm \\to W^{\\pm} γis of the order 10^{-5}. We also study the effects of the CP violating phases of Soft SUSY parameters and found that they can modify the branching ratio by about one order of magnitude. However, in the 2HDM where the Higgs sector is less constrained as compared to the MSSM higgs sector, one can reach branching ratio of the order 10^{-2} for both modes. △ Less", "We discuss the potential of combined analyses at the Large Hadron Collider and the planned International Linear Collider to explore low-energy supersymmetry in a difficult region of the parameter space characterized by masses of the scalar SUSY particles around 2 TeV. Precision analyses of cross sections for light chargino production and forward--backward asymmetries of decay leptons and hadrons at the ILC, together with mass information on chi^0_2 and squarks from the LHC, allow us to determine the underlying fundamental gaugino/higgsino MSSM parameters and to constrain the masses of the heavy, kinematically inaccessible sparticles. No assumptions on a specific SUSY-breaking mechanism are imposed. For this analysis the complete spin correlations between production and decay processes are taken into account. △ Less", "String compactification with fluxes yields MSSM soft SUSY breaking terms that receive comparable contributions from modulus and anomaly mediation whose relative strength is governed by a phenomenological parameter $α$. Gaugino and first/second generation (and sometimes also Higgs and third generation) scalar mass parameters unify at a mirage unification scale $Q \\not= M_{\\rm GUT}$, determined by the value of $α$. The ratio of scalar to gaugino masses at this mirage unification scale depends directly on the scalar field modular weights, which are fixed in turn by the brane or brane intersections on which the MSSM fields are localized. We outline a program of measurements which can in principle be made at the CERN LHC and the International Linear $e^+e^-$ collider (ILC) which can lead to a determination of the modular weights. △ Less", "Matter fields in the MSSM are chiral supermultiplets in fundamental (or singlet) representations of the standard model gauge group. In this paper we introduce chiral superfields in the adjoint representation of $SU(3)_C$ and study the effective field theory and phenomenology of them. These states are well motivated by intersecting D-brane models in which additional massless adjoint chiral supermultiplets appear generically in the low energy spectrum. Although it has been pointed out that the existence of these additional fields may make it difficult to obtain asymptotic freedom, we demonstrate that this consideration does not rule out the existence of adjoints. The QCD gauge coupling can be perturbative up to a sufficiently high scale, and therefore a perturbative description for a D-brane model is valid. The full supersymmetric and soft SUSY breaking Lagrangians and the resulting renormalization group equations are given. Phenomenological aspects of the adjoint matter are also studied, including the decay and production processes. The similarity in gauge interaction between the adjoint fermion and gluino facilitates our study on these aspects. It is found that these adjoint multiplets can give detectable signals at colliders and satisfy the constraints from cosmology. △ Less", "The observation in the universe of a small but positive vacuum energy strongly suggests, in the string landscape picture, that there will ultimately be a phase transition to an exactly supersymmetric universe. This ground state or \"true vacuum\" of the universe could be similar to the minimal supersymmetric standard model with all the susy breaking parameters set to zero. Alternatively, it might be similar to the prominent superstring theories with nine flat space dimensions or to the supersymmetric anti-deSitter model that seems to be equivalent to a conformal field theory. We propose that the dominant phenomenological feature of these potential future universes is the weakening of the Pauli principle due to Fermi-Bose degeneracy. Providing the phase transition occurs in the cosmologically near future, an exact supersymmetry could extend the life expectancy of intelligent civilizations far beyond what would be possible in the broken susy universe. △ Less", "If the energy density of the Universe before nucleosynthesis is dominated by a scalar field $φ$ that decays and reheats the plasma to a low reheating temperature $T_{RH}$, neutralinos may be warm dark matter particles. We study this possibility and derive the conditions on the production mechanism and on the supersymmetric spectrum for which it is viable. Large values of the $μ$ parameter and of the slepton masses are characteristic features of these models. We compute the expected direct detection cross sections and point out that Split-SUSY provides a natural framework for neutralino warm dark matter △ Less", "An old idea for explaining the hierarchy is strong gauge dynamics. We show that such dynamics {\\it also} stabilises the moduli in $M$ theory compactifications on manifolds of $G_2$-holonomy {\\it without} fluxes. This gives stable vacua with softly broken susy, grand unification and a distinctive spectrum of TeV and sub-TeV sparticle masses. △ Less", "We derive the equation for the quasi-normal modes corresponding to the scalar excitation of a black hole moving away in the fifth dimension. This geometry is the AdS/CFT dual of a boost-invariant expanding perfect fluid in N=4 SUSY Yang-Mills theory at large proper-time. On the gauge-theory side, the dominant solution of the equation describes the decay back to equilibrium of a scalar excitation of the perfect fluid. Its characteristic proper-time can be interpreted as a thermalization time of the perfect fluid, which is a universal (and numerically small) constant in units of the unique scale of the problem. This may provide a new insight on the short thermalization-time puzzle encountered in heavy-ion collision phenomenology. A nontrivial scaling behaviour in proper-time is obtained which can be interpreted in terms of a slowly varying adiabatic approximation. △ Less", "The meta-stable SUSY breaking mechanism of Intriligator Seiberg and Shih can be used to simplify the Pentagon model of TeV scale physics. The simplified model has only a single scalar field and no troublesome low energy axion. One significant signature is $l^+ l^- X$ plus missing energy, where $X$ might be the two photons of gauge mediated models, but is likely to be different. There is a new strongly interacting sector with a scale around 1.5 TeV. The penta-hadrons of this sector have masses of order 6 TeV or more. Dark matter is probably the pseudo-goldstone boson of spontaneously broken penta-baryon number. This can be a viable dark matter candidate if an appropriate asymmetry in penta-baryon number is generated in the early universe. The pseudo-Goldstone particle has a mass of $\\sim 1$ eV and is produced predominantly in flavor changing charged current decays of ordinary particles. The model solves the flavor problems of SUSY, but has two low energy CP violating phases, whose value is strongly constrained by experiment. △ Less", "Right-handed neutrinos offer us the possibility of accommodating neutrino masses. In a supersymmetric model, this implies the existence of right-handed sneutrinos. Right-handed sneutrinos are expected to be as light as other supersymmetric particles if the neutrinos are Dirac fermions, or if the lepton-number breaking scale is at (or below) the supersymmetry (SUSY) breaking scale, assumed to be around the electroweak scale. Depending on the mechanism of SUSY breaking, the lightest right-handed sneutrino may be the lightest supersymmetric particle (LSP). We consider the unique hadron collider signatures of a weak scale right-handed sneutrino LSP, assuming R-parity conservation. For concreteness, we concentrate on stop pair-production and decay at the Tevatron and the Large Hadron Collider, and briefly comment on the production and decay of other supersymmetric particles. △ Less", "The motivation for introduction of supersymmetry in high energy physics as well as a possibility for supersymmetry discovery at LHC (Large Hadronic Collider) are discussed. The main notions of the Minimal Supersymmetric Standard Model (MSSM) are introduced. Different regions of parameter space are analyzed and their phenomenological properties are compared. Discovery potential of LHC for the planned luminosity is shown for different channels. The properties of SUSY Higgs bosons are studied and perspectives of their observation at LHC are briefly outlined. △ Less", "In this talk we show that it is possible to find an upper bound on the total proton lifetime. We conclude that the minimal realistic non-supersymmetric grand unified theory is the modified Georgi-Glashow model with a Higgs sector composed of 5_H, 24_H, and 15_H. We discuss the possibility to test this scenario at the next generation of proton decay experiments and future colliders through the production of light scalar leptoquarks. △ Less", "We introduce a method to extract the right-handed neutrino mass matrix from the Left-Right symmetric seesaw formula and apply it to the study of a simple SUSY SO(10) theory. We find 8 possible solutions for the heavy neutrino spectrum and a richer phenomenology than in the pure type I or type II seesaw mechanism. Leptogenesis is studied in SO(10) and can be accomodated more easily than with the type I dominance. △ Less", "We suggest a very simple but general operator to break mass degeneration between representations of the Poincare group having spin 1 and 1/2. A quantity very similar, at experimental 0.13 $σ$ level, to Weinberg's angle, appears during the process. △ Less", "Realistic predictions are made for lepton flavour violating and flavour changing neutral current decays in the large tan beta regime of a SUSY-seesaw model. Lepton flavour violating neutral Higgs decays are discussed within this framework along with the highly constraining charged lepton decays l_i --> l_j + gamma. In the b-s system the important constraint from b --> s + gamma is studied in conjunction with the rare FCNC Bs --> mu mu (tau mu) decays and the recently measured Delta Ms. △ Less", "We present a SUSY breaking scenario based on Abelian gaugino kinetic term mixings between hidden and observable sectors. If an extra U(1) gaugino in the observable sector obtains a large mass through this mixing effect based on SUSY breaking in the hidden sector, soft SUSY breaking parameters in the MSSM may be affected by radiative effects due to this gaugino mass. New phenomenological aspects are discussed in such a SUSY breaking scenario. △ Less", "Among the firm predictions of softly broken supersymmetry is the identity of gauge couplings and the corresponding Yukawa couplings between gauginos, sfermions and fermions. In the event that a SUSY-like spectrum of new particles is discovered at future colliders, a key follow-up will be to test these relations experimentally. In detailed studies it has been found that the SUSY-Yukawa couplings of the electroweak sector can be studied with great precision at the ILC, but a similar analysis for the Yukawa coupling of the SUSY-QCD sector is far more challenging. Here a first phenomenological study for determining this coupling is presented, using a method which combines information from LHC and ILC. △ Less", "Discovery of supersymmetric (SUSY) particles at the Large Hadron Collider(LHC) has been studied for the models where squarks and gluino are much heavier than the lightest supersymetric particle (LSP). In this paper, we investigate the SUSY discovery in the models with degenerated mass spectrum up to m_LSP~0.7 m_sq. Such mass spectrum is predicted in certain parameter region of the mixed modulas anomaly mediation (MMAM) model. We find that the effective transverse mass of the signal for the degenerated parameters shows the distribution similar to that of the background. Experimental sensitivity of the SUSY particles at the LHC therefore depends on the uncertainty of the background in this class of model. We also find that SUSY signal shows an interesting correlation between M_eff and ETmiss which may be used to determine the signal region properly to enhance the S/N ratio even if the sparticle masses are rather degenerated. The structure is universal for the models with new heavy colored particles decaying into visible particles and a stable neutral particle, dark matter. △ Less", "Recent theoretical developments concerning Higgs production at the Large Hadron Collider are reviewed, both in the Standard Model and in the MSSM. Emphasis is put on the inclusive and exclusive cross sections for gluon fusion, as well as on the associated production with bottom quarks. △ Less", "In the first part of the talk, I explain what empirical evidence points to the need for having an effective grand unification-like symmetry possessing the symmetry SU(4)-color in 4D. If one assumes the premises of a future predictive theory including gravity--be it string/M theory or a reincarnation--this evidence then suggests that such a theory should lead to an effective grand unification-like symmetry as above in 4D, near the string-GUT-scale, rather than the standard model symmetry. Advantages of an effective supersymmetric G(224) = SU(2)$_L \\times$ SU(2)$_R \\times$ SU(4)$^c$ or SO(10) symmetry in 4D in explaining (i) observed neutrino oscillations, (ii) baryogenesis via leptogenesis, and (iii) certain fermion mass-relations are noted. And certain distinguishing tests of a SUSY G(224) or SO(10)-framework involving CP and flavor violations (as in $μ\\to eγ$, $τ\\toμγ$, edm's of the neutron and the electron) as well as proton decay are briefly mentioned. Recalling some of the successes we have had in our understanding of nature so far, and the current difficulties of string/M theory as regards the large multiplicity of string vacua, some comments are made on the traditional goal of understanding {\\em vis a vis} the recently evolved view of landscape and anthropism. △ Less", "The transition magnetic moments of Majorana neutrinos are calculated in grand unified theory (GUT) constrained Minimal Supersymmetric Standard Model (MSSM) with explicit R-parity violation. It is assumed that neutrinos acquire masses via one-loop (quark-squark and lepton-slepton) radiative corrections. The mixing of squarks, sleptons, and quarks is considered explicitly. The connection between neutrino magnetic moments and the entries of neutrino mass matrix is studied. The current upper limits on neutrino magnetic moments are deduced from the elements of phenomenological neutrino mass matrix, which is reconstructed using the neutrino oscillation data and the lower bound on the neutrinoless double beta decay half-life. Further, the results for transitional magnetic moments of Majorana neutrinos are presented for the cases of inverted and normal hierarchy of neutrino masses and different SUSY scenarios. The largest values are of the order of 10^{-17} in units of Bohr magneton. △ Less", "We point out that, if R-parity is broken spontaneously, the neutralino can decay to the final state majoron plus neutrino, which from the experimental point of view is indistinguishable from the standard missing momentum signal of supersymmetry. We identify the regions of parameter space where this decay mode is dominant and show that they are independent of R-parity conserving SUSY parameters. Thus, (a) only very weak limits on R-parity violating couplings can be derived from the observation of missing momentum events and (b) at future collider experiments huge statistics might be necessary to establish that R-parity indeed is broken. Parameter combinations which give calculated relic neutralino density larger than the measured dark matter density in case of conserved R-parity are valid points in this scenario and their phenomenology at the LHC deserves to be studied. △ Less", "I discuss the prospects of detecting the smallest dark matter bound structures present in the Milky Way by searching for the proper motion of $γ$-ray sources in the upcoming GLAST all sky map. I show that for dark matter particle candidates that couple to photons the detection of at least one $γ$-ray microhalo source with proper motion places a constraint on the couplings and mass of the dark matter particle. For SUSY dark matter, proper motion detection implies that the mass of the particle is less than 500 GeV and the kinetic decoupling temperature is in the range of [4-100] MeV. △ Less", "We investigate, in the general framework of KKLT, the mediation of supersymmetry breaking by fields propagating in the strongly warped region of the compactification manifold ('throat fields'). Such fields can couple both to the supersymmetry breaking sector at the IR end of the throat and to the visible sector at the UV end. We model the supersymmetry breaking sector by a chiral superfield which develops an F-term vacuum expectation value. It turns out that the mediation effect of vector multiplets propagating in the throat can compete with modulus-anomaly mediation. Moreover, such vector fields are naturally present as the gauge fields arising from isometries of the throat (most notably the SO(4) isometry of the Klebanov-Strassler solution). Their mediation effect is important in spite of their large 4d mass. The latter is due to the breaking of the throat isometry by the compact manifold at the UV end of the throat. The contribution from heavy chiral superfields is found to be subdominant. △ Less", "The proton decays too rapidly in supersymmetric theories if a dimension-4 operator \\bar{5}.10.\\bar{5} exists in the superpotential. The conventional idea is to impose the R-parity to kill this operator with a stable lightest supersymmetry particle (LSP) as a direct consequence. However, the SUSY-zero mechanism is also able to kill the operator without an unbroken R-parity. In this article, we provide a firm theoretical justification for the absence of the dimension-4 proton decay operator under the SUSY-zero mechanism, by using some input from string theory. The LSP may be unstable without the R-parity and, indeed, some dimension-5 R-parity violating operators may be generated in effective theories. This suggests that the dark matter is an axion in this string theory inspired model. An insight on the SUSY-zero mechanism is also obtained. △ Less", "In hep-ph/0401024: ``Threshold corrections to $m_b$ and the $\\bar{b}b\\to H^0_i$ production in CP-violating SUSY scenarios'', we have pointed out that the production cross sections of the three neutral Higgs bosons through $\\bar{b}b$ fusion can deviate substantially from those obtained in CP conserving scenarios, thanks to the nontrivial role played by the threshold corrections to $m_b$ combined with the CP-violating mixing in the neutral-Higgs-boson sector. The deviations are largest for values of the CP-violating phases that maximize the mixing among at least two of the three neutral Higgs bosons. We complement our previous work focussing explicitly on the values of masses and widths of the three neutral Higgs bosons in this region of parameter space. We then address the issue of whether the three different peaks in the invariant mass distribution of the Higgs-decay products can be experimentally disentangled at the LHC. △ Less", "Generation of the cosmological baryon asymmetry in SUSY based model with broken R-parity and low scale gravity is considered. The model allows for a long-life time or even stable proton and observable neutron-antineutron oscillations. △ Less", "A study of various SUSY scenarios is presented in which the lightest supersymmetric particle is the gravitino $\\sG$ and the next-to-lightest supersymmetric particle is a scalar tau $\\stau$ with lifetimes ranging from seconds to years. Gravitinos are interesting dark matter candidates which can be produced in decays of heavier sparticles at the International Linear Collider (ILC), but remain undetected in direct searches of astrophysical experiments. We investigate the detection and measurement of metastable staus, which may be copiously produced at the ILC either directly or via cascade decays. A proper choice of the experimental conditions will allow one to stop large samples of staus in the calorimeters of the ILC detector and to study the subsequent decays $\\stau\\toτ\\sG$. Detailed simulations show that the properties of the stau and the gravitino, such as stau mass and lifetime and gravitino mass, can be accurately determined at a future ILC and may provide direct access to the gravitational coupling, respectively Planck scale. △ Less", "We reconsider the Polonyi problem in gravity-mediation models for supersymmetry (SUSY) breaking. It has been argued that there is no problem in the dynamical SUSY breaking scenarios, since the Polonyi field acquires a sufficiently large mass of the order of the dynamical SUSY-breaking scale Lamada_{SUSY}. However, we find that a linear term of the Polonyi field in the Kahler potential brings us back to the Polonyi problem, unless the inflation scale is sufficiently low, H_{inf} < 10^{8} GeV, or the reheating temperature is extremely low, T_{R} < 100 GeV. Here, this Polonyi problem is more serious than the original one, since the Polonyi field mainly decays into a pair of gravitinos. △ Less", "In R-parity conserving supersymmetric (SUSY) models, sleptons are produced in pairs at hadron colliders through neutral and charged electroweak currents. We demonstrate that the polarization of the initial hadron beams allows for a direct extraction of the slepton mixing angle and thus for a determination of the underlying SUSY-breaking mechanism. We also perform a first precision calculation of the transverse-momentum (q_T) spectrum of the slepton pairs by resumming soft multiple-gluon emission at next-to-leading logarithmic order. The results show a relevant contribution of resummation both in the small and intermediate q_T-regions, which strongly influences the extraction of the missing transverse-momentum signal and the subsequent slepton mass-determination, and little dependence on unphysical scales and non-perturbative contributions. △ Less", "A supersymmetric see-saw model obeying the flavor symmetry L_mu - L_tau, which naturally predicts quasi-degenerate neutrinos, is investigated. Breaking of the symmetry is introduced in the Dirac mass matrix because it is the most economic choice in the sense that all interesting low and high energy phenomenology is made possible: we analyze the predictions for the low energy neutrino observables, for leptogenesis and for lepton flavor violating decays such as mu \\to e gamma, where the SPS benchmark points for the SUSY parameters are used. It is outlined how these decays in connection with the requirement of successful leptogenesis and with correlations between the neutrino observables depend on the way the symmetry is broken. △ Less", "The precision determination of scalar top quark properties will play an important role at a future International Linear Collider (ILC). Recent and ongoing studies are discussed for different experimental topologies in the detector. First results are presented for small mass differences between the scalar top and neutralino masses. This corresponds to a small expected visible energy in the detector. An ILC will be a unique accelerator to explore this scenario. In addition to finding the existence of light stop quarks, the precise measurement of their properties is crucial for testing their impact on the dark matter relic abundance and the mechanism of electroweak baryogenesis. Significant sensitivity for mass differences down to 5 GeV are obtained. The simulation is based on a fast and realistic detector simulation. A vertex detector concept of the Linear Collider Flavor Identification (LCFI)collaboration, which studies pixel detectors for heavy quark flavour identification, is implemented in the simulations for c-quark tagging. The study extends simulations for large mass differences (large visible energy) for which aspects of different detector simulations, the vertex detector design, and different methods for the determination of the scalar top mass are discussed. Based on the detailed simulations we study the uncertainties for the dark matter density predictions and their estimated uncertainties from various sources. In the region of parameters where stop-neutralino co-annihilation leads to a value of the relic density consistent with experimental results, as precisely determined by the Wilkinson Microwave Anisotropy Probe (WMAP), the stop-neutralino mass difference is small and the ILC will be able to explore this region efficiently. △ Less", "The lepton flavour violating charged lepton decays mu to e + gamma and thermal leptogenesis are analysed in the minimal supersymmetric standard model with see-saw mechanism of neutrino mass generation and soft supersymmetry breaking terms with universal boundary conditions. Hierarchical spectrum of heavy Majorana neutrino masses, M_1 << M_2 << M_3, is considered. In this scenario, the requirement of successful thermal leptogenesis implies a lower bound on M_1. For the natural GUT values of the heaviest right-handed Majorana neutrino mass, M_3 > 5 times 10^{13} GeV, and supersymmetry particle masses in the few times 100 GeV range, the predicted mu to e + gamma decay rate exceeds by few order of magnitude the experimental upper limit. This problem is avoided if the matrix of neutrino Yukawa couplings has a specific structure. The latter leads to a correlation between the baryon asymmetry of the Universe predicted by leptogenesis, BR(mu to e + gamma) and the effective Majorana mass in neutrinoless double beta decay. △ Less", "We study D-brane inspired models with U(3) x U(2) x U(1)^N gauge symmetry in the context of split supersymmetry. We consider configurations with one, two and three (N=1,2,3) abelian branes and derive all hypercharge embeddings which imply a realistic particle content. Then, we analyze the implications of split supersymmetry on the magnitude of the string scale, the gauge coupling evolution, the third family fermion mass relations and the gaugino masses. We consider gauge coupling relations which may arise in parallel as well as intersecting brane scenarios and classify the various models according to their predictions for the magnitude of the string scale and the low energy implications. In the parallel brane scenario where the U(1) branes are superposed to U(2) or U(3) brane stacks, varying the split susy scale in a wide range, we find three distinct cases of models predicting a high, intermediate and low string scale, M_S ~ 10^{16} GeV, M_S ~ 10^7 GeV and M_S ~ 10^4 GeV respectively. We further find that in the intermediate string scale model the low energy ratio m_b / m_τis compatible with b-τYukawa unification at the string scale. Furthermore, we perform a similar analysis for arbitrary abelian gauge coupling relations at M_S corresponding to possible intersecting brane models. We find cases which predict a string scale of the order M_S \\ge 10^{14} GeV that accommodate a right-handed neutrino mass of the same order so that a see-saw type light left-handed neutrino component is obtained in the sub-eV range as required by experimental and cosmological data. Finally, a short discussion is devoted for the gaugino masses and the life-time of the gluino. △ Less", "We discuss the potential of combined LHC and ILC experiments for SUSY searches in a difficult region of the parameter space, in which all sfermion masses are above the TeV scale. Precision analyses of cross sections of light chargino production and forward--backward asymmetries of decay leptons and hadrons at the ILC, together with mass information on \\tildeχ^0_2 and squarks from the LHC, allow us to fit rather precisely the underlying fundamental gaugino/higgsino MSSM parameters and to constrain the masses of the heavy virtual sparticles. For such analyses the complete spin correlations between the production and decay processes have to be taken into account. We also took into account expected experimental uncertainties. △ Less", "We analyse the dependence of the rates of the LFV charged lepton decays mu to e + gamma, tau to e + gamma, tau to mu + gamma (l_i to l_j + gamma) and their ratios, predicted in the class of SUSY theories with see-saw mechanism of nu-mass generation and soft SUSY breaking with universal boundary conditions at the GUT scale, on the Majorana CP-violation phases in the PMNS neutrino mixing matrix and the ``leptogenesis'' CP-violating (CPV) parameters. The case of quasi-degenerate in mass heavy Majorana neutrinos is considered. The analysis is performed for normal hierarchical (NH), inverted hierarchical (IH) and quasi-degenerate (QD) light neutrino mass spectra. We show, in particular, that for NH and IH nu-mass spectrum and negligible lightest neutrino mass, all three l_i to l_j + gamma decay branching ratios, BR(l_i to l_j + gamma), depend on one Majorana phase, one leptogenesis CPV parameter and on the 3-neutrino oscillation parameters; if the CHOOZ mixing angle theta_13 is sufficiently large, they depend on the Dirac CPV phase in the PMNS matrix. The ``double ratios'' R(21/31) sim BR(mu to e + gamma)/BR(tau to e + gamma) and R(21/32) sim BR(mu to e + gamma)/BR(tau to mu + gamma) are determined by these parameters. The same Majorana phase enters into the NH and IH expressions for the effective Majorana mass in neutrinoless double beta decay, <m>. △ Less", "We analyse the complementarity between Lepton Flavour Violation (LFV) and LHC experiments in probing the Supersymmetric (SUSY) Grand Unified Theories (GUT) when neutrinos got a mass via the see--saw mechanism. Our analysis is performed in an SO(10) framework, where at least one neutrino Yukawa coupling is necessarily as large as the top Yukawa coupling. Our study thoroughly takes into account the whole RG running, including the GUT and the right handed neutrino mass scales, as well as the running of the observable neutrino spectrum. We find that the upcoming (MEG, SuperKEKB) and future (PRISM/PRIME, Super Flavour factory) LFV experiments will be able to test such SUSY framework for SUSY masses to be explored at the LHC and, in some cases, even beyond the LHC sensitivity reach. △ Less", "Supersymmetric (SUSY) theories include many new parameters, some of which are CP-violating. Assuming that SUSY is found at a future high-energy collider, we examine the decay stop2 -> stop1 tau- tau+ with an eye to obtaining information about the new CP phases. We show that there are two CP-violating asymmetries which can be large in some regions of the SUSY parameter space. These involve measuring one or both of the tau spins. These asymmetries are particularly sensitive to phi_At, the phase of the trilinear coupling A_t. △ Less", "We consider the possibility of neutrino mass generation in a supersymmetric model where lepton number can be violated by odd units. The different patterns of mixing in the quark and lepton sectors are attributed to the persence of right-chiral neutrino superfields which (a) enter into Yukawa couplings via non-renormalizable interaction with hidden sector fields, and (b) can violate lepton number by odd units. Both of these features are shown to be the result of some global quantum number which is violated when SUSY is broken in the hidden sector. It is shown how such a scenario, together with all known R-parity violating effects, can lead to neutrino masses and bilarge mixing via seesaw as well as radiative mechanisms. Some sample values of the various parameters involved, consistent with electroweak symmetry breaking constraints, are presented as illustrations. △ Less", "We compute the complete electroweak one-loop effect on the process of $t$-channel single top production at LHC in the Standard Model and in the MSSM within the mSUGRA symmetry breaking scheme. We find that the one-loop electroweak SM effect is large, and decreases the cross section of an amount that is of the same size as that of the NLO QCD one. The genuine SUSY effect in the mSUGRA scheme, for a general choice of benchmark points, is rather small. It might become large and visible in more general scenarios around thresholds involving light stop and neutralino mass values. △ Less", "In this note we give an example application of a recently presented predictive learning method called Rule Ensembles. The application we present is the search for super-symmetric particles at the Large Hadron Collider. In particular, we consider the problem of separating the background coming from top quark production from the signal of super-symmetric particles. The method is based on an expansion of base learners, each learner being a rule, i.e. a combination of cuts in the variable space describing signal and background. These rules are generated from an ensemble of decision trees. One of the results of the method is a set of rules (cuts) ordered according to their importance, which gives useful tools for diagnosis of the model. We also compare the method to a number of other multivariate methods, in particular Artificial Neural Networks, the likelihood method and the recently presented boosted decision tree method. We find better performance of Rule Ensembles in all cases. For example for a given significance the amount of data needed to claim SUSY discovery could be reduced by 15 % using Rule Ensembles as compared to using a likelihood method. △ Less", "The ability of the LHC to make statements about the dark matter problem is considered, with a specific focus on supersymmetry. After reviewing the current strategies for supersymmetry searches at the LHC (in both CMS and ATLAS), some key ATLAS studies are used to demonstrate how one could establish that SUSY exists before going on to measure the relic density of a neutralino WIMP candidate. Finally, the general prospects for success at the LHC are investigated by looking at different points in the MSSM parameter space. △ Less", "A library for reading and writing data in the SUSY Les Houches Accord 2 format is presented. The implementation is in native Fortran 77. The data are contained in a single array conveniently indexed by preprocessor statements. △ Less", "We derive new model independent constraints on the supersymmetric extensions of the standard model from the new experimental measurements of B_s -\\bar{B}_s mass difference. We point out that supersymmetry can still give a significant contribution to the CP asymmetry of B_s ->J/ψφthat can be measured at the LHCb experiment. These new constraints on the LL and RR squark mixing severely restricted their possible contributions to the CP asymmetries of B-> φK and B - >η' K. Therefore, SUSY models with dominant LR flavor mixing is the only way to accommodate the apparent deviation of CP asymmetries from those expected in the standard model. Finally we present an example of SUSY non-minimal flavor model that can accommodate the new ΔM_{B_s} results and also induces significant CP asymmetries in B_s ->J/ψφ, B->φK and B ->η' K processes. △ Less", "We survey the flavor-changing neutral couplings (FCNC) of the top quark predicted by some extensions of the Standard Model: THDM, SUSY, L-R symmetric, TC2, 331, and models with extra quarks. Since the expected sensitivity of the LHC and ILC for the tcV (V=γ,g,Z) and tcH couplings is of order of a few percent, we emphasize the importance of any new physics effect that gives a prediction for these FCNC couplings within this limit. We also review the constraints imposed on these couplings from low-energy precision measurements. △ Less", "In a previous work, we noted that vacua with higher flux could be obtained by recombination of a small set of hidden-sector branes, numbering up to the Kahler degrees of freedom left to be fixed in the problem. Here, we discuss the general construction of Type IIB Standard Model flux vacua in which multiple branes participate in brane recombination in the hidden sector. We present several models with 4, 5 and 10 branes in a stack. They are complete with Pati-Salam gauge group, Standard Model chiral matter, and a hidden sector that combines with nonzero flux to satisfy RR tadpole constraints. We also illustrate a puzzle: within the 4-brane recombination approach, we are unable to find a formal cutoff on the number of Standard Model flux vacua. Nevertheless, we show that phenomenological considerations are sure to cut off the number of vacua, albeit at an extraordinarily large value. We comment on the possibility that more formal constraints could further reduce the number of vacua. △ Less", "We investigate the phenomenology of supersymmetric models where moduli fields and the Weyl anomaly make comparable contributions to SUSY breaking effects in the observable sector of fields. This mixed modulus-anomaly mediated supersymmetry breaking (MM-AMSB) scenario is inspired by models of string compactification with fluxes, which have been shown to yield a de Sitter vacuum (as in the recent construction by Kachru {\\it et al}). The phenomenology depends on the so-called modular weights which, in turn, depend on the location of various fields in the extra dimensions. We find that the model with zero modular weights gives mass spectra characterized by very light top squarks and/or tau sleptons, or where M_1\\sim -M_2 so that the bino and wino are approximately degenerate. The top squark mass can be in the range required by successful electroweak baryogenesis. The measured relic density of cold dark matter can be obtained via top squark co-annihilation at low \\tanβ, tau slepton co-annihilation at large \\tanβor via bino-wino coannihilation. Then, we typically find low rates for direct and indirect detection of neutralino dark matter. However, essentially all the WMAP-allowed parameter space can be probed by experiments at the CERN LHC, while significant portions may also be explored at an e^+e^- collider with \\sqrt{s}=0.5--1 TeV. We also investigate a case with non-zero modular weights. In this case, co-annihilation, A-funnel annihilation and bulk annihilation of neutralinos are all allowed. Results for future colliders are qualitatively similar, but prospects for indirect dark matter searches via gamma rays and anti-particles are somewhat better. △ Less", "In this talk I will begin with a very brief discussion as to why TeV scale Supersymmetry forms an important subject of the studies at all the current and future Colliders. Then, I will give different examples where the Photon Linear Collider, PLC, will be able to make unique contributions. PlC's most important role is in the context of Higgs Physics, due to its ability of accurate determination of $Γ_{γγ}$ as well as the possibilities it offers for the determination of the CP property of the Higgs boson and of possible CP mixing in the Higgs sector. Further, the PLC can provide probes of SUSY in the regions of the SUSY parameter space, which are either difficult or inaccessible at the LHC and also in the $e^+e^-$ mode of the International Linear Collider (ILC). △ Less", "We consider extra dimensional field theory descriptions of backgrounds with N different throats where one of the extra dimensions in each throat is much larger than the others. Such backgrounds can be described by field theory on N 5D warped spaces which intersect on a ultraviolet (UV) brane. Given a field that propagates in all N throats there are N boundary conditions on the UV brane (which are determined by the effective Lagrangian on the UV brane) in addition to the boundary conditions on the N infrared branes. We derive a general set of UV boundary conditions and give examples of how they are applied to particular situations. Three simple example applications are given: in the first the number of families is determined by the number of throats and the SUSY flavor problem is solved via an S_3 symmetry of the throats; in the second we embed this scenario in a SUSY GUT with a solution of the doublet-triplet splitting problem based on the product group approach; while in the final example we show a simple geometric implementation of a SUSY trinification model on three throats. △ Less", "Mirage mediation reduces the fine-tuning in the minimal supersymmetric standard model by dynamically arranging a cancellation between anomaly-mediated and modulus-mediated supersymmetry breaking. We explore the conditions under which a mirage \"messenger scale\" is generated near the weak scale and the little hierarchy problem is solved. We do this by explicitly including the dynamics of the SUSY-breaking sector needed to cancel the cosmological constant. The most plausible scenario for generating a low mirage scale does not readily admit an extra-dimensional interpretation. We also review the possibilities for solving the mu/Bmu problem in such theories, a potential hidden source of fine-tuning. △ Less", "We discuss the implications, for general flavour mixing, of the recent results regarding the new allowed range for mixing in the $B_s$ meson system, as well as the new improved bounds on $BR(\\bar{B}_s\\toμ^+μ^-)$. Constraints on right handed insertions, in particular, improve considerably in the large $\\tanb$ regime where the contributions to $B_s$ mixing are dominated by double Higgs penguins. Similarly, the allowed regions of parameter space when varying multiple insertions also decrease significantly. △ Less", "It is pointed out that the recent measurement of the angle $γ$ of the unitarity triangle, providing irrefutable evidence for a complex Cabibbo-Kobayashi-Maskawa (CKM) matrix, presents a great challenge for supersymmetric models with spontaneous CP violation. We construct a new minimal extension of the minimal supersymmetric standard model (MSSM), with spontaneous CP breaking, which leads to a complex CKM matrix, thus conforming to present experimental data. This is achieved through the introduction of two singlet chiral superfields and a vector-like quark chiral superfield which mixes with the standard quarks. A $Z_3$ symmetry is introduced in order to have a potential solution to the strong CP problem. △ Less", "We construct an extension of the MSSM in which superpartners can naturally be heavier than the electroweak scale. This ``little hierarchy'' of scales is stable because the Higgs arises as a pseudo-Nambu-Goldstone boson in the breaking of an accidental SU(4) symmetry of the Higgs sector. Supersymmetry and the global symmetry combine to forbid logarithmically divergent one-loop contributions to the Higgs mass. The accidental symmetry follows from a simple ``twin'' parity which exchanges the SU(2) sectors in the SU(3)_C x SU(2)_L x SU(2)_R x U(1)_X gauge group. △ Less", "We calculate the electric dipole moments (EDM) of the neutral Hg(199) atom, neutron and deuteron within a generic R-parity violating SUSY model (RPV SUSY) on the basis of a one-pion exchange model with CP-odd pion-nucleon interactions. We consider two types of the RPV SUSY contributions to the above hadronic EDMs: via the quark chromoelectric dipole moments (CEDM) and CP-violating 4-quark interactions. We demonstrate that the former contributes to all the three studied EDMs while the latter appears only in the nuclear EDMs via the CP-odd nuclear forces. We find that the RPV SUSY induced 4-quark interactions arise at tree level through the sneutrino exchange and involve only s and b quarks. Therefore, their effect in hadronic EDMs is determined by the strange and bottom-quark sea of the nucleon. From the null experimental results on the hadronic EDMs we derive the limits on the imaginary parts of certain products Im(lambda'* lambda') of the trilinear RPV-couplings and show that the currently best limits come from the Hg(199) EDM experiments. We demonstrate that some of these limits are better than those existing in the literature. We argue that future storage ring experiments on the deuteron EDM are able to improve these limits by several orders of magnitude. △ Less", "We consider the scenario in which the mass matrices of the charged fermions in the SO(10) Grand Unified Theory are generated exclusively by renormalizable Yukawa couplings to one $\\mathbf{10} \\oplus \\mathbf{120}$ representation of scalars. We analyze, partly analytically and partly numerically, this scenario in the three-generations case. We demonstrate that it leads to unification of the $b$ and $τ$ masses at the GUT scale. Testing this scenario against the mass values at the GUT scale, obtained from the renormalization-group evolution in the minimal SUSY extension of the Standard Model, we find that it is not viable: either the down-quark mass or the top-quark mass must be unrealistically low. If we include the CKM mixing angles in the test, then, in order that the mixing angles are well reproduced, either the top-quark mass or the strange-quark mass together with the down-quark mass must be very low. We conclude that, assuming a SUSY SO(10) scenario, charged-fermion mass generation based exclusively on one $\\mathbf{10} \\oplus \\mathbf{120}$ representation of scalars is in contradiction with experiment. △ Less", "We point out that the right-handed squark mixings can sizably enhance SUSY contributions to Delta M_s by taking into account renormalization group effects via the CKM matrix. The recent result of Delta M_s from the D0 experiment at the Tevatron thus implies a strong constraint on the right-handed mixings. △ Less", "Supersymmetry broken by anomaly mediation suffers from tachyonic slepton masses. A possible solution to this problem results in \"decoupling\", i.e., the first two generations of sfermions are much heavier than the third one. We note that in this scenario a sizable loop-induced contribution to the neutrino mass matrix results. As an application of this scenario we take advantage of the fact that the decoupling evidently not obeys 2-3 generation exchange symmetry. In the neutrino sector, this 2-3 symmetry (or mu-tau symmetry) is a useful Ansatz to generate zero theta_{13} and maximal theta_{23}. The induced deviations from these values are given for some examples, thereby linking SUSY breaking to the small parameters (including possibly the solar mass splitting) of the neutrino sector. △ Less", "In gravity-mediated SUSY breaking models with non-universal gaugino masses, lowering the SU(3) gaugino mass |M_3| leads to a reduction in the squark and gluino masses. Lower third generation squark masses, in turn, diminish the effect of a large top quark Yukawa coupling in the running of the higgs mass parameter m_{H_u}^2, leading to a reduction in the magnitude of the superpotential mu parameter (relative to M_1 and M_2). A low | mu | parameter gives rise to mixed higgsino dark matter (MHDM), which can efficiently annihilate in the early universe to give a dark matter relic density in accord with WMAP measurements. We explore the phenomenology of the low |M_3| scenario, and find for the case of MHDM increased rates for direct and indirect detection of neutralino dark matter relative to the mSUGRA model. The sparticle mass spectrum is characterized by relatively light gluinos, frequently with m(gl)<<m(sq). If scalar masses are large, then gluinos can be very light, with gl->Z_i+g loop decays dominating the gluino branching fraction. Top squarks can be much lighter than sbottom and first/second generation squarks. The presence of low mass higgsino-like charginos and neutralinos is expected at the CERN LHC. The small m(Z2)-m(Z1) mass gap should give rise to a visible opposite-sign/same flavor dilepton mass edge. At a TeV scale linear e^+e^- collider, the region of MHDM will mean that the entire spectrum of charginos and neutralinos are amongst the lightest sparticles, and are most likely to be produced at observable rates, allowing for a complete reconstruction of the gaugino-higgsino sector. △ Less", "In the framework of Supersymmetric Grand Unified Theories (SUSY GUTs), the universe undergoes a cascade of symmetry breakings, during which topological defects can be formed. We address the question of the probability of cosmic string formation after a phase of hybrid inflation within a large number of models of SUSY GUTs in agreement with particle and cosmological data. We show that cosmic strings are extremely generic and should be used to relate cosmology and high energy physics. This conclusion is employed together with the WMAP CMB data to strongly constrain SUSY hybrid inflation models. F-term and D-term inflation are studied in the SUSY and minimal SUGRA framework. They are both found to agree with data but suffer from fine tuning of their superpotential coupling (λ\\lesssim 3\\times 10^(-5) or less). Mass scales of inflation are also constrained to be less than M \\lesssim 3\\times 10^(15) GeV. △ Less", "We study the feasibility of detecting the stau neutralino (stau_1-neutralino_1)coannihilation region at the LHC using tau leptons. The signal is characterized by multiple low energy tau leptons from neutralino_2-->tau stau_1-->tau tau neutralino_1 decays, where the stau_1 and neutralino_1 mass difference (Delta M) is constrained to be 5-15 GeV by current experimental bounds including the bound on the amount of neutralino cold dark matter. Within the framework of minimal supergravity models, we show that if hadronically decaying tau's can be identified with 50% efficiency for visible pt >20 GeV the observation of such signals is possible in the final state of two tau leptons plus large missing energy and two jets. With a gluino mass of 830 GeV the signal can be observed with as few as 3-10 fb^-1 of data (depending on the size of Delta M). Using a mass measurement of the tau pairs with 10 fb^-1 we can determine dM with a statistical uncertainty of 12% for Delta M = 10 GeV and an additional systematic uncertainty of 14% if the gluino mass has an uncertainty of 5%. △ Less", "We study the constraints on supersymmetric contributions to b to s transitions from the recent allowed range and measurement of Bs-Bsbar mixing obtained by the D0 and CDF collaborations at the Tevatron. We compute the upper bounds on the relevant off-diagonal squark mass terms and compare them with the bounds coming from Delta F=1 decays. We find that the constraints on chirality-flipping mass insertions are unaffected. Conversely, the measurement of Bs-Bsbar mixing is effective in constraining chirality-conserving mass insertions, and it has striking effects in the case in which left- and right-handed insertions have similar size. Finally, we discuss the phase of the Bs-Bsbar mixing amplitude in the presence of SUSY contributions. △ Less", "SO(10) GUT models with only small Higgs fields use higher-dimensional operators to generate realistic fermion mass matrices. In particular, a Higgs field in the spinor representation, 16^d_H, acquires a weak scale vev. We include the weak vev of the corresponding field \\bar{16}^u_H and investigate the effect on two successful models, one by Albright and Barr (AB) and another by Babu, Pati and Wilczek (BPW). We find that the BPW model is a particular case within a class of models with identical fermion masses and mixings. In contrast, we expect corrections to the parameters of AB-type models. △ Less", "We calculate the kinetic-decoupling temperature for weakly interacting massive particles (WIMPs) in supersymmetric (SUSY) and universal-extra-dimension (UED) models that can account for the cold-dark-matter abundance determined from cosmic microwave background measurements. Depending on the parameters of the particle-physics model, a wide variety of decoupling temperatures is possible, ranging from several MeV to a few GeV. These decoupling temperatures imply a range of masses for the smallest protohalos much larger than previously thought -- ranging from 10^{-6} earth masses to 10^{2} earth masses. We expect the range of protohalos masses derived here to be characteristic of most particle-physics models that can thermally accommodate the required relic abundance of WIMP dark matter, even beyond SUSY and UED. △ Less", "A systematic method to obtain the effective Lagrangian on the BPS background in supersymmetric gauge theories is worked out, taking domain walls and vortices as concrete examples. The Lagrangian in terms of the superfields for four preserved SUSY is expanded in powers of the slow-movement parameter lambda. The expansion gives the superfield form of the BPS equations at {O}(lambda^0), and all the fluctuation fields at {O}(lambda^1). The density of the Kaehler potential for the effective Lagrangian follows as an automatic consequence of the lambda expansion with manifest (four preserved) SUSY. △ Less", "Dynamical supersymmetry breaking in a long-lived meta-stable vacuum is a phenomenologically viable possibility. This relatively unexplored avenue leads to many new models of dynamical supersymmetry breaking. Here, we present a surprisingly simple class of models with meta-stable dynamical supersymmetry breaking: N=1 supersymmetric QCD, with massive flavors. Though these theories are strongly coupled, we definitively demonstrate the existence of meta-stable vacua by using the free-magnetic dual. Model building challenges, such as large flavor symmetries and the absence of an R-symmetry, are easily accommodated in these theories. Their simplicity also suggests that broken supersymmetry is generic in supersymmetric field theory and in the landscape of string vacua. △ Less", "We present a detailed study of the reduction to 4D of 5D supergravity compactified on the S^1/Z_2 orbifold. For this purpose we develop and employ a recently proposed N=1 conformal superfield description of the 5D supergravity couplings to abelian vector and hypermultiplets. In particular, we obtain a unique relation of the \"radion\" to chiral superfields as in global 5D SUSY and we can embed the universal hypermultiplet into this formalism. In our approach, it is transparent how the superconformal structure of the effective 4D actions is inherited from the one of the original 5D supergravity. We consider both ungauged and gauged 5D supergravities. This includes compactifications in unwarped geometries, generalizations of the supersymmetric Randall-Sundrum (RS) model as well as 5D heterotic M-theory. In the unwarped case, after obtaining the effective Kaehler potentials and superpotentials, we demonstrate that the tree-level 4D potentials have flat and/or tachyonic directions. One-loop corrections to the Kaehler potential and gaugino condensation are presented as suitable tools for moduli stabilization to be discussed in subsequent work. Turning to the RS-like models, we obtain a master formula for the Kaehler potential for an arbitrary number of vector and hyper moduli, which we evaluate exactly for special cases. Finally, we formulate the superfield description of 5D heterotic M-theory and obtain its effective 4D description for the universal (h^(1,1)=1) case, in the presence of an arbitrary number of bulk 5-branes. We present, as a check of our expressions, time-dependent solutions of 4D heterotic M-theory, which uplift to 5D solutions generalizing the ones recently found in hep-th/0502077. △ Less", "We consider supersymmetric non-Abelian gauge theories coupled to hyper multiplets on five and six dimensional orbifolds, S^1/Z_2 and T^2/Z_N, respectively. We compute the bulk and local fixed point renormalizations of the gauge couplings. To this end we extend supergraph techniques to these orbifolds by defining orbifold compatible delta functions. We develop their properties in detail. To cancel the bulk one-loop divergences the bulk gauge kinetic terms and dimension six higher derivative operators are required. The gauge couplings renormalize at the Z_N fixed points due to vector multiplet self interactions; the hyper multiplet renormalizes only non-Z_2 fixed points. In 6D the Wess-Zumino-Witten term and a higher derivative analogue have to renormalize in the bulk as well to preserve 6D gauge invariance. △ Less", "Combining the Berends-Giele and on-shell recursion relations we obtain an extremely compact expression for the scattering amplitude of a complex scalar-antiscalar pair and an arbitrary number of positive helicity gluons. This is one of the basic building blocks for constructing other helicity configurations from recursion relations. We also show explicity that the all positive helicity gluons amplitude for heavy fermions is proportional to the scalar one, confirming in this way the recently advocated SUSY-like Ward identities relating both amplitudes. △ Less", "We use supersymmetric Ward identities to relate multi-gluon helicity amplitudes involving a pair of massive quarks to amplitudes with massive scalars. This allows to use the recent results for scalar amplitudes with an arbitrary number of gluons obtained by on-shell recursion relations to obtain scattering amplitudes involving top quarks. △ Less", "Rare astrophysical events - cosmological gamma-ray bursts with energies over GeV - are considered as an origin of information about some SUSY parameters. The model of generation of the powerful gamma-ray bursts is proposed. According to this model the gamma-ray burst represents as a result of the collapse and the total annihilation of the neutralino clump. About 80 % of the clump mass radiates during about 100 second at the final stage of annihilation. The annihilation spectrum and its characteristic energies are calculated in the framework of Split Higgsino model. △ Less", "The apparent unification of gauge couplings around 10^16 GeV is one of the strong arguments in favor of Supersymmetric extensions of the Standard Model (SM). In this contribution two new analyses of the gauge coupling running, the latter using in contrast to previous studies not data at the Z peak but at LEP2 energies, are presented. The generic SUSY scale in the more precise novel approach is 93 < M_SUSY < 183 GeV, easily within LHC, and possibly even within Tevatron reach. △ Less", "Final results from the MSSM Higgs boson searches from the LEP experiments ALEPH, DELPHI, L3 and OPAL are presented. The results are statistically combined and the statistical significance for signal and background hypotheses are given. Upper bounds on the production cross sections are set for several Higgs-like topologies. Interpretations for six benchmark scenarios in the MSSM, both for CP-conserving and CP-violating scenarios, are given. Limits on the tan(beta) parameter, and in some scenarios upper limits on the neutral Higgs boson masses are set. △ Less", "We perform a comprehensive exploration of the Constrained MSSM parameters using a Markov Chain Monte Carlo technique and a Bayesian analysis. We compute superpartner masses and other collider observables as well as a cold dark matter abundance, and compare them with experimental data. We include uncertainties arising from theoretical approximations as well as from residual experimental errors on relevant SM parameters. We delineate probability distributions of the CMSSM parameters, the collider and cosmological observables as well as a dark matter direct detection cross section. The 68% probability intervals of the CMSSM parameters are: 0.52 TeV < m_{1/2} < 1.26 TeV, m_0 <2.10 TeV, -0.34 TeV < A_0 < 2.41 TeV and 38.5< tan(beta) <54.6. Generally, large fractions of high probability ranges of the superpartner masses will be probed at the LHC. We highlight a complementarity between LHC and WIMP dark matter searches in exploring the CMSSM parameter space. We further expose a number of correlations among the observables, in particular between BR(B_s \\to μ^+ μ^-) and BR({\\bar B}\\to X_sγ) or sigma_p^{SI}. Once SUSY is discovered, this and other correlations may prove helpful in distinguishing the CMSSM from other supersymmetric models. The robustness of our results is investigated in terms of the assumed ranges of CMSSM parameters and the effect of the (g-2)_mu anomaly which shows some tension with the other observables. We find that the results for m_0, and the observables which strongly depend on it, are sensitive to our assumptions, while our conclusions for the other variables are robust. △ Less", "When the minimal supersymmetric standard model is augmented by three right-handed neutrino superfields, one generically predicts that the neutrinos acquire Majorana masses. We postulate that all supersymmetry (SUSY) breaking masses as well as the Majorana masses of the right-handed neutrinos are around the electroweak scale and, motivated by the smallness of neutrino masses, assume that the lightest supersymmetric particle (LSP) is an almost-pure right-handed sneutrino. We discuss the conditions under which this LSP is a successful dark matter candidate. In general, such an LSP has to be nonthermal in order not to overclose the universe, and we find the conditions under which this is indeed the case by comparing the Hubble expansion rate with the rates of the relevant thermalizing processes, including self-annihilation and co-annihilation with other SUSY and standard model particles. △ Less", "The evidence for a positive vacuum energy in our universe suggests that we might be living in a false vacuum destined to ultimately decay to a true vacuum free of dark energy. At present the simplest example of such a universe is one that is exactly supersymmetric (susy). It is expected that the nucleation rate of critically sized susy bubbles will be enhanced in regions of high density such as in degenerate stars. The consequent release of energy stored in Pauli towers provides a possible model for gamma ray bursts. Whether or not all or any of the currently observed bursts are due to this mechanism, it is important to define the signatures of this susy phase transition. After such a burst, due to the lifting of degeneracy pressure, the star would be expected to collapse into a black hole even though its mass is below the Chandrasekhar limit. Previous studies have treated the star as fully releasing its stored energy before the collapse. In this article we make an initial investigation of the effects of the collapse during the gamma ray emission. △ Less", "The gauge coupling unification is one of main motivations in the split-SUSY scenario, and the existence of the grand unified theories (GUTs) is assumed. We examine how to realize split-SUSY mass spectrum in the context of GUTs and find that the construction of split-SUSY GUTs is by no means straightforward. With R-symmetry breaking sources in the GUT sector, GUT particles play a role of the messengers in the gauge mediation scenario and their contributions to gaugino masses can be sizable. We find the upper bound on soft scalar masses of O(10^{10}) GeV from consistency for constructing the split-SUSY GUT. Also, we discuss the attempt to construct R-symmetric GUT models. △ Less", "We review some basic flux vacua counting techniques and results, focusing on the distributions of properties over different regions of the landscape of string vacua and assessing the phenomenological implications. The topics we discuss include: an overview of how moduli are stabilized and how vacua are counted; the applicability of effective field theory; the uses of and differences between probabilistic and statistical analysis (and the relation to the anthropic principle); the distribution of various parameters on the landscape, including cosmological constant, gauge group rank, and SUSY-breaking scale; \"friendly landscapes\"; open string moduli; the (in)finiteness of the number of phenomenologically viable vacua; etc. At all points, we attempt to connect this study to the phenomenology of vacua which are experimentally viable. △ Less", "We discuss the spectrum of Higgs bosons in the framework of the exceptional supersymmetric standard model. The presence of a $Z'$ and exotic particles predicted by the exceptional SUSY model allows the lightest Higgs particle to be significantly heavier than in the MSSM and NMSSM. When the mass of the lightest Higgs boson is larger than $135-140 {GeV}$ the heaviest scalar, pseudoscalar and charged Higgs states lie beyond the ${TeV}$ range. △ Less", "We calculate the pole mass of the gluino as a function of the running parameters in the lagrangian, to O(alpha_s^2) in SUSY QCD. The correction shifts the pole mass from the running mass by typically 1-2 %. This shift can be larger than the expected accuracy of the mass determination at future colliders, and should be taken into account for precision studies of the SUSY breaking parameters. The effects of other corrections are breifly commented. △ Less", "Production of (electrically neutral) heavy-quark pairs, such as t{\\bar c} and {\\bar t}c, is extremely suppressed in the SM. In supersymmetric (SUSY) theories, such as the MSSM, the number of these events can be significantly enhanced thanks (mainly) to the FCNC couplings of gluinos. We compute the efficiency of this mechanism for FCNC production of heavy quarks at the LHC. We find that σ(pp\\to t\\bar{c}+\\bar{t}c) can reach 1 pb, and therefore one can expect up to 10^{5} events per 100 fb^{-1} of integrated luminosity (with no counterpart in the SM). Their detection would be instant evidence of new physics, and could be a strong indication of underlying SUSY dynamics. △ Less", "We compute and analyze the Flavor-Changing Neutral Current (FCNC) interactions of Minimal Supersymmetric Standard Model Higgs bosons (h = h0, H0, A0) with heavy quarks (top and bottom), focusing on the strongly-interacting sector. We correlate the Higgs bosons production cross-section at the LHC with the FCNC decay branching ratios and find the maximum allowed values of the production rates, sigma(pp -> h -> qq') = sigma(pp -> h) x B(h -> qq') (qq'= tc or bs) after taking into account limits from low energy data on flavor-changing interactions. We single out the top channel, with a maximum production rate of sigma^max(pp -> h -> tc) =~ 10^-3 - 10^-2 pb, as the most promising FCNC channel to be detected at the LHC. △ Less", "We compute, in the MSSM framework, the total electroweak contributions at one loop for the process pp -> tW+X, initiated by the parton process bg -> tW. The supersymmetric effect is analyzed for various choices of the SUSY benchmark points. Choosing realistic unpolarized and polarized experimental quantities, we show the size of the various effects and discuss their dependence on the MSSM parameters. △ Less", "By choosing two typical input parameter points in the minimal supergravity (mSUGRA) model and using the QCD factorization (QCDF) approach, we studied the supersymmetric effects to the CP violation of the two-body charmless hadronic $B$ meson decays. We found that though the SUSY contributions can give large corrections to the CP asymmetries for some decay channels, they could not be distinguished experimentally from the SM values because of the large theoretical errors dominated by calculating the annihilation contributions in the QCDF approach. △ Less", "The last decade has seen the emergence of a wide range of automated calculations for supersymmetric extensions of the Standard Model. This guide contains a brief summary of these, with the main focus on hadron collider phenomenology, as well as a brief introduction to the so-called SUSY Les Houches Accord. See also the Les Houches Web Repository for BSM Tools: http://www.ippp.dur.ac.uk/montecarlo/BSM/ △ Less", "We study the trinified model, SU(3)_C x SU(3)_L x SU(3)_R x Z_3, with the minimal Higgs sector required for symmetry breaking. There are five Higgs doublets, and gauge-coupling unification results if all five are at the weak scale, without supersymmetry. The radiative see-saw mechanism yields sub-eV neutrino masses, without the need for intermediate scales, additional Higgs fields, or higher-dimensional operators. The proton lifetime is above the experimental limits, with the decay modes p -> \\barνK^+ and p -> μ^+ K^0 potentially observable. We also consider supersymmetric versions of the model, with one or two Higgs doublets at the weak scale. The radiative see-saw mechanism fails with weak-scale supersymmetry due to the nonrenormalization of the superpotential, but operates in the split-SUSY scenario. △ Less", "We study vacuum structure of N=2 supersymmetric (SUSY) QCD, based on the gauge group SU(2) with N_f=2 flavors of massive hypermultiplet quarks, in the presence of non-zero baryon chemical potential (μ). The theory has a classical vacuum preserving baryon number symmetry, when a mass term, which breaks N=2 SUSY but preserves N=1 SUSY, for the adjoint gauge chiral multiplet (m_{ad}) is introduced. By using the exact result of N=2 SUSY QCD, we analyze low energy effective potential at the leading order of perturbation with respect to small SUSY breaking parameters, μand m_{ad}. We find that the baryon number is broken as a consequence of the SU(2) strong gauge dynamics, so that color superconductivity dynamically takes place at the non-SUSY vacuum. △ Less", "The recent WMAP data have confirmed that exotic dark matter together with the vacuum energy (cosmological constant) dominate in the flat Universe. Thus the direct dark matter detection, consisting of detecting the recoiling nucleus, is central to particle physics and cosmology. Supersymmetry provides a natural dark matter candidate, the lightest supersymmetric particle (LSP). The relevant cross sections arise out of two mechanisms: i) The coherent mode, due to the scalar interaction and ii) The spin contribution arising from the axial current. In this paper we will focus on the spin contribution, which maybe important, especially for light targets. △ Less", "We formulate and discuss a 4-dimensional SUSY version of an A4 model for tri-bimaximal neutrino mixing which is completely natural. We also study the next-to-the-leading corrections and show that they are small, once the ratios of A4 breaking VEVs to the cutoff are fixed in a specified interval. We also point out an interesting way of presenting the A4 group starting from the modular group. In this approach, which could be interesting in itself as an indication on a possible origin of A4, the lagrangian basis where the symmetry is formulated coincides with the basis where the charged leptons are diagonal. If the same classification structure in A4 is extended from leptons to quarks, the CKM matrix coincides with the unit matrix in leading order and a study of non leading corrections shows that the departures from unity of the CKM matrix are far too small to accomodate the observed mixing angles. △ Less", "We study KKLT type models with moduli-mixing superpotential. In several string models, gauge kinetic functions are written as linear combinations of two or more moduli fields. Their gluino condensation generates moduli-mixing superpotential. We assume one of moduli fields is frozen already around the string scale. It is found that Kähler modulus can be stabilized at a realistic value without tuning 3-form fluxes because of gluino condensation on (non-)magnetized D-brane. Furthermore, we do not need to highly tune parameters in order to realize a weak gauge coupling and a large hierarchy between the gravitino mass and the Planck scale, when there exists non-perturbative effects on D3-brane. SUSY breaking patterns in our models have a rich structure. Also, some of our models have cosmologically important implications, e.g., on the overshooting problem and the destabilization problem due to finite temperature effects as well as the gravitino problem and the moduli problem. △ Less", "This is a preliminary version, comments and inputs are welcome. Contents: 1. Introduction. 2. Fuzzy Spaces. 3. Star Products. 4. Scalar Fields on the Fuzzy Sphere. 5. Instantons, Monopoles and Projective Modules. 6. Fuzzy Nonlinear Sigma Models. 7. Fuzzy Gauge Theories. 8. The Dirac Operator and Axial Anomaly. 9. Fuzzy Supersymmetry. 10.Fuzzy Spaces as Hopf Algebras. △ Less", "This report reviews the properties of Higgs bosons in the Standard Model (SM) and its various extensions. We give an extensive overview about the potential of the ILC operated at centre-of-mass energies up to 1 TeV (including the gamma gamma option) for the determination of the Higgs boson properties. This comprises the measurement of the Higgs boson mass, its couplings to SM fermions and gauge bosons, and the determination of the spin and the CP quantum numbers of the Higgs. The extensions of the SM that are analyzed in more detail are heavy SM-like Higgs bosons, heavy Higgs bosons in the framework of Supersymmetry (SUSY) and further exotic scenarios. We review recent theoretical developments in the field of Higgs boson physics. The important question what the ILC can contribute to Higgs boson physics after the LHC, the LHC/ILC interplay and synergy is discussed. The impact of Higgs boson physics on cosmology in several SUSY frameworks is analyzed. The impact of the accelerator and dector performance on the precision of measurements are discussed in detail. We propose a strategy to optimize future analyses. Open questions arising for the various topics are listed, further topics of study and corresponding roadmaps are suggested. △ Less", "Inspired by the existing calculation of B->piK decays in supersymmetry (SUSY), we evaluate the dominant SUSY contributions to Bs->K+K-. We show that the observables of this process can be significantly modified in the presence of SUSY. In particular, the branching ratio can be increased considerably compared to the prediction of the standard model (SM). The effect is even more dramatic for the CP-violating asymmetries A_dir and A_mix. These asymmetries, expected to be small in the SM (A_dir is predicted to take only positive values), change drastically with SUSY contributions. The measurement of these observables can therefore be used to detect the presence of physics beyond the SM, and put constraints on its parameters. △ Less", "The recent NA48/2 improvement on R_K=Gamma(K->e nu_e)/Gamma(K->mu nu_mu) emphasizes the role of K_l2 decays in probing the mu-e universality. Supersymmetric (SUSY) extensions of the Standard Model can exhibit mu-e non-universal contributions. Their origin is twofold: those deriving from lepton flavor conserving couplings are subdominant with respect to those arising from lepton flavor violating (LFV) sources. We show that mu-e non-universality in K_l2 is quite effective in constraining relevant regions of SUSY models with LFV (for instance, supergravities with a see-saw mechanism for neutrino masses). A comparison with analogous bounds coming from tau LFV decays proves the relevance of the measurement of R_K to probe LFV in SUSY. △ Less", "The semileptonic decays $τ^- \\to μ^- M (M=π^0,η,η')$ could be sensitive probe for new physics scenarios with lepton flavor violation(LFV). Motivated by the recent Belle measurement, we investigate these decays in type III two-Higgs-doublet model (2HDM III), R-parity violating supersymmetric models(RPV SUSY) and flavor changing $Z'$ models with family non-universal couplings, respectively. In these new physics scenarios, there are LFV couplings at tree level. Our results have shown that the decays are very sensitive to the LFV couplings and could be enhanced to the present experimental sensitivities. We have derived strong bounds on relevant couplings of these models, which may be useful for further relevant studies. △ Less", "We study the constraints on a minimal supersymmetric seesaw model imposed by neutrino data, charged lepton flavor violation, thermal leptogenesis and perturbativity. We show that it is possible to constrain the three heavy Majorana neutrino masses as well as the complex Yukawa coupling matrix. Our results provide a first step towards a seesaw benchmark model for further phenomenological studies and model building. △ Less", "The production of exotic heavy hadronic particles arise in several models for physics beyond the Standard Model. A study of the detection possibilities of new heavy hadron states with the ATLAS detector is presented. The focus is on R-hadrons, which are stable hadronized gluinos, predicted by certain supersymmetric models. Interactions and signatures of single R-hadrons are studied with the ATLAS simulation and reconstruction framework and issues concerning triggering on R-hadron events are addressed. The ATLAS fast simulation framework has been extended to include parameterizations for R-hadrons. Based on topological and kinematic variables only, the discovery potential of the ATLAS detector for R-hadron events produced in pp->g~g~, is studied for masses below 2 TeV/c^2. R-hadrons with masses as predicted by standard SUSY scenarios would be discovered already in the very early stages of the running of the LHC. The discovery reach of heavy gluinos, predicted by for example split supersymmetry models, extends up to at least 1.8 \\tevcc for three years running of the LHC at low luminosity. △ Less", "Models where supersymmetry (SUSY) is manifest only in a sector of the low-energy spectrum have been recently proposed as an alternative to the MSSM. In these models the electroweak scale is explained by a fine-tuning between different Higgs mass contributions (split-SUSY models), or by the localization of the Higgs sector in a point of an extra dimension where all the mass parameters are suppressed by the metric (partly-SUSY models). Therefore, the presence of a good dark matter candidate becomes the main motivation for (partial) low-energy SUSY. We study this issue in minimal frameworks where the higgsinos are the only light supersymmetric particles. Whereas in split-SUSY models the higgsino should have a mass around 1 TeV, we show that in partly-SUSY models the lightest higgsino could also be found below MW. △ Less", "We suggest a supersymmetric (SUSY) explanation of neutrino masses and mixing, where nonrenormalizable interactions in the hidden sector generate lepton number violating Majorana mass terms for both right-chiral sneutrinos and neutrinos. It is found necessary to start with a superpotential including an array of gauge singlet chiral superfields. This leads to nondiagonal $ΔL = 2$ mass terms and almost diagonal SUSY breaking $A$-terms. As a result, the observed pattern of bilarge mixing can be naturally explained by the simultaneous existence of the seesaw mechanism and radiatively induced masses. Allowed ranges of parameters in the gauge singlet sector are delineated, corresponding to each of the cases of normal hierarchy, inverted hierarchy and degenerate neutrinos. △ Less", "Uncertainties of the MSSM predictions are due to an unknown SUSY breaking mechanism. To reduce these uncertainties, one usually imposes constraints on the MSSM parameter space. Recently, two new constraints became available, both from astrophysics: WMAP precise measurement of the amount of the Dark Matter in the Universe and EGRET data on an excess in diffuse gamma ray flux. Being interpreted as a manifestation of supersymmetry these data lead to severe constraints on parameter space and single out a very restricted area. The key feature of this area is the splitting of light gauginos from heavy squarks and sleptons. We study the phenomenological properties of this scenario, in particular, the cross-sections of superparticle production, their decay patterns and signatures for observation at hadron colliders, Tevatron and LHC. We found that weakly interacting particles in this area are very light so that the cross-sections may reach fractions of a pb with jets and/or leptons as final states accompanied by missing energy taken away by light neutralino with a mass around 100 GeV. △ Less", "Gauge coupling unification and the success of TeV-scale weakly interacting dark matter are usually taken as evidence of low energy supersymmetry (SUSY). However, if we assume that the tuning of the higgs can be explained in some unnatural way, from environmental considerations for example, SUSY is no longer a necessary component of any Beyond the Standard Model theory. In this paper we study the minimal model with a dark matter candidate and gauge coupling unification. This consists of the SM plus fermions with the quantum numbers of SUSY higgsinos, and a singlet. It predicts thermal dark matter with a mass that can range from 100 GeV to around 2 TeV and generically gives rise to an electric dipole moment that is just beyond current experimental limits, with a large portion of its allowed parameter space accessible to next generation EDM and direct detection experiments. We study precision unification in this model by embedding it in a 5-D orbifold GUT where certain large threshold corrections are calculable, achieving gauge coupling and b-tau unification, and predicting a rate of proton decay just beyond current limits. △ Less", "Motivated by recent progress in experimental techniques of electric dipole moment (EDM) measurements, we study correlations between the neutron and electron EDMs in common supersymmetric models. These include minimal supergravity (mSUGRA) with small CP phases, mSUGRA with a heavy SUSY spectrum, the decoupling scenario and split SUSY. In most cases, the electron and neutron EDMs are found to be observable in the next round of EDM experiments. They exhibit certain correlation patterns. For example, if d_n ~ 10^{-27} e cm is found, d_e is predicted to lie in the range 10^{-28}-10^{-29} e cm. △ Less", "We study SUSY phenomenology of the KKLT (Kachru-Kallosh-Linde-Trivedi) scenario of string theory compactifications with fluxes. This setup leads to a specific pattern of soft masses and distinct phenomenological properties. In particular, it avoids the cosmological gravitino/moduli problems. Remarkably, the model allows for the correct abundance of SUSY dark matter consistently with all experimental constraints including the bound on the Higgs mass, b-->s gamma, etc. This occurs for both small and large tan beta, and requires the SUSY spectrum above 1 TeV. △ Less", "The production rate of the CP-odd Higgs boson in the Minimal Supersymmetric Standard Model is evaluated through next-to-leading order in the strong coupling constant. The divergent integrals are regulated using Dimensional Reduction, with a straightforward implementation of $γ_5$. The result is confirmed within Dimensional Regularization where $γ_5$ is implemented according to the Standard Model calculation of Chetyrkin et al. The well-known Standard Model result is recovered if the masses of the supersymmetric particles tend to infinity. △ Less", "We give detailed predictions for diffractive SUSY Higgs boson and top squark associated productions at the LHC via the exclusive double pomeron exchange mechanism. We study how the SUSY Higgs cross section and the signal over background ratio are enhanced as a function of tangent beta in different regimes. The prospects are particularly promising in the ``anti-decoupling'' regime, which we study in detail. We also give the prospects for a precise measurement of the top squark mass using the threshold scan of central diffractive associated top squark events at the LHC. △ Less", "We study the potential of neutralino dark matter searches and SUSY particle production at colliders in the framework of the Minimal Supersymmetric Standard Model. We show the effects of a non universal gluino mass parameter. The future experiments will be a stringent probe of the low energy MSSM and neutralino dark matter scenario. The deeper informations on both supersymmetry and astrophysics hypothesis will be obtained by correlation of the different signals or absence of signal. △ Less", "We provide, in a framework of vector-like gauge theories, concrete models for conformal sequestering of dynamical supersymmetry (SUSY) breaking in the hidden sector. If the sequestering is sufficiently strong, anomaly mediation of the SUSY breaking may give dominant contributions to the mass spectrum of SUSY standard-model particles, leading to negative slepton masses squared. Thus, we also consider a model with gravitational gauge mediation to circumvent the tachyonic slepton problem in pure anomaly mediation models. △ Less", "Under general circumstances full thermal equilibrium may not be established for a long period after perturbative or non-perturbative decay of the inflaton has completed. One can instead have a distribution of particles which is in kinetic equilibrium and evolves adiabatically during this period. Number-violating reactions which are required to establish chemical equilibrium can become efficient only at much later times. We highlight some of the striking consequences of such a quasi-thermal Universe. In particular, thermal gravitino production yields {\\it no bound} on the maximum temperature of the primordial thermal bath alone. As another consequence, the lower bound on the mass of the lightest right-handed (s)neutrino from thermal leptogenesis can be $\\gg 10^{9}$ GeV. Depending on the phase, a Wino or Higgsino considerably lighter than TeV, or a Bino in the bulk region, can be a viable {\\it thermal} dark matter candidate. Finally the electroweak symmetry may never be restored in the early Universe, therefore weakening any hopes of realizing a successful electroweak baryogenesis. △ Less", "The achievable tanbeta determination accuracy for CMS at LHC is presented. Using MSSM H/A->tau tau decay in the associated production process gg->bbH/A the event rates are measured at large tanbeta and the systematic and statistical errors are estimated. Due to sensitivity of the above event rates to tanbeta it is shown that it is possible to determine constraints on tanbeta for a given set of SUSY parameters and uncertainties. △ Less", "We investigate split supersymmetry (SUSY) within a supergravity framework, where local SUSY is broken by the F-term of a hidden sector chiral superfield X. With reasonably general assumptions, we show that the fermionic component of X will always have mass within a Tev. Though its coupling to the observable sector superfields is highly suppressed in Tev scale SUSY, we show that it can be enhanced by many orders in split SUSY, leading to its likely participation in accelerator phenomenology.We conclude with a specific example of such a scenario in a string based supergravity model. △ Less", "We study the decays of $B\\to K^{(*)} \\ell^{+} \\ell^{-}$ in split supersymmetry with R-parity violation. We find that the decay branching ratio of $B\\to Kτ^+τ^-$ in the new physics model due to the scalar interactions can be $1.8\\times 10^{-6}$ which is about one order of magnitude larger that in the standard model, whereas those of $B\\to K\\ell^+\\ell^-$ ($\\ell=e$ and $μ$) and the $K^*$ modes are insensitive to the new physics. On the other hand, the forward-backward asymmetries of $B\\to K τ^{+} τ^{-}$ and $Kμ^{+}μ^{-}$, vanishing in the standard model, can be over 10 and 1%, respectively. In addition, we show that the new interactions will significantly change the forward-backward asymmetry in $B\\to K^* τ^{+} τ^{-}$. △ Less", "The origin of the GUT scale from the top down perspective is explored. The GUT gauge symmetry is broken by the renormalization group effects, which is an extension of the radiative electroweak symmetry breaking scenario to the GUT models. That is, in the same way as the origin of the electroweak scale, the GUT scale is generated from the Planck scale through the radiative corrections to the soft SUSY breaking mass parameters. This mechanism is applied to a perturbative SO(10) GUT model, recently proposed by us. In the SO(10) model, the relation between the GUT scale and the Planck scale can naturally be realized by using order one coupling constants. △ Less", "Cerenkov Telescopes and Scintillators set on a Crown-like arrays facing the Horizons may reveal far Cosmic Rays Showers, nearer Anti-Neutrino-Electron + Electron --> W- shower in air and upgoing Tau Neutrino + N--> tau + X, --> Shower, Earth-Skimming tau air-showers. Even UHE SUSY Chi + e--> Selectron--> Chi + e at tens PeVs-EeV energy may blaze at Horizons, as anti-neutrino electron at Glashow peak - Burst shower. We show first estimate on down and up-going Horizontal Showers traces for present and future Magic-like Crown Arrays and their correlated Scintillator-like twin Crown Arrays. The one mono or stereo-Magic elements facing the Horizons are already comparable to present Amanda underground neutrino detector. △ Less", "We study the stability of the effective higgs potential in the split supersymmetry and Little Higgs models. In particular, we study the effects of higher dimensional operators in the effective potential on the higgs mass predictions. We find that the size and sign of the higher dimensional operators can significantly change the higgs mass required to maintain vacuum stability in Split Susy models. In the Little Higgs models the effects of higher dimensional operators can be large because of a relatively lower cut-off scale. Working with a specific model we find that a contribution from the higher dimensional operator with coefficient of O(1) can destabilize the vacuum. △ Less", "We consider the production of neutralino pairs $\\tchi^0_i\\tchi^0_j$ at a high energy hadron collider, putting a special emphasis on the case where one of them is the lightest neutralino $\\tchi^0_1$, possibly constituting the main Dark Matter component. At tree level, the only relevant subprocess is $q\\bar q\\to \\tchi^0_i\\tchi^0_j$, while the subprocess $gg\\to \\tchi^0_i\\tchi^0_j$ first appears at the one loop level. Explicit expressions for the $q\\bar q$-helicity amplitudes are presented, including the tree level contributions and the leading-log one loop radiative corrections. For the one-loop $ gg\\to \\tchi^0_i\\tchi^0_j$ process, a numerical code named PLATONggnn is released, allowing the computation of $dσ/d \\that$ in any MSSM model with real soft breaking parameters. It turns out that acceptable MSSM benchmark models exist for which the $q\\bar q $ and the gluonic contributions may give comparable effects at LHC, due to the enhanced gluonic structure functions at low fractional momenta. Depending on the values of the MSSM parameters, we find that the LHC neutralino pair production may provide sensitive tests of SUSY models generating neutralino Dark Matter. △ Less", "We present a complete 1-loop study of the process $γγ\\to \\tchi^0_i \\tchi^0_j$ and the predicted cross section in a $γγ$ Linear Collider. A suitable numerical code PLATONlc, valid for any set of real MSSM parameters, is released. This study and code are complementary to those suitable for Dark Matter detection through the inverse process $\\tchi^0_i \\tchi^0_j \\to γγ$ describing neutralino-neutralino annihilation at rest, which were presented previously. If SUSY is realized in Nature, both codes should be very helpful in future astrophysical and collider studies of the neutralino sector. △ Less", "In a class of SUSY SO(10) with $SU(2)_L x SU(2)_R x U(1)_{B-L} x SU(3)_C$ $(g_{2L}\\neq g_{2R})$ intermediate gauge symmetry, we observe that the prediction on the unification mass $(M_U)$ is unaffected by Planck-scale-induced gravitational and intermediate-scale-threshold effects, although the intermediate scale $(M_I)$ itself is subject to such corrections. In particular, without invoking the presence of additional lighter scalar degrees of freedom but including plausible and reasonable threshold effects, we find that interesting solutions for neutrino physics corresponding to $M_I\\simeq 10^{10}-10^{13}$ GeV and $M_U\\simeq (5-6) x 10^{17}$ GeV are permitted in the minimal models. Possibilities of low-mass right-handed gauge bosons corresponding to $M_I\\simeq 1-10$ TeV consistent with the CERN-LEP data are pointed out in a number of models when threshold effects are included using effective mass parameters. △ Less"]