["Most supersymmetric models predict new particles within the reach of the next generation of colliders. For an understanding of the model structure and the mechanism(s) of electroweak symmetry breaking, it is important to know the masses of the new particles precisely. The measurement of the mass of the scalar partner of the top quark (stop) at an e+e- collider is studied. A relatively light stop is motivated by attempts to explain electroweak baryogenesis and can play an important role in dark matter annihilation. A method is presented which makes use of cross-section measurements near the pair-production threshold as well as at higher center-of-mass energies. It is shown that this method does not only increase the statistical precision, but also reduces the influence of systematic uncertainties, which can be important. Numerical results are presented, based on a realistic event simulation, for two signal selection strategies: using conventional selection cuts, and using an Iterative Discriminant Analysis (IDA). While the analysis of stops is particularly challenging due to the possibility of stop hadronization and fragmentation, the general procedure could be applied to many precision mass measurements. △ Less", "We discuss some topics concerning exclusive non-leptonic B decays. In particular we focus on Bs->KK decays, for which we present complementary predictions within the SM, as well as the impact that SUSY would have on the CP observables. We also present an analysis of Bs->VV decays that allows to measure the mixing angle of the Bs system. We make special emphasis on the control of hadronic uncertainties. △ Less", "In supersymmetric (SUSY) models with the gravitino being the lightest SUSY particle (LSP), the SUSY breaking scale (i.e., the gravitino mass) could be determined by measuring the lifetime of the next-to-lightest SUSY particle (NLSP). However, for an ultralight gravitino of mass of O(1) eV, which is favored cosmologically, the determination of the SUSY breaking scale, or the gravitino mass, is difficult because the NLSP decay length is too short to be measured directly. Recently we proposed a new determination of the gravitino mass by measuring a branching fraction of two decay modes of sleptons. In this paper, we investigate the prospects for determining the gravitino mass at LHC. For demonstration we take some explicit gauge-mediation models and show that the gravitino mass can be determined with an accuracy of a few 10% for an integrated luminosity 10-100 fb^{-1}. △ Less", "The observation of three events for the decay $Σ^+ \\to p μ^+ μ^-$ with a dimuon invariant mass of $214.3\\pm0.5$MeV by the HyperCP collaboration imply that a new particle X may be needed to explain the observed dimuon invariant mass distribution. We show that there are regions in the SUSY-FCNC parameter space where the $A^0_1$ in the NMSSM can be used to explain the HyperCP events without contradicting all the existing constraints from the measurements of the kaon decays, and the constraints from the $K^0-\\bar{K}^0$ mixing are automatically satisfied once the constraints from kaon decays are satisfied. △ Less", "Combined analyses at the Large Hadron Collider and at the International Linear Collider are important to unravel a difficult region of supersymmetry that is characterized by scalar SUSY particles with masses around 2 TeV. Precision measurements of masses, cross sections and forward-backward asymmetries allow to determine the fundamental supersymmetric parameters even if only a small part of the spectrum is accessible. Mass constraints for the heavy particles can be derived. △ Less", "We review the physics potential of the GigaZ option of the International Linear Collider (ILC) for probing the Minimal Supersymmetric Standard Model (MSSM) via the sensitivity of the electroweak precision observables measured at the ILC to quantum corrections. A particular focus is put on the effective leptonic weak mixing angle, sin^2_theta_eff. The MSSM predictions take into account the complete one-loop results including the full complex phase dependence, all available MSSM two-loop corrections as well as the full Standard Model (SM) results. We find that the anticipated experimental accuracy at the ILC with GigaZ option may resolve the virtual effects of SUSY particles even in scenarios where the SUSY particles are so heavy that they escape direct detection at the LHC and the first phase of the ILC. △ Less", "Indirect information about the possible scale of supersymmetry (SUSY) breaking can be obtained from the comparison of precisely measured observables (and also of exclusion limits) with accurate theory predictions incorporating SUSY loop corrections. Recent results are reviewed obtained from a combined analysis of the most sensitive electroweak precision observables (EWPO), M_W, sin^2_theta^eff, Gamma_Z, (g-2)_μand M_h, and B-physics observables (BPO), BR(b -> s γ), BR(B_s -> μ^+μ^-), BR(B_u -> τν_τ) and ΔM_{B_s}. Assuming that the lightest supersymmetric particle (LSP) provides the cold dark matter density preferred by WMAP and other cosmological data, χ^2 fits are performed to the parameters of the constrained minimal supersymmetric extension of the Standard Model (CMSSM), in which the SUSY-breaking parameters are universal at the GUT scale, and the non-universal Higgs model (NUHM), in which this constraint is relaxed for the soft SUSY-breaking contributions to the Higgs masses. Within the CMSSM indirect bounds on the mass of the lightest CP-even Higgs boson are derived. △ Less", "I put metastable supersymmetry breaking in a cosmological context. I argue that under reasonable assumptions, the cooling down early Universe favors metastable SUSY-breaking vacua over the stable supersymmetric vacua. To illustrate the general argument, I analyze the early-Universe history of the Intriligator-Seiberg-Shih model. △ Less", "After a short introduction to the SUSY flavour problem, we focus the attention on the MSSM with MFV and large $\\tanβ$. The theoretical motivations and the general features of this scenario are briefly reviewed. The possible signatures in low-energy flavour-violating observables are discussed, with particular attention to the role played by $\\BR(P\\to\\ellν)$, $\\BR(B_{s,d}\\to \\ell^+\\ell^-)$ and $\\BR(μ\\to e γ)$ △ Less", "We review aspects of the phenomenology of the MSSM with non-minimal flavour violation, including a discussion of important constraints and the sensitivity to fundamental scales. △ Less", "For MSSM phenomenology, soft SUSY breaking dimension-three operators are important, in particular the couplings between Higgs bosons and squarks. In scattering processes, perturbative unitarity is violated at modest center-of-mass energy if these couplings are much larger than the masses of the scalar particles involved. Assuming perturbative unitarity, constraints on the trilinear couplings can be determined using a computer program that we have developed. △ Less", "CP violation in supersymmetric models is reviewd with focus on explicit CP violation in the MSSM. The topics covered in particular are CP-mixing in the Higgs sector and its measurement at the LHC, CP-odd observables in the gaugino sector at the ILC, EDM constraints, and the neutralino relic density. △ Less", "We derive the renormalization group equations for dimensionless couplings and soft supersymmetry breaking (SSB) parameters given arbitrary high scale inputs, incorporating 1-loop thresholds. A program (to be incorporated into ISAJET) has been developed, which includes flavour violating couplings of superparticles based on an arbitrary framework for the high scale flavour structure of SSB parameters. The weak scale flavour structure derived in this way can be applied to the study of SUSY flavour changing decays. As an illustration, we recalculate the branching ratio of the flavour-violating decay of the top squark. △ Less", "We explore how the polarization of the tau leptons in the cascade decay $\\tilde{q}\\to q\\tildeχ^0_2\\to qτ\\tildeτ\\to qττ\\tildeχ^0_1$ can be exploited to study mixing properties of neutralinos and staus. We present details of the analysis including experimental effects such as transverse momentum cuts for the $τ\\toπν$ decay mode, and show that the di-pion invariant mass distribution provides valuable information on their properties. △ Less", "The physics potential of the Large Hadron Collider in combination with the planned International Linear Collider is discussed for a difficult region of supersymmetry that is characterized by scalar SUSY particles with masses around 2 TeV. Precision measurements of masses, cross sections and forward-backward asymmetries allow to determine the fundamental supersymmetric parameters even if only a small part of the spectrum is accessible. No assumptions on a specific SUSY-breaking mechanism are imposed. Mass contraints for the kinematically inaccessible particles can be derived. △ Less", "Physical Higgs particles in the Minimal Supersymmetric Standard Model (MSSM) with explicit CP violation are CP mixed states. The decay of these Higgs particles can be analysed to study the CP properties of the MSSM. In the present work we consider the di-photon channel of the lightest neutral Higgs boson for this purpose. Compared to earlier studies on effects of scalar/pseudo-scalar mixing, our analysis also investigates the effect due to Higgs-sfermion-sfermion couplings along with that of mixing. We find that a light stop may have a strong impact on the width and Branching Ratio (BR) of the decay process H1 --> gamma.gamma, whereas other light sparticles have only little influence. In some regions of the MSSM parameter space with large CP-violating phase phi-mu ~ 90 deg a light (~ 200 GeV) stop can change the di-photon BR by more than 50 % compared to the case with heavy (~ 1 TeV) stop and otherwise same MSSM parameters. △ Less", "In this paper we review the properties of the 1/$N_f$ expansion in multidimensional theories. Contrary to the usual perturbative expansion it is renormalizable and contains only logarithmic divergencies. The price for it is the presence of ghost states which, however, in certain cases do not contribute to physical amplitudes. In this case the theory is unitary and one can calculate the cross-sections. As an example we consider the differential cross section of elastic $eq \\to eq$ scattering in $D=7,11,...$-dimensional world. We look also for the unification of the gauge couplings in multidimensional Standard Model and its SUSY extension which takes place at energies lower than in 4 dimensions. △ Less", "Final states with leptons, jets and missing transverse energy are a promising way to detect Supersymmetry at the Large Hadron Collider. Results of simulation studies performed by the CMS and ATLAS collaborations are presented. The discovery of new physics is shown to be possible within the first fb^-1 of collected integrated luminosity. △ Less", "The plan for mass and spin measurement of SUSY particles with the ATLAS detector is presented. The measurements of kinematical distributions, such as edges in the invariant mass of leptons and jets, could be used to constrain the model of SUSY that may be discovered at the LHC. Examples from a few points in the mSUGRA scenario are provided with an emphasis on measurements that can be conducted within the first few years of data taking. △ Less", "We consider the impact of Catalyzed Big Bang Nucleosynthesis on theories with a gravitino LSP and a charged slepton NLSP. In models where the gravitino to gaugino mass ratio is bounded from below, such as gaugino-mediated SUSY breaking, we derive a lower bound on the gaugino mass parameter m_1/2. As a concrete example, we determine the parameter space of gaugino mediation that is compatible with all cosmological constraints. △ Less", "We present a complete next-to-leading order (NLO) calculation for the total cross section for inclusive Higgs pair production via bottom-quark fusion at the CERN Large Hadron Collider (LHC) in the minimal supersymmetric standard model (MSSM) and the minimal supergravity model (mSUGRA). We emphasize the contributions of squark and gluino loops (SQCD) and the decoupling properties of our results for heavy squark and gluino masses. The enhanced couplings of the b quark to the Higgs bosons in supersymmetric models with large tanb yield large NLO SQCD corrections in some regions of parameter space. △ Less", "Here we update the predictions for lepton flavour violating tau and muon decays, $l_j \\to l_i γ$, $l_j \\to 3 l_i$, and $μ-e$ conversion in nuclei. We work within a SUSY-seesaw context where the particle content of the Minimal Supersymmetric Standard Model is extended by three right handed neutrinos plus their corresponding SUSY partners, and where a seesaw mechanism for neutrino mass generation is implemented. Two different scenarios with either universal or non-universal soft supersymmetry breaking Higgs masses at the gauge coupling unification scale are considered. After comparing the predictions with present experimental bounds and future sensitivities, the most promising processes are particularly emphasised. △ Less", "B decays are a subject of active research since they provide useful information on the dynamics of strong and electroweak interactions for testing the Standard Model (SM) and models beyond and are ideally suited for a critical analysis of CP violation phenomena. Within the standard model, there exist certain relations between CP violating rate differences in B decays in the SU(3) limit, as for example $Δ(\\bar{B}^0 \\to π^+ π^-) = - Δ(\\bar{B}^0 \\to π^+ K^-)$. The goal of this letter is to study the direct CP violation asymmetry in a class of processes where there has been recent theoretical progress, as for example the B decays into two light pseudoscalars mesons and into a light pseudoscalar and a light vector meson. We identify relations between rate asymmetries which are valid in the SU(3) limit in the standard model and we compute SU(3) breaking corrections to them, going beyond the naive factorization by using the QCD improved factorization model of Beneke {\\it et al.}. Finally, in some processes as for example $BR(B^- \\to η^{\\prime} K^-)$, we claim that one has to add SUSY contributions to the Wilson coefficients. In these cases, we end with a $BR$ depending on three parameters, whose values are constrained by the experimental data. △ Less", "We update constraints from B physics observables on the parameters of the MSSM and the NMSSM, combining them with LEP constraints. Presently available SM and Susy radiative corrections are included in the calculations, which will be made public in the form of a Fortran code. Results for the tan(beta) and M_{H^+} dependence of b -> s gamma are presented, as well as constraints on the NMSSM specific case of a light CP odd Higgs scalar. We find that the latter are essentially due to B_s -> mu^+ mu^-, but they do not exclude this possibility. △ Less", "The so-called supersymmetric flavour problem does not exist in isolation to the Standard Model flavour problem. We show that a realistic flavour symmetry can simultaneously solve both problems without ad hoc modifications of the SUSY model. Furthermore, departures from the SM expectations in these models can be used to discriminate among different possibilities. In particular we present the expected values for the electron EDM in a flavour model solving the supersymmetric flavour and CP problems. △ Less", "We study models of \"(extra)ordinary gauge mediation,\" which consist of taking ordinary gauge mediation and extending the messenger superpotential to include all renormalizable couplings consistent with SM gauge invariance and an R-symmetry. We classify all such models and find that their phenomenology can differ significantly from that of ordinary gauge mediation. Some highlights include: arbitrary modifications of the squark/slepton mass relations, small mu and Higgsino NLSP's, and the possibility of having fewer than one effective messenger. We also show how these models lead naturally to extremely simple examples of direct gauge mediation, where SUSY and R-symmetry breaking occur not in a hidden sector, but due to the dynamics of the messenger sector itself. △ Less", "I review some of the latest directions in supersymmetric model building, focusing on SUSY breaking mechanisms in the minimal supersymmetric standard model [MSSM], the \"little\" hierarchy and $μ$ problems, etc. I then discuss SUSY GUTs and UV completions in string theory. △ Less", "We discuss some recent developments in SUSY Grand Unified Theories based on the gauge group SO(10). Considering renormalisable Yukawa couplings, we present ways to accommodate quark and lepton masses and and mixings. △ Less", "NLSP - LSP decays could have dramatic influence on SUSY phenomenology at LHC. NLSP could have significant lifetime and could be charged. In at least two scenarios detectors must be used in a special way. They were not optimized for detection of heavy (semi)stable charged particles and decaying in flight (neutral or charged) NLSPs. During the last decade both ATLAS and CMS collaboration have developed strategies which allow for effective search within such scenarios. △ Less", "We comment on the power of the 'standard' solutions to the SUSY flavour and CP problem based on supergravity and its derivates like mSUGRA in comparison to the flavour symmetry approach. It is argued that flavour symmetries, and SU(3) in particular, can not only mimic the situation in supergravity frameworks in this respect, but sometimes do even better providing at the same time a further link between the soft and Yukawa sectors, that could be testable at future experimental facilities. △ Less", "It was recently found that the decay of inflaton and the SUSY breaking field produces many gravitinos in the gravity mediation scenario. These discoveries led to an exclusion of many inflation models such as chaotic, (smooth) hybrid, topological and new inflation models. Under these circumstances we searched for a successful inflation model and found that the ``inverted'' hybrid inflation models can solve the gravitino overproduction problem by their distinctive shape of the potential. Furthermore, we found that this inflation model simultaneously can explain the observed baryon asymmetry through the non-thermal leptogenesis and is consistent with the WMAP results, that is, $n_s=0.951^{+0.015}_{-0.019}$ and the negligible tensor to scalar ratio. △ Less", "String landscape ideas and the observation of a positive vacuum energy in the current universe suggest that there could be a future transition to an exactly supersymmetric world. Atomic and molecular binding in this susy background probably require that electroweak symmetry breaking survives the transition. Among several susy higgs models that have been discussed, one stands out in this regard. Thus, the higgs structure that is revealed at the LHC could have strong consequences for the type of bulk matter that may arise in a future susy universe. △ Less", "We discuss phenomenological consequences of some class of supersymmetric seesaw models in which the right-handed (s)neutrino mass is given to be TeV scale. In this scenario, scalar trilinear interaction of Higgs-slepton-(right-handed) sneutrino is enhanced. We show that the 1-loop correction by sneutrino exchange to the lightest Higgs boson mass destructively interferes with top-stop contributions in the minimal SUSY Standard Model. We find that a decay of charged Higgs boson into sneutrino and charged slepton is sizably enhanced and hence it gives rise to a distinctive signal at future collider experiments in some parameter space. △ Less", "The observed small value of cosmological constant can be naturally related with the scale of breaking down supersymmetry in agreement with other evaluations in particle physics. △ Less", "In this talk, we present a model based on SU(5)x(d)T which successfully gives rise to near tri-bimaximal leptonic mixing as well as realistic CKM matrix elements for the quarks. The Georgi-Jarlskog relations for three generations are also obtained. Due to the (d)T transformation property of the matter fields, the b-quark mass can be generated only when the (d)T symmetry is broken, giving a dynamical origin for the hierarchy between m_b and m_t. There are only nine operators allowed in the Yukawa sector up to at least mass dimension seven due to an additional Z12 x Z12' symmetry, which also forbids, up to some high orders, operators that lead to proton decay. The resulting model has a total of nine parameters in the charged fermion and neutrino sectors, and hence is very predictive. In addition to the prediction for theta13 ~ theta_c/3sqrt{2}, the model gives rise to a sum rule, tan^2(theta_{solar}) ~ tan^2(theta_{solar,TBM}) - 1/2*theta_c*cos(beta), which is a consequence of the Georgi-Jarlskog relations in the quark sector. This deviation could account for the difference between the experimental best fit value for the solar mixing angle and the value predicted by the tri-bimaximal mixing matrix. △ Less", "For the SUSY 2007 conference, I was asked to review the topic of indirect searches for dark matter. As part of that talk, I summarized several observations which have been interpreted as the product of dark matter annihilations. In my contribution to the proceedings, I have decided to focus on this aspect of my talk. In particular, I will discuss the cosmic positron spectrum measured by HEAT, the 511 keV emission from the Galactic Bulge measured by INTEGRAL, the diffuse galactic and extragalactic gamma ray spectra measured by EGRET, and the microwave excess from the Galactic Center observed by WMAP. △ Less", "We provide a short account of the effects one expects on meson-antimeson oscillations in the context of the Minimal Supersymmetric Standard Model (MSSM). This issue is largely dependent on the assumptions made on the MSSM parameter space. In this respect, we consider in closer detail the cases of the general MSSM, with completely free soft terms, and the Minimal Flavor Violating limit of the MSSM, providing a natural mechanism of near-flavor-conservation. For the case of meson oscillations in the Delta B = 2 sector, we show that this approach leads to a striking increase of the predictivity of the model. In particular, we find (i) SUSY corrections to be naturally small and always positive; (ii) if mu is not small, an increase in importance (even for low tan beta) of scalar operators due to gluino contributions. The last point signals that (V-A)x(V-A) dominated MFV is in general inconsistent with the MSSM. In this context, we also briefly discuss the MFV-Unitarity Triangle. △ Less", "In braneworld models coming from string theory one generally encounters massless scalar degrees of freedom -moduli- parameterizing the volume of small compact extra-dimensions. Here we discuss the effects of such moduli on Newton's law for a fairly general 5-D supersymmetric braneworld scenario with a bulk scalar field $φ$. We show that the Newtonian potential describing the gravitational interaction between two bodies localized on the visible brane picks up a non-trivial contribution at short distances that depends on the shape of the superpotential $W(φ)$ of the theory. In particular, we compute this contribution for dilatonic braneworld scenarios $W(φ) = e^{αφ}$ (where $α$ is a constant) and discuss the particular case of 5-D Heterotic M-theory. △ Less", "We describe the simulation of tau decays in the Herwig++ event generator, which includes sophisticated modelling of the hadronic currents and full treatment of spin correlation effects. The structure of the simulation makes it easy to add new models of tau decay,change the parameters of the existing models, and use the models from tau decay for the decay of other particles. The results are compared in detail with an existing simulation, and the benefits of the new structure are illustrated by considering the decay of the lightest chargino to the lightest neutralino in Anomaly-Mediated SUSY-Breaking models. △ Less", "We study models in which supersymmetry breaking appears at an intermediate scale, M_in, below the GUT scale. That is, that the soft supersymmetry-breaking parameters of the MSSM are universal at M_in. We demand that the lightest neutralino be the LSP, and that the relic neutralino density not conflict with measurements by WMAP and others, and study the morphology of this constraint as the universality scale is reduced from the GUT scale. At moderate values of M_in, we find that the allowed regions of the (m_1/2,m_0) plane are squeezed by the requirements of electroweak symmetry breaking and that the lightest neutralino be the LSP, whereas the constraint on the relic density is less severe. At very low M_in, the electroweak vacuum conditions become the dominant constraint, and a secondary source of astrophysical cold dark matter would be necessary to explain the measured relic density for nearly all values of the soft SUSY-breaking parameters and tan(beta). △ Less", "In the context of low-energy Supersymmetry, a model of Grand Unification with right-handed neutrinos, based on the group SU(5), is discussed and its implications for neutralino dark matter (DM) are studied and compared with the constrained MSSM. RG effects in this model modify the sparticle spectrum such that the WMAP limit on the DM relic density cannot be satisfied for small values of $\\tanβ$ ($\\tanβ\\lesssim 35$) and the region of the parameter space allowed by efficient neutralino-stau coannihilation presents a peculiar phenomenology and an upper bound on the neutralino mass for most of the parameters choices. △ Less", "The cosmological constant is inherently determined by the scale of breaking down supersymmetry in the mechanism of seesaw fluctuations of two vacuum-states. △ Less", "We present a study of threshold resummation effects for slepton pair production at the Large Hadron Collider (LHC). After confirming the known NLO QCD corrections and generalizing the NLO SUSY-QCD corrections to the case of mixing squarks in the virtual loop contributions, we employ the Mellin N-space resummation formalism to compute logarithmically enhanced soft-gluon terms to all perturbative orders. △ Less", "We report on a detailed analysis of a SO(10) SUSY GUT model of Dermisek and Raby (DR) with a D3 family symmetry. The model is completely specified in terms of only 24 parameters and is able to successfully describe both quark and lepton masses and mixings, except for |Vub| that turns out to be too low. However, a global fit shows that flavor changing (FC) processes like Bs --> mu+ mu-, Bs-mixing, B+ --> tau+ nu, B --> Xs gamma and B --> Xs l+ l- pose a serious problem to the DR model. The simultaneous description of these FC processes forces squarks to have masses well above 1 TeV, not appealing on grounds of naturalness and probably beyond the reach of the LHC. △ Less", "We analyze the CP violation in the semileptonic | ΔS|=1 tau-decays in supersymmetric extensions of the standard model (SM) with R parity violating term. We show that the CP asymmetry of tau-decay is enhanced significantly and the current experimental limits obtained by CLEO collaborations can be easily accommodated. We argue that observing CP violation in semi leptonic tau-decay would be a clear evidence for R-parity violating SUSY extension of the SM. △ Less", "I present two new renormalizable grand unified theories where the neutrino masses are generated through the type I and type III seesaw mechanisms. These theories can be considered as the simplest (SUSY) renormalizable grand unified theories based on the SU(5) gauge symmetry. Several phenomenological and cosmological aspects of these proposals are discussed. △ Less", "We discuss first a method of measuring $τ$ polarisation at the ILC using the 1--prong hadronic decays of the $τ$. We then show in this contribution how a study of the $\\tilde τ$ sector and particularly use of decay $τ$ polarisation can offer a very good handle for distinguishing between mSUGRA and a SUSY-GUT scenario, both of which can give rise to appropriate Dark Matter. △ Less", "(Abridged) We report on a complete study of the single top-quark production by direct supersymmetric flavor-changing neutral-current (FCNC) processes at the LHC. The total cross section for pp(gg)->t\\bar{c}+\\bar{t}c is computed at the 1-loop order within the unconstrained Minimal Supersymmetric Standard Model (MSSM). The present study extends the results of the supersymmetric strong effects (SUSY-QCD), which were advanced by some of us in a previous work, and includes the computation of the full supersymmetric electroweak corrections (SUSY-EW). Our analysis of pp(gg)->t\\bar{c}+\\bar{t}c in the MSSM has been performed in correspondence with the stringent low-energy constraints from b->s gamma. In the most favorable scenarios, the SUSY-QCD contribution can give rise to production rates of around 10^5 events per 100 fb^{-1} of integrated luminosity. Furthermore, we show that there exist regions of the MSSM parameter space where the SUSY-EW correction becomes sizeable. In the SUSY-EW favored regions, one obtains lower, but still appreciable, event production rates that can reach the 10^3 level for the same range of integrated luminosity. We study also the possible reduction in the maximum event rate obtained from the full MSSM contribution if we additionally include the constraints from B^0_s-\\bar{B}^0_s. In view of the fact that the FCNC production of heavy quark pairs of different flavors is extremely suppressed in the SM, the detection of a significant number of these events could lead to evidence of new physics -- of likely supersymmetric origin. △ Less", "Ultrahigh energy cosmic rays provide a unique ground for probing new physics. In this talk we review the possibility of testing TeV gravity in interactions of cosmogenic neutrinos and the potential to discover long-lived exotic particles in nucleon-produced air showers, such as gluinos of split-SUSY models or staus of supersymmetric models with a gravitino LSP. △ Less", "We explore in detail the effective matter fermion mass sum-rules in a class of renormalizable SUSY SO(10) grand unified models where the quark and lepton mass and mixing patterns originate from non-decoupling effects of an extra vector matter multiplet living around the unification scale. If the renormalizable type-II contribution governed by the SU(2)_L-triplet in 54_H dominates the seesaw formula, we obtain an interesting correlation between the maximality of the atmospheric neutrino mixing and the proximity of y_s/y_b to V_cb in the quark sector. △ Less", "The interesting but difficult phenomenology of supersymmetric models at the LHC and ILC demands a corresponding complexity and maturity from simulation tools. This includes multi-particle final states, reducible and irreducible backgrounds, spin correlations, real emission of photons and gluons, virtual corrections etc. Most of these topics are included in the multi-particle Monte Carlo (MC) Event generators Madgraph, WHIZARD and Sherpa. A comparison of these codes is shown, with a special focus on the new release of WHIZARD. I show examples for the necessity of considering full matrix elements with all off-shell effects and interferences for multi-particle final states in supersymmetric models and give a status report on ongoing projects for simulations of SUSY processes at the LHC with these codes, including all of the abovementioned corrections. △ Less", "The associated production of a Higgs boson with a b quark is a discovery mode for an MSSM Higgs boson at large tan beta. We compute the SUSY QCD corrections from gluino and squark loops to this process and combine them with the order alpha_s^2 NLO QCD corrections to obtain reliable predictions for the rate. Finally, we compare our results with an effective Lagrangian approximation which includes only the low energy corrections from squark and gluino loops to the b- bbar- Higgs vertices. △ Less", "Recent results on MSSM Higgs physics at the LHC are reviewed. The dependence of the LHC discovery reach in the b\\bar b H/A, H/A \\to τ^+τ^- channel on the underlying SUSY scenario is analysed. This is done by combining the latest results for the prospective CMS experimental sensitivities for an integrated luminosity of 30 or 60 fb^-1 with state-of-the-art theoretical predictions of MSSM Higgs-boson properties. The results are interpreted in terms of the parameters governing the MSSM Higgs sector at lowest order, M_A and tan_beta. While the higgsino mass parameter μhas a significant impact on the prospective discovery reach (and correspondingly the ``LHC wedge'' region), it is found that the discovery reach is rather stable with respect to variations of other supersymmetric parameters. Within the discovery region a determination of the masses of the heavy neutral Higgs bosons with an accuracy of 1-4% seems feasible. It is furthermore shown that Higgs-boson production in central exclusive diffractive channels can provide important information on the properties of the neutral MSSM Higgs bosons. △ Less", "Matter-Higgs unification in string-inspired supersymmetric Grand Unified Theories predicts the existence of colored states in the Higgs multiplets and calls for two extra generations of Higgs-like fields ('unhiggses'). If these states are present near the TeV scale, gauge-coupling unification points to the existence of two distinct scales, 10^15 GeV where right-handed neutrinos and a Pati-Salam symmetry appear, and 10^18 GeV where complete unification is achieved. Baryon-number conservation, while not guaranteed, can naturally emerge from an underlying flavor symmetry. Collider signatures and dark-matter physics may be drastically different from the conventional MSSM. △ Less", "Unification based on the group SO(10)^3 \\times S_3 is studied. Each family has its own SO(10) group, and the S_3 permutes the three families and SO(10) factors. This is the maximal local symmetry for the known fermions. Family unification is achieved in the sense that all known fermions are in a single irreducible multiplet of the symmetry. The symmetry suppresses SUSY flavor changing effects by making all squarks and sleptons degenerate in the symmetry limit. Doublet-triplet splitting can arise simply, and non-trivial structure of the quark and lepton masses emerges from the gauge symmetry, including the \"doubly lopsided\" form. △ Less", "We construct a model of direct gauge mediation of metastable SUSY breaking by simply deforming the Intriligator, Seiberg and Shih model in terms of a dual meson superpotential mass term. No extra matter field is introduced. The deformation explicitly breaks a U(1)_R symmetry and a pseudo moduli have a nonzero VEV at one-loop. Our metastable SUSY breaking vacuum turns out to be sufficiently long-lived. By gauging a subgroup of flavor symmetry, our model can directly couple to the standard model, which leads to nonvanishing gaugino mass generation. It is also shown that our model can evade the Landau pole problem. We show the parameters in the SUSY breaking sector are phenomenologically constrained. △ Less", "Recent studies about CP violation in the Minimal Supersymmetric Standard Model (MSSM) with complex parameters are reviewed. In order to unambiguously identify the CP-violating phenomena it is necessary to study CP-odd or T-odd observables. In chargino and neutralino production and decay at the International Linear Collider (ILC) triple product asymmetries and asymmetries defined via transverse beam polarization have been analyzed. It has been found that these asymmetries can be measured at the ILC in a large region of the MSSM parameter space and are thus an important tool to establish CP violation in supersymmetry. △ Less", "The ATLAS and CMS experiments will take first data soon. I consider here the prospects for new physics (excluding SUSY) with a few inverse fb of data. This means processes with signal cross sections of a few 100 fb or less, with clear and fairly simple signatures - precision comparison of data to Standard Model tails will take longer, needing more luminosity and very good understanding of detector calibrations, resolutions and trigger efficiencies. The approach I take here is signature rather than model based, but examples of models will be given. △ Less", "We present a complete calculation of the QCD and SUSY-QCD corrections to neutralino pair annihilation into bottom quark-antiquark pairs through exchange of a pseudoscalar Higgs boson, which is the dominant process in the cosmological A-funnel region of the mSUGRA model. We present numerical predictions for the annihilation cross section and discuss the influence of the correction terms on the cold dark matter relic density with respect to recent cosmological data. △ Less", "Indirect information about the possible scale of supersymmetry (SUSY) breaking is provided by B physics observables (BPO) as well as electroweak precision observables (EWPO). We review the combination of the constraints imposed by recent measurements of the BPO BR(b -> s gamma), BR(B_s -> mu+ mu-), BR(B_u -> tau nu_tau) and Delta M_{B_s} with those obtained from the experimental measurements of the EWPO M_W, sin^2 theta_eff, Gamma_Z, (g-2)_mu and M_h. We perform a chi^2 fit to the parameters of the constrained minimal supersymmetric extension of the Standard Model (CMSSM), in which the SUSY-breaking parameters are universal at the GUT scale. Assuming that the lightest supersymmetric particle (LSP) provides the cold dark matter density preferred by WMAP and other cosmological data, we confirm the preference found previously for a relatively low SUSY-breaking scale, though there is some slight tension between the EWPO and the BPO. △ Less", "The neutralino sector of the U(1) extended SUSY is presented and some collider and cosmology-related phenomenology discussed. △ Less", "A study is presented illustrating the excellent potential of future International Linear Collider (ILC) experiments to detect metastable staus $\\stau$, measure precisely their mass and lifetime, and to determine the mass of the gravitino $\\sG$ from the decay $\\stau\\toτ\\sG$, thus providing direct access to the gravitational coupling, respectively Planck scale. △ Less", "We study orbifold compactifications of the type IIB superstring on AdS_5 x S^5/Gamma, where Gamma is the abelian group Z_8, which can lead to non-SUSY three and four family models based on quartification. In particular, we focus on two models, one fully quartified model and one a model with two trinification families and one quartification family, which reduces to the standard model with a minimal leptonic color sector. △ Less", "We show that the narrow-width approximation is insufficient for describing production of supersymmetric particles at the ILC. Especially when cuts are taken into account to extract signals using the narrow-width approximation can be wrong by an order of magnitude. △ Less", "We compute the full O(alpha_s) SUSY-QCD corrections to dark matter annihilation in the Higgs-funnel, resumming potentially large mu tan beta and A_b contributions and keeping all finite O(m_b,s,1/tan^2 beta) terms. We demonstrate numerically that these corrections strongly influence the extraction of SUSY mass parameters from cosmological data and must therefore be included in common analysis tools such as DarkSUSY or micrOMEGAs. △ Less", "We present a simple mechanism by which supersymmetry can be dynamically broken in intersecting brane models, naturally generating an exponentially small scale. Rather than utilize either non-Abelian gauge dynamics or D-instantons, our mechanism uses worldsheet instantons to generate the small scale in a hidden sector. △ Less", "We observe that in SUSY models with non-universal GUT scale gaugino mass parameters, raising the GUT scale SU(2) gaugino mass |M_2| from its unified value results in a smaller value of -m_{H_u}^2 at the weak scale. By the electroweak symmetry breaking conditions, this implies a reduced value of μ^2 {\\it vis à vis} models with gaugino mass unification. The lightest neutralino can then be mixed Higgsino dark matter with a relic density in agreement with the measured abundance of cold dark matter (DM). We explore the phenomenology of this high |M_2| DM model. The spectrum is characterized by a very large wino mass and a concomitantly large splitting between left- and right- sfermion masses. In addition, the lighter chargino and three light neutralinos are relatively light with substantial higgsino components. The higgsino content of the LSP implies large rates for direct detection of neutralino dark matter, and enhanced rates for its indirect detection relative to mSUGRA. We find that experiments at the LHC should be able to discover SUSY over the portion of parameter space where m_{\\tg} \\alt 2350-2750 ~GeV, depending on the squark mass, while a 1 TeV electron-positron collider has a reach comparable to that of the LHC. The dilepton mass spectrum in multi-jet + \\ell^+\\ell^- + \\eslt events at the LHC will likely show more than one mass edge, while its shape should provide indirect evidence for the large higgsino content of the decaying neutralinos. △ Less", "We reconsider the ingredients of moduli stabilization in heterotic M-theory. On this line we close a gap in the literature deriving the Kaehler potential dependence on vector bundle moduli and charged matter. Crucial in this derivation is our superspace formulation of 5d heterotic M-theory taking into account the Bianchi identities modified by brane terms. Likewise, we obtain the Fayet-Iliopolous terms due to brane localised anomalous U(1)'s. After assembling perturbative and non-perturbative contributions to the superpotential, we study supersymmetric (adS) vacua. It is found that the susy condition decouples the bundle moduli from the geometric moduli. We show that M-theory supersymmetric vacua without five-branes can be found, albeit not at phenomenologically interesting values of the geometric moduli. This result is fairly independent of the choice of vector bundle at the observable brane. △ Less", "Recently Murayama and Nomura proposed a simple scheme to construct the gauge mediation models, using metastable supersymmetry breaking vacua. It has a possibility to predict the ultra light gravitino mass m_{3/2} \\lesssim 16 eV, while such a light gravitino may destabilize the metastable vacua. We investigate stability of the metastable vacuum of their model. The transition rate from the false vacuum to true ones is evaluated by numerical calculation, including the Coleman-Weinberg potential destabilizing the metastable vacuum. It is found that when the messenger sector is minimal, stability of the metastable vacuum imposes an upperbound on squark mass M_{\\tilde q} for the ultra light gravitino as M_{\\tilde q} \\lesssim 1800 GeV at most. Squarks with this mass may be found in the LHC experiments. △ Less", "We study N=1 global and local supersymmetric theories with a continuous global $U(1)_R$ symmetry as models of dynamical supersymmetry (SUSY) breaking. We introduce explicit R-symmetry breaking terms into such models, in particular a generalized O'Raifeartaigh model. Such explicit R-symmetry breaking terms can lead to a SUSY preserving minimum. We classify explicit R-symmetry breaking terms by the structure of newly appeared SUSY stationary points as a consequence of the R-breaking effect, which could make the SUSY breaking vacuum metastable. We show that the R-breaking terms are basically divided into two categories. One of them does not generate a SUSY solution, or yields SUSY solutions that disappear in the case of supergravity when we tune a parameter so that the original SUSY breaking minimum becomes a Minkowski vacuum. We also show that the general argument by Nelson and Seiberg for a dynamical SUSY breaking still holds with a local SUSY except for a certain nontrivial case, and present concrete examples of the exception. △ Less", "We address the constraints on the SUSY seesaw parameters arising from Lepton Flavour Violation observables. Working in the Constrained Minimal Supersymmetric Standard Model extended by three right-handed (s)neutrinos, we study the predictions for the branching ratios of $l_j \\to l_i γ$ and $l_j \\to 3 l_i$ channels. We impose compatibility with neutrino data, electric dipole moment bounds, and further require a successful baryon asymmetry of the Universe (via thermal leptogenesis). We emphasise the interesting interplay between $θ_{13}$ and the LFV muon decays, pointing out the hints on the SUSY seesaw parameters that can arise from measurements of $θ_{13}$ and LFV branching ratios. This is a brief summary of the work of Ref. \\cite{Antusch:2006vw}. △ Less", "We discuss the signals at the Large Hadron Collider (LHC) for scenarios with non-universal gaugino masses in supersymmetric (SUSY) theories. We perform a multichannel analysis, and consider the ratios of event rates in different channels such as $jets + {E}_T/ $, $same$ - and $opposite$-$sign dileptons$ $+jets+ {E}_T/ $, as well as $single-lepton$ and $trilepton$ final states together with $jets + {E}_T/ $ . Low-energy SUSY spectra corresponding to high-scale gaugino non-universality arising from different breaking schemes of SU(5) as well as SO(10) Grand Unified (GUT) SUSY models are considered, with both degenerate low-energy sfermion masses and those arising from a supergravity scenario. We present the numerical predictions over a wide range of the parameter space using the event generator {\\tt Pythia}, specifying the event selection criteria and pointing out regions where signals are likely to be beset with backgrounds. Certain broad features emerge from the study, which may be useful in identifying the signatures of different GUT breaking schemes and distinguishing them from a situation with a universal gaugino mass at high scale. The absolute values of the predicted event rates for different scenarios are presented together with the various event ratios, so that these can also be used whenever necessary. △ Less", "The estimation of the backgrounds for gluino signals in focus point supersymmetry is extended by including the backgrounds from the production of four third generation quarks in the analysis. We find that these backgrounds are negligible if one uses the strong selection criteria proposed in the literature (including this analysis) for heavy gluino searches. Softer selection criteria often recommended for lighter gluino searches yield backgrounds which are small but numerically significant. We have also repeated the more conventional background calculations and compared our results with the other groups. We find that the size of the total residual background estimated by different groups using different event generators and hard kinematical cuts agree approximately. In view of the theoretical uncertainties in the leading order signal and background cross sections mainly due to the choice of the QCD scale, the gluino mass reach at the LHC cannot be pinpointed. However, requiring a signal with $\\rm\\geq 3$ tagged b-jets (instead of the standard choice of $\\rm\\geq 2$) it is shown that gluino masses close to 2 TeV can be probed at the LHC for a range of reasonable choices of the QCD scale for an integrated luminosity of 300 fb$^{-1}$. △ Less", "One loop mediated charged Higgs bosons decays $H^\\pm\\to W^\\pm V$, $V= Z, γ$ are studied in the Minimal Supersymmetric Standard Model (MSSM) with and without CP violating phases. We evaluate the MSSM contributions to these processes taking into account $B\\to X_sγ$ constraint as well as experimental constraints on the MSSM parameters. In the MSSM, we found that in the intermediate range of $\\tanβ\\la 10$ and for large A_t and large $μ$, where the lightest top squark becomes very light and hence non-decoupled, the branching ratio of $H^\\pm \\to W^{\\pm} Z$ can be of the order 10^{-3} while the branching ratio of $H^\\pm \\to W^{\\pm} γ$ is of the order 10^{-5}. We found also that the CP violating phases of soft SUSY parameters can modify the branching ratio by about one order of magnitude. We also show that MSSM with CP violating phases lead to CP-violating asymmetry in the decays $H^+ \\to W^+V$ and $H^- \\to W^-V$. Such CP asymmetry can be rather large and can reach 80% in some region of parameter space. △ Less", "We carry out a detailed analysis of the scalar sector of the nonminimal supersymmetric standard model with lepton number violation, and study the constraints imposed on it by the stability of the electroweak symmetry breaking vacuum. The model contains a trilinear lepton mumber violating term in the superpotential together with the associated \\susy breaking interactions which can give rise to neutrino masses. We evaluate the mass matrices for the various boson and fermion modes and then discuss the effect that the lepton number violating interactions have on the mass spectra using a phenomenological precription to implement the experimental constraints on the light neutrinos mass matrix. We also discuss qualitatively the conditions on the lepton number violating parameters set by the unbounded from below directions, and from the absence of the charge and color breaking minima in this model. △ Less", "I review theoretical developments of the last year or so in nonperturbative supersymmetry. Topics: (i) Metastable vacua at strong coupling; (ii) Non-Abelian flux tubes, confined monopoles; (iii) One step beyond Seiberg's duality; (iv) Planar equivalence; (v) Multileg/multiloop amplitudes; (vi) N= (2,0) sigma model on the string worldsheet. △ Less", "New physics beyond the Standard Model can lead to extra matter effects on neutrino oscillation if the new interactions distinguish among the three flavors of neutrino. In a previous paper, we argued that a long-baseline neutrino oscillation experiment in which the Fermilab-NUMI beam in its high-energy mode is aimed at the planned Hyper-Kamiokande detector would be capable of constraining the size of those extra effects, provided the vacuum value of \\sin^2 2θ_{23} is not too close to one. In this paper, we discuss how such a constraint would translate into limits on the coupling constants and masses of new particles in various models. The models we consider are: models with generation distinguishing Z's such as topcolor assisted technicolor, models containing various types of leptoquarks, R-parity violating SUSY, and extended Higgs sector models. In several cases, we find that the limits thus obtained could be competitive with those expected from direct searches at the LHC. In the event that any of the particles discussed here are discovered at the LHC, then the observation, or non-observation, of their matter effects could help in identifying what type of particle had been observed. △ Less", "We perform a detailed analysis of the SO(10) SUSY GUT model with D3 family symmetry of Dermisek and Raby (DR). The model is specified in terms of 24 parameters and predicts, as a function of them, the whole MSSM set of parameters at low energy scales. Concerning the SM subset of such parameters, the model is able to give a satisfactory description of the quark and lepton masses, of the PMNS matrix and of the CKM matrix. We perform a global fit to the model, including flavour changing neutral current (FCNC) processes Bs --> mu+ mu-, B --> Xs gamma, B --> Xs l+ l- and the B(d,s) - bar B(d,s) mass differences Delta M(d,s) as well as the flavour changing (FC) process B+ --> tau+ nu. These observables provide at present the most sensitive probe of the SUSY mass spectrum and couplings predicted by the model. Our analysis demonstrates that the simultaneous description of the FC observables in question represents a serious challenge for the DR model, unless the masses of the scalars are moved to regions which are problematic from the point of view of naturalness and probably beyond the reach of the LHC. We emphasize that this problem could be a general feature of SUSY GUT models with third generation Yukawa unification and weak-scale minimal flavour violation. △ Less", "Among various supersymmetric (SUSY) models, gauge-mediated SUSY breaking models with an ultra-light gravitino of mass m_{3/2} \\lesssim O(10) eV are very attractive, since they are completely free from notorious gravitino problems. A drawback of such a scenario is the absence of the supersymmetric cold dark matter. In this letter, we propose that a baryonic bound state of strongly interacting messenger particles, with a mass of O(100) TeV, can naturally be the cold dark matter. We also exemplify a model which realizes such a scenario. △ Less", "We investigate unparticle physics with supersymmetry (SUSY). The SUSY breaking effects due to the gravity mediation induce soft masses for the SUSY unparticles and hence break the conformal invariance. The unparticle physics observable in near future experiments is only consistent if the SUSY breaking effects from the hidden sector to the standard model sector are dominated by the gauge mediation, or if the SUSY breaking effects to the unparticle sector is sufficiently sequestered. We argue that the natural realization of the latter possibility is the conformal sequestering scenario. △ Less", "We point out that in non supersymmetric GUTs, in which the SU(5) gauge symmetry is broken down to the Standard Model gauge group by a $\\mathbf{24}$ Higgs multiplet the Appelquist-Carazzone decoupling is violated. This is because the $SU(2)_L$ Higgs triplet contained in the $\\mathbf{24}$ acquires a dimensionfull coupling to the $SU(2)_L$ Higgs doublets which is proportional to the GUT breaking vacuum expectation value (VEV) $V$. As a result, at one loop heavy gauge and Higgs fields contribution to tadpoles generate a VEV of the triplet which is not suppressed for $V\\to\\infty$ and violates the custodial symmetry. △ Less", "The dominant MSSM effects in the rare K decays, K+ --> pi+ nu nu bar, KL --> pi0 nu nu bar, KL --> pi0 e+ e- and KL --> pi0 mu+ mu-, are discussed both within and without the minimal flavor violation hypothesis, at moderate and large tangent beta. In each case, the sensitivities to MSSM soft-breaking terms are compared, laying emphasis on possible correlations among observables. In most scenarios, rare K decays offer unique windows into the Delta S=1 sector of the soft-breaking terms. Therefore, together with B-physics and collider observables, these modes will be essential for reconstructing the still elusive SUSY-breaking mechanism. △ Less", "The lightest superparticle in the MSSM is expected to be a Bino, Higgsino or Wino. We consider the dark matter abundance constraint on these LSP scenarios in the minimal SUGRA and AMSB models. We discuss the resulting collider signals for the Bino LSP at LHC and the Higgsino and Wino LSP at CLIC. The Bino, Higgsino and Wino LSP signals in dark matter experiments are also discussed briefly. We conclude with a discussion of these LSP scenarios in nonminimal SUSY models. △ Less", "We study the impact of beam polarization on radiative neutralino production e+e- \\to χ^0_1 χ^0_1 photon at the International Linear Collider. We show that longitudinal polarized beams significantly enhance the signal and simultaneously reduce the Standard Model background from radiative neutrino production e+e- \\to ν\\barνphoton. We point out that the radiative production of neutralinos could be the only accessible SUSY particles, if neutralinos, charginos, sleptons, as well as squarks and gluinos are too heavy to be pair-produced in the first stage of the ILC at sqrt{s} = 500 GeV. △ Less", "A mechanism for the enhancement for proton lifetime in supersymmetric/supergravity (SUSY/SUGRA) grand unified theories (GUTs) and in string theory models is discussed where Higgsino mediated proton decay arising from color triplets (anti-triplets) with charges $Q=-1/3(1/3)$ and $Q=-4/3(4/3)$ is suppressed by an internal cancellation due to contributions from different sources. We exhibit the mechanism for an SU(5) model with $45_H+\\bar{45}_H$ Higgs multiplets in addition to the usual Higgs structure of the minimal model. This model contains both $Q=-1/3(1/3)$ and $Q=-4/3(4/3)$ Higgs color triplets (anti-triplets) and simple constraints allow for a complete suppression of Higgsino mediated proton decay. Suppression of proton decay in an SU(5) model with Planck scale contributions is also considered. The suppression mechanism is then exhibited for an SO(10) model with a unified Higgs structure involving $144_H+\\bar{144}_H$ representations.The SU(5) decomposition of $144_H+\\bar{144}_H$ contains $5_H+\\bar 5_H$ and $45_H+\\bar{45}_H$ and the cancellation mechanism arises among these contributions which mirrror the SU(5) case. The cancellation mechanism appears to be more generally valid for a larger class of unification models. Specifically the cancellation mechanism may play a role in string model constructions to suppress proton decay from dimension five operators. The mechanism allows for the suppression of proton decay consistent with current data allowing for the possibility that proton decay may be visible in the next round of nucleon stability experiment. △ Less", "Martin has proposed a scenario dubbed ``compressed supersymmetry'' (SUSY) where the MSSM is the effective field theory between energy scales M_{\\rm weak} and M_{\\rm GUT}, but with the GUT scale SU(3) gaugino mass M_3<< M_1 or M_2. As a result, squark and gluino masses are suppressed relative to slepton, chargino and neutralino masses, leading to a compressed sparticle mass spectrum, and where the dark matter relic density in the early universe may be dominantly governed by neutralino annihilation into ttbar pairs via exchange of a light top squark. We explore the dark matter and collider signals expected from compressed SUSY for two distinct model lines with differing assumptions about GUT scale gaugino mass parameters. For dark matter signals, the compressed squark spectrum leads to an enhancement in direct detection rates compared to models with unified gaugino masses. Meanwhile, neutralino halo annihilation rates to gamma rays and anti-matter are also enhanced relative to related scenarios with unified gaugino masses but, depending on the halo dark matter distribution, may yet be below the sensitivity of indirect searches underway. In the case of collider signals, we compare the rates for the potentially dominant decay modes of the stop_1 which may be expected to be produced in cascade decay chains at the LHC: \\tst_1\\to c\\tz_1 and \\tst_1\\to bW\\tz_1. We examine the extent to which multilepton signal rates are reduced when the two-body decay mode dominates. For the model lines that we examine here, the multi-lepton signals, though reduced, still remain observable at the LHC. △ Less", "We revisit the issue of moduli stabilization in a class of N=1 four dimensional supergravity theories which are low energy descriptions of standard perturbative heterotic string vacua compactified on Calabi-Yau spaces. In particular, we show how it is possible to stabilize the universal dilaton and Kahler moduli in a de Sitter/Minkowski vacuum with low energy supersymmetry breaking by means of non-perturbative gauge dynamics, including recent results by Intriligator, Seiberg and Shih. The non-SUSY vacua are meta-stable but sufficiently long-lived. △ Less", "We describe a kinematic method which is capable of determining the overall mass scale in SUSY-like events at a hadron collider with two missing (dark matter) particles. We focus on the kinematic topology in which a pair of identical particles is produced with each decaying to two leptons and an invisible particle (schematically, $pp\\to YY+jets$ followed by each $Y$ decaying via $Y\\to \\ell X\\to \\ell\\ell'N$ where $N$ is invisible). This topology arises in many SUSY processes such as squark and gluino production and decay, not to mention $t\\anti t$ di-lepton decays. In the example where the final state leptons are all muons, our errors on the masses of the particles $Y$, $X$ and $N$ in the decay chain range from 4 GeV for 2000 events after cuts to 13 GeV for 400 events after cuts. Errors for mass differences are much smaller. Our ability to determine masses comes from considering all the kinematic information in the event, including the missing momentum, in conjunction with the quadratic constraints that arise from the $Y$, $X$ and $N$ mass-shell conditions. Realistic missing momentum and lepton momenta uncertainties are included in the analysis. △ Less", "We explain the orbifold compactification in string models and present a Z_{12-I} orbifold compactification toward supersymmetric standard models. We also point out an effective R-parity from this string construction. The VEVs of gauge singlets are chosen such that phenomenological constraints are satisfied. △ Less", "We study phenomenological features in an extended gauge mediation SUSY breaking model which has non-universal gaugino masses and CP phases. We show that large CP phases in soft SUSY breaking parameters can be consistent with the constraints coming from the electric dipole moment (EDM) of an electron, a neutron, and also a mercury atom. Masses of the superpartners are not necessarily required to be larger than 1 TeV but allowed to be O(100) GeV. We also investigate the mass spectrum of Higgs scalars and their couplings to gauge bosons in that case. Compatibility of this model with the present experimental data on the Higgs sector is discussed. △ Less", "We revisit phenomenology of the minimal gauge-mediated model. This model is motivated from the SUSY CP and flavor problems. A specific feature of this model is that \\tanβis naturally large, since the B term in the Higgs potential is zero at the messenger scale. This leads to significant SUSY contributions to various low-energy observables. We evaluate the anomalous magnetic moment of the muon and the branching ratio of \\bar{B}\\to X_sγtaking account of recent theoretical and experimental developments. We find that the current experimental data prefer a low messenger scale (\\sim 100 TeV) and gluino mass around 1 TeV. We also calculate the branching ratios of \\bar{B}\\to X_s l^+l^-, B_s\\to μ^+μ^-, and B^-\\to τ^- \\barν, and show that these observables are strongly correlated with each other in this model. △ Less", "A consistent evolution of the strong coupling constant $α_s$ from $M_Z$ to the GUT scale is presented, involving three-loop running and two-loop decoupling. The two-loop transition from the MS- to the DR-scheme is properly taken into account. In the second part of the paper, the bottom quark mass in the DR-scheme at the electroweak/SUSY scale is evaluated with four-loop accuracy. We find that the three-loop effects are comparable to the experimental uncertainty both for $α_s$ and $m_b$. △ Less", "Gaugino masses might provide useful information on the underlying scheme of supersymmetry breaking as they are least dependent on the unknown physics between the TeV scale and the high messenger scale of supersymmetry breaking. We discuss the pattern of low energy gaugino masses in various schemes of supersymmetry breaking together with the possibility to determine the gaugino masses at LHC. △ Less", "We study the $e^{\\pm}μ^{\\mp} + E^{miss}_T$ and $l^+l^- + E^{miss}_T$ signatures $(l = e, μ)$ for different values of $\\tanβ$ in the mSUGRA model. With $\\tanβ$ rising, we observe a characteristic change in the shape of dilepton mass spectra in $l^+l^- + E^{miss}_T $ versus $e^{\\pm}μ^{\\mp}$ final states reflecting the decrease of $\\tildeχ^0_2 \\to l^+l^- \\tilde{χ^0_1}$ branching ratio. We also study the non mSUGRA modifications of the CMS test point LM1 with arbitrary relations among gaugino and higgsino masses. For such modifications of the mSUGRA test point LM1 the number of lepton events depends rather strongly on the relations among gaugino and higgsino masses and in some modifications of the test point LM1 the signatures with leptons and $E_{T}^{miss}$ do not lead to the SUSY discovery and the single SUSY discovery signature remains the signature with $n \\geq 2 jets + E^{miss}_T + no leptons$. △ Less", "We present the latest developments of the MadGraph/MadEvent Monte Carlo event generator and several applications to hadron collider physics. In the current version events at the parton, hadron and detector level can be generated directly from a web interface, for arbitrary processes in the Standard Model and in several physics scenarios beyond it (HEFT, MSSM, 2HDM). The most important additions are: a new framework for implementing user-defined new physics models; a standalone running mode for creating and testing matrix elements; generation of events corresponding to different processes, such as signal(s) and backgrounds, in the same run; two platforms for data analysis, where events are accessible at the parton, hadron and detector level; and the generation of inclusive multi-jet samples by combining parton-level events with parton showers. To illustrate the new capabilities of the package some applications to hadron collider physics are presented: 1) Higgs search in pp \\to H \\to W^+W^-: signal and backgrounds. 2) Higgs CP properties: pp \\to H jj$in the HEFT. 3) Spin of a new resonance from lepton angular distributions. 4) Single-top and Higgs associated production in a generic 2HDM. 5) Comparison of strong SUSY pair production at the SPS points. 6) Inclusive W+jets matched samples: comparison with the Tevatron data. △ Less", "The complementarity between the quark and lepton mixing matrices is shown to provide robust predictions. We obtain these predictions by first showing that the matrix V_M, product of the quark (CKM) and lepton (PMNS) mixing matrices, may have a zero (1,3) entry which is favored by experimental data. We obtain that any theoretical model with a vanishing (1,3) entry of V_M that is in agreement with quark data, solar, and atmospheric mixing angle leads to $θ_{13}^{PMNS}=(9{^{+1}_{-2}})^\\circ$. This value is consistent with the present 90% CL experimental upper limit. We also investigate the prediction on the lepton phases. We show that the actual evidence, under the only assumption that the correlation matrix V_M product of CKM and PMNS has a zero in the entry (1,3), gives us a prediction for the three CP-violating invariants J, S_1, and S_2. A better determination of the lepton mixing angles will give stronger prediction for the CP-violating invariants in the lepton sector. These will be tested in the next generation experiments. Finally we compute the effect of non diagonal neutrino mass in \"l_i -> l_j gamma\" in SUSY theories with non trivial Quark-Lepton complementarity and a flavor symmetry. The Quark-Lepton complementarity and the flavor symmetry strongly constrain the theory and we obtain a clear prediction for the contribution to \"mu -> e gamma\" and the \"tau\" decays \"tau -> e gamma\" and \"tau -> mu gamma\". If the Dirac neutrino Yukawa couplings are degenerate but the low energy neutrino masses are not degenerate, then the lepton decays are related among them by the V_M entries. On the other hand, if the Dirac neutrino Yukawa couplings are hierarchical or the low energy neutrino masses are degenerate, then the prediction for the lepton decays comes from the CKM hierarchy. △ Less", "We propose a possibility of spontaneous CP-violation (SCPV) at high scale in a SUSY SO(10) theory. The model is L-R symmetric SUSY SO(10) with \\textbf{\\noun{10}} and \\textbf{126} dimensional Higgs generating fermion masses, and the CP phase is generated through complex VEV of B-L breaking \\textbf{126} Higgs . The model can have potential application in explaining $ν$ masses and leptogenesis as well. △ Less", "We study R-parity violating contributions to the mixing parameter $y$ for $D^0 -\\bar D^0$ and $B^0_{d,s} - \\bar B^0_{d,s}$ systems. We first obtain general expressions for new physics contributions to $y$ from effective four fermion operators. We then use them to study R-parity contributions. We find that R-parity violating contributions to $D^0 - \\bar D^0$ mixing, and $B_{d}^0 - \\bar B_{d}^0$ to be small. There may be sizable contribution to $B_s^0 -\\bar B_s^0$ mixing. We also obtain some interesting bounds on R-parity violating parameters using known Standard Model predictions and experimental data. △ Less", "We have calculated the two-loop strong interaction corrections to the chargino pole masses in the DRbar'-scheme in the Minimal Supersymmetric Standard Model (MSSM) with complex parameters. We have performed a detailed numerical analysis for a particular point in the parameter space and found corrections of a few tenths of a percent. We provide a computer program which calculates chargino and neutralino masses with complex parameters including the one-loop corrections and all two-loop SQCD effects. △ Less", "Indirect information about the possible scale of supersymmetry (SUSY) breaking is provided by B-physics observables (BPO) as well as electroweak precision observables (EWPO). We combine the constraints imposed by recent measurements of the BPO BR(b -> s gamma), BR(B_s -> mu^+ mu^-), BR(B_u -> tau nu_tau) and Delta M_{B_s} with those obtained from the experimental measurements of the EWPO M_W, sin^2 theta_eff, Gamma_Z, (g-2)_mu and M_h, incorporating the latest theoretical calculations of these observables within the Standard Model and supersymmetric extensions. We perform a chi^2 fit to the parameters of the constrained minimal supersymmetric extension of the Standard Model (CMSSM), in which the SUSY-breaking parameters are universal at the GUT scale, and the non-universal Higgs model (NUHM), in which this constraint is relaxed for the soft SUSY-breaking contributions to the Higgs masses. Assuming that the lightest supersymmetric particle (LSP) provides the cold dark matter density preferred by WMAP and other cosmological data, we scan over the remaining parameter space. Within the CMSSM, we confirm the preference found previously for a relatively low SUSY-breaking scale, though there is some slight tension between the EWPO and the BPO. In studies of some specific NUHM scenarios compatible with the cold dark matter constraint we investigate M_A-tan_beta planes and find preferred regions that have values of chi^2 somewhat lower than in the CMSSM. △ Less", "We suggest SU(5)$'$ in the hidden sector toward a possible gauge mediated supersymmetry breaking scenario for removing the SUSY flavor problem, with an example constructed in $\\Z_{12-I}$ with three families. The example we present has the Pati-Salam type classification of particles in the observable sector and has no exotics at low energy. We point out that six or seven very light pairs of ${\\bf 5}'$ and $\\bar{\\bf 5}'$ out of ten vectorlike $\\five'$ and $\\fiveb'$ pairs of SU(5)$'$ is achievable, leading to a possibility of an unstable supersymmetry breaking vacuum. The possibility of different compactification radii of three two tori toward achieving the needed coupling strength is also suggested. △ Less", "One of the key motivations for supersymmetry is that it provides a natural candidate for dark matter. For a long time the density of this candidate particle fell within cosmological bounds across much of the SUSY parameter space. However with the precision results of WMAP, it has become apparent that the majority of the SUSY parameter space no longer fits the observed relic density. This has given rise to claims that supersymmetry no longer provides a natural explanation of dark matter. We address this claim by quantifying the degree of fine-tuning required for the different dark matter regions. We find that the dark matter regions vary widely in the degree of tuning required. This degree of tuning can then be used to provide valuable insights into the structure of SUSY breaking at the GUT scale. △ Less", "We construct a calculable model of electroweak symmetry breaking in which the Higgs doublet emerges from the meta-stable SUSY breaking sector as a pseudo Nambu-Goldstone boson. The Higgs boson mass is further protected by the little Higgs mechanism, and naturally suppressed by a two-loop factor from the SUSY breaking scale of 10 TeV. Gaugino and sfermion masses arise from standard gauge mediation, but the Higgsino obtains a tree-level mass at the SUSY breaking scale. At 1 TeV, aside from new gauge bosons and fermions similar to other little Higgs models and their superpartners, our model predicts additional electroweak triplets and doublets from the SUSY breaking sector. △ Less", "We consider neutralino dark matter within the framework of SUSY GUTs with non-universal gaugino masses. In particular we focus on the case of SU(5) with a SUSY breaking F-term in the 1, 24, 75 and 200 dimensional representations. We discuss the 24 case in some detail, and show that the bulk dark matter region cannot be accessed. We then go on to consider the admixture of the singlet SUSY breaking F-term with one of the 24, 75 or 200 dimensional F-terms, and show that in these cases it becomes possible to access the bulk regions corresponding to low fine-tuned dark matter. Our results are presented in the $(M_1,M_2)$ plane for fixed $M_3$ and so are useful for considering general GUT models, as well as more general non-universal gaugino models. △ Less", "The collision of a high energy cosmic ray with a nucleon in the upper atmosphere could produce long-lived heavy particles. Such particles would be very penetrating, since the energy loss in matter scales as the inverse mass, and could reach a neutrino telescope like IceCube from large zenith angles. Here we study this possibility and focus on the long-lived stau of SUSY models with a gravitino LSP. The signal would be a pair of muon-like parallel tracks separated by 50 meters along the detector. We evaluate the background of muon pairs and show that any events from zenith angles above 80 degrees could be explained by the production of these heavy particles by cosmic rays. △ Less", "Recently we have proposed a renormalizable grand unified theory, based on the SU(5) gauge symmetry, where the neutrino masses are generated through the type I and type III seesaw mechanisms. In this letter we study the supersymmetric version of this theory. As in the non-susy version it is possible to generate all fermion masses with the minimal number of Higgses, the theory predicts one massless neutrino and the leptogenesis mechanism can be realized. All contributions to the decay of the proton and the properties of neutralinos are discussed. This theory can be considered as the simplest renormalizable supersymmetric grand unified theory based on the SU(5) gauge symmetry since it has the minimal number of superfields and free parameters. △ Less", "We study the spectrum, couplings and cosmological and astrophysical implications of the moduli fields for the class of Calabi-Yau IIB string compactifications for which moduli stabilisation leads to an exponentially large volume V ~ 10^{15} l_s^6 and an intermediate string scale m_s ~ 10^{11}GeV, with TeV-scale observable supersymmetry breaking. All Kähler moduli except for the overall volume are heavier than the susy breaking scale, with m ~ ln(M_P/m_{3/2}) m_{3/2} ~ (\\ln(M_P/m_{3/2}))^2 m_{susy} ~ 500 TeV and, contrary to standard expectations, have matter couplings suppressed only by the string scale rather than the Planck scale. These decay to matter early in the history of the universe, with a reheat temperature T ~ 10^7 GeV, and are free from the cosmological moduli problem (CMP). The heavy moduli have a branching ratio to gravitino pairs of 10^{-30} and do not suffer from the gravitino overproduction problem. The overall volume modulus is a distinctive feature of these models and is an M_{planck}-coupled scalar of mass m ~ 1 MeV and subject to the CMP. A period of thermal inflation can help relax this problem. This field has a lifetime ~ 10^{24}s and can contribute to dark matter. It may be detected through its decays to 2γor e^+e^-. If accessible the e^+e^- decay mode dominates, with Br(χ\\to 2 γ) suppressed by a factor (ln(M_P/m_{3/2}))^2. We consider the potential for detection of this field through different astrophysical sources and find that the observed gamma-ray background constrains Ω_χ <~ 10^{-4}. The decays of this field may generate the 511 keV emission line from the galactic centre observed by INTEGRAL/SPI. △ Less", "We discuss some features of supersymmetry breaking induced by a brane-localized source which is stabilized at the IR end of warped throat, and also the resulting mirage mediation pattern of soft terms of the visible fields which are localized in the bulk space corresponding to the UV end of throat. Such supersymmetry breaking scheme can be naturally realized in KKLT-type string compactification, and predicts highly distinctive pattern of low energy superparticle masses which might be tested at the LHC. △ Less", "Patterns of flavor violation induced by neutrino Yukawa couplings are discussed in realistic ``minimal'' SUSY SU(5) models, obtained by adding nonrenormalizable operators to the minimal one, in order to fix the fermion spectrum and suppress proton decay. Results are presented for the three possible implementations of the seesaw mechanisms, i.e. of Type I, II and III. △ Less", "We propose a model of metastable dynamical supersymmetry breaking in which all scales are generated dynamically. Our construction is a simple variant of the Intriligator-Seiberg-Shih model, with quark masses induced by renormalizable couplings to an auxiliary supersymmetric QCD sector. Since all scales arise from dimensional transmutation, the model has no fundamental dimensionful parameters. It also does not rely on higher-dimensional operators. △ Less", "We provide what we believe is the minimal three family ${\\cal N} = 1$ SUSY and conformal Pati-Salam Model from type IIB superstring theory. This $Z_3$ orbifolded AdS$\\otimes S^5$ model has long lived protons and has potential phenomenological consequences for LHC. △ Less", "We construct a gauge-mediation model with a D-term supersymmetry (SUSY) breaking. R-symmetry breaking necessary for generating the SUSY standard-model gaugino masses is given by gaugino condensation of a strongly coupled gauge theory in the hidden sector. The energy scale of the strong dynamics of the hidden sector gauge theory should be around the messenger mass scale M, or otherwise perturbative calculations would be reliable and would lead to negative soft mass squared for squarks and sleptons. Thus, all the mass scales are controlled by a virtually single parameter, \\sqrt{D}/M. This model covers a very wide range of gravitino mass, m_{3/2} \\simeq 1 eV--100 TeV. Possible embeddings of the model in string theory are also discussed. △ Less", "We show how gauge coupling unification near the Planck scale $M_P\\sim 10^{19}$ GeV can be achieved in the framework of supersymmetry, facilitating a full unification of all forces with gravity. Below the conventional GUT scale $M_{GUT}\\sim 10^{16}$ GeV physics is described by a Supersymmetric Standard Model whose particle content is that of three complete $\\mathbf{27}$ representations of the gauge group $E_6$. Above the conventional GUT scale the gauge group corresponds to a left-right symmetric Supersymmetric Pati-Salam model, which may be regarded as a ``surrogate SUSY GUT'' with all the nice features of SO(10) but without proton decay or doublet-triplet splitting problems. At the TeV scale the extra exotic states may be discovered at the LHC, providing an observable footprint of an underlying $E_6$ gauge group broken at the Planck scale. Assuming an additional low energy $U(1)_X$ gauge group, identified as a non-trivial combination of diagonal $E_6$ generators, the $μ$ problem of the MSSM can be resolved. △ Less", "We will consider a SUSY-SU(5) with one right-handed neutrino with a large top like Yukawa coupling. Assuming universal soft masses at high scale we compute the low-energy spectrum and subsequently the neutralino LSP relic density taking also into consideration SU(5) as well as the see-saw running effects above the gauge coupling unification scale. We found that there exists no viable region in parameter space for $\\tanβ\\ler ~35$. The $\\tildeτ$ coannihilation process starts becoming efficient for $\\tanβ\\ger 35-40$. However, this process is significantly constrained by the limited range in which the stau is lighter than the neutralino. In fact, for a given $\\tanβ$ we find that there exists an upper bound on the lightest neutralino mass ($M_{χ_1^0}$) in this region. The A-pole funnel region appears at very large $\\tanβ\\simeq 45-50$, while the focus-point region does not make an appearance till large ($m_0,M_{1/2}$), namely a few TeV. Large $A_0$ terms at high scale can lead to extended regions consistent with WMAP constraints and remove the upper bounds in the stau coannihilation regions. △ Less", "We study models in which supersymmetry breaking appears at an intermediate scale, M_{in}, below the GUT scale. We assume that the soft supersymmetry-breaking parameters of the MSSM are universal at M_{in}, and analyze the morphology of the constraints from cosmology and collider experiments on the allowed regions of parameter space as M_{in} is reduced from the GUT scale. We present separate analyses of the (m_{1/2},m_0) planes for tan(beta)=10 and tan(beta)=50, as well as a discussion of non-zero trilinear couplings, A_0. Specific scenarios where the gaugino and scalar masses appear to be universal below the GUT scale have been found in mirage-mediation models, which we also address here. We demand that the lightest neutralino be the LSP, and that the relic neutralino density not conflict with measurements by WMAP and other observations. At moderate values of M_{in}, we find that the allowed regions of the (m_{1/2},m_0) plane are squeezed by the requirements of electroweak symmetry breaking and that the lightest neutralino be the LSP, whereas the constraint on the relic density is less severe. At very low M_{in}, the electroweak vacuum conditions become the dominant constraint, and a secondary source of astrophysical cold dark matter would be necessary to explain the measured relic density for nearly all values of the soft SUSY-breaking parameters and tan(beta). We calculate the neutralino-nucleon cross sections for viable scenarios and compare them with the present and projected limits from direct dark matter searches. △ Less", "The minimal SUSY SO(10) GUT models with {\\bf 10}, {\\bf 126} and {\\bf 210} Higgs and only renormalizable couplings has been shown to provide a simple way to understand the neutrino mixings as well as the ratio $Δm^2_\\odot/Δm^2_A$ in terms of quark mixing parameter $θ_{Cabibbo}$, provided neutrino masses are described by type II seesaw formula. However, in this minimal picture, it is impossible to realize type II dominance with renormalizable couplings in 4-dimensions. We show that this problem can be cured by embedding this model into a warped 5-dimensional space time with warping between the Planck and the GUT scale, where both type II as well as mixed seesaw formulae can be realized in a natural manner without expanding the Higgs sector. These models also avoid the possible problem of threshold effects associated with large Higgs representations since the theory above the GUT scale is now strongly coupled. △ Less", "In this paper we show how some flavor symmetries may be derived from the heterotic string, when compactified on a 6D orbifold. In the body of the paper we focus on the $D_4$ family symmetry, recently obtained in $Z_3 \\times Z_2$ orbifold constructions. We show how this flavor symmetry constrains fermion masses, as well as the soft SUSY breaking mass terms. Flavor symmetry breaking can generate the hierarchy of fermion masses and at the same time the flavor symmetry suppresses large flavor changing neutral current processes. △ Less", "Dark matter candidates and proton decay in a class of models based on the AdS/CFT correspondence are discussed. We show that the present bound on the proton decay lifetime is inconsistent with ${\\cal N} = 1$ SUSY, and strongly constrains ${\\cal N} = 0$ non-SUSY, low scale trinification type unification of orbifolded AdS$\\otimes S^5$ models. △ Less", "We consider gauge theories in a strong external magnetic like field. This situation can appear either in conventional four-dimensional theories, but also naturally in extra-dimensional theories and especially in brane world models. We show that in the lowest Landau level approximation, some of the coordinates become non-commutative. We find physical reasons to formal problems with non-commutative gauge theories such as the issue with SU(N) gauge symmetries. Our construction is applied to a minimal extension of the standard model. It is shown that the Higgs sector might be non-commutative whereas the remaining sectors of the standard model remain commutative. Signatures of this model at the LHC are discussed. We then discuss an application to a dark matter sector coupled to the Higgs sector of the standard model and show that here again, dark matter could be non-commutative, the standard model fields remaining commutative. △ Less", "We present a renormalization group motivation of scale hierarchies in SUSY SU(5) model. The Split Higgsino scanrio with a high scale of the SUSY breaking is considered in detail. Its manifestations in experiments are discussed. △ Less", "We discuss the phenomenological impact of a particularly interesting corner of the MSSM: the large tan(beta) regime. The capabilities of leptonic and hadronic Flavor Violating processes in shedding light on physics beyond the Standard Model are reviewed. Moreover, we show that tests of Lepton Universality in charged current processes can represent an interesting handle to obtain relevant information on New Physics scenarios. △ Less", "We consider a Mass Varying Neutrinos (MaVaNs) model in supersymmetric theory. The model includes effects of supersymmetry breaking transmitted by the gravitational interaction from the hidden sector, in which supersymmetry was broken, to the dark energy sector. Then evolutions of the neutrino mass and the equation of state parameter of the dark energy are presented in the model. It is remarked that only the mass of a sterile neutrino is variable in the case of the vanishing mixing between the left-handed and a sterile neutrino on cosmological time scale. The finite mixing makes the mass of the left-handed neutrino variable. △ Less", "We compute the effect of non diagonal neutrino mass in l_i -> l_j gamma in SUSY theories with non trivial Quark-Lepton complementarity and a flavor symmetry. The correlation matrix V_M=U_{CKM}U_{PMNS} is such that its (1,3) entry, as preferred by the present experimental data, is zero. We do not assume that $V_M$ is bimaximal. Quark-Lepton complementarity and the flavor symmetry strongly constrain the theory and we obtain a clear prediction for the contribution to mu -> e gamma and the tau decays tau -> e gamma and tau -> mu gamma. If the Dirac neutrino Yukawa couplings are degenerate but the low energy neutrino masses are not degenerate, then the lepton decays are related among them by the V_M entries. On the other hand, if the Dirac neutrino Yukawa couplings are hierarchical or the low energy neutrino masses are degenerate, then the prediction for the lepton decays comes from the U_{CKM} hierarchy. △ Less", "One way to ameliorate the SUSY flavor and CP problems is to postulate that scalar masses lie in the TeV or beyond regime. For example, the focus point (FP) region of the minimal supergravity (mSUGRA) model is especially compelling in that heavy scalar masses can co-exist with low fine-tuning while yielding the required relic abundance of cold dark matter (via a mixed higgsino-bino neutralino). We examine many of the characteristics of collider events expected to arise at the CERN LHC in models with multi-TeV scalars, taking the mSUGRA FP region as a case study. The collider events are characterized by a hard component arising from gluino pair production, plus a soft component arising from direct chargino and neutralino production. Gluino decays in the FP region are characterized by lengthy cascades yielding very large jet and lepton multiplicities, and a large b-jet multiplicity. Thus, as one steps to higher jet, b-jet or lepton multiplicity, signal-over-background rates should steadily improve. The lengthy cascade decays make mass reconstruction via kinematic edges difficult; however, since the hard component is nearly pure gluino pair production, the gluino mass can be extracted to +- 8% via total rate for \\eslt +\\ge 7-jet +\\ge 2 b-jet events, assuming 100 fb^{-1} of integrated luminosity. The distribution of invariant mass of opposite-sign/same-flavor dileptons in the hard component exhibits two dilepton mass edges: m_{\\tz_2}-m_{\\tz_1} and m_{\\tz_3}-m_{\\tz_1}. As a consistency check, the same mass edges should be seen in isolated opposite-sign dileptons occurring in the soft component trilepton signal which originates mainly from chargino-neutralino production. △ Less", "The anthropic principle is based on the observation that, within narrow bounds, the laws of physics are such as to have allowed the evolution of life. The string theoretic approach to understanding this observation is based on the expectation that the effective potential has an enormous number of local minima with different particle masses and perhaps totally different fundamental couplings and space time topology. The vast majority of these alternative universes are totally inhospitable to life, having, for example, vacuum energies near the natural (Planck) scale. The statistics, however, are assumed to be such that a few of these local minima (and not more) have a low enough vacuum energy and suitable other properties to support life. In the inflationary era, the \"multiverse\" made successive transitions between the available minima until arriving at our current state of low vacuum energy. String theory, however, also suggests that the absolute minimum of the effective potential is exactly supersymmetric. Questions then arise as to why the inflationary era did not end by a transition to one of these, when will the universe make the phase transition to the exactly supersymmetric ground state, and what will be the properties of this final state. △ Less", "A scenario is suggested for spontaneous CP violation in non-SUSY and SUSY- SO(10). The idea is to have a scalar potential which generates spontaneously a phase, at the high scale, in the VEV that gives a mass to the RH neutrinos. As a possible realization the case of the minimal renormalizable SUSY SO(10) is discussed in detail and one finds that a phase is induced in the CKM matrix. It is also pointed out that, in these models, the scales of Baryogenesis, Seesaw, Spontaneous CP violation and Spontaneous U(1)PQ breaking are all at the same order of magnitude. △ Less", "We study flavor changing effects on the \\ppbchT process at the Large Hadron Collider(LHC), which are inspired by the left-handed up-type squark mixings in the Minimal Supersymmetric Standard Model(MSSM). We find that the SUSY QCD radiative corrections to $bcH^\\pm$ coupling can significantly enhance the cross sections at the tree-level by a factor about $1.5 \\sim 5$ with our choice of parameters. We conclude that the squark mixing mechanism in the MSSM makes the \\ppbchT process a new channel for discovering a charged Higgs boson and investigating flavor changing effects. △ Less", "We apply the effective field theory definition of Minimal Flavour Violation (MFV) to the MSSM. We explicitly show how, by this definition, the new sources of flavour and CP violation present in the MSSM become functions of the SM Yukawa couplings, and cannot be simply set to zero, as is common wisdom in phenomenological MSSM studies that assume MFV. We apply our approach to the MSSM Delta B = 2 Hamiltonian at low tan(beta). The limit of MFV amounts to a striking increase in the predictivity of the model. In particular, SUSY corrections to meson-antimeson mass differences Delta M(d,s) are always found to be positive with respect to the SM prediction. This feature is due to an interesting interplay between chargino and gluino box diagrams (the dominant contributions) in the different mass regimes one can consider. Finally, we point out that, due to the presence of gluinos, the MFV MSSM does not belong -- even at low tan(beta) -- to the class of models with the so-called `constrained' MFV (CMFV), in which only the SM operator (V-A)x(V-A) contributes to Delta M(d,s). Consequently, for the MSSM and in the general case of MFV, one should not use the Universal Unitarity Triangle (UUT), relevant for CMFV models, but a MFV-UT constructed from beta(psi KS) and |V(ub)| or gamma from tree level decays. In particular, with the measured value of beta(psi KS), MFV implies a testable correlation between |V(ub)| and gamma. With the present high value of |V(ub)|, MFV favours gamma > 80 degrees. △ Less", "We study LHC phenomenology of mirage mediation scenario in which anomaly and modulus contributions to soft SUSY breaking terms are comparable to each other. A Monte Carlo study of mirage mediation, with model parameters $α=1$,$ M_0=500$ GeV, $n_M=1/2$, $n_H=1$ and $\\rm{tan}β=10$, is presented. It is shown that masses of supersymmetric particles can be measured in a model independent way, providing information on SUSY breaking sector. In particular, the mass ratio of gluino to the lightest neutralino for the benchmark scenario is determined to be $1.9 \\lesssim m_{\\tildeg}/m_{\\tildeχ_1^0} \\lesssim 3.1$, well reproducing theoretical input value of $m_{\\tilde g}/m_{\\tildeχ_1^0} \\simeq 2.5$ which is quite distinctive from the predictions $m_{\\tilde g}/m_{\\tildeχ_1^0} \\gtrsim 6$ of other SUSY scenarios in which gaugino masses are unified at the GUT scale. The model parameters of mirage mediation can be also determined from various kinematic distributions. △ Less", "We propose a one-parameter theory for gauge mediation of supersymmetry (SUSY) breaking. The spectrum of SUSY particles such as squarks and sleptons in the SUSY standard-model and the dynamics of SUSY-breaking sector are, in principle, determined only by one parameter in the theory, that is, the mass of messengers. Above the messenger threshold all gauge coupling and Yukawa coupling constants in the SUSY-breaking sector are on the infrared fixed point. We find that the present theory may predict a split spectrum of the standard-model SUSY particles, m_{gaugino} < m_{sfermion}, where m_{gaugino} and m_{sfermion} are SUSY-breaking masses for gauginos and squarks/sleptons, respectively. △ Less", "We study, in a bottom-up approach, the fine-tuning problem between soft SUSY breaking parameters and the $μ$-term for the successful electroweak symmetry breaking in the minimal supersymmetric standard model. It is shown that certain nontrivial ratios between gaugino masses, that is non-universal gaugino masses, are necessary at the GUT scale, in order for the fine-tuning to be reduced above 10 % order. In addition, when all the gaugino masses should be regarded as independent ones in their origins, a small gluino mass $M_3 \\lesssim 120$ GeV and a non-vanishing $A$-term $A_t \\sim O(M_3)$ associated to top squarks are also required at the GUT scale as well as the non-universality. On the other hand, when we consider some UV theory, which fixes ratios of soft SUSY breaking parameters as certain values with the overall magnitude, heavier spectra are allowed. It is favored that the gluino and wino masses are almost degenerate at the weak scale, while wider region of bino mass is favorable. △ Less", "We examine supersymmetric models with mixed modulus-anomaly mediated SUSY breaking (MM-AMSB) soft terms which get comparable contributions to SUSY breaking from moduli-mediation and anomaly-mediation. The apparent (mirage) unification of soft SUSY breaking terms at Q=mu_mir not associated with any physical threshold is the hallmark of this scenario. The MM-AMSB structure of soft terms arises in models of string compactification with fluxes, where the addition of an anti-brane leads to an uplifting potential and a de Sitter universe, as first constructed by Kachru {\\it et al.}. The phenomenology mainly depends on the relative strength of moduli- and anomaly-mediated SUSY breaking contributions, and on the Higgs and matter field modular weights, which are determined by the location of these fields in the extra dimensions. We delineate the allowed parameter space for a low and high value of tan(beta), for a wide range of modular weight choices. We calculate the neutralino relic density and display the WMAP-allowed regions. We show the reach of the CERN LHC and of the International Linear Collider. We discuss aspects of MM-AMSB models for Tevatron, LHC and ILC searches, muon g-2 and b->s γbranching fraction. We also calculate direct and indirect dark matter detection rates, and show that almost all WMAP-allowed models should be accessible to a ton-scale noble gas detector. Finally, we comment on the potential of colliders to measure the mirage unification scale and modular weights in the difficult case where mu_mir>>M_GUT. △ Less", "We study the effects of O(alpha_s) supersymmetric QCD (SQCD) corrections on the total production rate and kinematic distributions of polarized and unpolarized top-pair production in pp and p anti-p collisions. At the Fermilab Tevatron p anti-p collider, top-quark pairs are mainly produced via quark-antiquark annihilation, q anti-q -> t anti-t, while at the CERN LHC pp collider gluon-gluon scattering, g g -> t anti-t, dominates. We compute the complete set of O(alpha_s) SQCD corrections to both production channels and study their dependence on the parameters of the Minimal Supersymmetric Standard Model. In particular, we discuss the prospects for observing strong, loop-induced SUSY effects in top-pair production at the Tevatron Run II and the LHC. △ Less", "The continuous infall of dark matter with low velocity dispersion from all directions in a galactic halo leads to the formation of caustics which are very small scale ($\\sim$parsec) high density structures. If the dark matter is made up of SUSY neutralinos, the annihilation of these particles produces a characteristic spectrum of gamma rays which in principle, could be detected. The annihilation signal at different energy bands is computed and compared with the expected gamma ray background. △ Less", "We systematically calculate various flavor-changing neutral-current top-quark processes induced by supersymmetry at the Large Hadron Collider, which include five decay modes and six production channels. To reveal the characteristics of these processes, we first compare the dependence of the rates for these channels on the relevant supersymmetric parameters, then we scan the whole parameter space to find their maximal rates, including all the direct and indirect current experimental constraints on the scharm-stop flavor mixings. We find that, under all these constraints, only a few channels, through cg->t at parton-level and t-> ch, may be observable at the Large Hadron Collider. △ Less", "We propose a novel mechanism for dark energy, based on an extended seesaw for scalar fields, which does not require any new physics at energies below the TeV scale. A very light quintessence mass is usually considered to be technically unnatural, unless it is protected by some symmetry broken at the new very light scale. We propose that one can use an extended seesaw mechanism to construct technically natural models for very light fields, protected by SUSY softly broken above a TeV. △ Less", "In this talk I discuss some aspects of the study of electric dipole moments (EDMs) of the fermions, in the context of R-parity violating (\\rpv) Supersymmetry (SUSY). I will start with a brief general discussion of how dipole moments, in general, serve as a probe of physics beyond the Standard Model (SM) and an even briefer summary of \\rpv SUSY. I will follow by discussing a general method of analysis for obtaining the leading fermion mass dependence of the dipole moments and present its application to \\rpv SUSY case. Then I will summarise the constraints that the analysis of $e,n$ and $Hg$ EDMs provide for the case of trilinear \\rpv SUSY couplings and make a few comments on the case of bilinear \\rpv, where the general method of analysis proposed by us does not work. △ Less", "We systematically analyze the correlations between the various leptonic and hadronic flavor violating processes arising in SUSY Grand Unified Theories. Using the GUT-symmetric relations between the soft SUSY breaking parameters, we assess the impact of hadronic and leptonic flavor observables on the SUSY sources of flavor violation. △ Less", "We study CP violation in semi-leptonic $τ$ decays and we determine the conditions necessary to be able to define a observable CP asymmetry. We apply these conditions in both models, the standard model for the electroweak interactions and its supersymmetric extensions. In the first case, the leading order contribution to the direct CP asymmetry in $τ^{\\pm} \\to K^{\\pm}π^0 ν_τ$ decay rates is evaluated. In the second case,we compute the SUSY effective hamiltonian that describes the $|ΔS|=1$ semileptonic decays of tau leptons. We show that SUSY contributions may enhance the CP asymmetry of $τ\\to K πν_τ$ decays by several orders of magnitude compared to the standard model expectations. △ Less", "In this brief review of recent theoretical developments associated with the search for dark matter I describe the following: why baryons are now ruled out as dark matter candidates; SUSY WIMPS and signatures in the MSSM and NMSSM why claimed indirect signatures are probably not WIMP related, why axions may be of new interest, how WIMP detection might tell us about the galactic halo, and how theorists are preparing to avoid the next generation of experimental constraints. △ Less", "Motivated by the recent measurements of the B_s-\\bar{B}_s mass difference from the D0 and CDF collaborations, we probe new physics effects in the B_q-\\bar{B}_q mixing within the context of the supersymmetric grand unified model (SUSY GUT). We find that new physics effects in B_{s(d)}-\\bar{B}_{s(d)} mixing lead to the correlated information in the branching fractions of the lepton flavor violating decays, which may serve as a test of the SUSY GUT. We also discuss the implication of such new physics effects on the quark-lepton complementarity in the neutrino mixings. △ Less", "We review the mechanism of radiative electroweak symmetry breaking taking place in SUSY versions of the standard model. We further discuss different proposals for the origin of SUSY-breaking and the corresponding induced SUSY-breaking soft terms. Several proposals for the understanding of the little hierarchy problem are critically discussed. △ Less", "We examine the possible resolution of the recently observed polarization anomaly in B0(bar{B}0) -> phi K*0(bar{K}*0) decay within R-parity violating (RPV) SUSY. We show that a combination of the superpotential trilinear (RPV)-interactions, with the couplings lambda', and the soft SUSY breaking bilinear RPV, sneutrino-Higgs mixing, proportional to tilde{mu}**2, can potentially generate the effective operators with the chirality structure necessary to account for this anomaly. However, we demonstrate that the existing experimental data on Bs -> mu+ mu- decay lead to stringent upper limits on the Wilson coefficients of these operators, which are about two orders of magnitude below the values required for the resolution of the B-decay polarization anomaly, and, therefore, it can hardly be explained within the RPV SUSY framework. As a byproduct result of our analysis we derive new limits on the products of the soft bilinear and the superpotential trilinear RPV-parameters of the form tilde{mu}**2 * lambda'. △ Less", "We investigate the little hierarchy between Z boson mass and the SUSY breaking scale in the context of landscape of electroweak symmetry breaking vacua. We consider the radiative symmetry breaking and found that the scale where the electroweak symmetry breaking conditions are satisfied and the average stop mass scale is preferred to be very close to each other in spite of the fact that their origins depend on different parameters of the model. If the electroweak symmetry breaking scale is fixed at about 1 TeV by the supersymmetry model parameters then the little hierarchy seems to be preferred among the electroweak symmetry breaking vacua. We characterize the little hierarchy by a probability function and the mSUGRA model is used as an example to show the 90% and 95% probability contours in the experimentally allowed region. We also investigate the size of the Higgsino mass by considering the distribution of electroweak symmetry breaking scale. △ Less", "We argue that the superpartner of the Dirac right-handed neutrino is a prime candidate for dark matter created from a 'mattergenesis' mechanism. We show that due to the smallness of the Yukawa couplings, a right-handed sneutrino density created in the early Universe would not be erased by annihilations, which remain out of thermal equilibrium. It would also not be drowned by a later, additional production of right-handed sneutrinos, as the relic density of the non-thermal right-handed sneutrinos is found to be generally negligible compared to the observed dark matter density. Mild constraints on sneutrino masses and trilinear SUSY-breaking couplings are obtained. Possible mattergenesis scenarios are also mentioned △ Less", "We present a first and extensive study of threshold resummation effects for supersymmetric (SUSY) particle production at hadron colliders, focusing on Drell-Yan like slepton-pair and slepton-sneutrino associated production. After confirming the known next-to-leading order (NLO) QCD corrections and generalizing the NLO SUSY-QCD corrections to the case of mixing squarks in the virtual loop contributions, we employ the usual Mellin N-space resummation formalism with the minimal prescription for the inverse Mellin-transform and improve it by resumming 1/N-suppressed and a class of N-independent universal contributions. Numerically, our results increase the theoretical cross sections by 5 to 15% with respect to the NLO predictions and stabilize them by reducing the scale dependence from up to 20% at NLO to less than 10% with threshold resummation. △ Less", "We present the renormalization scheme used in and the characteristic features of GRACE/SUSY-loop, the package of the program for the automatic calculation of the MSSM processes including one-loop order corrections. The two-body and three-body decay widths of charginos in one-loop order evaluated by GRACE/SUSY-loop are shown. △ Less", "$\\tilde{q}_L \\tilde{q}_L$ production is one of the main SUSY production processes in the MSSM, which occurs due to the chirality flip caused by the Majorana gluino mass. This process is one of the sources of same sign two lepton (SS2$l$) events, however, gluino production also contributes to this channel. In this paper, we develop a method to identify gluino and squark production separately in the SS2$l$ channel, based on cuts on the kinematical configuration of the jets. We applied the method to the MSSM, a model with an extended gluino sector, and the Littlest Higgs model with T-parity (LHT), and found a distinctive difference between these models when considering the numbers of SS2$l$ events selected by the cuts. △ Less", "We study the complete one loop contribution to $H^\\pm\\to W^\\pm V$, $V= Z, γ$, in the Minimal Supersymmetric Standard Model (MSSM). We evaluate the MSSM contributions taking into account $B\\to X_sγ$ constraint as well as experimental constraints on the MSSM parameters. In the MSSM, we found that in the intermediate range of $\\tanβ\\la 10$ and for large $A_t$ and large $μ$, where lightest stop becomes very light and hence squarks contribution is not decoupling, the branching ratio of $H^\\pm \\to W^{\\pm} Z$ can be of the order $10^{-3}$ while the branching ratio of $H^\\pm \\to W^{\\pm} γ$ is of the order $10^{-5}$. We also study the effects of the CP violating phases of Soft SUSY parameters and found that they can modify the branching ratio by about one order of magnitude. △ Less", "We construct a supersymmetric version of the Standard Model which contains a long-lived metastable vacuum. In this vacuum supersymmetry is broken and the electroweak symmetry is Higgsed, and we identify it with the physical ground state of the Standard Model. In our approach the metastable supersymmetry breaking (MSB) occurs directly in the SU(2)_L x U(1)_Y sector of the Standard Model; it does not require a separate MSB sector and in this way it departs from the usual lore. There is a direct link between the electroweak symmetry breaking and the supersymmetry breaking in our model, both effects are induced by the same Higgs fields. In order to generate sufficiently large gluino masses we have to have strong coupling in the Higgs sector, h >> 1. Our model results in an extremely compact low-energy effective theory at the electroweak scale with Higgs fields being very heavy, M_{Higgs} >> M_W and frozen at their vacuum expectation values. △ Less", "We study constraints on the fundamental parameters of supersymmetric type I seesaw models imposed by neutrino data, charged lepton flavor violation, thermal leptogenesis and perturbativity of the neutrino Yukawa couplings. △ Less", "We analyze lepton flavor violating $τ\\to μγ$ and $μ\\to e γ$ processes in SUSY GUT model in which sfermions have special mass spectrum. It is assumed that only third generation sfermions which are contained in ${\\bf 10}(Q, U^c, E^c)$ of SU(5) can have a different mass from the others. This mass spectrum is led from $E_6$ GUT model with horizontal symmetries. It is shown that branching ratios of $τ\\to μγ$ and $μ\\to e γ$ depend strongly on a right-handed stau mass. The weak scale stability requires the light stau, so large decay rates can be expected in this scenario. When stau is around 150 GeV and $\\tan β\\sim 10$, the branching ratios can be larger than $Br(τ\\to μγ) \\simeq 10^{-8}$ and $Br(μ\\to e γ) \\simeq 5\\times 10^{-12}$, which are within reach of future experiments. In addition, this model has an interesting feature that the final state charged lepton tends to have the right-handed chirality. △ Less", "We present a simple extension of MSSM which provides a unified picture of cosmological baryon asymmetry and dark matter. Our model introduces a gauge singlet field $N$ and a color triplet field $X$ which couple to the right--handed quark fields. The out--of equilibrium decay of the Majorana fermion $N$ mediated by the exchange of the scalar field $X$ generates adequate baryon asymmetry for $M_N \\sim 100$ GeV and $M_X \\sim$ TeV. The scalar partner of $N$ (denoted $\\tilde{N}_1$) is naturally the lightest SUSY particle as it has no gauge interactions and plays the role of dark matter. $\\tilde{N}_1$ annihilates into quarks efficiently in the early universe via the exchange of the fermionic $\\tilde{X}$ field. The model is experimentally testable in (i) neutron--antineutron oscillations with a transition time estimated to be around $10^{10}$ sec, (ii) discovery of colored particles $X$ at LHC with mass of order TeV, and (iii) direct dark matter detection with a predicted cross section in the observable range. △ Less", "Events with an isolated high $p_T$ lepton, a hadron jet and missing energy as observed in the H1 experiment at HERA, are potentially associated with R-parity violation in supersymmetric theories. However, stringent kinematic constraints must be fulfilled if the production of supersymmetric particles in R-parity violating scenarios were the correct path for explaining these puzzling events. A reference point \\RF is specified for which these constraints are illustrated and implications of the supersymmetric interpretation for new classes of multi-lepton events are indicated. △ Less", "We have calculated the two-loop strong interaction corrections to the neutralino pole masses in the DRbar'-scheme in the Minimal Supersymmetric Standard Model (MSSM). We have performed a detailed numerical analysis for a particular point in the parameter space and found corrections of a few tenths of a percent. We agree with previously derived analytic formulae for two-loop corrections to fermion masses. △ Less", "In split supersymmetry the gauginos and higgsinos are the only supersymmetric particles possibly accessible at foreseeable colliders like the CERN Large Hadron Collider (LHC) and the International Linear Collider (ILC). In order to account for the cosmic dark matter measured by WMAP, these gauginos and higgsinos are stringently constrained and could be explored at the colliders through their direct productions and/or virtual effects in some processes. The clean environment and high luminosity of the ILC render the virtual effects of percent level meaningful in unraveling the new physics effects. In this work we assume split supersymmetry and calculate the virtual effects of the WMAP-allowed gauginos and higgsinos in Higgs productions e+e- -> Z h and e+e- -> ν_e \\bar_ν_e h through WW fusion at the ILC. We find that the production cross section of e+e- -> Zh can be altered by a few percent in some part of the WMAP-allowed parameter space, while the correction to the WW-fusion process e+e- -> ν_e \\bar_ν_e h is below 1%. Such virtual effects are correlated with the cross sections of chargino pair productions and can offer complementary information in probing split supersymmetry at the colliders. △ Less", "TeV scale mirage mediation has been proposed as a supersymmetry breaking scheme reducing the fine tuning for electroweak symmetry breaking in the minimal supersymmetric extension of the standard model. We discuss a moduli stabilization set-up for TeV scale mirage mediation which allows an extra-dimensional interpretation for the origin of supersymmetry breaking and naturally gives an weak-scale size of the Higgs B-parameter. The set-up utilizes the holomorphic gauge kinetic functions depending on both the heavy dilaton and the light volume modulus whose axion partners are assumed to be periodic fields. We also examine the low energy phenomenology of TeV scale mirage mediation, particularly the constraints from electroweak symmetry breaking and FCNC processes. △ Less", "We study the role neutrino telescopes could play in discovering supersymmetric extensions of the Standard Model with a long-lived stau next-to-lightest superparticle. In such a setup, pairs of staus are produced by cosmic neutrino interactions in the Earth matter. In optimistic scenarios, one can expect several pair events per year in a cubic kilometer detector such as IceCube. We also show that no significant event rate can be expected for decays of staus stopped in the detector. △ Less", "We show that Supercritical-String-Cosmology (SSC) off-equilibrium and time-dependent-dilaton effects lead to a smoothly evolving dark energy for the last 10 billion years in concordance with all presently available astrophysical data. Such effects dilute by a factor O (10) the supersymmetric dark matter density (neutralinos), relaxing severe WMAP 1,3 constraints on the SUSY parameter space. Thus, LHC anticipated searches/discoveries may discriminate between conventional and Supercritical-String Cosmology. △ Less", "A scenario is suggested for spontaneous CP violation in non-SUSY and SUSY SU(10). The idea is to have a scalar potential which generates spontaneously a phase, at the high scale, in the VEV that gives a mass to the RH neutrinos. The case of the minimal renormalizable SUSY SO(10) is discussed in detail. The high scale CP breaking induces a phase in the CKM matrix as well. It is also pointed out that, in these models, the scales of Baryogenesis, Seesaw, Spontaneous CP violation and Spontaneous U(1)_QP breaking are all of the same order of magnitude. △ Less", "We study moduli stabilization with F-term uplifting. As a source of uplifting F-term, we consider spontaneous supersymmetry breaking models, e.g. the Polonyi model and the Intriligator-Seiberg-Shih model. We analyze potential minima by requiring almost vanishing vacuum energy and evaluate the size of modulus F-term. We also study soft SUSY breaking terms. In our scenario, the mirage mediation is dominant in gaugino masses. Scalar masses can be comparable with gaugino masses or much heavier, depending on couplings with spontaneous supersymmetry breaking sector. △ Less", "We look at the recently proposed idea that susy breaking can be accomplished in a meta-stable vacuum. In the context of one of the simplest models (the Seiberg-dual of super-QCD), we address the following question: if we look at this theory as it cools from high temperature, is it at all possible that we can end up in a susy-breaking meta-stable vacuum? To get an idea about the answer, we look at the free energy of the system at high temperature. We conclude that the phase-structure of the free-energy as the temperature drops, is indeed such that there is a second order phase transition in the direction of the non-susy vacuum at a finite $T=T_c^Q$. On the other hand, the potential barrier in the direction of the susy vacuum is there all the way till $T \\sim 0$. △ Less", "It has been known that in anomaly-mediated SUSY breaking model Affleck-Dine baryogenesis does not work due to trapping of Affleck-Dine field into charge-breaking minima. We show that when finite-temperature effect is properly taken into account and if reheating temperature is relatively high, the problem of falling into charge breaking global minima can be avoided and hence Affleck-Dine baryogenesis works. Moreover, for the LH_u flat direction we obtain a constraint on the mass of neutrino. △ Less", "In some class of supersymmetric models, small neutrino mass is given as a consequence of the supersymmetry (SUSY) breaking. Phenomenologically interesting features of this scenario are as follows: (i) the right-handed sneutrino mass could be as low as TeV scale due to the Giudice-Masiero mechanism, and (ii) a scalar trilinear interaction of Higgs-slepton-(right-handed) sneutrino could be sizable without suppression by the small neutrino Yukawa coupling. We study some phenomenological aspects of this scenario focusing on the scalar trilinear interaction. We show that the 1-loop correction by sneutrino exchange to the lightest Higgs boson mass destructively interferes with top-stop contributions in the minimal SUSY Standard Model. We find that a decay of charged Higgs boson into sneutrino and charged slepton is sizably enhanced and hence it gives rise to a distinctive signal at future collider experiments in some parameter space. △ Less", "We systematically investigate constraints on the parameters of the supersymmetric type-I seesaw mechanism from the requirement of successful thermal leptogenesis in the presence of upper bounds on the reheat temperature $T_\\mathrm{RH}$ of the early Universe. To this end, we solve the flavour-dependent Boltzmann equations in the MSSM, extended to include reheating. With conservative bounds on $T_\\mathrm{RH}$, leading to mildly constrained scenarios for thermal leptogenesis, compatibility with observation can be obtained for extensive new regions of the parameter space, due to flavour-dependent effects. On the other hand, focusing on (normal) hierarchical light and heavy neutrinos, the hypothesis that there is no CP violation associated with the right-handed neutrino sector, and that leptogenesis exclusively arises from the CP-violating phases of the $U_\\text{MNS}$ matrix, is only marginally consistent. Taking into account stricter bounds on $T_\\mathrm{RH}$ further suggests that (additional) sources of CP violation must arise from the right-handed neutrino sector, further implying stronger constraints for the right-handed neutrino parameters. △ Less", "Dominant decay of a SM-like Higgs boson into particles beyond those contained in the minimal supersymmetric standard model has been identified as a natural scenario to avoid fine tuning in electroweak symmetry breaking while satisfying all LEP limits. In the simplest such extension, the next-to-minimal supersymmetric model, the lightest CP-even Higgs boson can decay into two pseudoscalars. In the scenario with least fine tuning the lightest CP-even Higgs boson has mass of order 100 GeV. In order to escape LEP limits it must decay to a pair of the lightest CP-odd Higgs bosons with Br(h -> aa)>.7 and m_a<2m_b (so that a -> τ^+ τ^- or light quarks and gluons). The mass of the lightest CP-odd Higgs boson is controlled by the soft-trilinear couplings, A_λ(m_Z) and A_κ(m_Z). We identify the region of parameter space where this situation occurs and discuss how natural this scenario is. It turns out that in order to achieve m_a < 2 m_b with A_λ(m_Z), A_κ(m_Z) of order the typical radiative corrections, the required tuning of trilinear couplings need not be larger than 5-10 %. Further, the necessity for this tuning can be eliminated in specific SUSY breaking scenarios. Quite interestingly, Br(h -> aa) is typically above 70 % in this region of parameter space and thus an appropriately large value requires no additional tuning. △ Less", "Cosmic rays from outer space enter the atmosphere with energies of up to 10^{11} GeV. The initial particle or a secondary hadron inside the shower may then interact with an air nucleon to produce nonstandard particles. In this article we study the production of new physics by high energy cosmic rays, focusing on the long-lived gluino of split-SUSY models and a WIMP working as dark matter. We first deduce the total flux of hadron events at any depth in the atmosphere, showing that secondary hadrons can not be neglected. Then we use these results to find the flux of gluinos and WIMPs that reach the ground after being produced inside air showers. We also evaluate the probability of producing these exotic particles in a single proton shower of ultrahigh energy. Finally we discuss the possible signal in current and projected experiments. While the tiny flux of WIMPs does not seem to have any phenomenological consequences, we show that the gluinos could modify substantially the profile of a small fraction of extensive air showers. In particular, they could produce a distinct signal observable at AUGER in showers of large zenith angle. △ Less", "From string theory and the observation of a positive vacuum energy in our universe it seems inevitable that there will eventually be a phase transition to an exactly supersymmetric (susy) universe. In this phase there will be an effective weakening of the Pauli principle due to fermi-bose degeneracy. As a consequence molecular binding will be significantly affected. We make some general comments on susy molecules and perform a variational principle estimate of ionic binding energies. △ Less", "Supersymmetry breaking in a metastable vacuum is re-examined in a cosmological context. It is shown that thermal effects generically drive the Universe to the metastable minimum even if it begins in the supersymmetry-preserving one. This is a generic feature of the ISS models of metastable supersymmetry breaking due to the fact that SUSY preserving vacua contain fewer light degrees of freedom than the metastable ground state at the origin. These models of metastable SUSY breaking are thus placed on an equal footing with the more usual dynamical SUSY breaking scenarios. △ Less", "Within supersymmetric SU(5) GUT we suggest mechanisms for suppression of baryon number violating dimension five and six operators. The mechanism is based on the idea of split multiplets (i.e. quarks and leptons are not coming from a single GUT state) which is realized by an extension with additional vector-like matter. The construction naturally avoids wrong asymptotic relation $\\hat{M}_D=\\hat{M}_E$. Thus, the long standing problems of the minimal SUSY SU(5) GUT can be resolved. In a particular example of flavor structure and with additional ${\\cal U}(1)\\tm {\\cal Z}_{3N}$ symmetry we demonstrate how the split multiplet mechanism works out. Namely, the considered model is compatible with successful gauge coupling unification and realistic fermion mass pattern. The nucleon decay rates are relatively suppressed and can be well compatible with current experimental bounds. △ Less", "In supersymmetric seesaw models based on SUSY-GUTs, it could happen that the neutrino PMNS mixing angles are related to the lepton flavour violating decay rates. In particular SO(10) frameworks, the smallest mixing angle would get directly correlated with the $μ\\to e + γ$ decay amplitude. Here we study this correlation in detail considering $U_{e3}$ as a free parameter between 0 and $U_{e3}$(CHOOZ). Large radiative corrections to $U_{e3}$ present in these models, typically of the order ~$ΔU_{e3} ~\\sim ~10^{-3}$ (peculiar to hierarchial neutrinos), can play a major role in enhancing the Br($μ\\to e +γ$), especially when $U_{e3} \\ler 10^{-3}$. For large tan$β$, even such small enhancements are sufficient to bring the associated Br($μ\\to e + γ$) into realm of MEG experiment as long as SUSY spectrum lies within the range probed by LHC. On the other hand, for some (negative) values of $U_{e3}$, suppressions can occur in the branching ratio, due to cancellations among different contributions. From a top-down perspective such low values of $U_{e3}$ at the weak scale might require some partial/full cancellations between the high scale parameters of the model and the radiative corrections unless $U_{e3}$ is purely of radiative origin at the high scale. We further emphasize that in Grand Unified theories there exist additional LFV effects related to the running above the GUT scale, that are also independent on the low energy value of $U_{e3}$. These new contributions can become competitive and even dominant in some regions of the parameter space. △ Less", "We derive Feynman rules for the interactions of a single gravitino with (s)quarks and gluons/gluinos from an effective supergravity Lagrangian in non-derivative form and use them to calculate the hadroproduction cross sections and decay widths of single gravitinos. We confirm the results obtained previously with a derivative Lagrangian as well as those obtained with the non-derivative Lagrangian in the high-energy limit and elaborate on the connection between gauge independence and the presence of quartic vertices. We perform extensive numerical studies of branching ratios, total cross sections, and transverse-momentum spectra at the Tevatron and the LHC. From the latest CDF monojet cross section limit, we derive a new and robust exclusion contour in the gravitino-squark/gluino mass plane, implying that gravitinos with masses below $2\\cdot10^{-5}$ to $1\\cdot10^{-5}$ eV are excluded for squark/gluino-masses below 200 and 500 GeV, respectively. These limits are complementary to the one obtained by the CDF collaboration, $1.1\\cdot 10^{-5}$ eV, under the assumption of infinitely heavy squarks and gluinos. For the LHC, we conclude that SUSY scenarios with light gravitinos will lead to a striking monojet signal very quickly after its startup. △ Less", "We investigate the unification constraints in the minimal sypersymmetric grand unified theories based on SU(5) gauge symmetry. The most general constraints on the spectrum of minimal supersymmetric SU(5) and flipped SU(5) are shown. The upper bound on the mass of the colored Higgs mediating proton decay is discussed in detail in the context of the minimal supersymmetric SU(5). In the case of the minimal SUSY SU(5) we show that if we stick to the strongest bound on the colored triplet mass coming from dimension five proton decay contributions there is no hope to test this model at future nucleon decay experiments through the dimension six operators. We find a lower bound on the partial proton decay lifetime for all relevant channels in the context of flipped SUSY SU(5). We conclude that flipped SUSY SU(5) might be in trouble if proton decay is found at the next generation of experiments with a lifetime below 10^{37} years. △ Less", "Finding a plausible origin for right-handed neutrino Majorana masses in semirealistic compactifications of string theory remains one of the most difficult problems in string phenomenology. We argue that right-handed neutrino Majorana masses are induced by non-perturbative instanton effects in certain classes of string compactifications in which the $U(1)_{B-L}$ gauge boson has a Stückelberg mass. The induced operators are of the form $e^{-U}ν_Rν_R$ where $U$ is a closed string modulus whose imaginary part transforms appropriately under $B-L$. This mass term may be quite large since this is not a gauge instanton and $Re U$ is not directly related to SM gauge couplings. Thus the size of the induced right-handed neutrino masses could be a few orders of magnitude below the string scale, as phenomenologically required. It is also argued that this origin for neutrino masses would predict the existence of R-parity in SUSY versions of the SM. Finally we comment on other phenomenological applications of similar instanton effects, like the generation of a $μ$-term, or of Yukawa couplings forbidden in perturbation theory. △ Less", "We derive and present expressions for the kinematic endpoints that arise in the invariant mass distributions of visible decay products of cascade decays featuring a two body decay followed by a three body decay. This is an extension of a current technique that addresses chains of successive two body decays. We then apply these to a supergravity model with Non-Universal Higgs Masses (NUHM), having simulated a data set using the ATLFAST detector simulation. We find that, should such a model be chosen by nature, the endpoints will be visible in ATLAS data, and we discuss the problems associated with mass reconstruction in models with a similar phenomenology. △ Less", "We conduct a detailed analysis of the phenomenology of two predictive see-saw scenarios leading to Quark-Lepton Complementarity. In both cases we discuss the neutrino mixing observables and their correlations, neutrinoless double beta decay and lepton flavor violating decays such as mu -> e gamma. We also comment on leptogenesis. The first scenario is disfavored on the level of one to two standard deviations, in particular due to its prediction for U_{e3}. There can be resonant leptogenesis with quasi-degenerate heavy and light neutrinos, which would imply sizable cancellations in neutrinoless double beta decay. The decays mu -> e gamma and tau -> mu gamma are typically observable unless the SUSY masses approach the TeV scale. In the second scenario leptogenesis is impossible. It is however in perfect agreement with all oscillation data. The prediction for mu -> e gamma is in general too large, unless the SUSY masses are in the range of several TeV. In this case tau -> e gamma and tau -> mu gamma are unobservable. △ Less", "We discuss the results of a global $χ^2$ analysis of a simple SO(10) SUSY GUT with $D_3$ family symmetry and low energy R parity. The model describes fermion mass matrices with 14 parameters and gives excellent fits to 20 observable masses and mixing angles in both quark and lepton sectors, giving 6 predictions. Bi-large neutrino mixing is obtained with hierarchical quark and lepton Yukawa matrices; thus avoiding the possibility of large lepton flavor violation. The model naturally predicts small 1-3 neutrino mixing, with $\\sin θ_{13} \\simeq 0.05 - 0.06$. In this paper we evaluate the predictions for the lepton flavor violating processes, $μ\\to e γ$, $τ\\to μγ$ and $τ\\to e γ$ and also the electric dipole moment of the electron, $d_e$, muon and tau, assuming universal squark and slepton masses, $m_{16}$, and a universal soft SUSY breaking A parameter, $A_0$, at the GUT scale. We find $Br(μ\\to e γ)$ is naturally below present bounds, but may be observable by MEG. Similarly, $d_e$ is below present bounds; but is within the range of future experiments. We also give predictions for the light Higgs mass (using FeynHiggs). We find an upper bound given by $m_h \\leq 127$ GeV, with an estimated $\\pm 3$ GeV theoretical uncertainty. Finally we present predictions for SUSY particle masses in the favored region of parameter space. △ Less", "We consider Lorentz violation in supersymmetric extensions of the standard model. We perform a spurion analysis to show that, in the simplest natural constructions, the resulting supersymmetry-breaking masses are tiny. In the process, we argue that one of the strongest bounds on Lorentz violation in the photon Lagrangian, which comes from the absence of birefringence from distant astrophysical sources, does not apply when Lorentz violation is parametrized by a single vector. △ Less", "We investigate the conditions for a QCD axion to coexist with stabilised moduli in string compactifications. We show how the simplest approaches to moduli stabilisation give unacceptably large masses to the axions. We observe that solving the F-term equations is insufficient for realistic moduli stabilisation and give a no-go theorem on supersymmetric moduli stabilisation with unfixed axions applicable to all string compactifications and relevant to much current work. We demonstrate how nonsupersymmetric moduli stabilisation with unfixed axions can be realised. We finally outline how to stabilise the moduli such that f_a is within the allowed window 10^9 GeV < f_a < 10^{12} GeV, with f_a ~ \\sqrt{M_{SUSY} M_P}. △ Less", "The light top-squark $\\sto$ may be the lightest squark and its lifetime may be `long enough' in a kind of SUSY models which have not been ruled out yet experimentally, so colorless `supersymmetric hadrons (superhadrons)' $(\\sto \\bar{q})$ ($q$ is a quark except $t$-quark) may be formed as long as the light top-squark $\\sto$ can be produced. Fragmentation function of $\\sto$ to heavy `supersymmetric hadrons (superhadrons)' $(\\sto \\bar{Q})$ ($\\bar{Q}=\\bar{c}$ or $\\bar{b}$) and the hadronic production of the superhadrons are investigated quantitatively. The fragmentation function is calculated precisely. Due to the difference in spin of the SUSY component, the asymptotic behavior of the fragmentation function is different from those of the existent ones. The fragmentation function is also applied to compute the production of heavy superhadrons at hadronic colliders Tevatron and LHC under the so-called fragmentation approach. The resultant cross-section for the heavy superhadrons is too small to observe at Tevatron, but great enough at LHC, even when all the relevant parameters in the SUSY models are taken within the favored region for the heavy superhadrons. The production of `light superhadrons' $(\\sto \\bar{q})$ ($q=u, d, s$) is also roughly estimated. It is pointed out that the production cross-sections of the light superhadrons $(\\sto \\bar{q})$ may be much greater than those of the heavy superhadrons, so that even at Tevatron the light superhadrons may be produced in great quantities. △ Less", "We present a complete calculation of weak boson fusion production of colorless supersymmetric particles at the LHC, using the new matrix element generator SUSY-MadGraph. The cross sections are small, generally at the attobarn level, with a few notable exceptions which might provide additional supersymmetric parameter measurements. We discuss in detail how to consistently define supersymmetric weak couplings to preserve unitarity of weak gauge boson scattering amplitudes to fermions, and derive sum rules for weak supersymmetric couplings. △ Less", "A broad overview of the current status of proton stability in unified models of particle interactions is given which includes non - supersymmetric unification, SUSY and SUGRA unified models, unification based on extra dimensions, and string-M-theory models. The extra dimensional unification includes 5D and 6D and universal extra dimensional (UED) models, and models based on warped geometry. Proton stability in a wide array of string theory and M theory models is reviewed. These include Calabi-Yau models, grand unified models with Kac-Moody levels $k>1$, a new class of heterotic string models, models based on intersecting D branes, and string landscape models. The destabilizing effect of quantum gravity on the proton is discussed. The possibility of testing grand unified models, models based on extra dimensions and string-M-theory models via their distinctive modes is investigated. The proposed next generation proton decay experiments, HyperK, UNO, MEMPHYS, ICARUS, LANNDD (DUSEL), and LENA would shed significant light on the nature of unification complementary to the physics at the LHC. Mathematical tools for the computation of proton lifetime are given in the appendices. Prospects for the future are discussed. △ Less", "Flavour changing effects originating from the exchange of scalar particles in the processes e^+ e^- -> H b \\bar{s}, H \\bar{b} s, with H = h^0, H^0, A^0, are investigated in the Minimal Supersymmetric Standard Model with non-minimal flavour violation at the one-loop level. The dominating SUSY-QCD contributions with squark--gluino loops are calculated and discussed. We consider the SUSY scenario with non-minimal flavour mixing in the down-type squark-mass matrix. The flavour-changing cross sections are derived, and we discuss the dependence on the MSSM parameters and the strength of flavour mixing. The values for the cross section can reach 10^{-4} pb for the production of the heavy Higgs boson H^0 or A^0, and only 10^{-7} pb for the light Higgs boson h^0. Non-decoupling behaviour occurs for both h^0, H^0 production in the case of a common heavy SUSY mass scale. △ Less", "It is proposed that supersymmetry (SUSY) maybe used to understand fermion mass hierarchies. A family symmetry Z_{3L} is introduced, which is the cyclic symmetry among the three generation SU(2) doublets. SUSY breaks at a high energy scale ~ 10^{11} GeV. The electroweak energy scale ~ 100 GeV is unnaturally small. No additional global symmetry, like the R-parity, is imposed. The Yukawa couplings and R-parity violating couplings all take their natural values which are about (10^0-10^{-2}). Under the family symmetry, only the third generation charged fermions get their masses. This family symmetry is broken in the soft SUSY breaking terms which result in a hierarchical pattern of the fermion masses. It turns out that for the charged leptons, the tau mass is from the Higgs vacuum expectation value (VEV) and the sneutrino VEVs, the muon mass is due to the sneutrino VEVs, and the electron gains its mass due to both Z_{3L} and SUSY breaking. The large neutrino mixing are produced with neutralinos playing the partial role of right-handed neutrinos. |V_{e3}| which is for nu_e-nu_{tau} mixing is expected to be about 0.1. For the quarks, the third generation masses are from the Higgs VEVs, the second generation masses are from quantum corrections, and the down quark mass due to the sneutrino VEVs. It explains m_c/m_s, m_s/m_e, m_d > m_u and so on. Other aspects of the model are discussed. △ Less", "An interesting alternative to supersymmetry (SUSY) for extending physics beyond the Standard Model is a model with universal extra dimensions (UED), in which the SUSY superpartners are replaced by Kaluza-Klein excitations of the Standard Model particles. If new particles are discovered at the LHC, even if their mass spectrum favours SUSY or UED, it will be vital to distinguish between their spin assignments in the two models as far as possible. We extend the method proposed by Barr [hep-ph/0405052] to the UED case and investigate the angular and charge asymmetries of decay distributions for sample mass spectra of both SUSY and UED types. For hierarchical (`SUSY-type') mass spectra there is a good chance of distinguishing the spin structures of the two models. However, a mass spectrum of the quasi-degenerate type expected in UED would make it difficult to observe spin correlations. △ Less", "If N=2 supersymmetry breaks to N=1 supersymmetry at an intermediate scale $m_2$ and then, later on, N=1 supersymmetry breaks and produces standard model at a scale $m_{susy}$ such that $m_2 > m_{susy}$, renormalization group evolution of three gauge couplings are altered above the scale $m_2$, changing the unification scale and the unified coupling. We show that when we enforce this general condition $m_2 > m_{susy}$ on the solutions of the renormalization group equations, the condition is translated into an upper bound on the scale $m_{susy}$. Using presently favored values of $α_1(m_z),α_2(m_z),α_3(m_z)$, we get $m_{susy} < 4.5 \\times 10^9$ GeVs for the central value of $α_3(m_Z)$. When low energy threshold effect is present, this bound gets smeared yet remains generally stable in the $10^9-10^{10}$ GeV range. We also show that if we demand string unification instead of having an unified gauge theory, this constraint can be changed by exotic hypercharge normalizations. △ Less"]