["We review recent developments in theoretical models for neutrino masses and mixing. Emphases are given to models based on finite group family symmetries. In particular, we describe one recent model based on SU(5), in which both the tri-bimaximal neutrino mixing and realistic CKM matrix are generated. We also discuss two models based on a non-anomalous U(1)_F family symmetry in which the gauge anomalies are cancelled due to the presence of the right-handed neutrinos. In one of these models, the seesaw scale can be as low as a TeV; in the other model, which is based on SUSY SU(5), the U(1)_F symmetry forbids Higgs-mediated proton decays. △ Less", "The top-pair production in association with a $Z^0$-boson at a photon-photon collider is an important process in probing the coupling between top-quarks and vector boson and discovering the signature of possible new physics. We describe the impact of the complete supersymmetric QCD(SQCD) next-to-leading order(NLO) radiative corrections on this process at a polarized or unpolarized photon collider, and make a comparison between the effects of the SQCD and the standard model(SM) QCD. We investigate the dependence of the lowest-order(LO) and QCD NLO corrected cross sections in both the SM and minimal supersymmetric standard model(MSSM) on colliding energy $\\sqrt{s}$ in different polarized photon collision modes. The LO, SM NLO and SQCD NLO corrected distributions of the invariant mass of $t\\bar t$-pair and the transverse momenta of final $Z^0$-boson are presented. Our numerical results show that the pure SQCD effects in \\ggttz process can be more significant in the $+ +$ polarized photon collision mode than in other collision modes, and the relative SQCD radiative correction in unpolarized photon collision mode varies from 32.09% to $-1.89 %$ when $\\sqrt{s}$ goes up from $500 GeV$ to $1.5 TeV$. △ Less", "Recently, conceptually new physics beyond the Standard Model has been proposed by Georgi, where a new physics sector becomes conformal and provides \"unparticle\" which couples to the Standard Model sector through higher dimensional operators in low energy effective theory. Among several possibilities, we focus on operators involving the (scalar) unparticle, Higgs and the gauge bosons. Once the Higgs develops the vacuum expectation value (VEV), the conformal symmetry is broken and as a result, the mixing between the unparticle and the Higgs boson emerges. In this paper, we consider the unparticle as a hidden sector of supersymmetry (SUSY) breaking, and give some phenomenological consequences of this scenario. The result shows that there is a possibility for the unparticle as a hidden sector in SUSY breaking sector, and can provide a solution to the mu problem in SUSY models. △ Less", "The Standard Model predictions for the hadronic and leptonic electric dipole moments (EDMs) are well far from the present experimental resolutions, thus, the EDMs represent very clean probes of New Physics effects. Especially, within supersymmetric frameworks with flavor-violating soft terms large and potentially visible effects to the EDMs are typically expected. In this work, we systematically evaluate the predictions for the EDMs at the beyond-leading-order (BLO). In fact, we show that BLO contributions to the EDMs dominate over the leading-order (LO) effects in large regions of the supersymmetric parameter space. Hence, their inclusion in the evaluation of the EDMs is unavoidable. As an example, we show the relevance of BLO effects to the EDMs for a SUSY $SU(5)$ model with right-handed neutrinos. △ Less", "We study a new signature of lepton flavor violation (LFV) at the Photon Collider (PC) within Supersymmetric (SUSY) theories. We consider the minimal supersymmetric standard model within a large $\\tanβ$ scenario with all superpartner masses in the ${\\cal O}$(TeV) while the heavy Higgs bosons masses lie below the TeV and develop sizable loop induced LFV couplings to the leptons. We consider a photon collider based on an $e^+e^-$ linear collider with $\\sqrt{s}=800$ GeV with the parameters of the TESLA proposal and show that, with the expected integrated $γγ$-luminosity $L_{γγ}=200÷500$ fb$^{-1}$, the \"$μτ$ fusion\" mechanism is the dominant channel for the process $\\gaga\\toμτb\\bar{b}$ providing detailed analytical and numerical studies of the signal and backgrounds. We impose on the parameter space present direct and indirect constraints from $B$ physics and rare LFV $τ$-decays and find that the LFV signal can be probed for masses of the heavy neutral Higgs bosons $A,H$ from 300 GeV up to the kinematical limit $\\simeq 600$ GeV for 30$\\leq\\tanβ\\leq$60. △ Less", "Supersymmetric models with t-b-τYukawa unification at M_{GUT} qualitatively predict a sparticle mass spectrum including first and second generation scalars at the 3--15 TeV scale, third generation scalars at the (few) TeV scale and gluinos in the sub-TeV range. The neutralino relic density in these models typically turns out to lie far above the measured dark matter abundance, prompting the suggestion that instead dark matter is composed of an axion/axino mixture. We explore the axion and thermal and non-thermal axino dark matter abundance in Yukawa-unified SUSY models. We find in this scenario that {\\it i}). rather large values of Peccei-Quinn symmetry breaking scale f_a\\sim 10^{12} GeV are favored and {\\it ii}). rather large values of GUT scale scalar masses \\sim 10-15 TeV allow for the re-heat temperature T_R of the universe to be T_R\\agt 10^6 GeV. This allows in turn a solution to the gravitino/Big Bang Nucleosynthesis problem while also allowing for baryogenesis via non-thermal leptogenesis. The large scalar masses for Yukawa-unified models are also favored by data on b\\to sγand B_s\\to μ^+μ^- decay. Testable consequences from this scenario include a variety of robust LHC signatures, a possible axion detection at axion search experiments, but null results from direct and indirect WIMP search experiments. △ Less", "In this paper we review our main results for Lepton Flavour Violating (LFV) semileptonic tau decays and muon-electron conversion in nuclei within the context of two Constrained SUSY-Seesaw Models, the CMSSM and the NUHM. The relevant spectrum is that of the Minimal Supersymmetric Standard Model extended by three right handed neutrinos, $ν_{R_i}$ and their corresponding SUSY partners, ${\\tilde ν}_{R_i}$, ($i=1,2,3$). We use the seesaw mechanism for neutrino mass generation and choose a parameterisation of this mechanism that allows us to incorporate the neutrino data in our analysis of LFV processes. In addition to the full one-loop results for the rates of these processes, we will also review the set of simple formulas, valid at large $\\tan β$, which are very useful to compare with present experimental bounds. The sensitivity to SUSY and Higgs sectors in these processes will also be discussed. This is a very short summary of the works in Refs. \\cite{Arganda:2008jj} and \\cite{Arganda:2007jw} to which we refer the reader for more details. △ Less", "We extend a model of the Dirac gauginos, which originate from N=2 supersymmetry (SUSY) for the gauge sector, such that the N=2 SUSY is imposed also to the sfermion sector but only for the 3rd generation squarks and sleptons. In addition to the N=2 supersymmetry, our model is constructed based on the SU(3)c times SU(3)L times U(1)' gauge symmetry. By this extension, the dominant source of radiative correction to the Higgs mass squared coming from the stop loop becomes controllable based on the enhanced symmetry. Then it becomes a viable model which provides a solution to the little hierarchy problem in SUSY models. Even in the original scenario, the Dirac gauginos can be superheavy, of order 10 TeV or so, while keeping the scalar masses at the weak scale. This possibility is phenomenologically interesting because it can suppress the unwanted flavor changing processes. And in scope of the LHC, this scenario can have a very distinct signature related to the exotic sfermions which are accompanied as the N=2 superpartners as well as the Dirac gauginos. △ Less", "Gravity-mediated SUSY breaking models with R-parity conservation give rise to dark matter in the universe. I review neutralino dark matter in the minimal supergravity model (mSUGRA), models with non-universal soft SUSY breaking terms (NUSUGRA) which yield a well-tempered neutralino, and models with unified Yukawa couplings at the GUT scale (as may occur in an SO(10) SUSY GUT theory). These latter models have difficulty accommodating neutralino dark matter, but work very well if the dark matter particles are axions and axinos. △ Less", "In this talk we will discuss how inflation can be embedded within a minimal extension of the Standard Model where the inflaton carries the Standard Model charges. There is no need of an ad-hoc scalar field to be introduced in order to explain the temperature anisotropy of the cosmic microwave background radiation, all the ingredients are present within a minimal supersymmetric Standard Model. For the first time inflaton properties can be directly linked to the particle phenomenology, dark matter, and the baryons of the Standard Model. △ Less", "We explore the physics of the general CP-conserving MSSM with Minimal Flavor Violation, the pMSSM. The 19 soft SUSY breaking parameters are chosen so to satisfy all existing experimental and theoretical constraints assuming that the WIMP is the lightest neutralino. We scan this parameter space twice using both flat and log priors and compare the results which yield similar conclusions. Constraints from both LEP and the Tevatron play an important role in obtaining our final model samples. Implications for future TeV-scale $e^+e^-$ linear colliders(LC) are discussed. △ Less", "We review the analysis of the 5 sigma discovery contours for the charged MSSM Higgs boson at the CMS experiment with 30 fb^-1 for the two cases M_H+ < m_t and M_H+ > m_t. Latest results for the CMS experimental sensitivities based on full simulation studies are combined with state-of-the-art theoretical predictions of MSSM Higgs-boson production and decay properties. Special focus is put on the SUSY parameter dependence of the 5 sigma contours. The variation of mu can shift the prospective discovery reach in tan_beta by up to Delta tan_beta = 40. We furthermore discuss various theory uncertainties on the signal cross section and branching ratio calculations. In order to arrive at a reliable interpretation of a signal of the charged MSSM Higgs boson at the LHC a strong reduction in the relevant theory uncertainties will be necessary. △ Less", "Searches for physics beyond the Standard Model of particle physics are about to enter a new era with the startup of the Large Hadron Collider (LHC) at CERN. Prospects for R-parity conserving supersymmetry discovery and measurements with the ATLAS detector at the LHC are presented. Methods for determining the parameters of the underlying supersymmetry model and the relation to dark matter estimation are discussed. △ Less", "We reexamine the constrained version of the Next-to-Minimal Supersymmetric Standard Model with semi universal parameters at the GUT scale (CNMSSM). We include constraints from collider searches for Higgs and SUSY particles, upper bound on the relic density of dark matter, measurements of the muon anomalous magnetic moment and of B-physics observables as well as direct searches for dark matter. We then study the prospects for direct detection of dark matter in large scale detectors and comment on the prospects for discovery of heavy Higgs states at the LHC. △ Less", "The defining feature of scalar sequestering is that the MSSM squark and slepton masses as well as all entries of the scalar Higgs mass matrix vanish at some high scale. This ultraviolet boundary condition - scalar masses vanish while gaugino and Higgsino masses are unsuppressed - is independent of the supersymmetry breaking mediation mechanism. It is the result of renormalization group scaling from approximately conformal strong dynamics in the hidden sector. We review the mechanism of scalar sequestering and prove that the same dynamics which suppresses scalar soft masses and the B_mu term also drives the Higgs soft masses to -|mu|^2. Thus the supersymmetric contribution to the Higgs mass matrix from the mu-term is exactly canceled by the soft masses. Scalar sequestering has two tell-tale predictions for the superpartner spectrum in addition to the usual gaugino mediation predictions: Higgsinos are much heavier (mu > TeV) than scalar Higgses (m_A ~ few hundred GeV), and third generation scalar masses are enhanced because of new positive contributions from Higgs loops. △ Less", "We analyse the possibility to get light long-lived charginos within the framework of the MSSM with gravity mediated SUSY breaking. We find out that this possibility can be realized in the so-called focus-point region of parameter space. The mass degeneracy of higgsino-like chargino and two higgsino-like neutralinos is the necessary condition for a long lifetime. It requires the fine-tuning of parameters, but being a single additional constraint in the whole parameter space it can be fulfilled in the Constrained MSSM along the border line where radiative electroweak symmetry breaking fails. In a narrow band close to the border line the charginos are long-lived particles. The cross-sections of their production and co-production at the LHC via electroweak interaction reach a few tenth of pb. △ Less", "In the Minimal Supersymmetric Standard Model (MSSM), there are numerous sources of flavour-violation in addition to the usual Kobayashi-Maskawa mixing matrix of the Standard Model. We reexamine the renormalisation group equations (RGEs) with a view to investigating flavour effects in a supersymmetric theory with an arbitrary flavour structure at some high scale. To incorporate (two-loop sized) threshold effects in the one-loop RGEs, we calculate the beta-functions using a sequence of (non-supersymmetric) effective theories with heavy particles decoupled at the scale of their mass, keeping track of the fact that many couplings (such as gauge and gaugino couplings) which are equal in an exact supersymmetric theory may no longer be equal once the supersymmetry (SUSY) is broken. We find that this splitting, which is ignored in the literature, may be larger than two-loop terms that are included. In addition, gaugino couplings develop flavour structure that is absent without including decoupling effects. A program (to be incorporated into ISAJET) has been developed, which includes flavour-violating couplings of superparticles and solves the two-loop threshold RGEs subject to specified high scale inputs. The weak scale flavour structure derived in this way can be applied to the study of flavour-changing decays of SUSY particles. As an illustration, we revisit the branching ratio of the flavour-violating decay of the top squark. We find that, in the minimal supergravity (mSUGRA) class of models, previous estimates for the width of this decay have been too large by a factor 10-25. We also analyse the consequences of introducing non-universality in the high scale soft SUSY-breaking mass matrices and find that under these conditions the partial width can be altered by a large amount. △ Less", "We describe the computation of the $\\mathcal{O}(α^3)$ corrections for single top (and single anti-top) production in the $t$-channel at hadron colliders. We show also The genuine one loop SUSY contribution to these processes. Such contributions are generally quite modest in the mSUGRA scenario. The experimental observables would therefore only practically depend, in this framework, on the CKM $Wtb$ coupling. △ Less", "The calculation of the cosmological relic density of the dark matter candidate within supersymmetric models is an interesting possibility to obtain additional constraints on the supersymmetric parameter space with respect to collider, electroweak precision, and low-energy data. Considering future cosmological precision measurements, radiative corrections can play an important role in the analysis. We present full QCD and SUSY-QCD corrections to neutralino pair annihilation into quark-antiquark pairs and analyze their impact on the neutralino annihilation cross section and the relic density. By comparing to the relic density obtained from a pure leading order calculation, we show that the corrections strongly influence the extraction of SUSY mass parameters from cosmological data. △ Less", "We study the duality cascade of softly broken supersymmetric theories. We investigate the renormalization group (RG) flow of SUSY breaking terms as well as supersymmetric couplings. It is found that the magnitudes of SUSY breaking terms are suppressed in most regimes of the RG flow through the duality cascade. At one stage of cascading, the gaugino mass of the strongly coupled sector and scalar masses converge to certain values, which are determined by the gauge coupling and the gaugino mass of the weakly coupled sector. At the next stage, the strongly and weakly coupled sectors are interchanged with each other. We also show the possibility that cascading would be terminated by the gauge symmetry breaking, which is induced by the so-called B-term. △ Less", "The possibility that supersymmetry (SUSY) could be broken in a metastable vacuum has recently attracted renewed interest. In these proceedings we will argue that metastability is an attractive and testable scenario. The recent developments were triggered by the presentation of a simple and calculable model of metastable SUSY breaking by Intriligator, Seiberg and Shih (ISS), which we will briefly review. One of the main questions raised by metastability is, why did the universe end up in this vacuum. Using the ISS model as an example we will argue that in a large class of models the universe is automatically driven into the metastable state during the early hot phase and gets trapped there. This makes metastability a natural option from the cosmological point of view. However, it may be more than that. The phenomenologically required gaugino masses require the breaking of R-symmetry. However, in scenarios with a low supersymmetry breaking scale, e.g., gauge mediation a powerful theorem due to Nelson and Seiberg places this at odds with supersymmetry breaking in a truely stable state and metstability becomes (nearly) inevitable. Turning around one can now experimentally test whether gauge mediation is realised in nature thereby automatically testing the possibility of a metastability of the vacuum. Indeed, already the LHC may give us crucial information about the stability of the vacuum. △ Less", "Several supersymmetric models with extended gauge structures predict light doubly-charged Higgsinos. Their distinctive signature at the large hadron collider is highlighted by studying their production and decay characteristics. △ Less", "We consider tan(beta)-enhanced quantum effects in the minimal supersymmetric standard model (MSSM) including those from the Higgs sector. To this end, we match the MSSM to an effective two-Higgs doublet model (2HDM), assuming that all SUSY particles are heavy, and calculate the coefficients of the operators that vanish or are suppressed in the MSSM at tree-level. Our result clarifies the dependence of the large-tan(beta) resummation on the renormalization convention for tan(beta), and provides analytic expressions for the Yukawa and trilinear Higgs interactions. The numerical effect is analyzed by means of a parameter scan, and we find that the Higgs-sector effects, where present, are typically larger than those from the \"wrong-Higgs\" Yukawa couplings in the 2HDM. △ Less", "New studies of the ATLAS and CMS collaborations are presented on the sensitivity to searches for non-standard signatures of particular SUSY scenarios. These signatures include non-pointing photons, as well as pairs of prompt photons, as expected in GMSB SUSY models, as well as heavy stable charged particles produced in split supersymmetry models, long lived staus from GMSB SUSY and long lived stops in other SUSY scenarios. A detailed detector simulation is used for the study, and all relevant Standard Model backgrounds and detector effects that can mimic these special signatures are included. It is shown that already with less than 100 pb$^{-1}$ the ATLAS and CMS sensitivity will probe an interesting as yet by data unexplored parameter range of these models. △ Less", "We present a MSSM study of the b -> s gamma decay in a Minimal Flavor Violating (MFV) framework, where the form of the soft SUSY breaking terms is determined by the Standard Model Yukawa couplings. In particular, we address the role of gluino contributions, which are set to zero in most studies of the MFV MSSM. Gluino contributions can play an important role in the MFV MSSM whenever mu * tan(beta) is large. In fact, similarly to chargino contributions, gluino contributions are tan(beta) enhanced and can easily dominate charged Higgs contributions for large values of tan(beta). Even though each of the separate contributions to b -> s gamma can be sizeable by itself, surprisingly no absolute lower bound can be placed on any of the relevant SUSY masses, since patterns of partial cancellations among the three competing contributions (Higgs, chargino and gluino) can occur throughout the MSSM parameter space. △ Less", "We update cosmological bound on axion model. The contribution from the anharmonic effect and the newly introduced initial overshoot correction are considered. We present an explicit formula for the axion relic density in terms of the QCD scale Lambda_{QCD}, the current quark masses m_q's and the Peccei-Quinn scale F_a, including firstly introduced 1.85 factor which is from the initial overshoot. △ Less", "The discovery of the Standard Model (SM) or supersymmetric (SUSY) Higgs bosons belongs to the main endeavors of the Large Hadron Collider (LHC). In this article the status of the signal and background calculations for Higgs boson production at the LHC is reviewed. △ Less", "Presented are the complete NLO electroweak contributions to the production of diagonal squark--anti-squark pairs at the LHC. We discuss their effects for the production of squarks of the first two generations, in different SUSY scenarios. △ Less", "We consider the production of squarks and gluinos at hadronic colliders. An overview over the class of processes is given. We investigate in detail the tree-level and higher order EW contributions to the cross sections. Special care has to be taken to obtain infrared finite observables. We study numerically stop--anti-stop and squark--gluino production at the LHC. △ Less", "The Zbb coupling determined from the Z-pole measurements at LEP/SLD shows an about 3-sigma deviation from the SM prediction, which would signal the presence of new physics in association with the Zbb coupling. In this work we give a comprehensive study for the full one-loop supersymmetric effects on the Zbb coupling in both the MSSM and the NMSSM by considering all current constraints which are from the precision electroweak measurements, the direct search for sparticles and Higgs bosons, the stability of Higgs potential, the dark matter relic density, and the muon g-2 measurement. We analyze the characters of each type of the corrections and search for the SUSY parameter regions where the corrections could be sizable. We find that the sizable corrections may come from the Higgs sector with light m_A and large tan-beta, which can reach -2% and -6% for rho_b and sin^2 θ_{eff}^b,respectively. However, such sizable negative corrections are just opposite to what needed to solve the anomaly. We also scan over the allowed parameter space and investigate to what extent supersymmetry can narrow the discrepancy. We find that under all current constraints, the supersymmetric effects are quite restrained and cannot significantly ameliorate the anomaly of Zbb coupling. Compared with χ^2/dof = 9.62/2 in the SM, the MSSM and NMSSM can only improve it to χ^2/dof = 8.77/2 in the allowed parameter space. Therefore, if the anomaly of Zbb coupling is not a statistical or systematic problem, it would suggest new physics beyond the MSSM or NMSSM. △ Less", "A new theory of WIMP Dark Matter has been proposed, motivated directly by striking Data from the PAMELA and ATIC collaborations. The WIMP is taken to be charged under a hidden gauge symmetry G_Dark, broken near the GeV scale; this also provides the necessary ingredients for the \"exciting\" and \"inelastic\" Dark Matter interpretations of the INTEGRAL and DAMA signals. In this short note we point out the consequences of the most straightforward embedding of this simple picture within low-energy SUSY, in which G_Dark breaking at the GeV scale arises naturally through radiative corrections, or Planck-suppressed operators. The theory predicts major additions to SUSY signals at the LHC. A completely generic prediction is that G_Dark particles can be produced in cascade decays of MSSM superpartners, since these end with pairs of MSSM LSP's that in turn decay into the true LSP and other particles in the dark sector. In turn, the lightest GeV-scale dark Higgses and gauge bosons eventually decay back into light SM states, and dominantly into leptons. Therefore, a large fraction of all SUSY events will contain at least two ``lepton jets'': collections of n>= 2 leptons, with small angular separations and GeV scale invariant masses. Furthermore, if the Dark Matter sector is directly charged under the Standard Model, the success of gauge coupling unification implies the presence of new long-lived colored particles that can be copiously produced at the LHC. △ Less", "After a short overview of the hypothesis of Yukawa unification within SUSY GUTs, I detail on the general conditions for its phenomenological viability, emphasizing the decisive role played by observables in the flavor sector. △ Less", "From the string partition function, we discuss the mass-shell and GSO projection conditions valid for Kaluza-Klein (KK) as well as massless states in the heterotic string theory compactified on a nonprime orbifold. Based on the obtained conditions we construct a 4D string standard model, which is embedded in a 6D SUSY GUT by including KK states above the compactification scale. We discuss the stringy threshold corrections to gauge couplings, including the Wilson line effects. △ Less", "Here we review the main results of LFV in the semileptonic tau decays $τ\\to μPP$ ($PP = π^+ π^-, π^0 π^0, K^+ K^-, K^0 \\bar{K}^0$), $τ\\to μP$ ($P = π, η, η^{\\prime}$), and $τ\\to μV$ ($V = ρ, φ$) as well as in $μ-e$ conversion in nuclei within SUSY-seesaw scenarios, and compare our predictions with the present experimental bounds △ Less", "We calculate the predictions for lepton flavour violating (LFV) tau and muon decays, $l_j \\to l_i γ$, $l_j \\to 3 l_i$, $μ-e$ conversion in nuclei and LFV semileptonic tau decays $τ\\to μPP$ with $PP= π^+π^-, π^0π^0, K^+K^-, K^0 {\\bar K}^0$ $τ\\to μP$ with $P=π^0, η, η'$ and $τ\\to μV$ with $V = ρ^0, φ$, performing the hadronisation of quark bilinears within the chiral framework. We work within a SUSY-seesaw context where the particle content of the Minimal Supersymmetric Standard Model is extended by three right-handed neutrinos plus their corresponding SUSY partners, and where a seesaw mechanism for neutrino mass generation is implemented. Two different scenarios with either universal or non-universal soft supersymmetry breaking Higgs masses at the gauge coupling unification scale are considered. After comparing the predictions with present experimental bounds and future sensitivities, the most promising processes are particularly emphasised. △ Less", "It is well-known that in scenarios with direct gauge mediation of supersymmetry breaking the messenger fields significantly affect the running of Standard Model couplings and introduce Landau poles which are difficult to avoid. This appears to remove any possibility of a meaningful unification prediction and is often viewed as a strong argument against direct mediation. We propose two ways that Seiberg duality can circumvent this problem. In the first, which we call \"deflected-unification\", the SUSY-breaking hidden sector is a magnetic theory which undergoes a duality to an electric phase, with fewer elementary degrees of freedom coupled to the MSSM. This changes the beta-functions of the MSSM gauge couplings so as to push their Landau poles above the unification scale. We show that this scenario is realised for recently suggested models of gauge mediation based on a metastable SCQD-type hidden sector directly coupled to MSSM. The second possibility, which we call \"dual-unification\", begins with the observation that, if the mediating fields fall into complete SU(5) multiplets, then the MSSM+messengers exhibits a fake unification at unphysical values of the gauge couplings. We show that, in known examples of electric/magnetic duals, such a fake unification in the magnetic theory reflects a real unification in the electric theory. We therefore propose that the Standard Model could itself be a magnetic dual of some unknown electric theory in which the true unification takes place. This scenario maintains the unification prediction (and unification scale) even in the presence of Landau poles in the magnetic theory below the GUT scale. We further note that this dual realization of grand unification can explain why Nature appears to unify, but the proton does not decay. △ Less", "The origin and the implications of higher dimensional effective operators in 4-dimensional theories are discussed in non-supersymmetric and supersymmetric cases. Particular attention is paid to the role of general, derivative-dependent field redefinitions which one can employ to obtain a simpler form of the effective Lagrangian. An application is provided for the Minimal Supersymmetric Standard Model extended with dimension-five R-parity conserving operators, to identify the minimal irreducible set of such operators after supersymmetry breaking. Among the physical consequences of this set of operators are the presence of corrections to the MSSM Higgs sector and the generation of \"wrong\"-Higgs Yukawa couplings and fermion-fermion-scalar-scalar interactions. These couplings have implications for supersymmetry searches at the LHC. △ Less", "There is hope that the Large Hadron Collider (LHC) at CERN will tell us about the fate of supersymmetry at the TeVscale. Therefore we might try to identify our expectations for the discovery of SUSY, especially in the first years of operation of this machine. In this talk we shall concentrate on the simplest SUSY scheme: the MSSM with SUSY broken in a hidden sector mediated by interactions of gravitational strength (gravity-, modulus and mirage-mediation). Such a situation might be favoured in a large class of string inspired models. There is a good chance to identify such simple schemes by knowing the properties of the gaugino mass spectrum such as the gluino/neutralino mass ratios. △ Less", "For points in SUSY parameter space where the sneutrino is lighter than the lightest chargino and next-to-lightest neutralino, its direct mass determination from sneutrino pair production process at e+e- collider is impossible since it decays invisibly. In such a scenario the sneutrino can be discovered and its mass determined from measurements of two-body decays of charginos produced in pairs at the ILC. Using the event generator WHIZARD we study the prospects of measuring sneutrino properties in a realistic ILC environment. In our analysis we include beamstrahlung, initial state radiation, a complete account of reducible backgrounds from SM and SUSY processes, and a complete matrix-element calculation of the SUSY signal which encompasses all irreducible background and interference contributions. We also simulate photon induced background processes using exact matrix elements. Radiation effects and the cuts to reduce background strongly modify the edges of the lepton energy spectra from which the sneutrino and chargino mass are determined. We discuss possible approaches to measure the sneutrino mass with optimal precision. △ Less", "It has long been known that the broken supersymmetric (susy) phase of the singlet extended susy higgs model (SESHM) is at best metastable and the ground states of the model have vanishing vacuum energy and are exactly supersymmetric. If the SESHM is confirmed at the Large Hadron Collider (LHC), the numerical values of the parameters of the model have a bearing on key properties of the susy phase and might provide an estimate of the remaining time before a possible decay of our false vacuum. We provide some analysis of the model including a treatment of phases in the potential and soft higgs masses. △ Less", "We study the Higgs sector of supersymmetric models containing two Higgs doublets with a light MSSM-like CP odd Higgs, $m_A \\lesssim 10$ GeV, and $\\tan β\\lesssim 2.5$. In this scenario all Higgses resulting from two Higgs doublets: light and heavy CP even Higgses, $h$ and $H$, the CP odd Higgs, $A$, and the charged Higgs, $H^\\pm$, could have been produced at LEP or the Tevatron, but would have escaped detection because they decay in modes that have not been searched for or the experiments are not sensitive to. Especially $H \\to ZA$ and $H^\\pm \\to W^{\\pm \\star} A$ with $A \\to c \\bar c, τ^+ τ^-$ present an opportunity to discover some of the Higgses at LEP, the Tevatron and also at B factories. In addition, the $2.8 σ$ excess of the branching ratio $W \\to τν$ with respect to the other leptons measured at LEP correlates well with the existence of the charged Higgs with properties typical for this scenario. Dominant $τ$- and $c$-rich decay products of all Higgses require modified strategies for their discovery at the LHC. △ Less", "We summarize the predictions for the radiative decays l_j->l_i γwithin the context of the supersymmetric type II seesaw mechanism considering universal boundary conditions for the soft SUSY breaking terms. The dependence on the low-energy neutrino parameters is discussed and the deviations from the analytical results for large $\\tanβ$ analyzed. △ Less", "We perform a multichannel analysis in context of the Large Hadron Collider (LHC) for supersymmetric (SUSY) theories with high-scale non-universal gaugino masses arising from different non-singlet representations of SU(5) and SO(10) gauge groups in a SUSY-GUT scenario and non-universal scalar masses in form of squark-slepton non-universality, third family scalar non-universality and that arising due to SO(10) $D$-terms. We present the numerical predictions over a wide region of parameter space using event generator {\\tt Pythia}. Certain broad features emerge from the study which may be useful to identify these non-universal schemes and distinguish them from the minimal supergravity (mSUGRA) framework. △ Less", "We review the 5 sigma discovery contours for the charged MSSM Higgs boson at the CMS experiment with 30/fb for the two cases M_H+ < m_t and M_H+ > m_t. In order to analyze the search reach we combine the latest results for the CMS experimental sensitivities based on full simulation studies with state-of-the-art theoretical predictions of MSSM Higgs-boson production and decay properties. Special emphasis is put on the SUSY parameter dependence of the 5 sigma contours. The variation of $μ$ can shift the prospective discovery reach in tan_beta by up to Delta tan_beta = 40. △ Less", "Currently available experimental data from electroweak precision observables (EWPO), B-physics observables (BPO) and cosmological data can be combined to extract the preferred value of SUSY mass scales. We review recent results on the predictions of the masses of supersymmetric particles and the indirect determination of the lightest Higgs boson mass. Special emphasis is put on models going beyond the Constrained Minimal Supersymmetric Standard Model (CMSSM), such as the Non-Universal Higgs Model type I (NUHM1), or gauge and anomaloy mediated SUSY breaking. △ Less", "Non-universal boundary conditions in grand unified theories can lead to non-universal gaugino masses at the unification scale. In R-parity preserving theories the lightest supersymmetric particle is a natural candidate for the dark matter. In this talk the composition of the lightest neutralino is studied, when nonuniversal gaugino masses come from representations of SO(10). In these cases, the thermal relic density compatible with WMAP observations is found. △ Less", "We report on the extrapolation of scalar mass parameters in the lepton sector to reconstruct SO(10) scenarios close to the unification scale. The method is demonstrated for an example in which SO(10) is broken directly to the Standard Model, based on the expected precision from coherent LHC and ILC collider analyses. In addition to the fundamental scalar mass parameters at the unification scale, the mass of the heaviest right-handed neutrino can be estimated in the seesaw scenario. △ Less", "We explore a mechanism of radiative B-L symmetry breaking in analogous to the radiative electroweak symmetry breaking. The breaking scale of B-L symmetry is related to the neutrino masses through the see-saw mechanism. Once we incorporate the U(1)(B-L) gauge symmetry in SUSY models, the U(1)(B-L) gaugino appears, and it can mediate the SUSY breaking (Z-prime mediated SUSY breaking) at around the scale of 10^6 GeV. Then we find a links between the neutrino mass (more precisly the see-saw or B-L scale of order 10^6 GeV) and the Z-prime mediated SUSY breaking scale. It is also very interesting that the gluino at the weak scale becomes relatively light, and almost compressed mass spectra for the gaugino sector can be realized in this scenario, which is very interesting in scope of the LHC. △ Less", "The impact of a kination-dominated phase generated by a quintessential exponential model on the thermal abundance of Supersymmetric (SUSY) extremely Weekly Interacting Massive Particles (e-WIMPs) is investigated. For values of the quintessential energy-density parameter on the eve of nucleosynthesis close to its upper bound, we find that: (i) the gravitino constraint is totally evaded for unstable gravitinos; (ii) the thermal abundance of stable gravitinos is not sufficient to account for the cold dark matter of the universe; (iii) the thermal abundance of axinos can satisfy the cold dark matter constraint for values of the initial (``reheating'') temperature well above those required in the standard cosmology. △ Less", "I review recent developments on the use of mT2 variables for SUSY parameter study, which might be useful for the data analysis in the early stage of the LHC experiments. I also review some of recent interesting studies. Talk in SUSY08. △ Less", "We point out another important production channel of a light pseudoscalar Higgs boson $a_1$ via the decays of neutralinos, including $\\widetildeχ_{2,3}^0 \\to \\widetildeχ_{1}^0 a_1$, in the framework of the NMSSM. We scan the whole parameter space using the most up-to-date version of NMHDECAY and search for regions where $B(\\widetildeχ_{2,3}^0 \\to \\widetildeχ_{1}^0 a_1) > 0.5$. If the gluino and squarks are light enough for copious production of SUSY events at the LHC, there would be numerous number of $\\widetildeχ_{2,3}^0$ in subsequent decays of gluinos and squarks. Therefore, the production rates of $a_1$ via neutralino decays would be more important than $h \\to a_1 a_1$ and others. Potentially, the final state is filled with many $τ$ leptons, which can be reconstructed at the mass of $a_1$. This is a clean, observable, and distinguishable signature for NMSSM. △ Less", "We review different constrained versions of the NMSSM: the fully constrained cNMSSM with universal boundary conditions for gauginos and all soft scalar masses and trilinear couplings, and the NMSSM with soft terms from Gauge Mediated Supersymmetry Breaking. Regarding the fully constrained cNMSSM, after imposing LEP constraints and the correct dark matter relic density, one single parameter is sufficient to describe the entire Higgs and sparticle spectrum of the model, which then contains always a singlino LSP. The NMSSM with soft terms from GMSB is phenomenologically viable if (and only if) the singlet is allowed to couple directly to the messenger sector; then various ranges in parameter space satisfy constraints from colliders and precision observables. Motivations for and phenomenological features of extra U(1)' gauge symmetries are briefly reviewed. △ Less", "The requirement of t-b-τYukawa coupling unification is common in simple grand unified models based on the gauge group SO(10), and it also places a severe constraint on the expected spectrum of superpartners. For Yukawa-unified models with μ>0, the spectrum is characterized by three mass scales: {\\it i}). first and second generation scalars in the multi-TeV range, {\\it ii}). third generation scalars, μand m_A in the few-TeV range and {\\it iii}). gluinos in the \\sim 350-500 GeV range with chargino masses around 100-160 GeV. In such a scenario, gluino pair production should occur at large rates at the CERN LHC, followed by gluino three-body decays into neutralinos or charginos. Discovery of Yukawa-unified SUSY at the LHC should hence be possible with only 1 fb^{-1} of integrated luminosity, by tagging multi-jet events with 2--3 isolated leptons, without relying on missing E_T. A characteristic dilepton mass edge should easily be apparent above Standard Model background. Combining dileptons with b-jets, along with the gluino pair production cross section information, should allow for gluino and neutralino mass reconstruction. A secondary corroborative signal should be visible at higher integrated luminosity in the W1Z2-> 3\\ell channel, and should exhibit the same dilepton mass edge as in the gluino cascade decay signal. △ Less", "We derive constraints on the mass insertion parameters from the recent measurements of B_s - B_s bar mixing, and discuss their implications on SUSY breaking mediation mechanisms and SUSY flavor models. Some SUSY flavor models are already excluded or disfavored by B_s - B_s bar mixing. We also discuss how to test the SM and SUSY models in the future experiments, by studying other CP violating observables related to b -> s transition, such as the time-dependent CP asymmetry in B -> phi K_S and the direct CP asymmetry in B -> X_s gamma. △ Less", "In SUSY models which violate R-parity, there exist trilinear lepton number violating (LNV) operators which can lead to neutrino masses. If these operators are defined at the unification scale, the renormalization group flow becomes important and generally leads to one neutrino mass much heavier than the others. We study, in a minimal supergravity (mSUGRA) set-up with two trilinear LNV operators and three charged lepton mixing angles, numerically how these parameters may be arranged to be compatible with neutrino oscillation data, and discuss some phenomenological observations. △ Less", "I propose implementing General Gauge Mediation using the class of $SU(N) \\times U(1)$ SUSY breaking models. As an existence proof, I have utilized the 4-1 model in building multi-parameter gauge mediation. These hidden sectors are relatively easy to use and avoid several model building pitfalls such as runaway directions. In addition models require no special tuning and may produce as many parameters as general gauge mediation allows. △ Less", "We investigate 5-dimensional supergravity on S^1/Z_2 with a physical Z_2-odd vector multiplet, which yields an additional modulus other than the radion. We find additional terms in the 4-dimensional effective theory that are peculiar to the multi moduli case. Such terms can make the soft masses are non-tachyonic and almost flavor-universal at tree-level, in contrast to the single modulus case. This provides a new possibility to solve the SUSY flavor problem. △ Less", "We present a very simple model of the radius stabilization in a supersymmetric (SUSY) Randall-Sundrum model with a hypermultiplet and a boundary constant superpotential. A wide range of parameters where the anomaly mediation of SUSY breaking is dominated is found although there are many problematic bulk effects of SUSY breaking. A negative cosmological constant in the radius stabilized vacuum can be cancelled by a localized SUSY breaking. Making use of this localized SUSY breaking also solves the μ-problem by Giudice-Masiero mechanism. △ Less", "We present an overview of the indirect constraints from flavor physics on supersymmetric models. During the past few years flavor data, and in particular b -> s gamma transitions, have been extensively used in order to constrain supersymmetric parameter spaces. We will briefly illustrate here the constraints obtained by a collection of low energy observables including FCNC transitions, rare decays, leptonic and semileptonic decays of B mesons, as well as leptonic decays of K mesons. The theoretical predictions can be obtained using the computer program SuperIso. △ Less", "We introduce a new dark matter candidate, the lightest U-parity particle (LUP). We suggest it as a good dark matter candidate especially in the R-parity violating supersymmetric model. △ Less", "The extraction of the parameters of the supersymmetric Lagrangian is discusse d. Particular emphasis is put on the rigorous treatment of experimental and theo retical errors. While the LHC can provide a valuable first estimate of the parameters, the combination of LHC and ILC will be nece ssary to determine with high precision the parameters of the MSSM. △ Less", "In grand unified theories (GUT), non-universal boundary conditions for the gaugino masses may arise at the unification scale, and affect the observability of the neutral MSSM Higgs bosons (h/H/A) at the LHC. The implications of such non-universal gaugino masses are investigated for the Higgs boson production in the SUSY cascade decay chain gluino --> squark quark, squark --> neutralino_2 quark, neutralino_2 --> neutralino_1 h/H/A, h/H/A --> b b-bar produced in pp interactions. In the singlet representation with universal gaugino masses only the light Higgs boson can be produced in this cascade with the parameter region of interest for us, while with non-universal gaugino masses heavy neutral MSSM Higgs boson production may dominate. The allowed parameter space in the light of the WMAP constraints on the cold dark matter relic density is investigated in the above scenarios for gaugino mass parameters. We also demonstrate that combination of representations can give the required amount of dark matter in any point of the parameter space. In the non-universal case we show that heavy Higgs bosons can be detected in the studied cascade in parameter regions with the WMAP preferred neutralino relic density. △ Less", "We show that supersymmetry and R-symmetry can be dynamically broken in a long-lived metastable vacuum of SQCD with massive and massless flavors. The vacuum results from a competition of a (leading) two-loop effect and small \"Planck\" suppressed higher-dimension operators. This mechanism provides a particularly simple realization of dynamical SUSY and R-symmetry breaking, and as such it is a good starting point for building phenomenologically viable models of gauge mediation. We take a preliminary step in this direction by constructing a complete model of minimal gauge mediation. Here we find that the parameters of the model are surprisingly constrained by the hidden sector. Similar mechanisms for creating long-lived states operate in a large class of models. △ Less", "The weak decays of $Λ_b \\to Λl^{+} l^{-}$ ($l=e, μ$) are investigated in Minimal Supersymmetric Standard Model (MSSM) and also in Supersymmetric (SUSY) SO(10) Grand Unified Models. In MSSM the special attention is paid to the Neutral Higgs Bosons (NHBs) as they make quite a large contribution in exclusive $B \\to X_{s} l^{+} l^{-}$ decays at large $\\tanβ$ regions of parameter space of SUSY models, since part of SUSY contributions is proportional to $\\tan^{3}β$. The analysis of decay rate, forward-backward asymmetries, lepton polarization asymmetries and the polarization asymmetries of $Λ$ baryon in $Λ_b \\to Λl^{+} l^{-}$ show that the values of these physical observables are greatly modified by the effects of NHBs. In SUSY SO(10) GUT model, the new physics contribution comes from the operators which are induced by the NHBs penguins and also from the operators having chirality opposite to that of the corresponding SM operators. SUSY SO(10) effects show up only in the decay $Λ_b \\to Λ+τ^{+} τ^{-}$ where the longitudinal and transverse lepton polarization asymmetries are deviate significantly from the SM value while the effects in the decay rate, forward-backward asymmetries and polarization asymmetries of final state $Λ$ baryon are very mild. The transverse lepton polarization asymmetry in $Λ_b \\to Λ+τ^{+} τ^{-}$ is almost zero in SM and in MSSM model. However, it can reach to -0.1 in SUSY SO(10) GUT model and could be seen at the future colliders; hence this asymmetry observable will provide us useful information to probe new physics and discriminate between different models. △ Less", "It is shown that LHC data can allow one to decode the mechanism by which dark matter is generated in the early universe in supersymmetric theories. We focus on two of the major mechanisms for such generation of dark matter which are known to be the Stau Coannihilation (Stau-Co) where the neutralino is typically Bino like and annihilation on the Hyperbolic Branch (HB) where the neutralino has a significant Higgsino component. An investigation of how one may discriminate between the Stau-Co region and the HB region using LHC data is given for the mSUGRA model. The analysis utilizes several signatures including multi leptons, hadronic jets, b-tagging, and missing transverse momentum. A study of the SUSY signatures reveals several correlated smoking gun signals allowing a clear discrimination between the Stau-Co and the HB regions where dark matter in the early universe can originate. △ Less", "We attempt to reconcile large trilinear R-parity violating interactions in a supersymmetric (SUSY) theory with the observed pattern of neutrino masses and mixing. We show that, with a restricted number of such interaction terms with the $λ'$-type couplings in the range (0.1-1.0), it is possible to forbid one-loop contributions to the neutrino mass matrix. This is illustrated with the help of a `working example' where an econnomic choice of SUSY parameters is made, with three non-vanishing and `large' R-parity violating terms in the superpotential. The two-loop contributions in such a case can not only generate the masses in the requisite order but can also lead us to specific allowed regions of the parameter space. △ Less", "We discuss the coupling of heavy moduli fields to light fields when the dynamics of the latter, absent such couplings, yields metastable vacua. We show that the survival of the vacuum structure of the local model depends nontrivially on the cross-couplings of the two sectors. In particular we find that for \"local\" models (such as those realized by D-branes in type II string theories) with metastable vacua breaking supersymmetry via F-terms, cross-coupling of the two sectors at an intermediate scale can push the metastable vacuum outside of the regime of the effective field theory. We parametrize the region in which the metastable vacua are safe. We the show that sufficiently small cross-couplings can be made natural. Finally, we briefly discuss the role of moduli in stringy realizations of \"retrofitted\" SUSY-breaking sectors. △ Less", "We present the two-loop SUSY-QCD corrections to the effective bottom Yukawa couplings within the minimal supersymmetric extension of the Standard Model. The effective Yukawa couplings include the resummation of the non-decoupling corrections Delta m_b for large values of tg(beta). We have derived the two-loop SUSY-QCD corrections to the leading SUSY-QCD and top-induced SUSY-electroweak contributions to Delta m_b. The scale dependence of the resummed Yukawa couplings is reduced from O(10%) to the per-cent level. These results reduce the theoretical uncertainties of the MSSM Higgs branching ratios to the accuracy which can be achieved at a future linear e+e- collider. △ Less", "Can a theory of flavour capable of describing the spectrum of fermion (including neutrino) masses and mixings also contain within it the seeds for a solution of the SUSY flavour and CP problems? We argue that supergravity together with a non-Abelian family symmetry can completely resolve the SUSY flavour and CP problems in a broad class of theories in which family symmetry and CP is spontaneously broken in the flavon sector. We show that a simple superpotential structure can suppresses the F-terms of the flavons and GUT scale Higgs fields and that, if this mechanism is implemented, the resulting flavour and CP violation is suppressed and comfortably within the experimental limits. For illustration, we study a specific model based on SU(3) family symmetry, but similar models based on non-Abelian (continuous or discrete) family symmetry will lead to similar results. △ Less", "In some class of supersymmetric (SUSY) models, the neutral Wino becomes the lightest superparticle and the Bino decays into the Wino and standard-model particles. In such models, we show that the measurement of the Bino mass is possible if the short charged tracks (with the length of O(10 cm)) can be identified as a signal of the charged-Wino production. We pay particular attention to the anomaly-mediated SUSY-breaking (AMSB) model with a generic form of Kähler potential, in which only the gauginos are kinematically accessible superparticles to the LHC, and discuss the implication of the Bino mass measurement for the test of the AMSB model. △ Less", "It is demonstrated that the light Higgs boson scenario, which the lightest Higgs mass is less than the LEP bound, mh > 114.4 GeV, is consistent with the SUSY seesaw model. With the assumptions of the universal right-handed neutrino mass and the hierarchical mass spectrum of the ordinary neutrinos, the bounds for the right-handed neutrino mass is investigated in terms of lepton flavor violating charged lepton decays. We also discuss the effect of the modification of renormalization group equations by the right-handed neutrinos on the b to s gamma process and the relic abundance of dark matter in the light Higgs boson scenario. △ Less", "I discuss an evolution of SUSY GUT model building, starting with the construction of 4d GUTs, to orbifold GUTs and finally to orbifold GUTs within the heterotic string. This evolution is an attempt to obtain realistic string models, perhaps relevant for the LHC. This review is in memory of the sudden loss of Julius Wess, a leader in the field, who will be sorely missed. △ Less", "High precision electroweak tests, such as deviations from the Standard Model expectations of the Lepton Flavor Universality breaking in K->lnu (with l= e or mu), represent a powerful tool to test the Standard Model and, hence, to constrain or obtain indirect hints of New Physics beyond it. We explore such a possibility within Supersymmetric theories. Interestingly enough, a process that in itself does not need lepton flavor violation to occur, i.e. the violation of mu-e non-universality in K_l2, proves to be quite effective in constraining not only relevant regions of SUSY models where lepton flavor is conserved, but even those where specific lepton flavor violating contributions arise. Indeed, a comparison with analogous bounds coming from tau lepton flavor violating decays shows the relevance of the measurement of R_K to probe Lepton Flavor Violation in SUSY. We outline the role and the interplay of the direct New Physics searches at the LHC with the indirect searches performed by LFU tests. △ Less", "We show that when the supersymmetric SU(5) model is extended to explain small neutrino masses by the type III seesaw mechanism, the new {\\bf 24}-dimensional fields needed for the purpose can act as messengers for transmitting SUSY breaking from a hidden sector to the visible sector. For the three {\\bf 24} case, the constraints of grand unification and suppressed lepton flavor violation restrict the seesaw scale in this case to be in the narrow range of $10^{12}-10^{13}$ GeV. The model predicts (i) a stable LSP gravitino with mass in the range of 1-10 MeV which can be a cold dark matter of the universe; (ii) a stau NLSP which is detectable at LHC; (iii) a lower bound on the branching ratio $BR(μ\\to e γ)$ larger than $10^{-14}$ testable by the ongoing MEG experiment as well as characteristic particle spectrum different from other SUSY breaking scenarios. We also discuss the case with two {\\bf 24} fields, which is the minimal case that can explain neutrino oscillation data. △ Less", "It is shown that a supersymmetric SO(10) model extended with fermion singlets can accommodate the observed neutrino masses and mixings as well as generate the desired lepton asymmetry in concordance with the gravitino constraint. A necessary prediction of the model is near-TeV scale doubly-charged Higgs scalars which should be detectable at the LHC. △ Less", "There has been interest in generalizing models of gauge mediation of supersymmetry breaking. As shown by Meade, Seiberg, and Shih (MSS), the soft masses of general gauge mediation can be expressed in terms of the current two-point functions of the susy-breaking sector. We here give a simple extension of their result which provides, for general gauge mediation, the full effective potential for squark pseudo-D-flat directions. The effective potential reduces to the sfermion soft masses near the origin, and the full potential, away from the origin, can be useful for cosmological applications. We also generalize the soft masses and effective potential to allow for general gauge mediation by Higgsed gauge groups. Finally, we discuss general gauge mediation in the limit of small F-terms, and how the results of MSS connect with the analytic continuation in superspace results, based on a spurion analysis. △ Less", "In a model-independent formalism of gauge mediation, Meade, Seiberg, and Shih have shown that hidden sector effects are captured by two-point correlation functions of the gauge current superfields and that, generically, many of the characteristic features of gauge mediated SUSY breaking do not survive. We review the general story, particularly the way that the correlators enter the low-energy effective action and give rise to soft-breaking terms. We then specialize to the case where there is a small parameter, F/m^2, where m is the mass scale characterizing the hidden sector, and F is the strength of the SUSY breaking. To leading nontrivial order in this small parameter, we show that many of the classic predictions of gauge mediated SUSY breaking are recovered. △ Less", "We consider a supersymmetric completion of codimension-two branes with nonzero tension in a 6D gauged supergravity. As a consequence, we obtain the football solution with 4D Minkowski space as a new supersymmetric background that preserves 4D N=1 SUSY. In the presence of brane multiplets, we derive the 4D effective supergravity action for the football background and show that the remaining modulus can be stabilized by a bulk non-perturbative correction with brane uplifting potentials at a zero vacuum energy. We find that the U(1)_R mediation can be a dominant source of SUSY breaking for a brane scalar with nonzero R charge. △ Less", "Global topological defects may account for the large cold spot observed in the Cosmic Microwave Background. We explore possibilities of constructing models of supersymmetric F-term hybrid inflation, where the waterfall fields are globally SU(2)-symmetric. In contrast to the case where SU(2) is gauged, there arise Goldstone bosons and additional moduli, which are lifted only by masses of soft-supersymmetry breaking scale. The model predicts the existence of global textures, which can become semi-local strings if the waterfall fields are gauged under U(1)_X. Gravitino overproduction can be avoided if reheating proceeds via the light SU(2)-modes or right-handed sneutrinos. For values of the inflaton- waterfall coupling >=10^-4, the symmetry breaking scale imposed by normalisation of the power spectrum generated from inflation coincides with the energy scale required to explain the most prominent of the cold spots. In this case, the spectrum of density fluctuations is close to scale-invariant which can be reconciled with measurements of the power spectrum by the inclusion of the sub-dominant component due to the topological defects. △ Less", "A fourth generation could provide, within SUSY, a solution to baryogenesis at the EW scale. It is allowed by precision measurements. Available data from Tevatron already restrict the allowed domain of parameters for the new quarks and the Higgs boson. There are some indications from b->s transitions which could be interpreted within an extension of the CKM matrix to 4x4, in particular CPV in the Bs time-dependence for the J/Psi-Phi mode observed at Tevatron. If confirmed with more data the 4MSSM interpretation predicts a very interesting scenario for LHC and a TeV LC. △ Less", "In various models of supersymmetry (SUSY), the lightest superparticle in the minimal SUSY standard model sector, which we call MSSM-LSP, becomes unstable. Then, we may observe the decay of the MSSM-LSP in the detector at the LHC experiment. We show that the discovery of such a decay process (and the determination of the lifetime of the MSSM-LSP) may be possible at the LHC even if the decay length of the MSSM-LSP is much longer than the size of the detector; sizable number of the MSSM-LSPs decay inside the detector if the lifetime is shorter than 0.01-1 millisec. We also discuss the implications of the study of the MSSM-LSP decay for several well-motivated SUSY models. △ Less", "In this contribution, we discuss the possibility of meta-stable supersymmetry (SUSY) breaking vacua in a perturbed Seiberg-Witten theory with Fayet-Iliopoulos (FI) term. We found meta-stable SUSY breaking vacua at the degenerated dyon and monopole singular points in the moduli space at the nonperturbative level. △ Less", "We study the Higgs potential of the next-to-minimal renormalizable SUSY SO(10) GUT with 120 Higgs representation on top of the \"standard\" minimal model Higgs sector spanning over 10, 126bar+126 and 210. All the GUT-scale Higgs sector mass matrices for the 592 Higgs states of the model are written down in detail with all the conventions fully specified. The consistency of the results is checked by the decoupling of 120 and independently by the analysis of the relevant Goldstone modes. The matching of the Yukawa sector sum-rules driving the matter fermion masses and mixing at the level of the effective theory is described thoroughly. △ Less", "We revisit the minimal supersymmetric left-right model with B-L=2 triplet Higgs fields and show that a self-consistent picture emerges with automatic R-parity conservation even in the absence of higher dimensional operators. By computing the effective potential for the Higgs system including heavy Majorana neutrino Yukawa couplings we show that the global minimum of the model can lie in the charge and R-parity conserving domain. The model provides natural solutions to the SUSY phase problem and the strong CP problem and makes several interesting predictions. Quark mixing angles arise only after radiative corrections from the lepton sector are taken into account. A pair of doubly charged Higgs fields remain light below TeV with one field acquiring its mass entirely via renormalization group corrections. We find this mass to be not much above the Bino mass. In the supergravity framework for SUSY breaking, we also find similar upper limits on the stau masses. Natural solutions to the $μ$ problem and the SUSY CP problem entails light SU(2)_L triplet Higgs fields, leading to rich collider phenomenology. △ Less", "Experimental prospects for studying high-energy photon-photon and photon-proton interactions at the LHC are discussed. Assuming a typical LHC multipurpose detector, various signals and their irreducible backgrounds are presented after applying acceptance cuts. Selection strategies based on photon interaction tagging techniques are presented. Prospects are discussed for the Higgs boson search, detection of SUSY particles and of anomalous quartic gauge couplings, as well as for the top quark physics. △ Less", "New results which correlate SUSY dark matter with LHC signals are presented, and a brief review of recent developments in supersymmetric and hidden sector dark matter is given. It is shown that the direct detection of dark matter is very sensitive to the hierarchical SUSY sparticle spectrum and the spectrum is very useful in distinguishing models. It is shown that the prospects of the discovery of neutralino dark matter are very bright on the \"Chargino Wall\" due to a copious number of model points on the Wall, where the NLSP is the Chargino, and the spin independent neutralino-proton cross section is maintained at high values in the $10^{-44}$cm$^{2}$ range for neutralino masses up to $\\sim 850$ GeV . It is also shown that the direct detection of dark matter along with lepton plus jet signatures and missing energy provide dual, and often complementary, probes of supersymmetry. Finally, we discuss an out of the box possibility for dark matter, which includes dark matter from the hidden sector, which could either consist of extra weakly interacting dark matter (a Stino XWIMP), or milli-charged dark matter arising from the Stueckelberg extensions of the MSSM or the SM. △ Less", "I review our recent attempts toward obtaining the MSSM from string orbifold compactification. The required constraints are the existence of three families and R parity, vectorlike exotics, one pair of Higgs doublets, and the SU(5)$'$ hidden sector for dynamical breaking of SUSY toward a GMSB scenario. We also comment on the threshold correction which are influenced by a power law evolution of gauge couplings through the KK radius in non-prime orbifolds and can be used to fit the couplings. △ Less", "Supersymmetry predicts the identity of Yukawa and gauge couplings in the QCD sector: quark-squark-gluino = squark-squark-gluon = quark-quark-gluon. We examine whether the quark-squark-gluino Yukawa coupling can be determined, by methods complementary to LHC, by analyzing squark-gluino final states at a TeV e+e- collider. △ Less", "One of the first orders of business for LHC experiments after beam turn-on will be to calibrate the detectors using well understood Standard Model (SM) processes such as W and Z production and ttbar production. These familiar SM processes can be used to calibrate the electromagnetic and hadronic calorimeters, and also to calibrate the associated missing transverse energy signal. However, the presence of new physics may already affect the results coming from these standard benchmark processes. We show that the presence of relatively low mass supersymmetry (SUSY) particles may give rise to significant deviations from SM predictions of Z+jets and W+jets events for jet multiplicity $\\ge 4$ or $\\ge 5$, respectively. Furthermore, the presence of low mass SUSY may cause non-standard deviations to appear in top quark invariant and transverse mass distributions. Thus, effects that might be construed as detector mal-performance could in fact be the presence of new physics. We advocate several methods to check when new physics might be present within SM calibration data. △ Less", "We study the supersymmetric version of the type-II seesaw mechanism assuming minimal supergravity boundary conditions. We calculate branching ratios for lepton flavour violating (LFV) scalar tau decays, potentially observable at the LHC, as well as LFV decays at low energy, such as $l_i \\to l_j + γ$ and compare their sensitivity to the unknown seesaw parameters. In the minimal case of only one triplet coupling to the standard model lepton doublets, ratios of LFV branching ratios can be related unambigously to neutrino oscillation parameters. We also discuss how measurements of soft SUSY breaking parameters at the LHC can be used to indirectly extract information of the seesaw scale. △ Less", "We describe a new cascade mass reconstruction approach to allow reconstruction of SUSY particle masses in long cascades (five or more particles) at the LHC with integrated luminosity as low as a few fb^(-1). This approach is based on a consecutive use of the endpoint method, an event filter and a combinatorial mass reconstruction method. The endpoint method gives a preliminary estimate of light sparticle masses. An event filter combining the maximum likelihood distributions for all events in the data sample allows suppression of backgrounds and gives a preliminary estimate of heavy sparticle masses. Finally, SUSY particle masses are reconstructed by a search for a maximum of a combined likelihood function constructed for each possible combination of five events in the data sample. SUSY data sample sets for the SU3 model point containing 80k events each were generated, corresponding to an integrated luminosity of 4.2 fb^(-1). These events were passed through the AcerDET detector simulator, which parametrized the response of a detector. To demonstrate the stability and precision of the approach five different 80k event data sets were considered. Masses were reconstructed with a precision of about 10% for heavy sparticles and 10-20% for light sparticles. △ Less", "We suppose that the baryon asymmetry is produced by thermal leptogenesis (with flavour effects), at temperatures $\\sim 10^{9} - 10^{10}$ GeV, in the supersymmetric seesaw with universal and real soft terms. The parameter space is restricted by assuming that $l_α\\to l_βγ$ processes will be seen in upcoming experiments. We study the sensitivity of the baryon asymmetry to the phases of the lepton mixing matrix, and find that leptogenesis can work for any value of the phases. We also estimate the contribution to the electric dipole moment of the electron, arising from the seesaw, and find that it is (just) beyond the sensitivity of next generation experiments ($\\lsim 10^{-29} e$ cm). The fourteen dimensional parameter space is efficiently explored with a Monte Carlo Markov Chain, which concentrates on the regions of interest. △ Less", "We present global fits to the Large Volume Scenario (LVS) of string models using current indirect data. We use WMAP5 constraints on dark matter relic density, b-physics and electroweak observables as well as direct search constraints. Such data can be adequately fit by LVS, with the best-fit point for mu>0 having chi^2=13.6 for 8 degrees of freedom. The resulting constraints on parameter space are robust in that they do not depend much upon the prior, or upon whether one uses Bayesian or frequentist interpretations of the data. Sparticle masses are constrained to be well below the 1 TeV level, predicting early SUSY discovery at the LHC. We devise a method of quantifying which are the most important constraints. We find that the LEP2 Higgs mass constraint, the relic density of dark matter and the anomalous magnetic moment of the muon affect the fits to the strongest degree. △ Less", "The detection of pairs of sleptons, charginos and charged higgs bosons produced via photon-photon fusion at the LHC is studied, assuming a couple of benchmark points of the MSSM model. Due to low cross sections, it requires large integrated luminosity, but thanks to the striking signature of these exclusive processes the backgrounds are low, and are well known. Very forward proton detectors can be used to measure the photon energies, allowing for direct determination of masses of the lightest SUSY particle, of selectrons and smuons with a few GeV resolution. Finally, the detection and mass measurement of quasi-stable particles predicted by the so-called sweet spot supersymmetry is discussed. △ Less", "We generalize the computation of supersymmetric contributions to the muon anomalous magnetic moment (g-2)_mu to the NMSSM. In the presence of a light CP-odd Higgs scalar, these can differ considerably from the MSSM. We discuss the amount of these contributions in regions of the parameter space of the general NMSSM compatible with constraints from B physics. In the mSUGRA-like cNMSSM, constraints from (g-2)_mu prefer regions in parameter space corresponding to a low SUSY breaking scale. △ Less", "It has been shown through the AdS/CFT correspondence that the energy loss of a fast quark in a strongly coupled ${\\cal N}=4$ SUSY Yang--Mills matter in the large N limit is given by the classical Lienard formula. I demonstrate that under quite natural assumptions about the dynamics of heavy ion collisions this leads to a universal (i.e. independent of the initial parton energy, but dependent on flavor and centrality) upper bound on the energy of the partons escaping from the plasma. This bound is a Yang--Mills analog of the Pomeranchuk bound in classical electrodynamics, where it is a consequence of radiation in a strong external field acting on a relativistic charge. Since as a result the massive constituent partons are slowed down to a velocity v < c, the angular distribution of the emitted radiation exhibits a broad \"dead cone\". If the properties of conformal and QCD matter at strong coupling are qualitatively similar, the existence of this universal upper bound would have dramatic implications for heavy ion experiments. △ Less", "The search for supersymmetry (SUSY) and other classes of new physics will be tackled on two fronts, with high energy, direct detection machines, and in high precision experiments searching for indirect signatures. While each of these methods has its own strengths, even more can be gained by finding ways to combine their results. In this paper, we examine one way of bridging these two types of experiments by calculating sum rules which link physical squark masses to the flavor-violating squark mixings. These sum rules are calculated for minimally flavor-violating SUSY theories at both high and low tan(beta). We also explore how the sum rules could help to disentangle the relative strengths of different SUSY contributions to b -> s gamma, a favored channel for indirect searches of new physics. Along the way, we show that the gluino contributions to b -> s gamma can be very sizable at large tan(beta). △ Less", "In this talk I review three topics: (i) Heterotic strings from N=1 gauge theories; (ii) Planar equivalence and emergent center symmetry in QCD-like theories; (iii) Exact result for gluon scattering amplitudes in N=4 (dual conformality). △ Less", "It is recently announced by the {\\bf Ut}{\\it fit} collaboration that the CP phase of the $B_s$ mixing amplitude, $φ_{B_s}$, deviates more than $3 σ$ from the standard-model prediction. In this paper we discuss how large correction to $φ_{B_s}$ is possible in the supersymmetric SU(5) ground unified model (SUSY SU(5) GUT) with right-handed neutrinos. Here, we assume the supergravity-like boundary condition for the SUSY-breaking terms. We found that the 95% probability region derived by the {\\bf Ut}{\\it fit} collaboration is marginal in this model. △ Less", "We study the general patterns of SUSY-breaking soft terms arising under the assumption of Kahler moduli dominated SUSY-breaking in string theory models. Insisting that all MSSM gauginos get masses at leading order and that the top Yukawa coupling is of order the gauge coupling constant identifies the class of viable models. These are models in which the SM fields live either in the bulk or at the intersection of local sets of Type IIB D7-branes or their F-theory relatives. General arguments allow us to compute the dependence of the Kahler metrics of MSSM fields on the local Kahler modulus of the brane configuration in the large moduli approximation. We illustrate this study in the case of toroidal/orbifold orientifolds but discuss how the findings generalize to the F-theory case which is more naturally compatible with coupling unification. Only three types of 7-brane configurations are possible, leading each of them to very constrained patterns of soft terms for the MSSM. We study their consistency with radiative electroweak symmetry breaking and other phenomenological constraints. We find that essentially only the configuration corresponding to intersecting 7-branes is compatible with all present experimental constraints and the desired abundance of neutralino dark matter. The obtained MSSM spectrum is very characteristic and could be tested at LHC. We also study the LHC reach for the discovery of this type of SUSY particle spectra. △ Less", "Unification of GUT-scale t-b-τYukawa couplings is a significant feature of simple SO(10) SUSY GUTs. Here we present the results of a search that used the Markov Chain Monte Carlo technique to investigate regions of Yukawa unification and WMAP-compatible dark matter relic density in SO(10)-like MSSM parameter spaces. We mention the possible LHC signatures of Yukawa unified scenarios and discuss the consequences for dark matter. △ Less", "We consider supersymmetric (SUSY) models in which a very light gravitino is the lightest SUSY particle. Assuming that a neutralino is the next-to-lightest SUSY particle, we present a measurement of the neutralino mass at the LHC in two photons + missing energy events, which is based on the MT2 method. It is a direct measurement of the neutralino mass itself, independent of other SUSY particle masses and patterns of cascade decays before the neutralino is produced. △ Less", "We explore electroweak precision observables (EWPO) and $B$-physics observables (BPO) in the CMSSM, the mGMSB and the mAMSB. We perform a chi^2 analysis based on the combination of current EWPO and BPO data. For the first time this allows the comparison of the mGMSB and mAMSB in terms of EWPO and BPO with the CMSSM. We find that relatively low mass scales in all three scenarios are favored. However, the current data from EWPO and BPO can hardly exclude any parameters at the level of Delta chi^2 = 9. Remarkably the mAMSB scenario, despite having one free GUT scale parameter less than the other two scenarios, has a somewhat lower total minimum chi^2. We present predictions for the lightest Higgs boson mass, based on the chi^2 analysis of current data, where relatively good compatibility with the bounds from Higgs searches at LEP is found. We also present the predictions for other Higgs sector parameters and SUSY mass scales, allowing to compare the reach of the LHC and the ILC in the three scenarios. We furthermore explore the future sensitivities of the EWPO and BPO for the current best-fit results and for a hypothetical point with somewhat higher mass scales that results in a similar Higgs and SUSY spectrum in the three scenarios. We find that the future improvement of the accuracy of the EWPO and BPO will lead to a significant gain in the indirect parameter determination. The improvement is similar in the CMSSM, mGMSB and mAMSB and will yield constraints to the parameter space even for heavy Higgs and SUSY mass scales. △ Less", "In this article we review the mechanisms in several supersymmetric models for producing gluinos at the LHC and its potential for discovering them. We focus on the MSSM and its left-right extensions. We study in detail the strong sector of both models. Moreover, we obtain the total cross section and differential distributions. We also make an analysis of their uncertainties, such as the gluino and squark masses, which are related to the soft SUSY breaking parameters. △ Less", "We provide a bestiary of public codes and other algorithmic tools that can be used for analysing supersymmetric phenomenology. We also describe the organisation of the different tools and communication between them. Tools exist that calculate supersymmetric spectra and decay widths, simulate Monte Carlo events as well as those that make predictions of dark matter relic density or that predict precision electroweak or b-observables. Some global fitting tools for use in SUSY phenomenology are also presented. In each case, a description and a link to the relevant web-site is provided. It is hoped that this review could serve as an \"entry-gate\" and map for prospective users. △ Less", "In this thesis we concentrate on the determination of the spin of an intermediate particle by using a decay chain. In SUSY the gluino is especially interesting for searches at the LHC, since it is a Majorana fermion which can produce like-sign dileptons in the final state. In UED the like-sign dilepton signature could occur as well from the decay of a bosonic KK-gluon. As we will show, angular distributions of the outgoing b-jets in SUSY and UED differ due to the different coupling structures. The effect from the different boosts of gluino and heavy gluon is shown to be much smaller. The hadronic UED cross section for KK-gluon KK-quark collisions is calculated in leading order and compared to the gluino squark collision in SUSY. The analytically given partonic cross sections are compared at the threshold. △ Less", "We study the neutrino mass matrix derived from the seesaw mechanism in which the neutrino Yukawa couplings and the heavy Majorana neutrino mass matrix are controlled by the Froggatt-Nielsen mechanism. In order to obtain the large neutrino mixings, two Froggatt-Nielsen fields are introduced with a complex vacuum expectation values. As a by-product, CP violation is systematically induced even if the order one couplings of FN fields are real. We show several predictions of this model, such as theta_{13}, the Dirac CP phase, two Majorana CP phases, the effective mass of the neutrinoless double beta decay and the leptogenesis. The prediction of the branching ratio of mu to e+gamma is also given in SUSY model. △ Less", "We analyze the production and subsequent decay of the neutral Higgs bosons of the MSSM into electrically neutral quark pairs qq'=bs,tc of different flavors at the LHC and compare with the direct FCNC production mechanisms. The cross-sections are computed in the unconstrained MSSM with minimal flavor-mixing sources and taking into account the stringent bounds from radiative B-meson decays. We extend the results previously found for these FCNC processes, which are singularly uncommon in the SM. Specifically, we report here on the SUSY-EW contribution of the Higgs-mediated FCNC cross-section into bs and tc final states and the SUSY-QCD and SUSY-EW contributions to bs-production. In this way, the complete map of MSSM predictions for the qq'-pairs produced at the LHC becomes available. The upshot is that the most favorable channels are: 1) the Higgs boson FCNC decays into bs, and 2) the direct production of tc pairs, both of them at the 1 pb level and mediated by SUSY-QCD effects. If, however, the latter are suppressed, we find a small SUSY-EW yield for the tc-production through Higgs decays but, at the same time, a cross-section of 0.1-1 pb for bs-production, which implies a significant number (10^4-10^5) of bs-pairs per 100 inverse femtobarn of integrated luminosity. △ Less", "We calculate triangle anomalies for fermions with non-canonical scaling dimensions. The most well known example of such fermions (aka unfermions) occurs in Seiberg duality where the matching of anomalies (including mesinos with scaling dimensions between 3/2 and 5/2) is a crucial test of duality. By weakly gauging the non-local action for an unfermion, we calculate the one-loop three-current amplitude. Despite the fact that there are more graphs with more complicated propagators and vertices, we find that the calculation can be completed in a way that nearly parallels the usual case. We show that the anomaly factor for fermionic unparticles is independent of the scaling dimension and identical to that for ordinary fermions. This can be viewed as a confirmation that unparticle actions correctly capture the physics of conformal fixed point theories like Banks-Zaks or SUSY QCD. △ Less", "We compute the nonperturbative decay of supersymmetric flat directions due to their D-term potential. Flat directions can develop large vacuum expectation values (vevs) during inflation, and, if they are long-lived, this can strongly affect the reheating and thermalization stages after the inflation. We study a generic system of two U(1) or SU(2) flat directions which are cosmologically evolving after inflation. After proper gauge fixing, we show that the excitations of the fields around this background can undergo exponential amplification, at the expense of the energy density of the flat directions. We compute this effect for several values of the masses and the initial vevs of the two flat directions, through a combination of analytical methods and extensive numerical simulations. For a wide range of parameters the flat directions decay within their first few rotations. △ Less", "Spacetime supersymmetry is widely believed to play an important role in most fundamental theories of physics, and is usually invoked in order to address problems of naturalness. In this paper, we examine the question of whether supersymmetry itself is ``natural'' (i.e., likely to exist as a fundamental component of nature at high energy scales). Our approach to answering this question is based on a statistical examination of the heterotic string landscape, and our conclusion is that supersymmetry is an exceedingly rare phenomenon. We also find that the likelihood of supersymmetry appearing at the string scale is dependent on the gauge symmetries present at the string scale, with certain gauge groups strongly favoring the appearance of N=1 supersymmetry and others not. This article summarizes several recent papers, yet also contains some new results. In particular, one new result is that the heterotic landscape appears to favor either the non-supersymmetric Standard Model or an N=1 SUSY GUT gauge group at the string scale; by contrast, the opposite outcomes (namely the MSSM or a non-supersymmetric GUT) are significantly disfavored. △ Less", "The so-called supersymmetric flavour and CP problems are deeply related to the origin of flavour and hence to the origin of the SM Yukawa couplings themselves. We show that realistic SU(3) flavour symmetries with spontaneous CP violation reproducing correctly the SM Yukawa matrices can simultaneously solve both problems without ad hoc modifications of the SUSY model. We analyze the leptonic electric dipole moments and lepton flavour violation processes in these models. We show that the electron EDM and the decay mu -> e gamma are naturally within reach of the proposed experiments if the sfermion masses are measurable at the LHC. △ Less", "If left-right gauge theory occurs as an intermediate symmetry in a GUT then, apart from other advantages, it is possible to obtain the see-saw scale necessary to understand small neutrino masses with Majorana coupling of order unity. Barring threshold or non-renormalizable gravitational effects, or assumed presence of additional light scalar particles of unprescribed origin, all other attempts to achieve manifest one-loop gauge coupling unification in SUSY SO(10) with left-right intermediate symmetry have not been successful so far. Attributing this failure to lack of flavor symmetry in the GUT, we show how the spontaneous symmetry breaking of $SO(10)\\times S_4$ leads to such intermediate scale extending over a wide range, $M_R \\simeq 5\\times 10^{9}$ GeV to $10^{15}$ GeV. All the charged fermion masses are fitted at the see-saw scale, $M_N\\simeq M_R \\simeq 4 \\times 10^{13}$ GeV which is obtained with Majorana coupling $f_0 \\simeq 1$. Using a constrained parametrization in which CP-violation originates only from quark sector, besides other predictions made in the neutrino sector, the reactor mixing angle is found to be $θ_{13} \\simeq 3^{\\circ} - 5^{\\circ}$ which is in the range accessible to ongoing and planned experiments. The leptonic Dirac phase turns out to be $δ\\sim 2.9- 3.1$ radians with Jarlskog invariant $J \\sim 2.95 \\times 10^{-5} - 10^{-3}$. △ Less", "In certain class of flux compactification, moduli mediated supersymmetry (SUSY) breaking preserves flavor and CP at leading order in the perturbative expansion controlled by the vacuum expectation value of the messenger modulus. Nevertheless there still might be dangerous flavor or CP violation induced by higher order Kähler potential. We examine the constraints on such SUSY breaking scheme imposed by low energy flavor and/or CP violating observables. It is found that all phenomenological constraints can be satisfied even for generic form of higher order Kähler potential and sparticle spectra in the sub-TeV range, under plausible assumptions on the size of higher order correction and flavor mixing angles. This implies for instance that mirage mediation scheme of SUSY breaking, which involves such modulus mediation together with an anomaly mediation of comparable size, and also the modulus-dominated mediation realized in flux compactification can be free from the SUSY flavor and CP problems, while giving gaugino and sfermion masses in the sub-TeV range. △ Less", "We explore a mechanism of radiative B-L symmetry breaking in analogous to the radiative electroweak symmetry breaking. The breaking scale of B-L symmetry is related to the neutrino masses through the see-saw mechanism. Once we incorporate the U(1)_{B-L} gauge symmetry in SUSY models, the U(1)_{B-L} gaugino appears, and it can mediate the SUSY breaking (Z-prime mediated SUSY breaking) at around the scale of 10^6 GeV. Then we find a links between the neutrino mass (more precisly the see-saw or B-L scale of order 10^{6} GeV) and the Z-prime mediated SUSY breaking scale. It is also very interesting that the gluino at the weak scale becomes relatively light, and almost compressed mass spectra for the gaugino sector can be realized in this scenario, which is very interesting in scope of the LHC. △ Less", "Motivated by the fact that neutrinos are massive, we study the effect of neutrino Yukawa couplings on neutralino dark matter observables within the framework of a supersymmetric seesaw. We find that neutrino couplings significantly affect the neutralino relic density in regions of parameter space where soft SUSY-breaking slepton masses and/or trilinear couplings are large. Depending on the size of the couplings, the neutralino relic density spans over an order of magnitude in the A-funnel, focus point and stop-coannihilation regions of mSUGRA. We also show that dark matter detection rates can be modified by up to several orders of magnitude. △ Less", "We study the neutralino relic density in the minimal supersymmetric standard model with natural light Higgs sector in which all Higgs masses, the supersymmetry (SUSY) breaking parameters, and the higgsino mass parameter mu are of order the weak scale. To realize this situation we adopt nonuniversal Higgs masses at the grand unified scale. We show that in some parameter space in which the SUSY breaking parameters are comparatively small, not only the constraint from the observed relic density of dark matter but also the LEP Higgs bound and the constraint from the b ->s gamma process are satisfied. In most of the parameter space, the neutralino relic density becomes smaller than the observed relic density in contrast with the results in the constrained minimal SUSY standard model (CMSSM). The reason is that the neutralino coannihilation processes to Higgs bosons open even if the gaugino mass is small and the cross sections become large due to the small dimensionful parameters. Especially small mu parameter and the light CP-odd Higgs, which are difficult to be realized in the CMSSM, are essential for the result. △ Less", "We examine stabilities of our supersymmetry-breaking false vacuum in a low-energy direct gauge mediation model of SUSY breaking. The stability required in the high-temperature early universe leads to upperbounds on masses of squarks and gluino as m_\\tilde{q} \\lesssim 1 TeV and m_\\tilde{g} \\lesssim 1 TeV for the light gravitino of mass m_{3/2} \\lesssim 16 eV. △ Less", "Prospects for SUSY discoveries and measurements at future colliders LHC and ILC are discussed. The problem of reconstructing the underlying theory and SUSY breaking mechanism is also addressed. △ Less", "We discuss SUSY models in which renormalizable lepton number violating couplings hide the decay of the Higgs through h -> χ_1^0 + χ_1^0 followed by χ_1^0 -> τ+ 2 jets or χ_1^0 -> ν_τ+ 2 jets and also explain neutrino masses. This mechanism can be made compatible with gauge mediated SUSY breaking. △ Less", "We explore in detail the consequences of the CP-violating phases residing in the supersymmetric and soft SUSY breaking parameters in the approximation that family flavour mixings are ignored. We allow for non-universal boundary conditions and in such a consideration the model is described by twelve independent CP-violating phases and one angle which misaligns the vacuum expectation values (VEVs) of the Higgs scalars. We run two-loop renormalization group equations (RGEs), for all parameters involved, including phases, and we properly treat the minimization conditions using the one-loop effective potential with CP-violating phases included. We show that the two-loop running of phases may induce sizable effects for the electric dipole moments (EDMs) that are absent in the one-loop RGE analysis. Also important corrections to the EDMs are induced by the Higgs VEVs misalignment angle which are sizable in the large tanb region. Scanning the available parameter space we seek regions compatible with accelerator and cosmological data with emphasis on rapid neutralino annihilations through a Higgs resonance. It is shown that large CP-violating phases, as required in Baryogenesis scenarios, can be tuned to obtain agreement with WMAP3 cold dark matter constraints, EDMs and all available accelerator data, in extended regions of the parameter space which may be accessible to LHC. △ Less", "The minimal renormalizable SUSY SO(10) model is a very compact and predictive theory. It was very popular till one realized that it cannot account for the masses of the neutrinos. The best cure to this problem is to add the 120 Higgs representaion, the 'next to minimal' version. To reduce the number of free parameters, it was suggested in recent papers to use only real parameters in the superpotential and induce CP violation via complex VEVs. This is what one usually calls 'spontaneous CP violation'. The number of free parameters turned out, then, to be even smaller than in the original minimal model and good fits to all known masses and mixings were obtained. Out of those papers only that of Aulakh and Garg discusses how CP is spontaneously violated. Some heavy MSSM singlet VEVs generate a phase at high scale and CP violationis carried down to the CKM matrix by the mixing of the scalar MSSM doublets. They study the model in great detail and give a large set of solutions. As a proof of principle, two of the solutions are shown to induce realistic phenomenological fits. It is not clear, however, how the right physical solution is obtained. I study the way solutions for spontaneous CP violation affect the scalar potential. The one that gives the lowest minimum of the potential, in terms of a given set of parameters, is the right physical one. In the way of doing so, I will prove that complex MSSM singlet VEVs lead actually to lower minima than the real (CP conserving) ones. This proves that CP is spontaneously violated in this model. △ Less", "We consider supersymmetric QCD in the free magnetic phase with massless and massive flavors. The theory has a supersymmetry breaking pseudo-moduli space of vacua and a runaway behavior far away from the origin. A two-loop computation reveals that the origin is destabilized and there is no meta-stable SUSY breaking solution. We also study the embedding of this model in type IIA string theory and find evidence for similar behavior. The perturbative brane dynamics involves simple interactions between branes, correctly predicting the two-loop result in the gauge theory. Our results also apply to the case when all the flavors are massive but have hierarchy among them, leading to possible instability which is manifest both in field theory and the brane description. △ Less", "We study the Higgs sector of the secluded $U(1)'$-extended MSSM (sMSSM) focusing on CP violation. Using the one-loop effective potential that includes contributions from quarks and squarks in the third generation, we search for the allowed region under theoretical and experimental constraints. It is found that the possible region for the electroweak vacuum to exist is quite limited, depending on the parameters in the model. The masses and couplings of the Higgs bosons are calculated with/without CP violation. Even at the tree level, CP violation is possible by complex soft SUSY breaking masses. Similar to the CPX scenario in the MSSM, the scalar-pseudoscalar mixing enables the lightest Higgs boson mass to become smaller than the $Z$ boson mass while the coupling with the $Z$ boson is sufficiently suppressed to avoid the LEP experimental constraints. However, unlike the CPX scenario, large $μ$ and $A$ are not required for the realization of large CP violation. The typical spectrum of the SUSY particles is thus different. We also investigate the possible upper bound of the lightest Higgs boson in the case of spontaneous CP violation. The maximal value of it can reach above 100 GeV with maximal CP-violating phases. △ Less", "We have computed the one-loop electroweak expression of diagonal and non diagonal stop-antistop and sbottom-antisbottom production from initial state gluons at LHC. We have investigated the possibility that the one-loop effects exhibit a dependence on \"extra\" supersymmetric parameters different from the final squark masses. Our results, given for a choice of twelve SUSY benchmark points in the MSSM with mSUGRA symmetry breaking, show that in some cases a mild dependence might arise, at the percent relative level, of not simple experimental detection. △ Less", "The search for MSSM Higgs bosons will be an important goal at the LHC. In order to analyze the search reach of the CMS experiment for the charged MSSM Higgs bosons, we combine the latest results for the CMS experimental sensitivities based on full simulation studies with state-of-the-art theoretical predictions of MSSM Higgs-boson production and decay properties. The experimental analyses are done assuming an integrated luminosity of 30 fb^-1 for the two cases M_H+- < m_t and M_H+- > m_t. The results are interpreted as 5 sigma discovery contours in M_H+- - tan_beta planes of the MSSM for various benchmark scenarios. We study the dependence of the 5 sigma contours on the variation of the relevant SUSY parameters. Particular emphasis is put on analyzing the variation of the discovery contours with the Higgs mixing parameter mu. The variation of mu can shift the prospective discovery reach in tan_beta by up to Delta tan_beta = 40. △ Less", "We investigate the effect of supersymmetric (SUSY) threshold corrections on the values of the running quark and charged lepton masses at the GUT scale within the large $\\tanβ$ regime of the MSSM. In addition to the typically dominant SUSY QCD contributions for the quarks, we also include the electroweak contributions for quarks and leptons and show that they can have significant effects. We provide the GUT scale ranges of quark and charged lepton Yukawa couplings as well as of the ratios $m_μ/m_s$, $m_e/m_d$, $y_τ/y_b$ and $y_t/y_b$ for three example ranges of SUSY parameters. We discuss how the enlarged ranges due to threshold effects might open up new possibilities for constructing GUT models of fermion masses and mixings. △ Less", "We show that in supersymmetric left-right models (SUSYLR), the upper bound on the lightest neutral Higgs mass can be appreciably higher than that in minimal supersymmetric standard model (MSSM). The exact magnitude of the bound depends on the scale of parity restoration and can be 10-20 GeV above the MSSM bound if mass of the right-handed gauge boson $W_R$ is in the TeV range. An important implication of our result is that since SUSYLR models provide a simple realization of seesaw mechanism for neutrino masses, measurement of the Higgs boson mass could provide an independent probe of a low seesaw scale. △ Less", "We show how models of neutrino masses and mixings can be differentiated on the basis of their predictions for $θ_{13}$ and lepton flavor violation in radiative charged lepton decays and $μ- e$ conversion. We illustrate the lepton flavor violation results for five predictive SO(10) SUSY GUT models and point out the relative importance of their heavy right-handed neutrino mass spectra and $θ_{13}$ predictions. △ Less", "We consider NLO chargino production and decays at the ILC. For this, we present an NLO extension of the Monte Carlo Event Generator Whizard including the NLO production. For photonic corrections, we use both a fixed order and a resummation approach. The latter method evades the problem of negative event weights and automatically includes leading higher order corrections. We present results for cross sections and event generation for both methods. As a first step towards a full NLO Monte Carlo, we consider a LO implementation of the chargino production and subsequent leptonic decay and investigate the precision of the sneutrino mass determination by means of lepton energy distributions in chargino decays. The SM and SUSY backgrounds are included in our study using full matrix elements as well as smearing effects from ISR and beamstrahlung. Without using energy distribution fits, the sneutrino mass can be determined with an error in the percent regime. △ Less", "We study methods of extracting new physics signals in final states with a top-quark pair plus large missing energy at the LHC. We consider two typical examples of such new physics: pair production of a fermionic top partner (a $T'$ in Little Higgs models for example) and of a scalar top partner (a $\\tilde{t}$ in SUSY). With a commonly-adopted discrete symmetry under which non Standard Model particles are odd, the top partner is assumed to decay predominantly to a top quark plus a massive neutral stable particle $A^0$. We focus on the case in which one of the top quarks decays leptonically and the other decays hadronically, $pp \\to {\\tt} A^0A^0 X \\to bj_1j_2 \\bar b\\ell^- \\barνA^0A^0 X + c.c.$, where the $A^0$s escape detection. We identify a key parameter for the signal observation: the mass splitting between the top partner and the missing particle. We reconstruct a transverse mass for the lepton-missing transverse energy system to separate the real $W$ background from the signal and propose a definition for the reconstructed top quark mass that allows it to take unphysical values as an indication of new physics. We perform a scan over the two masses to map out the discovery reach at the LHC in this channel. We also comment on the possibility of distinguishing between scalar and fermionic top partners using collider signatures. △ Less", "We provide a simple solution to the $μ/B_μ$ problem in the gauge-mediated Next-to-Minimal Supersymmetric Standard Model. In this model the messenger sector contains one pair of $3+\\bar 3$ and one pair of $2+\\bar 2$ messengers. These two messenger pairs couple to different gauge singlets in the hidden sector in which supersymmetry (SUSY) is broken. Such a gauge-mediation structure can naturally arise in many backgrounds. Because of the two effective SUSY breaking scales $\\frac{< F_i>}{< M_i>}$ in the messenger sector, the renormalization group evolutions of the soft SUSY breaking parameters can be properly modified, leading to a negative enough singlet soft mass square $m_N^2(Λ_{EW})$ and hence reasonable $μ/B_μ$ values. In most of the perturbative (up to the GUT scale) parameter region, as a result, the electroweak scale is stabilized and phenomenologically interesting mass spectra of particles and superparticles are obtained. In addition, this model favors large values of $\\tanβ$: $5 \\sim 50$ and a heavy scalar spectrum. With the relatively large $\\tanβ$, the light $U(1)_R$ pseudoscalar (mainly appearing in the low-scale gauge-mediated SUSY breaking models) becomes extremely singlet-like, and is no longer a problem in this model. These features apply to all cases of low-, intermediate- and high-scale gauge-mediated SUSY breaking. △ Less", "The lightest neutralino, as the dark matter candidate, can be gravitationally captured by the Sun. In this paper, we studied the high energy neutrino signals from solar neutralino annihilations in the core of the Sun in the anomaly mediated supersymmetry (SUSY) breaking (AMSB) model. Based on the event-by-event monte carlo simulation code WimpSim, we studied the detailed energy and angular spectrum of the final muons at large neutrino telescope IceCube. More precisely we simulated the processes since the production of neutrino via neutralino annihilation in the core of the Sun, neutrino propagation from the Sun to the Earth, as well as the converting processes from neutrino to muon. Our results showed that in the AMSB model it is possible to observe the energetic muons at IceCube, provided that the lightest neutralio has relatively large higgsino component, as a rule of thumb $ N_{13}^2 + N_{14}^2 > 4%$ or equivalently $ σ_{SD} > 10^{- 5} pb$. Especially, for our favorable parameters the signal annual events can reach 102 and the statistical significance can reach more than 20. We pointed out that the energy spectrum of muons may be used to distinguish among the AMSB model and other SUSY breaking scenarios. △ Less", "In this work we study the Lepton Flavour Violating semileptonic $τ$ decays: 1) $τ\\to μPP$ with $PP= π^+π^-, π^0π^0, K^+K^-, K^0 {\\bar K}^0$; 2) $τ\\to μP$ with $P=π^0, η, η'$ and 3) $τ\\to μV$ with $V = ρ^0, φ$. We work within the context of two constrained MSSM scenarios: the CMSSM and NUHM. A full one-(SUSY)loop computation is presented and the importance of the various contributions, the $γ$-, $Z$-, and Higgs bosons mediated ones are analysed. The hadronization of quark bilinears is performed within the chiral framework. Some discrepancies in the predicted rates for BR($τ\\to μη$), BR($τ\\to μη'$) and BR($τ\\to μK^+K^-$) are found with respect to previous estimates, which will be commented here. These three channels will be shown to be the most competitive ones to test simultaneously the Lepton Flavour Violation and the Higgs sector. We further present here a set of approximate formulas for all the semileptonic channels which we believe can be useful for further comparison with present and future data. △ Less", "We analyze the quark-gluon induced process $u g\\to \\tilde d\\tchi_i^+$, including the one loop electroweak (EW) effects in the minimal supersymmetric model (MSSM). This process is determined by four helicity amplitudes, three of which are violating helicity conservation, and another one which respects it and is logarithmically enhanced at high energy. Combining this $u g\\to \\tilde d\\tchi_i^+$ analysis with a corresponding one for $u g \\to d W^+$, we obtain simple approximate relations between the two processes, testing the MSSM structure at the amplitude and the cross section levels. These relations become exact at asymptotic energies and, provided the SUSY scale is not too heavy, they may be approximately correct at LHC energies also. In addition to these, we study the 1loop EW corrections to the inclusive $\\tilde d\\tchi_i^+$ production at LHC, presenting as examples, the $p_T$ and angular distributions. Comparing these to the corresponding predictions for $W$+jet production derived earlier, provides an accurate test of the supersymmetric assignments. △ Less", "The sensitivity of the lightest supersymmetric particle relic density calculation to the variation of the cosmological expansion rate before nucleosynthesis is discussed. We show that such a modification, even extremely modest and with no consequence on the cosmological observations, can greatly enhance the calculated relic density, and therefore change the constraints on the SUSY parameter space drastically. We illustrate this variation in two examples of SUSY models, and show that it is unsafe to use the lower bound of the WMAP limits in order to constrain supersymmetry. We therefore suggest to use only the upper value Omega_DM h^2 < 0.135. △ Less", "Simple SUSY GUT models based on the gauge group SO(10) require t-b-τYukawa coupling unification, in addition to gauge coupling and matter unification. The Yukawa coupling unification places strong constraints on the expected superparticle mass spectrum, with scalar masses \\sim 10 TeV while gaugino masses are quite light. A problem generic to all supergravity models comes from overproduction of gravitinos in the early universe: if gravitinos are unstable, then their late decays may destroy the predictions of Big Bang nucleosynthesis. We present a Yukawa-unified SO(10) SUSY GUT scenario which avoids the gravitino problem, gives rise to the correct matter-antimatter asymmetry via non-thermal leptogenesis, and is consistent with the WMAP-measured abundance of cold dark matter due to the presence of an axino LSP. To maintain a consistent cosmology for Yukawa-unified SUSY models, we require a re-heat temperature T_R\\sim 10^6-10^7 GeV, an axino mass around \\sim 0.1-10 MeV, and a PQ breaking scale f_a\\sim 10^{12} GeV. △ Less", "There have been many theoretical models constructed which aim to explain the neutrino masses and mixing patterns. While many of the models will be eliminated once more accurate determinations of the mixing parameters, especially $\\sin^2 2θ_{13}$, are obtained, charged lepton flavor violation (LFV) experiments are able to differentiate even further among the models. In this paper, we investigate various rare LFV processes, such as $\\ell_{i} \\to \\ell_{j} + γ$ and $μ-e$ conversion, in five predictive supersymmetric (SUSY) SO(10) models and their allowed soft-SUSY breaking parameter space in the constrained minimal SUSY standard model. Utilizing the Wilkinson Microwave Anisotropy Probe dark matter constraints, we obtain lower bounds on the branching ratios of these rare processes and find that at least three of the five models we consider give rise to predictions for $μ\\to e + γ$ that will be tested by the MEG Collaboration at PSI. In addition, the next generation $μ-e$ conversion experiment has sensitivity to the predictions of all five models, making it an even more robust way to test these models. While generic studies have emphasized the dependence of the branching ratios of these rare processes on the reactor neutrino angle $θ_{13}$ and the mass of the heaviest right-handed neutrino $M_3$, we find very massive $M_3$ is more significant than large $θ_{13}$ in leading to branching ratios near to the present upper limits. △ Less", "This collection of studies on new physics at the LHC constitutes the report of the supersymmetry working group at the Workshop `Physics at TeV Colliders', Les Houches, France, 2007. They cover the wide spectrum of phenomenology in the LHC era, from alternative models and signatures to the extraction of relevant observables, the study of the MSSM parameter space and finally to the interplay of LHC observations with additional data expected on a similar time scale. The special feature of this collection is that while not each of the studies is explicitely performed together by theoretical and experimental LHC physicists, all of them were inspired by and discussed in this particular environment. △ Less", "We present brief synopses of supersymmetric models where either the neutralino composition or its mass is adjusted so that thermal relic neutralinos from the Big Bang saturate the measured abundance of cold dark matter in the universe. We first review minimal supergravity (mSUGRA), and then examine its various one-parameter extensions where we relax the assumed universality of the soft supersymmetry breaking parameters. Our goal is to correlate relic-density-allowed parameter choices with expected phenomena in direct, indirect and collider dark matter search experiments. For every non-universal model, we first provide plots to facilitate the selection of ``dark-matter allowed'' parameter space points, and then present salient features of each model with respect to searches at Tevatron, LHC and ILC and also direct and indirect dark matter searches. We present benchmark scenarios that allow one to compare and contrast the non-universal models with one another and with the paradigm mSUGRA framework. We show that many implications about sparticle properties and collider signals drawn from the analysis of the relic density constraint within mSUGRA do not carry over to simple one-parameter extensions of the mSUGRA framework. We find that in many relic-density-consistent models, there is one (or more) detectable edge in the invariant mass distribution of same-flavour, opposite sign dileptons in SUSY cascade decay events at the LHC. Finally, we scan the parameter space of these various models, requiring consistency with the LEP2 constraint on the chargino mass, and with the observed relic density, and examine prospects for direct and indirect dark matter detection. We find that in a large number of cases the mechanism that causes the early universe neutralino annihilation rate to be large (so as to produce the measured relic density) also enhances the direct detection rate, and often also the rates for indirect detection of neutralino dark matter. △ Less", "The observation of the Egret experiment of an excess of diffuse gamma rays with energies above E_γ=1 GeV has previously been interpreted in the context of the minimal supergravity model (mSUGRA) as coming from neutralino annihilation into mainly b-quarks in the galactic halo, with neutralino mass in the vicinity of 50-70 GeV. We observe that in order to obtain the correct relic abundance of neutralinos in accord with WMAP measurements, the corresponding neutralino-proton direct detection (DD) rates should be in excess of recent limits from the Xenon-10 collaboration. While it does not appear possible to satisfy the Egret, WMAP and Xenon-10 constraints simultaneously within the mSUGRA model, we find that it is easily possible in models with non-universal Higgs soft masses (NUHM). In either case, gluino pair production from m(gluino)\\sim 400-500 GeV should occur at large rates at the CERN LHC, and a gluino pair production signal should be visible with just 0.1 fb^{-1} of integrated luminosity. The NUHM interpretation predicts a rather light spectrum of heavy Higgs bosons with m_A\\sim 140-200 GeV over the whole parameter space which would interpret Egret data. Spin-independent DD rates are predicted to be just above 10^{-8} pb, within range of the next round of direct dark matter detection experiments. △ Less", "Leptogenesis is a class of scenarios where the baryon asymmetry of the Universe is produced from a lepton asymmetry generated in the decays of a heavy sterile neutrino. We explain the motivation for leptogenesis. We review the basic mechanism, and describe subclasses of models. We then focus on recent developments in the understanding of leptogenesis: finite temperature effects, spectator processes, and in particular the significance of flavor physics. △ Less", "We have computed the complete one-loop electroweak effects in the MSSM for single top (and single antitop) production in the $t$-channel at hadron colliders, generalizing a previous analysis performed for the dominant $dt$ final state and fully including QED effects. The results are quite similar for all processes. The overall Standard Model one-loop effect is small, of the few percent size. This is due to a compensation of weak and QED contributions that are of opposite sign. The genuine SUSY contribution is generally quite modest in the mSUGRA scenario. The experimental observables would therefore only practically depend, in this framework, on the CKM $Wtb$ coupling. △ Less", "We analyze a supersymmetry (SUSY) breaking model proposed by Intriligator, Seiberg and Shih in a supergravity (SUGRA) framework. This is a simple and natural setup which demands neither extra superpotential interactions nor an additional gauge symmetry. In the SUGRA setup, the U(1)R symmetry is explicitly broken by the constant term in the superpotential, and pseudo-moduli field naturally takes non-zero vacuum expectation value through a vanishing cosmological constant condition. Sfermions tend to be heavier than gauginos, and the strong-coupling scale is determined once a ratio of sfermion to gaugino masses is fixed. △ Less", "Superconformal anomalies provide an elegant and economical way to understand the soft breaking parameters in SUSY models; however, implementing them leads to the several undesirable features including: tachyonic sleptons and electroweak symmetry breaking problems in both the MSSM and the NMSSM. Since these two theories also have the additonal problem of massless neutrinos, we have reconsidered the AMSB problems in a class of models that extends the NMSSM to explain small neutrino masses via the seesaw mechanism. In a recent paper, we showed that for a class of minimal left-right extensions, a built-in mechanism exists which naturally solves the tachyonic slepton problem and provides new alternatives to the MSSM that also have automatic R-parity conservation. In this paper, we discuss how electroweak symmetry breaking arises in this model through an NMSSM-like low energy theory with a singlet VEV, induced by the structure of the left-right extension and of the right magnitude. We then study the phenomenological issues and find: the LSP is an Higgsino-wino mix, new phenomenology for chargino decays to the LSP, degenerate same generation sleptons and a potential for a mild squark-slepton degeneracy. We also discuss possible collider signatures and the feasibility of dark matter in this model. △ Less", "At present, there are discrepancies between the measurements of several observables in B-->pi K decays and the predictions of the standard model (the ``B-->pi K puzzle''). Although the effect is not yet statistically significant -- it is at the level of $\\gsim 3σ$ -- it does hint at the presence of new physics. In this paper, we explore whether supersymmetry (SUSY) can explain the B-->pi K puzzle. In particular, we consider the SUSY model of Grossman, Neubert and Kagan (GNK). We find that it is extremely unlikely that GNK explains the B-->pi K data. We also find a similar conclusion in many other models of SUSY. And there are serious criticisms of the two SUSY models that do reproduce the B-->pi K data. If the B-->pi K puzzle remains, it could pose a problem for SUSY models. △ Less", "The relation between the Hubble constant and the scale of supersymmetry breaking is investigated in models of inflation dominated by a string modulus. Usually in this kind of models the gravitino mass is of the same order of magnitude as the Hubble constant which is not desirable from the phenomenological point of view. It is shown that slow-roll saddle point inflation may be compatible with a low scale of supersymmetry breaking only if some corrections to the lowest order Kahler potential are taken into account. However, choosing an appropriate Kahler potential is not enough. There are also conditions for the superpotential, and e.g. the popular racetrack superpotential turns out to be not suitable. A model is proposed in which slow-roll inflation and a light gravitino are compatible. It is based on a superpotential with a triple gaugino condensation and the Kahler potential with the leading string corrections. The problem of fine tuning and experimental constraints are discussed for that model. △ Less", "We consider models built on $AdS_5\\otimes S^5/Γ$ orbifold compactifications of the type $IIB$ superstring, where $Γ$ is the abelian group $Z_n$. An attractive three family $\\mathcal{N}=0$ SUSY model is found for $n=7$ that is a modified Pati--Salam Model which reduced to the Standard Model after symmetry breaking. △ Less", "We discuss a grand unified model based on SUSY SU(5) in extra dimensions and on the flavour group A4xU(1) which, besides reproducing tri-bimaximal mixing for neutrinos with the accuracy required by the data, also leads to a natural description of the observed pattern of quark masses and mixings. △ Less", "We present an improved method of reconstructing New Physics (NP) masses from invariant mass endpoints. While the traditional method focuses on a single NP decay, our method considers the decays of two or more NP particles ($ABC...$) in a grander decay chain: $ anything \\to ABC... \\to ... \\to jets + leptons$. Though the center-of-mass energy $E_{CM}$ of `anything' varies unpredictably at a hadron collider, a sample of many events nonetheless expresses features of threshold production $E_{CM} = m_A + m_B + ...$: invariant masses constructed from the final jet and lepton momenta are correlated in a way that makes their threshold endpoints visually obvious in a scatterplot. We illustrate this technique for the production of two neutralinos in the MSSM: $anything \\to \\widetildeχ_{i}^0 \\widetildeχ_{j}^0$ ($i,j=2,3,4$) which subsequently decay via on- or off-shell sleptons to four leptons. Assuming the relevant SUSY spectrum is below $1 TeV$ and squarks/gluinos eventually decay to neutralinos, our MC study shows that one low-luminosity year at the LHC ($10-30 fb^{-1}$) can quantitatively determine on- versus off-shell decays and find the relevant neutralino and slepton masses to less than 10 percent. △ Less", "Applying realistic veto efficiencies for the low angle electromagnetic calorimeter located in the very forward direction of the future international linear collider, we revisited the Standard Model background contributions studied previously in stau analyses with supersymmetrical dark matter scenarios. △ Less", "We investigate the decay of particles with the quantum numbers of the gluino. Besides SUSY, such particles may be present in models where the Higgs and top are composite. We find that such 'composite' gluinos have decay signatures similar to those of gluinos in 'more minimal' SUSY type models. Though it is in principle possible to distinguish the two scenarios, we find that it will be a challenging task at the LHC. This puts into question the common lore that a gluino is an obvious 'smoking-gun' signature of SUSY. △ Less", "We address the viability of exact Yukawa unification in the context of general SUSY GUTs with universal soft-breaking sfermion and gaugino mass terms at the GUT scale. We find that this possibility is challenged, unless the squark spectrum is pushed well above the limits allowed by naturalness. This conclusion is assessed through a global fit using electroweak observables and quark flavour-changing neutral current (FCNC) processes. The problem is mostly the impossibility of accommodating simultaneously the bottom mass and the BR(B --> Xs gamma), after the stringent CDF upper bound on the decay Bs --> mu^+ mu^- is taken into account, and under the basic assumption that the b --> s gamma amplitude have like sign with respect to the Standard Model one, as indicated by the B --> Xs l^+ l^- data. With the same strategy, we also consider the possibility of relaxing Yukawa unification to b - tau Yukawa unification. We find that with small departures from the condition tan beta ~= 50, holding when Yukawa unification is exact, the mentioned tension is substantially relieved. We emphasize that in the region where fits are successful the lightest part of the SUSY spectrum is basically fixed by the requirements of b - tau unification and the applied FCNC constraints. As such, it is easily falsifiable once the LHC turns on. △ Less", "Traditional searches for SUSY at hadron colliders rely heavily on the presence of large missing transverse energy (ME_T) to reject background compared to signal. On the other hand, initial searches for new physics at the LHC may not be able to rely on ME_T due to a variety of detector calibration issues. We show that much of SUSY parameter space is accessible to discovery even {\\it without} using ME_T, and with rather low integrated luminosities 0.1-1 fb^{-1}. A key role is played by isolated lepton multiplicity which arises from gluino and squark cascade decays. Requiring \\ge 3 isolated leptons plus jets yields a high rate of background rejection compared to signal. We find an LHC reach in m(gluino) of about 700-750 GeV for just 0.1 fb^{-1} of integrated luminosity by requiring events with \\ge 4 jets plus \\ge 3 isolated leptons but {\\it without} using ME_T. If a large enough event sample is assembled, then kinematic reconstruction of sparticle mass properties should be possible just as in the case where large ME_T is required. SUSY without ME_T can also be seen in opposite-sign/same flavor {\\it dilepton plus jets} events when a characteristic invariant mass edge stands out against background. △ Less", "With sufficient data, Large Hadron Collider (LHC) experiments can constrain the selectron-smuon mass splitting through differences in the di-electron and di-muon edges from supersymmetry (SUSY) cascade decays. We study the sensitivity of the LHC to this mass splitting, which within mSUGRA may be constrained down to O(10^{-4}) for 30 fb^{-1} of integrated luminosity. Over substantial regions of SUSY breaking parameter space the fractional edge splitting can be significantly enhanced over the fractional mass splitting. Within models where the selectron and smuon are constrained to be universal at a high scale, edge splittings up to a few percent may be induced by renormalisation group effects and may be significantly discriminated from zero. The edge splitting provides important information about high-scale SUSY breaking terms and should be included in any fit of LHC data to high-scale models. △ Less", "We discuss the production of single top-quark final states by direct supersymmetric flavor-changing interactions at the LHC. The total cross section pp(gg)->t\\bar{c}+\\bar{t}c is computed at the 1-loop order within the unconstrained MSSM. We prove that SUSY-QCD effects may furnish sizeable production rates amounting up to barely 10^5 t\\bar{c}(c\\bar{t}) events per 100 fb^{-1} of integrated luminosity, in full compliance with the stringent low-energy constraints from b->s gamma. Furthermore, we show that the cooperative SUSY-EW effects can be sizeable on their own, regardless of the SUSY-QCD contribution, with maximum production rates of the order of 10^3 events per 100 fb^{-1}. Owing to the fact that FCNC production of electrically neutral heavy-quark pairs is virtually absent within the SM, we conclude that the observation of such pp(gg)->t\\bar{c}+\\bar{t}c processes at the LHC could lead to evidence of new physics - of likely supersymmetric nature. △ Less", "Combined analyses at the Large Hadron Collider and at the International Linear Collider are important to reveal precisely the new physics model as, for instance, supersymmetry. Examples are presented where ILC results as input for LHC analyses could be crucial for the identification of signals as well as of the underlying model. The synergy of both colliders leads also to rather accurate SUSY parameter determination and powerful mass constraints even if the scalar particles have masses in the multi-TeV range. △ Less", "In the Standard Model with Minimal Supersymmetry, the Lagrangian contains complex parameters which lead to additional CP violation. We study CP violating asymmetries in the decays of the MSSM charged Higgs boson, induced by loop corrections with intermediate SUSY particles, and perform analytical and numerical analysis. The decay rate asymmetry can go up to 25% and the forward-backward asymmetry can reach up to 10%. △ Less", "The conventional method using low energy theorems [3] does not seem to lead to an explicit unitarity limit in the scattering processes of longitudinally polarized gauge bosons for the high energy case in the extra U(1) superstring inspired models, commonly known as eta model, emanating from E6 group of superstring theory. We have made use of an alternative procedure given in [14], which is applicable to SUSY GUT. Explicit unitarity bounds on the Yukawa couplings are obtained from both using unitarity constraints as well as using RGE analysis at one-loop level utilizing critical couplings concepts implying divergence of scalar coupling at MG. These are found to be consistent with finiteness over the entire range MZ<=sqrt(s)<=MG. For completeness, the similar approach has been made use of in other models, i.e., chi, psi, and nu models emanating from E6 and it has been noticed that at weak scale, the unitarity bounds on Yukawa couplings do not differ among E6 extra U(1) models significantly except for the case of chi model in 16 representations. Theoretically we have obtained the upper bounds on top quark and lightest neutral higgs boson mass using the unitarity constrained superpotential couplings and also obtained the D-quark mass as a function of MZ2 is O(3 TeV) for MZ2 is O(1 TeV). The obtained bounds on these physical parameters are found consistent with the present day experimental precision measurements. △ Less", "One interpretation of proton stability is the existence of extra-flat directions of the MSSM, in particular $u^{c}u^{c}d^{c}e^{c}$ and $QQQL$, where the operators lifting the potential are suppressed by a mass scale $Λ$ which is much larger than the Planck mass, $ Λ\\gae 10^{26} \\GeV$. Using D-term hybrid inflation as an example, we show that such flat directions can serve as the inflaton in SUSY inflation models. The resulting model is a minimal version of D-term inflation which requires the smallest number of additional fields. In the case where $Q$-balls form from the extra-flat direction condensate after inflation, successful Affleck-Dine baryogenesis is possible if the suppression mass scale is $\\gae 10^{31}-10^{35} \\GeV$. In this case the reheating temperature from $Q$-ball decay is in the range $3-100 \\GeV$, while observable baryon isocurvature perturbations and non-thermal dark matter are possible. In the case of extra-flat directions with a large $t$ squark component, there no $Q$-ball formation and reheating is via conventional condensate decay. In this case the reheating temperature is in the range $1-100 \\TeV$, naturally evading thermal gravitino overproduction while allowing sphaleron erasure of any large B-L asymmetry. △ Less", "Simple supersymmetric grand unified models based on the gauge group SO(10) require --in addition to gauge and matter unification-- the unification of t-b-τYukawa couplings. Yukawa unification, however, only occurs for very special values of the soft SUSY breaking parameters. We perform a search using a Markov Chain Monte Carlo (MCMC) technique to investigate model parameters and sparticle mass spectra which occur in Yukawa-unified SUSY models, where we also require the relic density of neutralino dark matter to saturate the WMAP-measured abundance. We find the spectrum is characterizd by three mass scales: first/second generation scalars in the multi-TeV range, third generation scalars in the TeV range, and gauginos in the \\sim 100 GeV range. Most solutions give far too high a relic abundance of neutralino dark matter. The dark matter discrepancy can be rectified by 1. allowing for neutralino decay to axino plus photon, 2. imposing gaugino mass non-universality or 3. imposing generational non-universality. In addition, the MCMC approach finds 4. a compromise solution where scalar masses are not too heavy, and where neutralino annihilation occurs via the light Higgs h resonance. By imposing weak scale Higgs soft term boundary conditions, we are also able to generate 5. low μ, m_A solutions with neutralino annihilation via a light A resonance, though these solutions seem to be excluded by CDF/D0 measurements of the B_s\\to μ^+μ^- branching fraction. Based on the dual requirements of Yukawa coupling unification and dark matter relic density, we predict new physics signals at the LHC from pair production of 350--450 GeV gluinos. The events are characterized by very high b-jet multiplicity and a dilepton mass edge around mz2-mz1 \\sim 50-75 GeV. △ Less", "We study concretely several issues altogether, moduli stabilization, the dynamical supersymmetry (SUSY) breaking, the uplifting of SUSY anti-de Sitter (AdS) vacuum and the sequestering of hidden sector, in a simple supergravity model with a single extra dimension. The sequestering is achieved dynamically by a wavefunction localization in extra dimension. The expressions for the visible sector soft SUSY breaking terms as well as the hidden sector potential are shown explicitly in our model. We find that the tree-level soft scalar mass and the A-term can be suppressed at a SUSY breaking Minkowski minimum where the radius modulus is stabilized, while gaugino masses would be a mirage type. △ Less", "A discrepancy between the Anomaly Mediated Supersymmetry Breaking (AMSB) gaugino mass calculated from the work of Kaplunovsky and Louis (hep-th/9402005) (KL) and other calculations in the literature is explained, and it is argued that the KL expression is the correct one relevant to the Wilsonian action. Furthermore it is argued that the AMSB contribution to the squark and slepton masses should be replaced by the contribution pointed out by Dine and Seiberg (DS) which has nothing to do with Weyl anomalies. This is not in general equivalent to the AMSB expression, and it is shown that there are models in which the usual AMSB expression would vanish but the DS one is non-zero. In fact the latter has aspects of both AMSB and gauge mediated SUSY breaking. In particular like the latter, it gives positive squared masses for sleptons. △ Less", "We present a realistic supersymmetric SU(5) model combined with a non-anomalous U(1)_F symmetry. We find a set of U(1)_F charges which automatically lead to the realistic mass hierarchy and mixing patterns for quarks, leptons and neutrinos. All gauge anomalies, including the [U(1)_F]^3 anomaly, are cancelled in our model without invoking the Green-Schwarz mechanism or having exotic fields. Proton decay mediated by dimension 5 operators is automatically suppressed in our model, because the scale set by the largest right-handed neutrino mass is much less than the GUT scale. △ Less", "We re-analyse the effect of corrections from canonical normalisation of kinetic terms on the quark and lepton mixing angles. This type of corrections emerges, for example, from effective higher-dimensional Kahler potential operators in the context of locally supersymmetric models of flavour. In contrast to previous studies we find that the necessary procedure of redefining the fields in order to restore canonically normalised kinetic terms, i.e. canonical normalisation, can lead to significant corrections to the fermion mixing angles (as determined from the superpotential). Such potentially large effects are characteristic of flavour models based on non-Abelian family symmetries, where some of the possible Kahler potential (and superpotential) operators, in particular those associated with the third family, are only mildly suppressed. We investigate under which conditions the messenger sector of such flavour models generates such Kahler potential operators for which the canonical normalisation effects are sizeable, and under which conditions these operators may be absent and canonical normalisation effects are small. As explicit examples for potentially relevant CN effects, we will discuss the corrections to the CKM matrix element |V_{cb}| as well as corrections to tri-bimaximal neutrino mixing. △ Less", "We present the first detailed, large-scale study of the Minimal Supersymmetric Standard Model (MSSM) at a $\\sqrt s=500$ GeV International Linear Collider, including full Standard Model backgrounds and detector simulation. We investigate 242 points in the MSSM parameter space, which we term models, that have been shown by Arkani-Hamed et al to be difficult to study at the LHC. In fact, these points in MSSM parameter space correspond to 162 pairs of models which give indistinguishable signatures at the LHC, giving rise to the so-called LHC Inverse Problem. We first determine whether the production of the various SUSY particles is visible above the Standard Model background for each of these parameter space points, and then make a detailed comparison of their various signatures. Assuming an integrated luminosity of 500 fb$^{-1}$, we find that only 82 out of 242 models lead to visible signatures of some kind with a significance $\\geq 5$ and that only 57(63) out of the 162 model pairs are distinguishable at $5(3)σ$. Our analysis includes PYTHIA and CompHEP SUSY signal generation, full matrix element SM backgrounds for all $2\\to 2, 2\\to 4$, and $2\\to 6$ processes, ISR and beamstrahlung generated via WHIZARD/GuineaPig, and employs the fast SiD detector simulation org.lcsim. △ Less", "A new technique for improving the precision of measurements of SUSY particle masses at the LHC is introduced. The technique involves kinematic fitting of events with two fully identified decay chains. We incorporate both event ETmiss constraints and independent constraints provided by kinematic end-points in experiment invariant mass distributions of SUSY decay products. Incorporation of the event specific information maximises the information used in the fit and is shown to reduce the mass measurement uncertainites by ~30% compared to conventional fitting of experiment end-point constraints for the SPS1a benchmark model. △ Less", "We propose a new solution to the supersymmetric flavor problem without flavor-blind mediation. Our proposal is to enforce a continuous or a suitably large discrete R-symmetry on weak scale supersymmetry, so that Majorana gaugino masses, trilinear A-terms, and the mu-term are forbidden. We find that replacing the MSSM with an R-symmetric supersymmetric model allows order one flavor-violating soft masses, even for squarks of order a few hundred GeV. The minimal R-symmetric supersymmetric model contains Dirac gaugino masses and R-symmetric Higgsino masses with no left-right mixing in the squark or slepton sector. Dirac gaugino masses of order a few TeV with vanishing A-terms solve most flavor problems, while the R-symmetric Higgs sector becomes important at large tan(beta). epsilon_K can be accommodated if CP is preserved in the SUSY breaking sector, or if there is a moderate flavor degeneracy, which can arise naturally. epsilon'/epsilon, as well as neutron and electron EDMs are easily within experimental bounds. The most striking phenomenological distinction of this model is the order one flavor violation in the squark and slepton sector, while the Dirac gaugino masses tend to be significantly heavier than the corresponding squark and slepton masses. △ Less", "We compute the three-body decays of charged sleptons and sneutrinos into other sleptons. These decays are of particular interest in SUSY-breaking models with non-universal Higgs mass parameters, where the left-chiral sleptons can be lighter than the right-chiral ones, and lighter than the lightest neutralino. We present the formulas for the three-body decay widths together with a numerical analysis in the context of gaugino-mediated SUSY breaking with a gravitino LSP. △ Less", "A bilinear R-Parity breaking SUSY model for neutrino mass and mixing predicts the lightest superparticle to decay mainly into a pair of tau leptons or b quarks along with a neutrino for relatively light SUSY spectra. This leads to a distinctive triple bang signature of SUSY events at ultrahigh energy neutrino telescopes like IceCube or Antares. While the expected signal size is only marginal at IceCube, it will be promising for a future multi-km^3 size neutrino telescope. △ Less", "We estimate the bounds on Higgs and sparticle masses and discuss their correlations in the constrained minimal supersymmetric standard model (CMSSM). In our analysis we have applied the present constraints from collider and low energy experiments, as well as the experimental bound on cold dark matter from WMAP. For a given lightest Higgs boson mass, which is expected to be measured with good precision at the LHC, we find important correlations between the Higgs and sparticle masses which allows one to delineate the MSSM model parameters and particle spectra. We have also demonstrated an important complementarity between the LHC and direct dark matter detection experiments emphasizing that by including the experimental input both from collider physics and from dark matter detection experiments, one would significantly improve the measurement of the SUSY spectrum and the underlying parameter space. △ Less", "We show a calculable example of stable supersymmetry (SUSY) breaking models with O(10) eV gravitino mass based on the combination of D-term gauge mediation and U(1)' mediation. A potential problem of the negative mass squared for the SUSY standard model (SSM) sfermions in the D-term gauge mediation is solved by the contribution from the U(1)' mediation. On the other hand, the splitting between the SSM gauginos and sfermions in the U(1)' mediation is circumvented by the contributions from the D-term gauge mediation. Since the U(1)' mediation does not introduce any new SUSY vacua, we achieve a completely stable model under thermal effects. Our model, therefore, has no cosmological difficulty. △ Less", "In the minimal supersymmetric extension of the Standard Model (MSSM), if the two Higgs doublets are lighter than some subset of the superpartners of the Standard Model particles, then it is possible to integrate out the heavy states to obtain an effective broken-supersymmetric low-energy Lagrangian. This Lagrangian can contain dimension-four gauge invariant Higgs interactions that violate supersymmetry (SUSY). The \"wrong-Higgs\" Yukawa couplings generated by one-loop radiative corrections are a well known example of this phenomenon. In this paper, we examine gauge invariant gaugino--higgsino--Higgs boson interactions that violate supersymmetry. Such wrong-Higgs gaugino couplings can be generated in models of gauge-mediated SUSY-breaking in which some of the messenger fields couple to the MSSM Higgs bosons. In regions of parameter space where the messenger scale is low and tan(beta) is large, these hard SUSY-breaking operators yield tan(beta)-enhanced corrections to tree-level supersymmetric relations in the chargino and neutralino sectors that can be as large as 20%. We demonstrate how physical observables in the chargino sector can be used to isolate the tan(beta)-enhanced effects derived from the wrong-Higgs gaugino operators. △ Less", "We have calculated the leading Yukawa corrections to the chargino, neutralino and gluino pole masses in the DR-bar scheme in the Minimal Supersymmetric Standard Model (MSSM) with the full set of complex parameters. We have performed a numerical analysis for a particular point in the parameter space and found typical corrections of a few tenths of a percent thus exceeding the experimental resolution as expected at the ILC. We provide a computer program which calculates two-loop pole masses for SUSY fermions with complex parameters up to the respective order in pertubation theory. △ Less", "We study the mechanism of particle production in the world-volume of a probe anti D6-brane (or D6 with SUSY breaking) moving in the background created by a fixed stack of $D6$-branes. We show that this may occur in a regime of parametric resonance when the probe's motion is non-relativistic and it moves at large distances from the source branes in low eccentricity orbits. This leads to an exponential growth of the particle number in the probe's world-volume and constitutes an effective mechanism for producing very massive particles. We also analyze the evolution of this system in an expanding universe and how this affects the development of the parametric resonance. We discuss the effects of transverse space compactification on the probe's motion, showing that it leads to the creation of angular momentum in a similar way to the Affleck-Dine mechanism for baryogenesis. Finally, we describe possible final states of the system and their potential relevance to cosmology. △ Less", "We study the possible phenomenology of a three-family Pati-Salam model constructed from intersecting D6-branes in Type IIA string theory on the T^6/(Z2 x Z2) orientifold with some desirable semi-realistic features. In the model, tree-level gauge coupling unification is achieved automatically at the string scale, and the gauge symmetry may be broken to the Standard Model (SM) close to the string scale. The small number of extra chiral exotic states in the model may be decoupled via the Higgs mechanism and strong dynamics. We calculate the possible supersymmetry breaking soft terms and the corresponding low-energy supersymmetric particle spectra which may potentially be tested at the Large Hadron Collider (LHC). We find that for the viable regions of the parameter space the lightest CP-even Higgs boson mass usually satisfies m_H < 120 GeV, and the observed dark matter density may be generated. Finally, we find that it is possible to obtain correct SM quark masses and mixings, and the tau lepton mass at the unification scale. Additionally, neutrino masses and mixings may be generated via the seesaw mechanism. Mechanisms to stabilize the open and closed-string moduli, which are necessary for the model to be truly viable and to make definite predictions are discussed. △ Less", "In this work we re-examine the correlation between B(d,s)-anti-B(d,s) mixing and Lepton Flavour Violation in the light of recent experimental measurements in the $B_s$ system. We perform a generic SUSY analysis of the allowed down squark mass insertion parameter space. In the SUSY GUT scenario this parameter space is then used to make predictions for LFV branching ratios. We find that the recent measurement for the CP phase $φ_s$ excludes the lowest rates for tau --> mu + gamma and provides a lower bound of ~ 3E-9 for tan beta = 10. Future experimental improvements in the bound on tau --> mu + gamma and the measurement of phi(s) will constitute a strong test of the SUSY GUT scenario. △ Less", "We re-examine constraints from the recent evidence for observation of the lifetime difference in D^0 - \\bar{D}^0 mixing on the parameters of supersymmetric models with R-parity violation (RPV). We find that RPV SUSY can give large negative contribution to the lifetime difference. We also discuss the importance of the choice of weak or mass basis when placing the constraints on RPV-violating couplings from flavor mixing experiments. △ Less", "We consider the six-dimensional Salam-Sezgin supergravity in the presence of codimension-2 branes. In the case that the branes carry only tension, we provide a way to supersymmetrise them by adding appropriate localised Fayet-Iliopoulos terms and localised corrections to the Chern-Simons term and modifying accordingly the fermionic supersymmetry transformations. The resulting brane action has N=1 supersymmetry (SUSY). We find the axisymmetric vacua of the system and show that one has unwarped background solutions with \"football\"-shaped extra dimensions which always respect N=1 SUSY for any value of the equal brane tensions, in contrast with the non-supersymmetric brane action background. Finally, we generically find multiple zero modes of the gravitino in this background and discuss how one could obtain a single chiral zero mode present in the low energy spectrum. △ Less", "At the quark level there are basically two types of contributions of R-parity violating SUSY (RPV SUSY) to neutrinoless double beta decay: the short-range contribution involving only heavy virtual superpartners and the long-range one with the virtual squark and neutrino. Hadronization of the effective operators, corresponding to these two types of contributions, may in general involve virtual pions in addition to the close on-mass-shell nucleons. It is known that the short-range contribution is dominated by the pion exchange. In the present paper we show that this is also true for the long-range RPV SUSY contribution and, therefore, the RPV SUSY contributes to the neutrinoless double beta decay dominantly via charged pion exchange between the decaying nucleons. △ Less", "We study flavor-changing neutral current and CP violations in the minimal supersymmetric left-right model. We calculate the beyond-standard-model contributions to the neutral kaon mixing $ΔM_K$ and $ε$, and find possible to have a numerical cancelation between the contributions from the right-handed gauge boson and supersymmetric box diagram. With the cancelation, the right-handed $W$-boson mass scale can be lowered to about 2 TeV, well within the search limit of LHC. △ Less", "We present a stringy realization of the ISS metastable SUSY breaking model with moduli stabilization. The mass moduli of the ISS model is stabilized by gauging of a U(1) symmetry and its D-term potential. The SUSY is broken both by F-terms and D-terms. It is possible to obtain de-Sitter vacua with a vanishingly small cosmological constant by an appropriate fine-tuning of flux parameters. △ Less", "(Abridged) We study dissipative inflation in the regime where the dissipative term takes a specific form, Γ=Γ(φ), analyzing two models in the weak and strong dissipative regimes with a SUSY breaking potential. After developing intuition about the predictions from these models through analytic approximations, we compute the predicted cosmological observables through full numerical evolution of the equations of motion, relating the mass scale and scale of dissipation to the characteristic amplitude and shape of the primordial power spectrum. We then use Markov Chain Monte Carlo techniques to constrain a subset of the models with cosmological data from the cosmic microwave background (WMAP three-year data) and large scale structure (SDSS Luminous Red Galaxy power spectrum). We find that the posterior distributions of the dissipative parameters are highly non-Gaussian and their allowed ranges agree well with the expectations obtained using analytic approximations. In the weak regime, only the mass scale is tightly constrained; conversely, in the strong regime, only the dissipative coefficient is tightly constrained. A lower limit is seen on the inflation scale: a sub-Planckian inflaton is disfavoured by the data. In both weak and strong regimes, we reconstruct the limits on the primordial power spectrum and show that these models prefer a {\\it red} spectrum, with no significant running of the index. We calculate the reheat temperature and show that the gravitino problem can be overcome with large dissipation, which in turn leads to large levels of non-Gaussianity: if dissipative inflation is to evade the gravitino problem, the predicted level of non-Gaussianity might be seen by the Planck satellite. △ Less", "We present a complete 1-loop study of the electroweak corrections to the process $ug\\to dW^+$ in MSSM and SM. The occurrence of a number of remarkable properties in the behavior of the helicity amplitudes at high energies is stressed, and the crucial role of the virtual SUSY contributions in establishing them, is emphasized. The approach to asymptopia of these amplitudes is discussed, comparing the effects of the logarithmic and constant contributions to the mass suppressed ones, which are relevant at lower energies. Applying crossing to $ug\\to d W^+$, we obtain all subprocesses needed for the 1-loop electroweak corrections to $W^\\pm$-production at LHC. The SUSY model dependence of such a production is then studied, and illustrations are given for the transverse $W^{\\pm}$ momentum distribution, as well as the angular distribution in the subprocess center of mass. △ Less", "We show how the SUSY flavour and CP problems can be solved using gauged SU(3) family symmetry previously introduced to describe quark and lepton masses and mixings, in particular neutrino tri-bimaximal mixing via constrained sequential dominance. The Yukawa and soft trilinear and scalar mass squared matrices and kinetic terms are expanded in powers of the flavons used to spontaneously break the SU(3) family symmetry, and the canonically normalized versions of these matrices are constructed. The soft mass matrices are then expressed in the Super-CKM basis, and the leading order mass insertion parameters are calculated, and are shown to satisfy the experimental constraints from flavour changing neutral current processes. Assuming that CP is spontaneously broken by the flavons, the next-to-leading order effects responsible for CP violation are then estimated, and the predictions for electric dipole moments are shown to be an order of magnitude more suppressed than those predicted from the constrained minimal supersymmetric standard model (CMSSM), and may be further suppressed if the high energy trilinear soft parameter is assumed to be relatively small. We also predict that, unlike in the CMSSM, epsilon_K'/epsilon_K may be dominated by the SUSY operator O_8. We also discuss the additional constraints from unification, which can lead to further predictions for flavour changing in our scheme. △ Less", "We study a supersymmetric extension of the Standard Model based on discrete A4xZ3xZ4 flavor symmetry. We obtain quark mixing angles as well as a realistic fermion mass spectrum and we predict tribimaximal leptonic mixing by a spontaneous breaking of A4. The top quark Yukawa interaction is present at the renormalizable level in the superpotential while all the other Yukawa interactions arise only at higher orders. We study the Higgs potential and show that it can potentially solve the so called vacuum alignment problem. The leading order predictions are not spoiled by subleading corrections. △ Less", "The running mass of the b-quark defined in DRbar-scheme is one of the important parameters of SUSY QCD. To find its value it should be related to some known experimental input. In this paper the b-quark running mass defined in nonsupersymmetric QCD is chosen for determination of corresponding parameter in SUSY QCD. The relation between these two quantities is found by considering five-flavor QCD as an effective theory obtained from its supersymmetric extension. A numerical analysis of the calculated two-loop relation and its impact on the MSSM spectrum is discussed. Since for nonsupersymmetric models MSbar-scheme is more natural than DRbar, we also propose a new procedure that allows one to calculate relations between MSbar- and DRbar-parameters. Unphysical epsilon-scalars that give rise to the difference between mentioned schemes are assumed to be heavy and decoupled in the same way as physical degrees of freedom. By means of this method it is possible to ``catch two rabbits'', i.e., decouple heavy particles and turn from DRbar to MSbar, at the same time. Explicit two-loop example of DRbar -> MSbar transition is given in the context of QCD. The advantages and disadvantages of the method are briefly discussed. △ Less", "We propose a unified explanation for the origin of dark matter and baryon number asymmetry on the basis of a non-supersymmetric model for neutrino masses. Neutrino masses are generated in two distinct ways, that is, a tree-level seesaw mechanism with a single right-handed neutrino, and one-loop radiative effects by a new additional doublet scalar. A spontaneously broken U(1)$^\\prime$ brings a $Z_2$ symmetry which restricts couplings of this new scalar and controls the neutrino masses. It also guarantees the stability of a CDM candidate. We examine two possible candidate for the CDM. We also show that the decay of a heavy right-handed neutrino related to the seesaw mechanism can generate baryon number asymmetry through leptogenesis. △ Less", "We compute, in the MSSM framework, the sum of the one-loop electroweak and of the total QED radiation effects for the process $pp \\to t W+X$, initiated by the parton process $bg\\to tW$. Combining these terms with the existing NLO calculations of SM and SUSY QCD corrections, we analyze the overall one-loop supersymmetric effects on the partial rates of the process, obtained by integrating the differential cross section up to a final variable invariant mass. We conclude that, for some choices of the SUSY parameters and for relatively small final invariant masses, they could reach the relative ten percent level, possibly relevant for a dedicated experimental effort at LHC. △ Less", "From several points of view it is strongly suggested that the current universe is unstable and will ultimately decay to one that is exactly supersymmetric (susy). The possibility that atoms and molecules form in this future universe requires that the degenerate electron/selectron mass is non-zero and hence that electroweak symmetry breaking (EWSB) survives the phase transition to exact susy. However, the minimal supersymmetric standard model (MSSM) and several of its extensions have no EWSB in the susy limit. Among the extended higgs models that have been discussed one stands out in this regard. The higgs sector that is revealed at the Large Hadron Collider (LHC) will therefore have implications for the future universe. We also address the question as to whether the transition to the exact susy phase with EWSB is exothermic. △ Less", "The identity of the quark-squark-gluino Yukawa coupling with the corresponding quark-quark-gluon QCD coupling in supersymmetric theories can be examined experimentally at the Large Hadron Collider (LHC). Extending earlier investigations of like-sign di-lepton final states, we include jets in the analysis of the minimal supersymmetric standard model, adding squark-gluino and gluino-pair production to squark-pair production. Moreover we expand the method towards model-independent analyses which cover more general scenarios. In all cases, squark decays to light charginos and neutralinos persist to play a dominant role. △ Less", "The diffuse Galactic $γ$-rays from EGRET observation shows excesses above 1 GeV in comparison with the expectations from conventional Galactic cosmic ray (CR) propagation model. In the work we try to solve the \"GeV excess\" problem by dark matter (DM) annihilation in the frame of supersymmetry (SUSY). Compared with previous works, there are three aspects improved in this work: first, the direction-independent \"boost factor\" for diffuse $γ$-rays from dark matter annihilation (DMA) is naturally reproduced by taking the DM substructures into account; second, there is no need for renormalization of the diffuse $γ$-ray background produced by CRs; last but not the least, in this work our new propagation model can give consistent results of both diffuse $γ$-rays and antiprotons, by directly adding the signals from DMA to the diffuse $γ$-ray background. This is a self-consistent model among several possible scenarios at present, and can be tested or optimized by the forthcoming experiments such as GLAST, PAMELA and AMS02. △ Less", "We present a detailed study of the quark and lepton mass spectra in a SO(10) framework with one 10_H and one \\bar{126}_H Higgs representations in the Yukawa sector. We consider in full generality the interplay between type-I and type-II seesaws for neutrino masses. We first perform a χ^2 fit of fermion masses independent on the detailed structure of the GUT Higgs potential and determine the regions in the parameter space that are preferred by the fermion mass sum rules. We then apply our study to the case of the minimal renormalizable SUSY SO(10) GUT with one 10_H, one \\bar{126}_H, one 126_H, and one 210_H Higgs representations. By requiring that proton decay bounds are fulfilled we identify a very limited area in the parameter space where all fermion data are consistently reproduced. We find that in all cases gauge coupling unification in the supersymmetric scenario is severely affected by the presence of lighter than GUT (albeit B-L conserving) states. We then conclusively show that the minimal supersymmetric SO(10) scenario here considered is not consistent with data. The fit of neutrino masses with type-I and type-II seesaws within a renormalizable SO(10) framework strongly suggests a non-SUSY scenario for gauge unification. △ Less", "We construct the Lagrangian of the ${\\cal N}=1$ four-dimensional generalized supersymmetric Nambu$-$Jona-Lasinio (SNJL) model, which has ${\\cal N}=1/2$ supersymmetry (SUSY) on non(anti)commutative superspace. A special attention is paid to the examination on the nonperturbative quantum dynamics: The phenomenon of dynamical-symmetry-breaking/mass-generation on the deformed superspace is investigated. The model Lagrangian and the method of SUSY auxiliary fields of composites are examined in terms of component fields. We derive the effective action, examine it, and solve the gap equation for self-consistent mass parameters. △ Less", "We investigate the phenomena of the dynamical chiral symmetry breaking (DCSB), color superconductivity (CSC), and Bose-Einstein condensation (BEC) in an ${\\cal N}=1$ four-dimensional generalized SUSY Nambu$-$Jona-Lasinio model at finite temperature and density. Both the ${\\cal N}=1$ four-dimensional and ${\\cal N}=2$ three-dimensional cases are considered. The ${\\cal N}=2$ three-dimensional theory is obtained by a simple dimensional reduction scheme of the four-dimensional counterpart. In order to realize the DCSB and BCS-type CSC in this model, we introduce a SUSY soft mass term. After adopting the method of SUSY auxiliary fields with the Fierz transformation in color and flavor spaces, we discuss several possible breaking schemes of the global symmetries of the model. The integrations of the auxiliary fields of composites in the effective potential are performed by using the steepest descent approximation. The roles of both the boson and fermion sectors in the BEC, DCSB and CSC are examined by the quasiparticle excitation spectra and the gap equations. The physical properties of the DCSB and the CSC are studied in detail, while that of the BEC is beyond scope of this paper. It is found that the BEC, DCSB and CSC can coexist under a condition of model parameters. △ Less", "We investigate the dynamical chiral symmetry breaking (DCSB) and superconductivity in a supersymmetric model at finite temperature and density. We employ the ${\\cal N}=1$ four-dimensional generalized supersymmetric Nambu$-$Jona-Lasinio model (${\\cal N}=1$ generalized ${\\rm SNJL}_{4}$) with a chemical potential as the model Lagrangian, and select the gauge freedom as U(1). In order to realize the DCSB and BCS-type superconductivity in this model, we introduce a SUSY soft mass term. Under the finite-temperature Matsubara formalism, the effective potential and the gap equations are derived in the flamework of the large-N expansion. The finite-density effect in the DCSB is shown by the critical coupling. The roles of both the boson and fermion sectors in the superconductivity are examined by the quasiparticle excitation spectra and the gap equations. △ Less", "We study the cancellations among Feynman diagrams that implement the Ward and Slavnov-Taylor identities corresponding to the conserved supersymmetry current in supersymmetric quantum field theories. In particular, we show that the Faddeev-Popov ghosts of gauge- and supersymmetries never decouple from the physical fields, even for abelian gauge groups. The supersymmetric Slavnov-Taylor identities provide efficient consistency checks for automatized calculations and can verify the supersymmetry of Feynman rules and the numerical stability of phenomenological predictions simultaneously. △ Less"]