["In this paper we consider a class of inflation models on the brane where the dominant part of the inflaton scalar potential does not depend on the inflaton field value during inflation. In particular, we consider supernatural inflation, its hilltop version, A-term inflation, and supersymmetric (SUSY) D- and F-term hybrid inflation on the brane. We show that the parameter space can be broadened, the inflation scale generally can be lowered, and still possible to have the spectral index $n_s=0.96$. △ Less", "I present a brief overview of a variety of computational tools for supersymmetry calculations, including: spectrum generators, cross section and branching fraction calculators, low energy constraints, general purpose event generators, matrix element event generators, SUSY dark matter codes, parameter extraction codes and Les Houches interface tools. △ Less", "Weak scale supersymmetry is a highly motivated extension of the Standard Model that has a strong degree of support from data. It provides several viable dark matter candidates: the lightest neutralino (a WIMP), the gravitino, and the axion/axino supermultiplet. The LHC turn-on is imminent. The discovery of supersymmetry at the LHC will go a long way towards establishing the nature of dark matter. I present arguments why mainly axion cold dark matter is a better fit for supersymmetric models than neutralinos. I also argue that Yukawa-unified SUSY GUT theories based on SO(10) with mixed axion/axino cold dark matter are extremely compelling, and present distinctive signatures for gluino pair production at the LHC. △ Less", "This lecture discusses the Higgs boson sector of the SM and the MSSM, including their connection to electroweak precision physics and the searches for SM and SUSY Higgs bosons at the LHC. △ Less", "We examine the prospects for testing SO(10) Yukawa-unified supersymmetric models during the first year of LHC running at \\sqrt{s}= 7 TeV, assuming integrated luminosity values of 0.1 to 1 fb^-1. We consider two cases: the Higgs splitting (HS) and the D-term splitting (DR3) models. Each generically predicts light gluinos and heavy squarks, with an inverted scalar mass hierarchy. We hence expect large rates for gluino pair production followed by decays to final states with large b-jet multiplicity. For 0.2 fb^-1 of integrated luminosity, we find a 5 sigma discovery reach of m(gluino) ~ 400 GeV even if missing transverse energy, E_T^miss, is not a viable cut variable, by examining the multi-b-jet final state. A corroborating signal should stand out in the opposite-sign (OS) dimuon channel in the case of the HS model; the DR3 model will require higher integrated luminosity to yield a signal in the OS dimuon channel. This region may also be probed by the Tevatron with 5-10 fb^-1 of data, if a corresponding search in the multi-b+ E_T^miss channel is performed. With higher integrated luminosities of ~1 fb^-1, using E_T^miss plus a large multiplicity of b-jets, LHC should be able to discover Yukawa-unified SUSY with m(gluino) up to about 630 GeV. Thus, the year 1 LHC reach for Yukawa-unified SUSY should be enough to either claim a discovery of the gluino, or to very nearly rule out this class of models, since higher values of m(gluino) lead to rather poor Yukawa unification. △ Less", "We compute the branching ratios for mu-> e gamma, tau-> mu gamma and tau -> e gamma in a supersymmetric model invariant under the flavour symmetry group A4 X Z3 X U(1)_{FN}, in which near tri-bimaximal lepton mixing is naturally predicted. At leading order in the small symmetry breaking parameter u, which is of the same order as the reactor mixing angle theta_{13}, we find that the branching ratios generically scale as u^2. Applying the current bound on the branching ratio of mu -> e gamma shows that small values of u or tan(beta) are preferred in the model for mass parameters m_{SUSY} and m_{1/2} smaller than 1000 GeV. The bound expected from the on-going MEG experiment will provide a severe constraint on the parameter space of the model either enforcing u approx 0.01 and small tan(beta) or m_{SUSY} and m_{1/2} above 1000 GeV. In the special case of universal soft supersymmetry breaking terms in the flavon sector a cancellation takes place in the amplitudes and the branching ratios scale as u^4, allowing for smaller slepton masses. The branching ratios for tau -> mu gamma and tau -> e gamma are predicted to be of the same order as the one for mu -> e gamma, which precludes the possibility of observing these tau decays in the near future. △ Less", "In models where supersymmetry-breaking is dominated by the Kahler moduli and/or the universal dilaton, the B-parameter at the unification scale should be consistent with the value of tan(beta) at the electroweak scale determined by minimization of the Higgs potential triggering REWSB. We study such models employing a self-consistent determination of the B-parameter. In particular, we study the viability of a generic model, as well as M-theory and Type IIB flux compactifications with modulus-dominated supersymmetric soft-terms from the GUT scale, M_{GUT}=2x10^{16}GeV. △ Less", "We investigate the potential of SUSY flat directions (FDs). Large FD vacuum expectation values (VEVs) can delay thermalisation and solve the gravitino problem - if FDs decay perturbatively. This depends on how many and which directions get the VEVs. Recently the decay of the FDs have been studied with the VEVs as input. Here we look at how the VEVs come about -- statistically and analytically. △ Less", "In case of the discovery of supersymmetry at the LHC, the goal will be to identify the underlying theory, its fundamental parameters, and the masses of SUSY particles. We followed here the approach to reconstruct the decay chains in SUSY events under the assumption of common intermediate masses. These masses cannot be extracted from each event because of the unmeasured LSP momenta in case of R-parity conservation. But an ensemble of events can be over-constrained, if the decay chains are long enough, such that enough mass constraints are available. Here, we present a new method combining a) a SUSY mass scan, b) a kinematic fitting based on a genetic algorithm for decay chain reconstruction, and c) the usage of angular decay information to suppress the background from other SUSY processes. Taking into account the full combinatorial background and experimental resolutions in the most difficult case of the fully hadronic decay mode, we demonstrate, within one SUSY scenario, that this method can be used to derive a probability map of the SUSY parameter space. △ Less", "In light of recent observations of an anomalous excess of high-energy positrons and electrons by the PAMELA and Fermi LAT experiments, we investigate exotic cosmic-ray signatures in scenarios with unstable dark matter that decays with an extremely long lifetime. We identify decay modes capable of explaining the observed anomalies and mention constraints arising from measurements of antiprotons and gamma rays. We also discuss complementary tests by measurements of anisotropies in diffuse gamma rays which should be accessible to Fermi. △ Less", "The supersymmetric finite threshold effects are studied in the presence of non minimal soft terms that can correct the problematic mass ratios of the light generations in the minimal SU(5) GUT. We show that with large soft A-terms, one can achieve simple unification for lighter generations without additional Higgs multiplet, while having sfermions lighter than 1 TeV. The presence of such large A-terms will distort the sfermion mass spectrum upon running from GUT scale down to the electroweak scale making it distinct from the universal SUSY breaking scenarios, especially in the first two generations. The implications of these splittings are studied in K and D meson oscillations and in rare processes D^+ -> pi^+ nu anti-nu and K^+ -> pi^+ nu anti-nu, and in the latter case the effect is found to be important. △ Less", "We discuss lepton flavor violation (LFV) in the context of SUSY breaking when the first-two generation sleptons are heavy. When the first-two generation sleptons are $\\mathcal{O}(5 {\\rm TeV})$ and have small mass-splittings, we find that a light third generation slepton is allowed even with the large mixing implied by neutrino oscillation experiments. As an application, we consider a gravity dual to single-sector SUSY breaking and show that it is compatible with both LFV constraints and oscillation measurements. △ Less", "The hybrid N=1/N=2 supersymmetric model predicts scalar gluons (sgluons) as SUSY partners of the Dirac gluino. Their strikingly distinct phenomenology at the CERN Large Hadron Collider is discussed. △ Less", "We revisit four generations within the context of supersymmetry. We compute the perturbativity limits for the fourth generation Yukawa couplings and show that if the masses of the fourth generation lie within reasonable limits of their present experimental lower bounds, it is possible to have perturbativity only up to scales around 1000 TeV. Such low scales are ideally suited to incorporate gauge mediated supersymmetry breaking, where the mediation scale can be as low as 10-20 TeV. The minimal messenger model, however, is highly constrained. While lack of electroweak symmetry breaking rules out a large part of the parameter space, a small region exists, where the fourth generation stau is tachyonic. General gauge mediation with its broader set of boundary conditions is better suited to accommodate the fourth generation. △ Less", "We discuss the interplay between LHC signatures and the mechanism by which dark matter is generated in the early universe in supersymmetric theories. The LHC signatures of two of the major mechanisms for such generation of dark matter which are known to be the Stau Coannihilation (Stau-Co) region and annihilation on the Hyperbolic Branch (HB) are exhibited in detail. By analyzing the various LHC signatures, including multi leptons, hadronic jets, b-tagging, and missing transverse momentum, one can discriminate between the Stau-Co region and the HB region for the mSUGRA model. Interestingly, there are some regions of the parameter space which are beyond the current and near future reach of the dark matter direct detection experiments but will be accessible at the LHC, and vise versa. △ Less", "In this talk I review some recent progress in heterotic and F theory model building. I then consider work in progress attempting to find the F theory dual to a class of heterotic orbifold models which come quite close to the MSSM. △ Less", "The rare decay B to K* (to K pi) mu+ mu- is regarded as one of the crucial channels for B physics since its angular distribution gives access to many observables that offer new important tests of the Standard Model and its extensions. We point out a number of correlations among various observables which will allow a clear distinction between different New Physics (NP) scenarios. Furthermore, we discuss the decay B to K* nu anti-nu which allows for a transparent study of Z penguin effects in NP frameworks in the absence of dipole operator contributions and Higgs penguin contributions. We study all possible observables in B to K* nu anti-nu and the related b to s transitions B to K nu anti-nu and B to X_s nu anti-nu in the context of the SM and various NP models. △ Less", "We present an analysis of low energy CP violating observables in the Minimal Supersymmetric Standard Model (MSSM). We focus on the predictions of CP violation in b -> s transitions in the framework of a flavor blind MSSM, where the CKM matrix remains the only source of flavor violation, but additional CP violating phases are introduced in the soft SUSY breaking sector. We find large and strongly correlated effects in Delta F = 0 observables like the electric dipole moments (EDMs) of the electron and the neutron, as well as in Delta F = 1 observables like the time dependent CP asymmetries in B -> phi K_s and B -> eta' K_s, the direct CP asymmetry in b -> s gamma and in several CP asymmetries in B -> K* mu+ mu-. On the other hand, observables that are only sensitive to CP violation in Delta F = 2 transitions, in particular the B_s mixing phase, are found to be SM like in this framework. We stress that only in presence of additional sources of flavor violation, sizeable New Physics effects to CP violation in meson mixing can occur. △ Less", "We explore the potential for the direct detection of light fermionic dark matter in neutrino detectors. We consider the possible observation of the process $\\bar{f} p \\to e^+ n$, where $f$ is a dark matter fermion, in a model-independent manner. All operators of dimension six or lower which can contribute to this process are listed, and we place constraints on these operators from decays of $f$ which contain $γ$ rays or electrons. One operator is found which is sufficiently weakly constrained that it could give observable interactions in neutrino detectors. We find that Super-Kamiokande can probe the new physics scale for this operator up to $O(100{TeV})$. △ Less", "We investigate the validity of using thermal masses in the kinematics of final states in the decay rate of heavy neutrinos in leptogenesis calculations. We find that using thermal masses this way is a reasonable approximation, but corrections arise through quantum statistical distribution functions and leptonic quasiparticles. △ Less", "We discuss the production of W bosons in association with three jets at the LHC. We investigate how next-to-leading order QCD corrections modify basic kinematic distributions of jets and leptons. We also address the magnitude of NLO QCD effects in W+3 jet observables, relevant for SUSY searches at the LHC. △ Less", "We consider a supersymmetric (SUSY) scenario including right-handed neutrinos, one of whose scalar superpartners is the lightest SUSY particle (LSP). The distinguishing feature in the collider signal of SUSY in such a case is not missing energy but a pair of charged tracks corresponding to the next-to- lightest SUSY particle, when it is, as in the case considered, a stau. Following up on our recent work on neutralino reconstruction in such cases, we explore the possibility of reconstructing charginos, too, through a study of transverse mass distributions in specified final states. The various steps of isolating the transverse momenta of neutrinos relevant for this are outlined, and regions of the parameter space where our procedure works are identified. △ Less", "We investigate the phenomenology of general gauge mediation in the MSSM. We apply the strict definition of gauge mediated SUSY-breaking where B_mu is generated only through gauge interactions, and as a result is very close to zero at the messenger scale. In this setup tan beta is a prediction rather than an input. The input parameters are independent scales for the gaugino masses, the scalar masses and the messenger mass in accord with general gauge mediation. We investigate the spectra, the constraints on the parameter space from direct searches and indirect observables, as well as fine-tuning. The favoured region of parameter space includes and interpolates between non-split and mildly split SUSY, characteristic of ordinary gauge mediation and direct gauge mediation models, respectively. △ Less", "The process gamma gamma \\to mu tau b bbar is studied in the minimal supersymmetric standard model within a large tan_beta scenario imposing on the parameter space present direct and indirect constraints from B physics and rare LFV tau-decays. At a photon collider based on an e+e- linear collider with a center of mass energy of 800 GeV with the parameters of the TESLA proposal (expected integrated gamma-gamma luminosity L=200-500 inverse fb) the LFV signal can be probed for masses of the heavy neutral Higgs bosons A,H from 300 GeV up to the kinematical limit ~ 600 GeV for tan_beta in the range 30,60. △ Less", "Combining anomaly with Z' mediation allows us to solve the tachyonic slepton problem of the former and avoid fine tuning in the latter. We describe how the two mechanisms can be combined, and some of the phenomenology of such a joint scenario. △ Less", "The cascade mass reconstruction approach was used for mass reconstruction of the lightest stau produced at the LHC in the cascade decay $\\tilde{g} \\to \\tilde{b} b \\to \\tildeχ_{2}^{0} b b \\to \\tildeτ_{1} τb b \\to \\tildeχ_{1}^{0} ττb b $. The stau mass was reconstructed assuming that masses of gluino, bottom squark and two lightest neutralinos were reconstructed in advance. SUSY data sample sets for the SU3 model point containing 160k events each were generated which corresponded to an integrated luminosity of about $8 \\rm fb^{-1}$ at 14 TeV. These events were passed through the AcerDET detector simulator, which parametrized the response of a generic LHC detector. The mass of the $\\tildeτ_{1}$ was reconstructed with a precision of about 20% on average. △ Less", "We consider first an interesting connection between the development of physics and the Boston Red Sox. We then discuss in detail the collider phenomenology, as well as precision electroweak observables of a very light neutralino. We conclude by considering also the astrophysics and cosmology of a very light neutralino. We find that a massless neutralino is consistent with all present data. △ Less", "We discuss the potential to observe effects of CP violation in squark decay chains at the LHC. As the CP-violating observable we use the asymmetry composed by triple products of final state momenta. Extending methods for momentum reconstruction we show that there are good prospects for observation of these effects at the LHC. Finally, we include the main experimental factors and discuss the expected sensitivity. △ Less", "Diverse mass and mixing patterns between the quarks and leptons makes it challenging to construct a simple grand unified theory of flavor. We show that SO(10) SUSY GUTs with type II seesaw mechanism giving neutrino masses provide a natural framework for addressing this issue. A simple ansatz that the dominant Yukawa matrix (the 10-Higgs coupling to matter) has rank one, appears to simultaneously explain both the large lepton mixings as well as the observed quark flavor hierarchy in these models. A testable prediction of this ansatz is the neutrino mixing, U_{e3}, which should be observable in planned long baseline experiments. △ Less", "We present full QCD and SUSY-QCD corrections to neutralino pair annihilation into quark-antiquark pairs. We show results and numerically evaluate their impact on the neutralino annihilation cross section and the relic density in scenarios with non-universal gaugino masses. By comparing to the relic density obtained from a pure leading order calculation, we demonstrate that the corrections strongly influence the extraction of SUSY mass parameters from cosmological data. △ Less", "Littlest Higgs model with T-parity and Minimal Supersymmtric standard Model with R-parity both give similar signatures in collider experiment with a huge amount of missing energy depending upon mass of the lightest T-odd/R-odd particle. In this talk, I will discuss possibility of distinguishing the two models at the LHC in hadronically quiet signal where masses of R-odd particles are identical to masses of T-odd particles. △ Less", "Axion/axino dark matter (DM) is explored in the minimal supergravity (mSUGRA) and Yukawa-unified supersymmetric grand-unified theory (SUSY GUT) models with surprising results. For this type of scenario, relic DM abundance has three components: {\\it i}.) cold axions, {\\it ii.}) warm axinos from neutralino decay, and {\\it iii.}) cold or warm thermally produced axinos. Reheat temperatures $T_R$ exceeding $10^6$ GeV are required in order to solve the gravitino/Big Bang Nucleosynthesis (BBN) problem while also allowing for baryogensis via non-thermal leptogenesis. In order to attain high enough reheat temperatures, we also need high values of the Peccei-Quinn (PQ) breaking scale $f_a$ on the order $10^{11}$-$10^{12}$ GeV. △ Less", "In this paper we investigate the possibility of finding models that, in the global minimum, break SUSY by a combined F and D-term effect. We find that if the superpotential is a cubic polynomial in the fields and the Kahler potential is canonical this does not happen. We then give two examples where the previous conditions do not apply and where the vacuum of the model breaks SUSY by combined F and D-term vevs: SQCD+singlet with N_C=N_F+1, and a baryon deformed ISS model. We briefly discuss the phenomenological viability of the models. △ Less", "We discuss the problem of universality of the soft, supersymmetry-breaking terms in the minimal supersymmetric SU(5) model (MSSU(5)) completed with flavor-dependent nonrenormalizable operators (NROs), or nrMSSU(5). These are exploited to correct the wrong fermion spectrum and to slow down the too-fast decay rate of the proton that the MSSU(5) model predicts. In general, the presence of such operators in the superpotential and Kähler potential gives rise to tree-level flavor- and CP-violating entries in the sfermion mass matrices at the cutoff scale, even when the mediation of supersymmetry (SUSY) breaking is generation and field-type independent. We identify the conditions under which such terms can be avoided. △ Less", "The two-photon exclusive production of charged supersymmetric pairs at the LHC has a clean and unique signature - two very forward scattered protons and two opposite charged leptons produced centraly. For low-mass SUSY scenarios, significant cross-sections are expected and background processes are well controlled. Measurement of the forward proton energies would allow for mass reconstruction of right-handed sleptons and the LSP with a few GeV resolution. Methods to reduce backgrounds at high luminosity resulting from accidental coincidences between events in the central and forward detectors are discussed. △ Less", "In the U(1)_{B-L} extension of the minimal supersymmetric standard model the right-handed sneutrino is a natural candidate for thermal dark matter. Sneutrino annihilation at the present time can be considerably enhanced due to the exchange of the lightest field in the Higgs sector that breaks U(1)_{B-L}. The annihilation mainly produces taus (or muons) by the virtue of B-L charge assignments. A sneutrino mass of 1-2 TeV provides a good fit to the PAMELA and is compatible with the latest results from the FERMI experiment. In addition, the sneutrino-nucleon elastic scattering cross section is within the reach of the upcoming and future direct detection experiments. △ Less", "It is well known that the supersymmetric finite threshold effects can induce substantial corrections to the Standard Model fermion masses. This opens an alternative possibility to correct the problematic mass ratios of the lighter generations within the minimal SU(5) GUT. We show that with large soft A--terms, one can achieve simple unification for lighter generations without additional Higgs multiplet, while having sfermions lighter than 1 TeV. The presence of such large A--terms will distort the sfermion mass spectrum upon running from GUT scale down to the electroweak scale making it distinct from the universal SUSY breaking sector, especially in the first two generations. The implications of these splittings are studied in K and D meson oscillations and in rare processes D^+ -> pi^+ nu anti-nu and K^+ -> pi^+ nu anti-nu, and in the latter case the effect is found to be important. △ Less", "We discuss the implications of a gauged Abelian hidden-sector communicating with the Standard Model (SM) fields via kinetic mixing with the SM hypercharge gauge field, or via the Higgs quartic interaction. We discuss signatures of the hidden-sector gauge boson at the LHC in the four-lepton channel. We show that a hidden-sector fermion can be a natural dark-matter candidate with the correct relic-density, discuss direct-detection prospects, and show how Higgs signatures may be altered at the LHC. △ Less", "We re-examine constraints from the evidence for observation of the lifetime difference in $D^0$-${\\bar D}^0$ mixing on the parameters of supersymmetric models with R-parity violation (RPV). We find that RPV SUSY can give large negative contribution to the lifetime difference. We also discuss the importance of the choice of weak or mass basis when placing the constraints on RPV-violating couplings from flavor mixing experiments. △ Less", "We reexamine the renormalization group equations (RGEs) for the dimensionless and dimensionful parameters of the Minimal Supersymmetric Standard Model (MSSM), incorporating 1-loop thresholds. The inclusion of these thresholds necessarily results in splitting between dimensionless couplings which are equal at the tree level. Assuming that the SUSY-breaking mechanism does not introduce new intergenerational couplings, we present the most general form for high-scale, soft-SUSY-breaking (SSB) parameters. With this as our boundary condition, we consider illustrative examples of numerical solutions to the RGEs. In a supersymmetric grand unified theory with the scale of SUSY scalars split from that of gauginos and higgsinos, we find that the gaugino mass unification relation may be violated to the order of 10%. Further, we consider the rate for the flavor violating decay of the lightest stop to charm plus neutralino. We find that using the complete RGE solution as opposed to the commonly used `single-step' integration of the RGEs can qualitatively change the picture of event-topologies from top-squark pair production, or from gluino production if gluino to stop plus top is the dominant gluino decay mode. △ Less", "The Exceptional Supersymmetric Standard Model (E$_6$SSM) provides a low energy alternative to the MSSM, with an extra gauged U(1)$_N$ symmetry, solving the $μ$-problem of the MSSM. Inspired by the possible embedding into an E$_6$ GUT, the matter content fills three generations of E$_6$ multiplets, thus predicting exciting exotic matter such as diquarks or leptoquarks. We present predictions from a constrained version of the model (cE$_6$SSM), with a universal scalar mass $m_0$, trilinear mass $A$ and gaugino mass $M_{1/2}$. We reveal a large volume of the cE$_6$SSM parameter space where the correct breakdown of the gauge symmetry is achieved and all experimental constraints satisfied. We predict a hierarchical particle spectrum with heavy scalars and light gauginos, while the new exotic matter can be light or heavy depending on parameters. We present representative cE$_6$SSM scenarios, demonstrating that there could be light exotic particles, like leptoquarks and a U(1)$_N$ Z' boson, with spectacular signals at the LHC. △ Less", "The $μν$SSM solves the $μ$ problem of the MSSM and explains the origin of neutrino masses by simply using right-handed neutrino superfields. The solution implies the breaking of R-parity. The properties and phenomenology of the model are briefly reviewed. △ Less", "We examine decays of a spin-1 bottomonium into a pair of light scalar Dark Matter (DM) particles, assuming that Dark Matter is produced due to exchange of heavy degrees of freedom. We perform a model-independent analysis and derive formulae for the branching ratios of these decays. We confront our calculation results with the experimental data. We show that the considered branching ratios are within the reach of the present BaBaR experimental sensitivity. Thus, Dark Matter production in Upsilon decays leads to constraints on parameters of various models containing a light spin-0 DM particle. We illustrate this for the models with a \"WIMPless miracle\", in particular for a Gauge Mediated SUSY breaking scenario, with a spin-0 DM particle in the hidden sector. Another example considered is the type II 2HDM with a scalar DM particle. △ Less", "We discuss the M_T2-kink method to determine the masses of both the dark matter WIMP and its mother particle produced at the LHC. We then introduce a new kinematic variable, the M_T2-Assisted-On-Shell (MAOS) momentum, that provides a systematic approximation to the invisible particle momenta in hadron collider events producing a pair of invisible particles, and apply it to certain SUSY processes and their UED equivalents to determine the spin of gluino/KK-gluon and of slepton/KK-lepton. An application of the MAOS momentum to the SM Higgs mass measurement is briefly discussed also. △ Less", "Leptogenic Supersymmetry is a scenario characterized by copious lepton production in cascade decays. Due to the high lepton multiplicity and the lack of significant missing energy, leptogenic supersymmetry provides very clean channels which can be probed already with the early LHC data. Furthermore, the Higgs may be discovered in the h->b bbar mode because the leptons accompanying Higgs production efficiently suppress the background. △ Less", "In the CMSSM we find preferences for sparticle masses that are relatively light. In the NUHM1 the best-fit values for many sparticle masses are even slightly smaller, but with greater uncertainties. We find that at the 95% C.L. all colored particles are in the reach of the LHC. While the light Higgs boson is bounded from above by M_h <= 125 GeV, the heavy Higgs bosons could well escape the LHC searches, but might be accessible at the ILC. △ Less", "This paper has been withdrawn by the author, due to two identical copies of the paper. △ Less", "Neutralino dark matter can be indirectly detected by observing the gamma ray lines from the annihilation processes XX-->gg and XX-->gZ. In this paper we study the implications that the observation of these two lines could have for the determination of the supersymmetric parameter space. Within the minimal supergravity framework, we find that, independently of the dark matter distribution in the Galaxy, such observations by themselves would allow to differentiate between the coannihilation region, the funnel region, and the focus point region. As a result, several restrictions on the msugra parameters can be derived. Within a more general MSSM scenario, we show that the observation of gamma-ray lines might be used to discriminate between a bino-, a wino-, and a higgsino-like neutralino, with important consequences for cosmology and for models of supersymmetry breaking. The detection of the gamma ray lines, therefore, will not only provide an unmistakable signature of dark matter, it will also open a new road toward the determination of supersymmetric parameters. △ Less", "A new Abelian gauge symmetry U(1)' is well motivated to extend the standard model or supersymmetric standard model. Leptonic Z' resonances are clean signals even at the hadron colliders. We discuss how 4-lepton and 6-lepton Z' resonances can help the search for Supersymmetry and Higgs, respectively, at the LHC. △ Less", "We discuss the implementation of bulk fermions in soft wall models. The introduction of a position dependent bulk mass allows for a well defined Kaluza-Klein expansion for bulk fermions. The realization of flavor and the contribution to electroweak precision observables are shown to be very similar to the hard wall case. The bounds from electroweak precision test are however milder with gauge boson Kaluza-Klein modes as light as $\\sim 1.5$ TeV compatible with current experimental bounds. △ Less", "Results are presented for the two-body decays of mesons into light neutralinos and from the first complete calculation of the loop-induced decays of kaons to pions plus light neutralinos and of B mesons to kaons plus light neutralinos. The branching ratios are shown to be strongly suppressed within the MSSM with minimal flavor violation, and no bounds on the neutralino mass can be inferred from experimental data, i.e. a massless neutralino is allowed. △ Less", "A recently proposed warped top-condensation model generally predicts a light radion φ, with a mass of a few GeV or less, whose interactions are suppressed by a scale of order 100 TeV. In this talk, we present existing constraints and potential signals from the process b \\to s φ, in the context of such a model. Astrophysical bounds, applicable to very light radions, are also briefly discussed. △ Less", "The principle of Minimal Flavour Violation (MFV) provides a natural solution to the SUSY flavour problem, but does not solve the SUSY CP problem as it allows for the presence of new CP-violating phases. If the MFV principle is generalized by the assumption of CP conservation in the limit of flavour blindness, the SUSY CP problem can be solved, predicting at the same time interesting CP violating phenomenology. △ Less", "We present the next-to-leading strong interaction corrections to the Delta F=2 Hamiltonian in the MSSM with exact diagonalization of the squark mass matrices. These results allow phenomenological studies of neutral meson mixing in scenarios with non-degenerate squarks, with control over the renormalization scale and scheme dependence. △ Less", "We summarize the results on patterns of flavour violation in a Randall-Sundrum model with custodial protection (RSc) and compare them with those identified in the Littlest Higgs Model with T--parity (LHT) and in a number of SUSY Flavour Models. While K decays play in this presentation a prominent role, the inclusion of B physics and lepton flavour violation is crucial in the distinction between these three popular extensions of the Standard Model (SM) by means of flavour physics. △ Less", "Grand Unified Theories based on an E6 gauge group embed all Higgs- and matter fields within one 27 dimensional fundamental representation. In addition each 27 contains a right handed neutrino, an NMSSM-like standard model singlet and a pair of exotic particles, that couple quarks to leptons. The extended particle content spoils simple gauge unification as in the MSSM. By embedding the SM into a Pati-Salam gauge group above 10^16 GeV, one obtains a unification below the Planck-scale. We present a Markov chain Monte-Carlo algorithm to systematically scan the high dimensional parameter space and calculate low-energy spectra, as well as first results of our studies of the LHC phenomenology of leptoquarks and leptoquarkinos with the event generator WHIZARD. △ Less", "The Next-To-Minimal-Supersymmetric extension of the Standard Model (NMSSM) has been in the focus of extensive studies in the past two decades. In anticipation of the LHC era, the interest in automatized tools that can calculate collider signatures has grown. We present the implementation of the NMSSM into the event generator WHIZARD. In addition to a brief review of the implementation, we discuss the testing and validation procedure. Phenomenological studies will not be presented here. △ Less", "The aim of these proceedings is to present the main predictions of the Randall-Sundrum model with custodial protection for particle-antiparticle mixing and rare decays of K and B_(s,d) mesons, putting particular attention on the testability of the resulting NP effects at future experiments. Before giving numerical results, we discuss theoretical expectations, residing in the flavor structure of the model. The high energy scale M_KK is chosen in such a way that direct searches of new particles at the LHC are possible, still being consistent with electroweak precision observables. △ Less", "We survey some of the recent promising developments in the search for the theory behind neutrino mass and tri-bimaximal mixing, and indeed all fermion masses and mixing. We focus in particular on models with discrete family symmetry and unification, and show how such models can also solve the SUSY flavour and CP problems. We also discuss the theoretical implications of the measurement of a non-zero reactor angle, as hinted at by recent experimental measurements. △ Less", "We report on an extensive analysis of FCNC and CPV effects in SUSY theories. We present results for Delta F=2 and Delta F=1 processes governed by b --> s transitions both in the low and high tanbeta regime, focussing in particular on S_psi_phi, the phase of Bs mixing. We emphasize that while the MFV framework is not suited to explain potentially large effects in S_psi_phi as indicated by recent data from CDF and D0, models with large right-right mass insertions in the 32 sector provide natural frameworks to account for such effects. Exemplarily we consider two SUSY models based on an abelian and a non-abelian flavor symmetry that show representative flavor structures in the soft SUSY breaking terms and stress that the characteristic correlations among the considered observables allow to distinguish between the different models. △ Less", "The neutrino oscillation data are well explained by the tri-bimaximal pattern. Recently a paper appeared showing that also the bimaximal pattern could be a very good starting point in order to describe the lepton mixing. In this paper I review both the flavour structures and then I present an explicit model based on the discrete symmetry group S4. △ Less", "We investigate constraints that the requirements of perturbativity and gauge coupling unification impose on extensions of the Standard Model and of the MSSM. In particular, we discuss the renormalization group running in several SUSY left-right symmetric and Pati-Salam models and show how the various scales appearing in these models have to be chosen in order to achieve unification. We find that unification in the considered models occurs typically at scales below M^{min}_{B violation} = 10^16 GeV, implying potential conflicts with the non-observation of proton decay. We emphasize that extending the particle content of a model in order to push the GUT scale higher or to achieve unification in the first place will very often lead to non-perturbative evolution. We generalize this observation to arbitrary extensions of the Standard Model and of the MSSM and show that the requirement of perturbativity up to M^{min}_{B violation}, if considered a valid guideline for model building, severely limits the particle content of any such model, especially in the supersymmetric case. However, we also discuss several mechanisms to circumvent perturbativity and proton decay issues, for example in certain classes of extra dimensional models. △ Less", "We probe the unification of down quarks and leptons in a supersymmetric SO(10) GUT. The large atmospheric neutrino mixing angle induces bR-sR transitions, which can account for the sizeable CP phase measured in Bs-Bsbar mixing. Corrections to down-quark-lepton unification from higher-dimensional Yukawa terms translate neutrino mixing also into sR-dR and bR-dR currents. We find the flavour structure of Yukawa corrections to be strongly constrained by epsilonK. △ Less", "We address the problem of rationalizing the pattern of fermion masses and mixings by adding a nonabelian flavor symmetry in a grand unified framework. With this purpose, we include an A4 flavor symmetry into a unified renormalizable SUSY GUT SU(5) model. With the help of the \"Type II Seesaw\" mechanism we are able to obtain the pattern of observed neutrino mixings in a natural way, through the so called tribimaximal matrix. △ Less", "In order to satisfy current FCNC and CP violation bounds, SUSY flavour structures cannot be generic. An interesting solution to these SUSY Flavour and CP Problems lies on the use of an SU(3) family symmetry which spontaneously breaks CP symmetry. Typical observables of such a model are electric dipole moments and LFV processes. In addition, these models can give contributions to CP violation in neutral meson mixing. We show how the latter can be used to restrict the allowed SUSY parameter space, and induce correlations between LFV and EDM predictions. △ Less", "Events with isolated leptons and missing energy in the final state are known to be signatures of new physics phenomena at high energy collider physics facilities. Standard model (SM) sources of isolated trilepton final states include gauge boson pair production such as WZ and W gamma^{*}, and t-bar t production. Symbol gamma^* represents a virtual photon. Our new contribution is the demonstration that bottom and charm meson decays, b to l X and c to l X$, produce isolated lepton (l) events that can overwhelm the effects of other processes. We compute contributions from a wide range of SM heavy flavor processes. In all these cases, one or more of the final observed isolated leptons comes from a heavy flavor decay. We propose new cuts to control the heavy flavor backgrounds in the specific case of chargino plus neutralino pair production in supersymmetric models. △ Less", "We study a new supersymmetric mechanism for lepton flavor violation in a minimal extension of the MSSM with low-mass heavy singlet neutrinos, which is fully independent of the flavor structure of the soft SUSY breaking sector. We find that l -> l' gamma processes are forbidden in the SUSY limit, whilst the processes l -> l'l1 l2 and mu -> e conversion in nuclei can be enhanced well above the observable level, via large neutrino Yukawa-coupling effects. △ Less", "We show that presently available precision data are in good agreement with supersymmetry at a mass scale below 1 TeV. Using a SUSY point close to the best fit to present data, we give a projection of the capabilities of the LHC to constrain SUSY models and their parameters as function of the accumulated luminosity. △ Less", "A SUSY SO(10) $\\times A_4$ GUT model is constructed for fermion masses and mixing by introducing a minimal set of low dimensional Higgs representations needed to break the guage symmetry down to $SU(3)_c \\times U(1)_{em}$. The hierarchy of fermion masses can be understood in the framework of $A_4$ symmetry. From the $A_4$-invariant superpotential, the \"double lopsided\" mass matrices for the charged leptons and the down quarks are obtained. It is shown that this structure leads to bi-large neutrino mixings simultaneously with small CKM mixing angles. An excellent fit to the masses and mixings of the quarks and leptons as well as to CP violation parameter is obtained. Moreover, the model predicts the neutrino mixing angle $\\sinθ_{13}\\approx 0.15$. △ Less", "Most models of weak scale supersymmetry (SUSY) predict observable rates for production of SUSY matter at the CERN LHC. The SUSY collider events are expected to be rich in jets, isolated (and non-isolated) leptons and missing E_T. After first discussing the merits of mixed axion/axino vs. neutralino cold dark matter in SUSY models, I then survey prospects for detecting SUSY matter at the LHC via leptonic signatures. In the paradigm mSUGRA model, cascade decays of gluinos and squarks should yield high rates for multi-jet plus multi-lepton events, allowing values of m_{\\tg}\\sim 3 (1.8) TeV to be probed for m_{\\tq}\\simeq m_{\\tg} (m_{\\tq}\\gg m_{\\tg}) with 100 fb^{-1} of integrated luminosity. Direct production of gauginos and sleptons should also be possible in limited regions of parameter space. Even in the first year of LHC running, observable signals in multi-muon plus jets channel (without cutting on missing E_T) can occur for interesting ranges of parameters. The highly motivated Yukawa unified SUSY models-- where the dark matter is expected to be of mixed axion/axino type-- should likely be testable in the first year of LHC running due to large rates for gluino pair production followed by cascade decays. △ Less", "Here we study and compare the sensitivity to the Higgs sector of the SUSY-seesaw models via the LFV tau decays: tau-> 3 mu, tau->K^{+}K^{-}, tau->mu eta and tau-> mu f_{0}. We emphasize that, at present, the two later channels are the most efficient ones to test indirectly the Higgs particles. △ Less", "Relic density calculations are often used to constrain particle physics models, and in particular supersymmetry. We will show that the presence of additional energy or entropy before the Big-Bang nucleosynthesis can however completely change the relic density constraints on the SUSY parameter space. Therefore one should be extremely careful when using the relic density to constrain supersymmetry as it could give misleading results, especially if combined with the future collider data. Alternatively, we will also show that combining the discoveries of the future colliders with relic density calculations can shed light on the inaccessible pre-BBN dark time physics. Finally we will present SuperIso Relic, a new relic density calculator code in Supersymmetry, which incorporates alternative cosmological models, and is publicly available. △ Less", "We investigate the phenomenological consequences of string models wherein the MSSM resides on a D-brane, and the hypercharge gaugino mass is generated in a geometrically separated hidden sector. This hypercharged anomaly-mediated SUSY breaking (HCAMSB) model naturally solves the tachyonic slepton mass problem endemic to pure AMSB scenarios. In HCAMSB, one obtains a mass ordering M_1>μ>M_2 with split left- and right- scalars, whereas in mAMSB models, one obtains μ>M_1>M_2 with nearly degenerate left- and right-scalars. We compute the allowed parameter space and expected superparticle mass spectrum in the HCAMSB model. For low values of the HC and AMSB mixing parameter α, the spectra is characterized by light left-sleptons, while the spectra for large αis characterized by light top- and bottom- squarks. We map out the approximate reach of LHC for HCAMSB, and find that with 100 fb^{-1} of integrated luminosity, a gravitino mass of \\sim 115 (105) TeV can be probed for low (high) values of α, corresponding to a gluino mass reach of \\sim 2.4 (2.2) TeV. Both cases contain-- as is typical in AMSB models-- long lived charginos that should yield visible highly ionizing tracks in the LHC detector. Also, in the lower \\tanβrange, HCAMSB models give rise to reconstructable Z\\to \\ell\\bar{\\ell} candidates in SUSY cascade decay events, while mAMSB models should do so only rarely. △ Less", "The motivations for the NMSSM are reviewed, and possible unconventional signals for Higgs and sparticle production at the LHC are discussed. In the presence of a light pseudoscalar, the SM-like Higgs scalar can decay dominantly into a 4-tau final state. In the fully constrained NMSSM with mSUGRA-like soft SUSY breaking terms, the correct dark matter relic density is obtained for a singlino-like LSP which modifies considerably all sparticle decay chains. △ Less", "Signatures of soft supersymmetry breaking at the CERN LHC and in dark matter experiments are discussed with focus drawn to light superparticles, and in particular light gauginos and their discovery prospects. Connected to the above is the recent PAMELA positron anomaly and its implications for signatures of SUSY in early runs at the Large Hadron Collider. Other new possibilities for physics beyond the Standard Model are also briefly discussed. △ Less", "The two-loop relations between the running gluino-quark-squark coupling, the gluino and the quark mass defined in dimensional regularization (DREG) and dimensional reduction (DRED) in the framework of SUSY-QCD are presented. Furthermore, we verify with the help of these relations that the three-loop beta-functions derived in the minimal subtraction scheme combined with DREG or DRED transform into each other. This result confirms the equivalence of the two schemes through three-loops, if applied to SUSY-QCD. △ Less", "We study the potential to observe CP-violating effects in SUSY cascade decay chains at the LHC. We consider squark and gluino production followed by subsequent decays into neutralinos with a three-body leptonic decay in the final step. Asymmetries composed by triple products of momenta of the final state particles are sensitive to CP-violating effects. Due to large boosts these asymmetries can be difficult to observe at a hadron collider. We show that using all available kinematic information one can reconstruct the decay chains on an event-by-event basis even in the case of 3-body decays, neutrinos and LSPs in the final state. We also discuss the most important experimental effects like major backgrounds and momentum smearing due to finite detector resolution. We show that with 300 fb$^{-1}$ of collected data, CP violation may be discovered at the LHC for a wide range of the phase of the bino mass parameter $M_1$. △ Less", "Current attempts to understand supersymmetry (susy) breaking are focused on the idea that we are not in the ground state of the universe but, instead, in a metastable state that will ultimately decay to an exactly susy ground state. It is interesting to ask how experiments at the Large Hadron Collider (LHC) will shed light on the properties of this future supersymmetric universe. In particular we ask how we can determine whether this final state has the possibility of supporting atoms and molecules in a susy background. △ Less", "Many models of meta-stable supersymmetry (SUSY) breaking lead to a very light scalar pseudo-Nambu Goldstone boson (PNGB), P, associated with spontaneous breakdown of a baryon number like symmetry in the hidden sector. Current particle physics data provide no useful constraints on the existence of P. For example, the predicted decay rates for both K --> pi + P, b--> s + P and Upsilon --> photon + P are many orders of magnitude below the present experimental bounds. We also consider astrophysical implications of the PNGB and find a significant constraint from its effect on the evolution of red giants. This constraint either rules out models with a hidden sector gauge group larger than SU(4), or requires a new intermediate scale, of order at most 10^{10} GeV, at which the hidden sector baryon number is explicitly broken. △ Less", "In this paper we present a simple extension of the minimal supersymmetric standard model [MSSM] which \"naturally\" produces the INTEGRAL photon signal. The model can be embedded in an SU(5) grand unified theory [GUT] with gauge mediated SUSY breaking. The new ingredients are the addition of several MSSM singlets/moduli. While the masses of the singlets are at the weak scale, their mass splittings are suppressed by chiral symmetry breaking and naturally lie around an MeV. The decay of the heavier modulino to the lighter one with the associated production of electron - positron pairs explains the INTEGRAL signal. Finally, the detection of diffuse gamma rays from internal bremsstrahlung in the galactic halo would be a suggestive indication of dark matter decays associated with the 511 keV line, and is an unambiguous additional prediction of this model. △ Less", "Group theoretical factors from GUT symmetry breaking can lead to predictions for the ratios of quark and lepton masses at the unification scale. Due to supersymmetric (SUSY) threshold corrections the viability of such predictions can depend strongly on the SUSY parameters. We derive possible new predictions for the GUT scale ratios m_μ/m_s, y_τ/y_b and y_t/y_b and compare them with the experimentally allowed ranges for three common SUSY breaking scenarios. △ Less", "We study lepton flavor-violating (LFV) processes within a supersymmetric type-I seesaw framework with flavor-blind universal boundary conditions, properly accounting for the effect of the neutrino sector on the dark matter relic abundance. We consider several possibilities for the neutrino Yukawa coupling matrix and show that in regions of SUSY parameter space that yield the correct neutralino relic density, LFV rates can differ from naive estimates by up to two orders of magnitude. Contrary to common belief, we find that current LFV limits do not exclude neutrino Yukawa couplings larger than top Yukawa couplings. We introduce the ISAJET-M program that was used for the computations. △ Less", "Recent renormalization group calculations of the sparticle mass spectrum in the Minimal Supersymmetric Standard Model (MSSM) show that t-b-τYukawa coupling unification at M_{\\rm GUT} is possible when the mass spectra follow the pattern of a radiatively induced inverted scalar mass hierarchy. The calculation is entirely consistent with expectations from SO(10) SUSY GUT theories, with one exception: it seems to require MSSM Higgs soft term mass splitting at M_{\\rm GUT}, dubbed \"just-so Higgs splitting\" (HS) in the literature, which apparently violates the SO(10) gauge symmetry. Here, we investigate three alternative effects: {\\it i}). SO(10) D-term splitting, {\\it ii}). inclusion of right hand neutrino in the RG calculation, and {\\it iii}). first/third generation scalar mass splitting. By combining all three effects (the DR3 model), we find t-b-τYukawa unification at M_{\\rm GUT} can be achieved at the 2.5% level. In the DR3 case, we expect lighter (and possibly detectable) third generation and heavy Higgs scalars than in the model with HS. In addition, the light bottom squark in DR3 should be dominantly a right state, while in the HS model, it is dominantly a left state. △ Less", "We combine the analyses for flavor changing neutral current processes and dark matter solutions in minimal-type supersymmetric grand unified theory (GUT) models, SO(10) and SU(5), with a large B_s - anti-B_s mixing phase and large tan beta. For large tan beta, the double penguin diagram dominates the SUSY contribution to the B_s - anti-B_s mixing amplitude. Also, the Br(B_s -> mu mu) constraint becomes important as it grows as tan^6 beta, although it can still be suppressed by large pseudoscalar Higgs mass m_A. We investigate the correlation between B_s -> mu mu and the dark matter direct detection cross-section through their dependence on m_A. In the minimal-type of SU(5) with type I seesaw, the large mixing in neutrino Dirac couplings results in large lepton flavor violating decay process tau to mu gamma, which in turn sets upper bound on m_A. In the SO(10) case, the large mixing can be chosen to be in the Majorana couplings instead, and the constraint from Br(tau -> mu gamma) can be avoided. The heavy Higgs funnel region turns out to be an interesting possibility in both cases and the direct dark matter detection should be possible in the near future in these scenarios. △ Less", "We explore general SUSY GUT models with exact third-generation Yukawa unification, but where the requirement of universal soft terms at the GUT scale is relaxed. We consider the scenario in which the breaking of universality inherits from the Yukawa couplings, i.e. is of minimal flavor violating (MFV) type. In particular, the MFV principle allows for a splitting between the up-type and the down-type soft trilinear couplings. We explore the viability of this trilinear splitting scenario by means of a fitting procedure to electroweak observables, quark masses as well as flavor-changing neutral current processes. Phenomenological viability singles out one main scenario. This scenario is characterized by a sizable splitting between the trilinear soft terms and a large mu term. Remarkably, this scenario does not invoke a partial decoupling of the sparticle spectrum, as in the case of universal soft terms, but instead it requires part of the spectrum, notably the lightest stop, the gluino and the lightest charginos and neutralinos to be very close to the current experimental limits. The above mechanism is mostly triggered by a non-trivial interplay between the requirements of negative, sizable SUSY threshold corrections to mb and an instead negligible modification of the B --> Xs gamma decay rate, in presence of various other constraints, most notably a successful EWSB and a not too large BR(Bs --> mu^+ mu^-). We present a model-building interpretation of our discussed scenario and emphasize the crucial role of SUSY spectrum determinations at the LHC for either falsifying Yukawa unification or else providing important hints on the mechanism of SUSY breaking at work. △ Less", "In the framework of supersymmetric Grand Unified Theories, the minimal Higgs sector is often extended by introducing multi-dimensional Higgs representations in order to obtain realistic models. However these constructions should remain anomaly-free, which constraints significantly their structure. We review the necessary conditions for the cancellation of anomalies in general and discuss in detail the different possibilities for SUSY SU(5) models. Alternative anomaly free combinations of Higgs representations, beyond the usual vector-like choice, are identified, and it is shown that their corresponding beta functions are not equivalent. Although the unification of gauge couplings is not affected, the introduction of multi-dimensional representations leads to different scenarios for the perturbative validity of the theory up to the Planck scale. △ Less", "One of the major objectives of this dissertation has been the seek for inflationary models, coming from supersymmetric theories, which are compatible with recent cosmological data and, more specifically, with measurements of the spectral index from the WMAP3 data. A particular particle physics model, the extended SUSY Pati-Salam model with Yukawa quasi-unification, was examined thoroughly with respect to its cosmology and it was found that it incorporates a number of inflationary scenarios which can become compatible with recent data. The study of these scenarios brought out variations of cosmological models which might be important in cosmological research. △ Less", "We investigate flavor violation mediated by Higgs bosons and supersymmetric particles in a predictive class of models based on the non-Abelian flavor symmetry Q_6. These models, which aim to reduce the number of parameters of the fermion sector and to solve the flavor changing problems of generic SUSY setup, assume three families of Higgs bosons and spontaneous/soft violation of CP symmetry. Tree-level contributions to meson-antimeson mixings mediated by Higgs bosons are shown to be within experimental limits for Higgs masses in the (1-5) TeV range. Calculable flavor violation induced by SUSY loops are analyzed for meson mixing and lepton decays and found to be consistent with data. Significant new SUSY contributions arise in B_s- \\bar{B}_s mixing, but non-standard CP violation is suppressed. A simple solution to the SUSY CP problem is found, which requires light Higgsinos. △ Less", "A non-Abelian flavour symmetry in a minimal supersymmetric standard model can explain the flavour structures in the Yukawa couplings and simultaneously solve the SUSY flavour problem. Similarly the SUSY CP problem can be solved if CP is spontaneously broken in the flavour sector. In this work, we present an explicit example of these statements with a SU(3) flavour symmetry and spontaneous CP violation. In addition, we show that it is still possible to find some significant deviation from the SM expectations as far as FCNC and CP violation are concerned. We find that large contributions can be expected in lepton flavour violating decays, as $μ\\to e γ$ and $τ\\to μγ$, electric dipole moments, $d_e$ and $d_n$ and kaon CP violating processes as $ε_K$. Thus, these flavoured MSSM realizations are phenomenologically sensitive to the experimental searches in the realm of flavor and CP vioation physics. △ Less", "In this paper we investigate the one-loop radiative corrections to the neutrino indices of refraction from supersymmetric models. We consider the Next-to Minimal Supersymmetric extension of the Standard Model (NMSSM) which happens to be a better supersymmetric candidate than the MSSM for both theoretical and experimental reasons. We scan the relevant SUSY parameters and identify regions in the parameter space which yield interesting values for V_{mu tau}. If R-parity is broken there are significant differences between MSSM and NMSSM contributions contrary to the R-parity conserved case. Finally, for a non-zero CP-violating phase, we show analytically that the presence of V_{mu tau} will explicitly imply CP-violation effects on the supernova electron (anti-) neutrino fluxes. △ Less", "We briefly review some recent Cold Dark Matter (CDM) models. Our main focus are charge symmetric models of WIMPs which are not the standard SUSY LSP's (Lightest Supersymmetric Partners). We indicate which experiments are most sensitive to certain aspects of the models. In particular we discuss the manifestations of the new models in neutrino telescopes and other set-ups. We also discuss some direct detection experiments and comment on measuring the direction of recoil ions--which is correlated with the direction of the incoming WIMP. This could yield daily variations providing along with the annual modulation signatures for CDM. △ Less", "We investigate the constraints on Supersymmetry arising from available precision measurements using a global fit approach. When interpreted within minimal supergravity (mSUGRA), the data provide significant constraints on the masses of supersymmetric particles, which are predicted to be light enough for an early discovery at the Large Hadron Collider (LHC). We provide predicted mass spectra including, for the first time, full uncertainty bands. The most stringent constraint is from the measurement of the anomalous magnetic moment of the muon. Using the results of these fits, we investigate to which precision mSUGRA and more general MSSM parameters can be measured by the LHC experiments with three different integrated luminosities for a parameter point which approximately lies in the region preferred by current data. The impact of the already available measurements on these precisions, when combined with LHC data, is also studied. We develop a method to treat ambiguities arising from different interpretations of the data within one model and provide a way to differentiate between values of different digital parameters of a model. Finally, we show how measurements at a linear collider with up to 1 TeV centre-of-mass energy will help to improve precision by an order of magnitude. △ Less", "We present a new formalism for finding the low-energy effective Lagrangian of Goldstinos and other fields. This Lagrangian is written using standard superspace and the superfields are constrained to include only the light degrees of freedom. The Goldstino resides in a (constrained) chiral superfield X which is naturally identified at short distances. This allows us to exactly compute the IR behavior of some correlation functions even in strongly coupled theories with SUSY breaking. The Goldstino couplings above the scale of the matter superpartners are determined by identifying X with the standard spurion. At energies below the superpartners' scale, fermions, scalars (including Goldstone bosons) and gauge fields are also described by constrained superfields. Our framework makes it easy to find the leading order terms in the Lagrangian and to control their corrections. It simplifies the derivation of many known results and leads to new ones. △ Less", "Supersymmetric standard model (MSSM) has two sources of rapid proton decay: (i) R-parity breaking terms and (ii) higher dimensional Planck induced B-violating terms; its extensions to include neutrino masses via the type I seesaw mechanism need not have the first of these problems due to the existence of B-L as a gauge symmetry but for sure always have the second one. If instead, neutrino masses are explained in a type III seesaw extension of the standard model, an anomaly free gauge symmetry different from B-L is known to exist. In this note, it is shown that a realistic supersymmetric versions of this model can be constructed (MSSM as well as SUSY left-right with type III seesaw) which forbid the R-parity violating couplings of MSSM and suppress Planck scale contributions to proton decay. The degree of suppression of the latter depends on the weak gauge group. For the left-right case, the suppression to the desired level is easily achieved. △ Less", "We have studied $Δ(54)\\times Z_2$ flavor model for leptons and sleptons. The tri-bimaximal mixing can be reproduced for arbitrary neutrino masses if vacuum alignments of scalar fields are guaranteed. The deviation from the tri-bimaximal mixing of leptons is predicted. The predicted upper bound for $\\sinθ_{13}$ is 0.06. The magnitude of $\\sinθ_{23}$ could be deviated from the maximal mixing considerably, but $\\sinθ_{12}$ is hardly deviated from the tri-maximal mixing. We have also studied SUSY breaking terms in the slepton sector. Three families of left-handed and right-handed slepton masses are degenerate. Even although flavor symmetry breaking effects are taken into account, our model leads to smaller values of flavor changing neutral currents than the present experimental bounds. △ Less", "We examine the supersymmetry (SUSY) reach of the CERN LHC operating at $\\sqrt{s}=10$ and 14 TeV within the framework of the minimal supergravity model. We improve upon previous reach projections by incorporating updated background calculations including a variety of $2\\to n$ Standard Model (SM) processes. We show that SUSY discovery is possible even before the detectors are understood well enough to utilize either $E_T^{\\rm miss}$ or electrons in the signal. We evaluate the early SUSY reach of the LHC at $\\sqrt{s}=10$ TeV by examining multi-muon plus $\\ge4$ jets and also dijet events with {\\it no} missing $E_T$ cuts and show that the greatest reach in terms of $m_{1/2}$ occurs in the dijet channel. The reach in multi-muons is slightly smaller in $m_{1/2}$, but extends to higher values of $m_0$. We find that an observable multi-muon signal will first appear in the opposite-sign dimuon channel, but as the integrated luminosity increases the relatively background-free but rate-limited same-sign dimuon, and ultimately the trimuon channel yield the highest reach. We show characteristic distributions in these channels that serve to distinguish the signal from the SM background, and also help to corroborate its SUSY origin. We then evaluate the LHC reach in various no-lepton and multi-lepton plus jets channels {\\it including} missing $E_T$ cuts for $\\sqrt{s}=10$ and 14 TeV, and plot the reach for integrated luminosities ranging up to 3000 fb$^{-1}$ at the SLHC. For $\\sqrt{s}=10$ TeV, the LHC reach extends to $m_{gluino}=1.9, 2.3, 2.8$ and 2.9 TeV for $m_{squark}\\sim m_{gluino}$ and integrated luminosities of 10, 100, 1000 and 3000 fb$^{-1}$, respectively. For $\\sqrt{s}=14$ TeV, the LHC reach for the same integrated luminosities is to $m_{gluino}=2.4,\\3.1, 3.7$ and 4.0 TeV. △ Less", "We argue that the existence of Dark Matter (DM) is a possible consequence of GUT symmetry breaking. In GUTs like SO(10), discrete Z_2 matter parity (-1)^{3(B-L)} survives despite of broken B-L, and group theory uniquely determines that the only possible Z_2-odd matter multiplets belong to representation 16. We construct the minimal non-SUSY SO(10) model containing one scalar 16 for DM and study its predictions below M_{G}. We find that EWSB occurs radiatively due to DM couplings to the SM Higgs boson. For thermal relic DM the mass range M_{DM}\\sim (0.1-1) TeV is predicted by model perturbativity up to M_{G}. For M_{DM}\\sim (1) TeV to explain the observed cosmic ray anomalies with DM decays, there exists a lower bound on the spin-independent direct detection cross section within the reach of planned experiments. △ Less", "We have recently completed a detailed scan of the 19-dimensional parameter space of the phenomenological MSSM, i.e., the CP-conserving MSSM assuming Minimal Flavor Violation(MFV) with the first two sfermion generations degenerate. We found a large set of parameter space points that satisfied all of the existing experimental and theoretical constraints. This analysis allows us to examine the general features of the MSSM without reference to any particular SUSY breaking scenario or any other assumptions about physics at higher scales. This study opens up new possibilities for SUSY phenomenology both at colliders and in astrophysical observations. △ Less", "A well-known signature of supersymmetry breaking scenarios with ordinary gauge mediation is a universal formula governing gaugino and sfermion masses such that their ratio is of order one. On the other hand, recently studied models with direct gauge mediation predict anomalously small ratios of gaugino to scalar masses. It was argued that the smallness of gaugino masses is a consequence of being in the lowest energy state of the SUSY-breaking low energy effective theory. To increase gaugino masses one either has to move to higher metastable vacuum or alternatively remain in the original SUSY-breaking vacuum but extend the theory by introducing a lower-lying vacuum elsewhere. We follow the latter strategy and show that the ratio of gaugino to sfermion masses can be continuously varied between zero and of order one by bringing in a lower vacuum from infinity. We argue that the stability of the vacuum is directly linked to the ratio between the gaugino masses and the underlying SUSY-breaking scale, i.e. the gravitino mass. △ Less", "We describe in detail our calculation of the full supersymmetric (SUSY) QCD corrections to neutralino annihilation into heavy quarks and extend our numerical analysis of the resulting dark matter relic density to scenarios without scalar or gaugino mass unification. In these scenarios, the final state is often composed of top quarks and the annihilation proceeds through Z^0-boson or scalar top-quark exchanges. The impact of the corrections is again shown to be sizable, so that they must be taken into account systematically in global analyses of the supersymmetry parameter space. △ Less", "We consider candidates for dark matter in models of gauge mediated supersymmetry breaking, in which the supersymmetry breaking sector is weakly coupled and calculable. Such models typically contain classically flat directions, that receive one-loop masses of a few TeV. These pseudo-flat directions provide a new mechanism to account for the cold dark matter relic abundance. We discuss also the possibility of heavy gravitino dark matter in such models. △ Less", "We review the current best fit values of Higgs boson masses in the Standard Model (SM) and its minimal supersymmetric extension (MSSM) obtained from existing experimental data. We also review the parameters space of the constrained MSSM (CMSSM) and the non-universal Higgs mass model (NUHM1) currently preferred by precision data. Following a Frequentist approach, the experimental data includes electroweak precision observables, B physics observables and the relic density of cold dark matter. △ Less", "In type IIB large volume compactifications involving orientifolds of the Swiss-Cheese Calabi-Yau [11169] with a single mobile space-time filling D3-brane and stacks of D7-branes wrapping the \"big\" divisor (D_5) and supporting D7-brane fluxes, (i) using the toric data and GLSM techniques, we obtain the geometric Kaehler potential for D_5 in terms of genus-two Siegel theta functions; (ii) we show that as the D3-brane moves from a particular embedded non-singular elliptic curve to another one, it is possible to obtain 10^{12}GeV gravitino during the inflationary era as well as a TeV gravitino in the present era, for the same vol(CY)~10^6l_s^6; (iii) by constructing local appropriate involutively-odd harmonic one-form on D_5 that lies in the cokernel of the pullback of the immersion map, we show that it is possible to obtain an O(1) g_{YM} from the wrapping of D7-branes on D_5 due to competing contributions from the Wilson line moduli relative to the divisor volume modulus (to permit gaugino condensation [gc], we consistently consider zero sections of ND_5) - to simplify we restrict the D3-brane to D_5 which means W_gc=0; (iv) we obtain gaugino masses of the order of gravitino mass and the matter fields' masses to be enhanced relative to the gravitino mass; (v) the anomaly-mediated gaugino masses are found to be suppressed relative to the gravity-mediated gaugino masses by the standard loop factor; (vi) new sub-dominant mu-terms are obtained from section of the (small) divisor bundle encoding information about the ED3- instanton fluctuation determinant; (vii) we obtain a (near)universality in the masses, hat(mu), hat(Y) and the hat(mu)B-terms for the D3 position moduli and a hierarchy in the same set and a universality in the A-terms on inclusion of D7 Wilson line moduli. △ Less", "We argue that effective field theories compatible with the idea of Cosmological SUSY Breaking, can have no supersymmetric vacuum states in the M_P -> infinity limit. We introduce a revised version of the Pyramid Scheme, which satisfies this criterion. Combining the criteria for CSB with results of Nelson and Seiberg, any such Lagrangian is non-generic, but we argue that this is plausible in the context of CSB, where R-violating terms in the Lagrangian come from interactions with the horizon, rather than integrating out short distance degrees of freedom. We also point out a Landau pole in the hidden sector gauge group of the Pyramid Scheme, and propose an unique mechanism for avoiding it. △ Less", "We examine the minimal supergravity (mSUGRA) model under the assumption that the strong CP problem is solved by the Peccei-Quinn mechanism. In this case, the relic dark matter (DM) abundance consists of three components: {\\it i}). cold axions, {\\it ii}). warm axinos from neutralino decay, and {\\it iii}). cold or warm thermally produced axinos. To sustain a high enough re-heat temperature (T_R\\agt 10^6 GeV) for many baryogenesis mechanisms to function, we find that the bulk of DM should consist of cold axions, while the admixture of cold and warm axinos should be rather slight, with a very light axino of mass \\sim 100 keV. For mSUGRA with mainly axion cold DM (CDM), the most DM-preferred parameter space regions are precisely those which are least preferred in the case of neutralino DM. Thus, rather different SUSY signatures are expected at the LHC in the case of mSUGRA with mainly axion CDM, as compared to mSUGRA with neutralino CDM. △ Less", "We critically reexamine the standard applications of the method of kinematical endpoints for sparticle mass determination. We consider the typical decay chain in supersymmetry (SUSY) squark -> neutralino -> slepton -> LSP, which yields a jet j and two leptons ln and lf. The conventional approaches use the upper kinematical endpoints of the individual distributions m_{jll}, m_{jl(lo)} and m_{jl(hi)}, all three of which suffer from parameter space region ambiguities and may lead to multiple solutions for the SUSY mass spectrum. In contrast, we do not use m_{jll}, m_{jl(lo)} and m_{jl(hi)}, and instead propose a new set of (infinitely many) variables whose upper kinematic endpoints exhibit reduced sensitivity to the parameter space region. We then outline an alternative, much simplified procedure for obtaining the SUSY mass spectrum. In particular, we show that the four endpoints observed in the three distributions m^2_{ll}, m^2_{jln} U m^2_{jlf} and m^2_{jln}+m^2_{jlf} are sufficient to completely pin down the squark mass and the two neutralino masses, leaving only a discrete 2-fold ambiguity for the slepton mass. This remaining ambiguity can be easily resolved in a number of different ways: for example, by a single additional measurement of the kinematic endpoint of any one out of the many remaining 1-dimensional distributions at our disposal, or by exploring the correlations in the 2-dimensional distribution of m^2_{jln} U m^2_{jlf} versus m^2_{ll}. We illustrate our method with two examples: the LM1 and LM6 CMS study points. An additional advantage of our method is the expected improvement in the accuracy of the SUSY mass determination, due to the multitude and variety of available measurements. △ Less", "We study in two space-time dimensions (d = 2) the relation between N = 2 supersymmetric (SUSY) QED theory and N = 2 nonlinear (NL) SUSY model by linearizing N = 2 NLSUSY generally based upon the fundamental notions of the basic theory. We find a remarkable mechanism which determines theoretically the magnitude of the bare gauge coupling constant from the general structure of auxiliary fields. We show explicitly in d = 2 that the NL/linear SUSY relation (i.e. a SUSY compositeness condition for all particles) determines the magnitude of the bare electromagnetic coupling constant (i.e. the fine structure constant) of N = 2 SUSY QED. △ Less", "One of the challenges of supersymmetry (SUSY) breaking and mediation is generating a mu term consistent with the requirements of electro-weak symmetry breaking. The most common approach to the problem is to generate the mu term through a SUSY breaking F-term. Often these models produce unacceptably large B mu terms as a result. We will present an alternate approach, where the mu term is generated directly by non-perturtative effects. The same non-perturbative effect will also retrofit the model of SUSY breaking in such a way that mu is at the same scale as masses of the Standard Model superpartners. Because the mu term is not directly generated by SUSY breaking effects, there is no associated B mu problem. These results are demonstrated in a toy model where a stringy instanton generates mu. △ Less", "We consider the full Boltzmann equations for standard and soft leptogenesis, instead of the usual integrated Boltzmann equations which assume kinetic equilibrium for all species. Decays and inverse decays may be inefficient for thermalising the heavy-(s)neutrino distribution function, leading to significant deviations from kinetic equilibrium. We analyse the impact of using the full kinetic equations in the case of a previously generated lepton asymmetry, and find that the washout of this initial asymmetry due to the interactions of the right-handed neutrino is larger than when calculated via the integrated equations. We also solve the full Boltzmann equations for soft leptogenesis, where the lepton asymmetry induced by the soft SUSY-breaking terms in sneutrino decays is a purely thermal effect, since at T=0 the asymmetry in leptons cancels the one in sleptons. In this case, we obtain that in the weak washout regime (K ~< 1) the final lepton asymmetry can change up to a factor four with respect to previous estimates. △ Less", "A number of DR-bar renormalization constants in softly broken SUSY-QCD are evaluated to three-loop level: the wave function renormalization constants for quarks, squarks, gluons, gluinos, ghosts, and epsilon-scalars, and the renormalization constants for the quark and gluino mass as well as for all cubic vertices. The latter allow us to derive the corresponding beta functions through three loops, all of which we find to be identical to the expression for the gauge beta function obtained by Jack, Jones, and North [Jack:1996vg] (see also Ref. [Pickering:2001aq]). This explicitely demonstrates the consistency of DRED with SUSY and gauge invariance, an important pre-requisite for precision calculations in supersymmetric theories. △ Less", "This article is a very basic introduction to supersymmetry. It introduces the two kinds of superfields needed for supersymmetric extensions of the Standard Model, the chiral superfield and the vector superfield, and discusses in detail how to construct supersymmetric, gauge invariant Lagrangians. The main ideas on how to break supersymmetry spontaneously are also covered. The article is meant to provide a platform for further reading. △ Less", "In models of supersymmetry (SUSY) breaking and mediation, strongly coupled SUSY-breaking sectors can play a significant role in determining the low-energy spectrum of the model. For example, strong dynamics may provide a natural solution to both the SUSY flavor problem and the mu / B mu problem. Recently, it has been suggested that a large class of these models lead to identical boundary conditions at the SUSY breaking scale. These boundary conditions would severely constrain the models' viability. We demonstrate that the boundary conditions are instead sensitive to the details of the hidden sector, so that only specific hidden sectors may be ruled out by phenomenological considerations. We determine the high scale boundary conditions using the operator product expansion of the hidden sector. The techniques used to determine the beta functions are generally applicable to the RG flow of any approximately conformal hidden sector. The discrepancy with previously proposed boundary conditions can be traced to the fact that the renormalization group (RG) flow involves multiple fixed points. △ Less", "We generalize (linearized) relativistic hydrodynamics by including all order gradient expansion of the energy momentum tensor, parametrized by four momenta-dependend transport coefficients, one of which is the usual shear viscosity. We then apply the AdS/CFT duality for ${\\cal N}=4$ SUSY in order to compute the retarded correlators of the energy-momentum tensor. From these correlators we determine a large set of transport coefficients of third- and fourth-order hydrodynamics. We find that higher order terms have a tendency to reduce the effect of viscosity. △ Less", "Supersymmetric (SUSY) standard models in which the lightest SUSY particle (LSP) is an ultralight gravitino (m_{3/2}=O(1) eV) are very attractive, since they are free from the cosmological gravitino problems. If the neutralino is the next lightest SUSY particle (NLSP), it decays into a photon and the gravitino in collider experiments. We propose a simple test for the lightness of gravitino at the LHC. △ Less", "We study general conditions for the gravitino to be the lightest supersymmetric particle (LSP) in models with gravity mediated supersymmetry breaking. We find that the decisive quantities are the Kaehler potential K and the gauge kinetic function f. In constrained MSSM (CMSSM) type models, the gravitino LSP occurs if the gaugino mass at the GUT scale is greater than approximately 2.5 gravitino masses. This translates into \\sqrt{K\"}/f' < 0.2, where the derivatives are taken with respect to the dominant SUSY breaking field. This requirement can easily be satisfied in string-motivated setups. △ Less", "Anomalously small gaugino masses are a common feature of various models of direct gauge mediation. This problem is closely related to the vacuum structure of the theory. In this paper we show that massive SQCD can have SUSY-breaking vacua which are qualitatively different from the ISS vacuum. These novel vacua are metastable with respect to decay to the ISS vacuum. We demonstrate the possibility of addressing the gaugino mass problem in this framework. We study the properties of these vacua and construct an example of a model of direct gauge mediation. △ Less", "I present results for the finite renormalization of the Cabibbo-Kobayashi-Maskawa (CKM) matrix induced by gluino--squark diagrams in the MSSM with non-minimal sources of flavour violation. Subsequently I derive bounds on the flavour--off--diagonal elements of the squark mass matrices by requiring that the radiative corrections to the CKM elements do not exceed the experimental values. The constraints on the associated dimensionless quantities $δ^{d LR}_{ij}$, $j>i$, are stronger than the bounds from flavour-changing neutral current (FCNC) processes if gluino and squarks are heavier than 500$ \\gev$. The results imply that it is still possible to generate all observed flavour violation from the soft supersymmetry-breaking terms without conflicting with present-day data on FCNC processes. Therefore we reappraise the idea that only $Y^q_{33}$ is different from zero at tree-level and all other Yukawa couplings are generated radiatively. This model solves the SUSY flavour as well as the SUSY CP problem. The presented results are published in \\cite{Crivellin:2008mq}. △ Less", "Supersymmetric contributions to time independent asymmetry in $B^0_s \\to J/ψφ$ process are analyzed in the view of the recent Tevatron experimental measurements. We show that the experimental limits of the mass difference $ΔM_{B_s}$ and the mercury EDM significantly constrain the SUSY contribution to $B^0_s -\\bar{B}^0_s$ mixing, so that $\\sin 2 β_s \\lsim 0.1$. We also point out that the one loop SUSY contribution to $B^0_s \\to J/ψφ$ decay can be important and can lead to large indirect CP asymmetries which are different for different polarization states. These new physics effects in the decay amplitude can be consistent with CP measurements in the $B_d$ system. △ Less", "The possibility that the gluino is the next to the lightest supersymmetric particle (NLSP) is discussed and it is shown that this situation arises in nonuniversal SUGRA models within a significant part of the parameter space compatible with all known experimental bounds. It is then shown that the gluino NLSP (GNLSP) models lead to a compressed sfermion spectrum with the sleptons often heavier than the squarks at least for the first two generations. The relic density here is governed by gluino coannihilation which is responsible for a relatively small mass splitting between the gluino and the neutralino masses. Thus the GNLSP class of models is very predictive first because the SUSY production cross sections at the LHC are dominated by gluino production and second because the gluino production itself proceeds dominantly through a single channel which allows for a direct determination of the gluino mass and an indirect determination of the neutralino mass due to a linear relation between these two masses which is highly constrained by coannihilation. A detailed analysis of these models shows that the jet production and tagged b-jets from the gluino production can be discriminated from the standard model background with appropriate cuts. It is found that the GNLSP models can be tested with just 10 fb$^{-1}$ of integrated luminosity and may therefore be checked with low luminosity runs in the first data at the LHC. Thus if a GNLSP model is realized, the LHC will turn into a gluino factory through a profuse production of gluinos with typically only a small fraction $\\lesssim 5%$ of total SUSY events arising from other production modes over the allowed GNLSP model parameter space. △ Less", "Following \\cite{Lin:2009yt}, we explore the parameter space of the case when the supersymmetry (SUSY) breaking scale is lower, for example, in gauge mediated SUSY breaking model. During inflation, the form of the potential is $V_0$ plus MSSM (MSSM stands for Minimal Supersymmetric Standard Model) (or A term (It is called A-term inflation when the inflaton field is any direction (gauge or singlet) that generates an A-term.)) inflation. We show that the model works for a wide range of the potential $V_0$ with the soft SUSY breaking mass $m\\sim O(1)$ TeV. The implication to MSSM (or A-term) inflation is that the flat directions which is lifted by the non-renormalizable terms described by the superpotential $W=λ_p φ^{p-1}/M^{p-3}_P$ with $p=4$ and $p=5$ are also suitable to be an inflaton field for $λ_p=O(1)$ provided there is an additional false vacuum term $V_0$ with appropriate magnitude. The flat directions corresponds to $p=6$ also works for $0 \\lae V_0/M_P^4 \\lae 10^{-40}$. △ Less", "I review recent opportunities from flavor for b-physics and collider searches. △ Less", "We analyze a model of Semi-Direct Gauge Mediation in which the hidden sector is the 4-1 model and the messenger fields are charged under the U(1) gauge group. At tree level, the SUSY-breaking F-terms induce D-terms from which SUSY-split messenger masses arise. We calculate these masses by three complementary methods. Additionally, we compute the one-loop corrections to the masses. We consider this model both with and without a Fayet-Iliopoulos term for the hidden sector U(1). Finally, we write down a simple model of Minimal Gauge Mediation in which the only scale is dynamically generated. △ Less", "We have studied the contribution of higher order corrections of the flavor symmetry breaking in the $A_4$ seesaw model with the supersymmetry. Taking account of possible higher dimensional mass operators, we predict the deviation from the tri-bimaximal lepton mixing for both normal hierarchy and inverted hierarchy of neutrino masses. We have found that the value of $\\sin^2 2θ_{23}$ is larger than 0.96 and the upper bound of $\\sin^2θ_{13}$ is 0.01. We have also examined the flavor changing neutral current of leptons from the soft SUSY breaking in slepton masses and A-terms within the framework of supergravity theory. Those magnitudes are enough suppressed to be consistent with experimental constraints. △ Less", "In the Minimal Supersymmetric Standard Model, physical phases of complex parameters lead to CP violation. We show how triple products of particle momenta or spins can be used to construct asymmetries, that allow us to probe these CP phases. To give specific examples, we discuss the production of neutralinos at the International Linear Collider. For the Large Hadron Collider, we discuss CP asymmetries in squark decays, and in the tri-lepton signal. We find that the CP asymmetries can be as large as 60%. △ Less", "The spatial 't Hooft loop measures the colour electric flux in SU(N)/Z(N) gauge theory. It is a closed loop of Dirac Z(N) flux and has strength k=1, 2,.., N-1. It is analyzed for generic k and small gauge coupling in the high temperature phase of {\\cal N} =1, 2 and 4 SUSY theory up and including cubic order. In one loop order no qualitative difference with gluodynamics shows. However the two loop order shows a logarithmic divergence appear in the centre of the wall. This is because the gluinos become bosonic in the centre and acquire long wavelength excitations. We discuss the cure for this divergence, due to a gluino zero mode. The physics of Casimir scaling is explained. The cubic order can be obtained from gluodynamics by simple rescalings of the Debye masses and the Casimir parameter $k/N_c$. △ Less", "We observe that the electroweak one loop correction to the quark+gluon to quark+Higgs amplitude at high energy involves both single and quadratic logarithms of the energy in the SM case but only quadratic logarithms in the MSSM case. We explore the origin of this special SUSY cancellation, both in a diagrammatic way and through the splitting+Parameter Renormalization procedure. We show that it is not an accident but a remarkableand general SUSY property of the renormalized Higgs-fermion-fermion and Higgsino-sfermion-fermion vertices which directly reflects in such processes, for example in $bg\\to tH^-$, $bg\\to bH^0$, $bg\\to bh^0$, $bg\\to bA^0$, and through equivalence in $bg\\to tW^-_{long}$, $bg\\to bZ_{long}$, as well as in $bg\\to \\tilde{t}χ^-$, $bg\\to\\tilde{b}χ^0$. This simplification of the high energy behaviour (which only leaves quadratic logarithms involving pure gauge couplings without any free parameter) allows to write simple relations among these various processes which constitute genuine tests of the assumed SUSY model. △ Less", "We investigate a mechanism for spontaneous R-parity breaking in a class of extensions of the minimal supersymmetric standard model with an extra Abelian gauge symmetry which is a linear combination of B-L and weak hypercharge. Both U(1)_X and R-parity are broken by the vacuum expectation value of the right-handed sneutrinos which is proportional to the soft SUSY masses. In these models the mechanism for spontaneous R-parity violation can be realized even with positive soft masses. In this context one has a realistic mechanism for generating neutrino masses as well as a realistic spectrum. We briefly discuss the possible collider signals which could be used to test the theory, the contributions for proton decay and the possibility of a gravitino as a dark matter candidate. △ Less", "The Standard Model (SM) predictions for the lepton flavor-violating (LFV) processes like mu->eg are well far from any realistic experimental resolution, thus, the appearance of m->eg at the running MEG experiment would unambiguously point towards a New Physics (NP) signal. In this article, we discuss the phenomenological implications in case of observation/improved upper bound on m->eg at the running MEG experiment for supersymmetric (SUSY) scenarios with a see-saw mechanism accounting for the neutrino masses. We outline the role of related observables to m->eg in shedding light on the nature of the SUSY LFV sources providing useful tools i) to reconstruct some fundamental parameters of the neutrino physics and ii) to test whether an underlying SUSY Grand Unified Theory (GUT) is at work. The perspectives for the detection of LFV signals in tau decays are also discussed. △ Less", "The experiments at LHC have shown that the SUSY (exotic) bound states are likely to form bound states in an entirely similar fashion as ordinary quarks form bound states, i.e., quarkonium. Also, the interaction between two squarks is due to gluon exchange which is found to be very similar to that interaction between two ordinary quarks. This motivates us to solve the Schrödinger equation with a strictly phenomenological static quark-antiquark potential: $V(r)=-Ar^{-1}+κ\\sqrt{r}+V_{0}$ using the shifted large $N$-expansion method to calculate the low-lying spectrum of a heavy quark with anti-sbottom\\textbf{\\}$(c\\bar{\\widetilde{b}},b% \\bar{\\widetilde{b}})$ and sbottom with anti-sbottom $(\\widetilde{b}% \\bar{\\widetilde{b}})$ bound states with $m_{\\widetilde{b}}$ is set free. To have a full knowledge on spectrum, we also give the result for a heavier as well as for lighter sbottom masses. As a test for the reliability of these calculations, we fix the parameters of this potential by fitting the spin-triplet $(n^{3}S_{1})$ and center-of-gravity $l\\neq 0$ experimental spectrum of the ordinary heavy quarkonia $c\\bar{c},c\\bar{b}$ and $b% \\bar{b}$ to few $\\mathrm{MeV.}$ Our results are compared with other models to gauge the reliability of these predictions and point out differences. △ Less", "We describe SPICE: Simulation Package for Including Flavor in Collider Events. SPICE takes as input two ingredients: a standard flavor-conserving supersymmetric spectrum and a set of flavor-violating slepton mass parameters, both of which are specified at some high \"mediation\" scale. SPICE then combines these two ingredients to form a flavor-violating model, determines the resulting low-energy spectrum and branching ratios, and outputs HERWIG and SUSY LesHouches files, which may be used to generate collider events. The flavor-conserving model may be any of the standard supersymmetric models, including minimal supergravity, minimal gauge-mediated supersymmetry breaking, and anomaly-mediated supersymmetry breaking supplemented by a universal scalar mass. The flavor-violating contributions may be specified in a number of ways, from specifying charges of fields under horizontal symmetries to completely specifying all flavor-violating parameters. SPICE is fully documented and publicly available, and is intended to be a user-friendly aid in the study of flavor at the Large Hadron Collider and other future colliders. △ Less", "We consider corrections to the unification of down-quark and charged-lepton Yukawa couplings in supersymmetric GUTs, which links the large nu_tau-nu_mu mixing angle to b -> s transitions. These corrections generically occur in simple grand-unified models with small Higgs representations and affect s -> d and b -> d transitions via the mixing of the corresponding right-handed superpartners. On the basis of a specific SUSY-SO(10) model, we analyze the constraints from K-Kbar and B-Bbar mixing on the additional \\tilde{d}_R-\\tilde{s}_R rotation angle theta. We find that epsilon_K already sets a stringent bound on theta, theta^{max}=O(1 degree), indicating a very specific flavor structure of the correction operators. The impact of the large neutrino mixings on the unitarity triangle analysis is also briefly discussed, as well as their ability to account for the sizeable CP-violating phase observed recently in B_s -> psi phi decays. △ Less", "In this work we study the Lepton Flavour Violating semileptonic tau --> mu f0(980) decay within the context of SUSY-Seesaw Models, where the MSSM spectrum is extended by three right handed neutrinos and their SUSY partners, and where the seesaw mechanism is used to generate the neutrino masses. We estimate its decay rate when it proceeds via the Higgs mediated channel tau --> mu H* --> mu f0(980), where H refers to the CP-even MSSM Higgs bosons h^0 and H^0, and the Lepton Flavour Violating tau mu H vertex is radiatively generated via SUSY loops. In order to describe the f0(980) meson we follow the guidelines from chiral constraints. As an implication of our computation, we explore the sensitivity to the Higgs sector in this decay and compare it with other LFV tau decay channels. The confrontation of our predictions for BR(tau --> mu f0(980)) with its very competitive present experimental bound leads us to extract some interesting restrictions on the most relevant model parameters, particularly, tanbeta and m_{H^0}. △ Less", "Within the MSSM and SM frameworks, we analyze the 1loop electroweak (EW) predictions for the helicity amplitudes describing the 17 processes $gg\\to HH'$, and the 9 processes $gg\\to VH$; where $H,H'$ denote Higgs or Goldstone bosons, while $V= Z, ~W^\\pm$. Concentrating on MSSM, we then investigate how the asymptotic helicity conservation (HCns) property of SUSY, affects the amplitudes at the LHC energy range; and what is the corresponding situation in SM, where no HCns theorem exists. HCns is subsequently used to construct many relations among the cross sections of the above MSSM processes, depending only on the angles $α$ and $β$. These relations should be asymptotically exact, but with mass-depending deviations appearing, as the energy decreases towards the LHC range. Provided the SUSY scale is not too high, they may remain roughly correct, even at the LHC energy range. △ Less", "We have recently examined a large number of points in the parameter space of the phenomenological MSSM, the 19-dimensional parameter space of the CP-conserving MSSM with Minimal Flavor Violation. We determined whether each of these points satisfied existing experimental and theoretical constraints. This analysis provides insight into general features of the MSSM without reference to a particular SUSY breaking scenario or any other assumptions at the GUT scale. This study opens up new possibilities for SUSY phenomenology both in colliders and in astrophysical experiments. Here we shall discuss the implications of this analysis relevant to the study of dark matter. △ Less", "We revisit the method of kinematical endpoints for particle mass determination, applied to the popular SUSY decay chain squark -> neutralino -> slepton -> LSP. We analyze the uniqueness of the solutions for the mass spectrum in terms of the measured endpoints in the observable invariant mass distributions. We provide simple analytical inversion formulas for the masses in terms of the measured endpoints. We show that in a sizable portion of the SUSY mass parameter space the solutions always suffer from a two-fold ambiguity, due to the fact that the original relations between the masses and the endpoints are piecewise-defined functions. The ambiguity persists even in the ideal case of a perfect detector and infinite statistics. We delineate the corresponding dangerous regions of parameter space and identify the sets of \"twin\" mass spectra. In order to resolve the ambiguity, we propose a generalization of the endpoint method, from single-variable distributions to two-variable distributions. In particular, we study analytically the boundaries of the (m_{jl(lo)}, m_{jl(hi)}) and (m_{ll}, m_{jll}) distributions and prove that their shapes are in principle sufficient to resolve the ambiguity in the mass determination. We identify several additional independent measurements which can be obtained from the boundary lines of these bivariate distributions. The purely kinematical nature of our method makes it generally applicable to any model that exhibits a SUSY-like cascade decay. △ Less", "The Split SUSY scenario with light Higgsino states is treated as an application to the Dark Matter problem. We have considered the structure of the neutralino-nucleon interaction and calculated cross-section of the neutralino-nucleon scattering. The decay properties of the lightest chargino and next lightest neutralino are analyzed in details. △ Less", "We study N=1 global and local supersymmetric theories with a continuous global U(1)_R symmetry. We discuss conditions for supersymmetry (SUSY) breaking and vacuum structures of R-symmetric SUSY models. Especially we find the conditions for R-symmetry breaking and runway vacua in global supersymmetric theories. We introduce explicit R-symmetry breaking terms into such models in global and local supersymmetric theories. We classify explicit R-symmetry breaking terms by the structure of newly appeared SUSY stationary points as a consequence of the R-breaking effect. Based on the generic argument, we propose the scenario that conformal dynamics causes approximate R-symmetry and metastable SUSY breaking vacua at a low energy scale. Furthermore, we find that conformal dynamics also leads approximate R-symmetry in softly SUSY breaking theories, even in more complicated models such as the duality cascade. We investigate the RG flow of SUSY breaking terms as well as supersymmetric couplings in the duality cascade of softly broken supersymmetric theories. We also show the possibility that cascading would be terminated by the gauge symmetry breaking, which is induced by the so-called B-term. Finally, we find some models to arrive at standard-model-like models and to cause gauge symmetry breaking corresponding to electro-weak symmetry breaking. △ Less", "We study the possibility that the Higgs and the inflaton are the same single field or cousins arising from the extra space components of some higher-dimensional gauge field. We take 5D supersymmetric gauge theory with a matter compactified on S^1 as a toy model and evaluate the one-loop contribution to the Higgs-inflaton potential. Our gauge-Higgs-inflaton unification picture applied to the gauge field of intermediate energy scale (\\sim 10^{13} GeV) can explain the observed inflation parameters without fine-tuning. △ Less", "A new class of non-Gaussian curvature fluctuations ζ_{pr} (\\bx) \\equiv δN(χ_i) arises from the post-inflation preheating behaviour of a non-inflaton field χ_i. Its billiard-like chaotic dynamics imprints regular log-spaced narrow spikes in the number of preheating e-folds N(χ_i). We perform highly accurate lattice simulations of SUSY-inspired quartic inflaton and coupling potentials in a separate-universe approximation to compute N(χ_i) as a function of the (nearly homogeneous) initial condition χ_i. The super-horizon modes of χ_i(\\bx) result in positive spiky excursions in ζ_{pr} and hence negative gravitational potential fluctuations added to the usual sign-independent inflaton-induced perturbations, observably manifested in large cosmic structures and as (polarized) temperature CMB cold spots. △ Less", "We investigate the phenomenology of the Nearly Minimal Supersymmetric Standard Model (nMSSM) in the deflected anomaly mediation scenario. We also include the Fayet-Iliopoulos D-term of the standard model gauge group. In the nMSSM, the mu term is replaced by the vacuum expectation value of the gauge singlet; therefore, there is no difficulty in generating the B-term of the SUSY breaking scale. Although the messenger sector is introduced, direct couplings between nMSSM fields and messenger sector fields are forbidden by the discrete symmetry. Therefore, the phenomenology at the weak scale does not depend on the detail of the messenger sector. We show that there are regions of parameter space in which electroweak symmetry breaking occurs successfully and the lightest Higgs is heavier than the LEP bound. We show that the gluino is light in this scenario. The lightest neutralino, which is mainly composed of a singlino, is a candidate for dark matter. The relic density explains the observed abundance of dark matter. The dark matter-nucleon scattering cross section satisfies the current limit from CDMS and XENON10 with a small value for the strange quark content of a nucleon. △ Less", "We present a locally supersymmetric extension of the minimal supersymmetric Standard Model (MSSM) based on the gauge group $SU(3)_C\\times SU(2)_L\\times U(1)_Y\\times U(1)^\\prime$ where, except for the supersymmetry breaking scale which is fixed to be $\\sim 10^{11}$ GeV, we require that all non-Standard-Model parameters allowed by the {\\it local} spacetime and gauge symmetries assume their natural values. The $U(1)^\\prime$ symmetry, which is spontaneously broken at the intermediate scale, serves to ({\\it i}) explain the weak scale magnitudes of $μ$ and $b_μ$ terms, ({\\it ii}) ensure that dimension-3 and dimension-4 baryon-number-violating superpotential operators are forbidden, solving the proton-lifetime problem, ({\\it iii}) predict {\\it bilinear lepton number violation} in the superpotential at just the right level to accommodate the observed mass and mixing pattern of active neutrinos (leading to a novel connection between the SUSY breaking scale and neutrino masses), while corresponding trilinear operators are strongly supppressed. The phenomenology is like that of the MSSM with bilinear R-parity violation, were the would-be lightest supersymmetric particle decays leptonically with a lifetime of $\\sim 10^{-12}-10^{-8}$ s. Theoretical consistency of our model requires the existence of multi-TeV, stable, colour-triplet, weak-isosinglet scalars or fermions, with either conventional or exotic electric charge which should be readily detectable if they are within the kinematic reach of a hadron collider. Null results of searches for heavy exotic isotopes implies that the re-heating temperature of our Universe must have been below their mass scale which, in turn, suggests that sphalerons play a key role for baryogensis. Finally, the dark matter cannot be the weakly interacting neutralino. △ Less", "We show how the sum of the two average tau polarisations in the decay chain chi20 -> stau1 tau -> tau tau chi10 in minimal supersymmetry with conserved R-parity can be measured at the LHC. This is accomplished by exploiting the polarisation dependence of the visible di-tau mass spectrum. Such a measurement provides information on the couplings of the involved SUSY particles and allows a more precise determination of the di-tau mass endpoint. If different tau decay modes can be distinguished, the polarisation and endpoint measurement can be improved even further. △ Less", "We present an overview of supersymmetry searches, both at collider experiments and via searches for dark matter (DM). We focus on three DM possibilities in the SUSY context: the thermally produced neutralino, a mixture of axion and axino, and the gravitino, and compare and contrast signals that may be expected at colliders, in direct detection (DD) experiments searching of DM relics left over from the Big Bang, and indirect detection (ID) experiments designed to detect the products of DM annihilations within the solar interior or galactic halo. Detection of DM particles using multiple strategies provides complementary information that may shed light on the new physics associated with the dark matter sector. In contrast to the mSUGRA model where the measured cold DM relic density restricts us to special regions mostly on the edge of the m_0-m_{1/2} plane, the entire parameter plane becomes allowed if the universality assumption is relaxed in models with just one additional parameter. Then, thermally produced neutralinos with a well-tempered mix of wino, bino and higgsino components, or with a mass adjusted so that their annihilation in the early universe is Higgs-resonance-enhanced, can be the DM. Well-tempered neutralinos typically yield heightened rates for DD and ID experiments compared to generic predictions from minimal supergravity. If instead DM consists of axinos (possibly together with axions) or gravitinos, then there exists the possibility of detection of quasi-stable next-to-lightest SUSY particles at colliding beam experiments, with especially striking consequences if the NLSP is charged, but no DD or ID detection. The exception for mixed axion/axino DM is that DD of axions may be possible. △ Less", "With the first measurements of the branching ratios and the direct CP asymmetries of $B_s\\to K^{-}K^{+}$, $K^{-}π^{+}$ decays by the CDF collaboration, we constrain the relevant parameter space of the Minimal Supersymmetric Standard Model with R-parity violation. Using the constrained R-parity violating couplings, we further examine their possible effects in $B_{s}\\to K^{-*}π^{+}$, $K^{(*)-}ρ^{+}$ and $K^{(*)\\pm}K^{(*)\\mp}$ decays. We find that some branching ratios and CP asymmetries are very sensitive to the R-parity violating couplings. The direct longitudinal CP asymmetries of tree-dominated process $B_s\\to K^{*-}ρ^{+}$ could be enlarged to $\\sim 70%$ and the longitudinal polarizations of $B_s\\to K^{*-}K^{*+}$, $K^{*-}ρ^{+}$ decays could be suppressed very much by the squark exchange couplings. Near future experiments at CERN LHC can test these predictions and shrink/reveal the parameter spaces of RPV SUSY. △ Less", "We introduce and implement a new, extended approach to placing bounds on trilinear R-parity violating couplings. We focus on a limited set of leptonic and semi-leptonic processes involving neutrinos, combining multidimensional plotting and cross-checking constraints from different experiments. This allows us to explore new regions of parameter space and to relax a number of bounds given in the literature. We look for qualitatively different results compared to those obtained previously using the assumption that a single coupling dominates the R-parity violating contributions to a process (SCD). By combining results from several experiments, we identify regions in parameter space where two or more parameters approach their maximally allowed values. In the same vein, we show a circumstance where consistency between independent bounds on the same combinations of trilinear coupling parameters implies mass constraints among slepton or squark masses. Though our new bounds are in most cases weaker than the SCD bounds, the largest deviations we find on individual parameters are factors of two, thus indicating that a conservative, order of magnitude bound on an individual coupling is reliably estimated by making the SCD assumption. △ Less", "Group theoretical factors from GUT symmetry breaking can lead to predictions for the ratios of quark and lepton masses (or Yukawa couplings) at the unification scale. Due to supersymmetric (SUSY) threshold corrections the viability of such predictions can depend strongly on the SUSY parameters. For three common minimal SUSY breaking scenarios with anomaly, gauge and gravity mediation we investigate which GUT scale ratios $m_e/m_d$, $m_μ/m_s$, $y_τ/y_b$ and $y_t/y_b$ are allowed when phenomenological constraints from electroweak precision observables, $B$ physics, $(g-2)_μ$, mass-limits on sparticles from direct searches as well as, optionally, constraints from the observed dark matter density are taken into account. We derive possible new predictions for the GUT scale mass ratios and compare them with the phenomenologically allowed ranges. We find that new GUT scale predictions such as $m_μ/m_s = 9/2$ or 6 and $y_τ/y_b = 3/2$ or 2 are often favoured compared to the ubiquitous relations $m_μ/m_s = 3$ or $y_τ/y_b =1$. They are viable for characteristic SUSY scenarios, testable at the CERN LHC and future colliders. △ Less", "We analyze the connection between electric dipole moment of the electron and the soft leptogenesis in supersymmetric $B-L$ extension of the standard model. In this model, the $B-L$ symmetry is radiatively broken at TeV scale. Therefore, it is a natural framework for low scale seesaw mechanism and also for implementing the soft leptogenesis. We show that the phases of trilinear soft SUSY breaking couplings $A$, which are relevant for the lepton asymmetry, are not constrained by the present experimental bounds on electric dipole moment. As in the MSSM extended with right-handed neutrinos, successful leptogenesis requires small bilinear coupling $B$, which is now given by $A_N$ and $B-L$ breaking VEVs. SUSY $B-L$ model with non-universal $A$-terms such that $A_N=0$ while $A_ν\\neq0$ is a promising scenario for soft leptogenesis. The proposed EDM experiments will test this scenario in the future. △ Less", "An explanation of relations between the large scale structure of the universe and the tiny scale structure of the particle physics, e.g. the observed mysterious relation between the (dark) energy density and the dark matter of the universe and the neutrino mass and the SUSY breaking mass scale of the particle physics may be given by the nonlinear supersymmmetric general relativity (NLSUSY GR). NLSUSY GR shows that studying the physics before/of the Big Bang of the universe may be significant and may give new insight to unsolved problems of the low energy particle physics, cosmology and their relations. △ Less", "Recently Arkani-Hamed, Finkbeiner, Slatyer and Weiner proposed a unified explanation to the set of experimental and observational anomalies with possible connections to Dark Matter (DM). A central role is played by GeV scale \"dark\" gauge bosons exchanged by the weak scale DM. Motivated by this proposal, we build an explicit model of DM in the context of Weak Scale Supersymmetry (SUSY). We employ high-scale SUSY-breaking and invoke the Giudice-Masiero mechanism to generate the weak scale DM masses. By sequestering the dark sector from the SUSY-breaking \"hidden\" sector, it naturally acquires GeV scale soft masses that help generate the dark gauge boson mass. The visible MSSM sector is not fully sequestered and acquires gaugino-mediated soft terms at the weak scale. This hierarchy of scales naturally leads to the Sommerfeld enhancement of DM annihilations needed to account for the electron/positron excesses in the PAMELA and ATIC experiments. The possibility of co-existing species of DM is used to show how the INTEGRAL and DAMA anomalies can both be explained. We study the cosmological constraints on the new stable or long-lived light particles that appear in our models. We discuss the lepton-jet collider signals suggested by Arkani-Hamed and Weiner, and find that they are not guaranteed in our construction. △ Less", "We review recent progress in determining the effects of D-brane instantons in N=1 supersymmetric compactifications of Type II string theory to four dimensions. We describe the abstract D-brane instanton calculus for holomorphic couplings such as the superpotential, the gauge kinetic function and higher fermionic F-terms. This includes a discussion of multi-instanton effects and the implications of background fluxes for the instanton sector. Our presentation also highlights, but is not restricted to the computation of D-brane instanton effects in quiver gauge theories on D-branes at singularities. We then summarize the concrete consequences of stringy D-brane instantons for the construction of semi-realistic models of particle physics or SUSY-breaking in compact and non-compact geometries. △ Less", "It has recently been shown that specific non-perturbative effects may lead to an explosive decay of flat direction condensates in supersymmetric theories. We confirm explicitly the efficiency of this process with lattice simulations: after few rotations of the condensates in their complex plane, most of their energy is quickly converted into inhomogeneous fluctuations. We then point out that this generates a gravitational wave background which depends on the inflaton sector and falls in the Hz-kHz frequency range today. We compute the resulting spectrum and study how it depends on the parameters. We show that these gravity waves can be observable by upcoming experiments like Advanced LIGO and depend crucially on (i) the initial VEV of flat directions when they start to oscillate, (ii) their soft SUSY-breaking mass and (iii) the reheat temperature of the universe. This signal could open a new observational window on inflation and low-energy supersymmetry. △ Less", "The kinematic end-point technique for measuring the masses of supersymmetric particles in R-Parity conserving models at hadron colliders is re-examined with a focus on exploiting additional constraints arising from correlations in invariant mass observables. The use of such correlations is shown to potentially resolve the ambiguity in the interpretation of quark+lepton end-points and enable discrimination between sequential two-body and three-body lepton-producing decays. The use of these techniques is shown to improve the SUSY particle mass measurement precision for the SPS1a benchmark model by at least 20-30% compared to the conventional end-point technique. △ Less", "The SUSY flavour problem is deeply related to the origin of flavour and hence to the origin of the SM Yukawa couplings themselves. Since all CP-violation in the SM is restricted to the flavour sector, it is possible that the SUSY CP problem is related to the origin of flavour as well. In this work, we present three variations of an SU(3) flavour model with spontaneous CP violation. Such models explain the hierarchy in the fermion masses and mixings, and predict the structure of the flavoured soft SUSY breaking terms. In such a situation, both SUSY flavour and CP problems do not exist. We use electric dipole moments and lepton flavour violation processes to distinguish between these models, and place constraints on the SUSY parameter space. △ Less", "A model of generalised hybrid inflation in a supersymmetric QCD theory is proposed whose parameters are the gauge coupling and quark masses. Its gravitational coupling to another SQCD sector induces a metastable supersymmetry breaking vacuum of the ISS type as ISS quarks become massive at the end of inflation. Using a known mechanism with a gravitational breaking of the baryon number and the gauging of flavour symmetries, we find that gauge mediation of supersymmetry breaking is compatible with the dynamics of the inflation sector. Reheating proceeds via the thermalization of the ISS messengers into the standard model states. This setup contains a single dimensionful parameter in the form of a quark mass term in the inflationary sector, i.e. all other scales involved are either related to this single mass parameter or dynamically generated. △ Less", "The weak decays of $B \\to K^{\\ast}_0(1430) l^{+} l^{-}$ ($l=μ, τ$) are investigated in Minimal Supersymmetric Standard Model (MSSM) and also in Supersymmetric (SUSY) SO(10) Grand Unified Models. Neutral Higgs bosons are the point of main focus in MSSM because they make quite a large contribution in exclusive $B \\to X_{s} l^{+} l^{-}$ decays at large $\\tanβ$ regions of parameter space of SUSY models, as part of SUSY contributions is proportional to $\\tan^{3}β$. The analysis of decay rate, forward-backward asymmetries and lepton polarization asymmetries in $B \\to K^{\\ast}_0(1430) l^{+} l^{-}$ show that the values of these physical observables are greatly modified by the effects of neutral Higgs bosons. In SUSY SO(10) GUT model, the new physics contribution comes from the operators which are induced by the neutral Higgs boson penguins and also from the operators with chirality opposite to that of the corresponding Standard Model (SM) operators. SUSY SO(10) effects show up only in the decay $B \\to K^{\\ast}_0 μ^{+} μ^{-}$ where the transverse lepton polarization asymmetries deviate significantly from the SM value while the effects in the decay rate, forward-backward asymmetries, the longitudinal and normal lepton polarization asymmetries are very mild. The transverse lepton polarization asymmetry is almost zero in SM and in MSSM model, whereas it can reach to -0.3 in SUSY SO(10) GUT model which could be seen at the future colliders; hence this asymmetry observable can be used to discriminate between different SUSY models. △ Less", "We consider the basic supersymmetric (SUSY) models of F-term hybrid inflation (FHI). We show that a simple class of Kaehler potentials ensures a resolution to the ηproblem and allows for inflation of hilltop type. As a consequence, observationally acceptable values for the spectral index, ns, can be achieved constraining the coefficient c4k of the quartic supergravity correction to the inflationary potential. For about the central value of ns, in the case of standard FHI, the grand unification (GUT) scale turns out to be well below its SUSY value with the relevant coupling constant κin the range (0.0006-0.15) and c4k=-(1100-0.05). In the case of shifted [smooth] FHI, the GUT scale can be identified with its SUSY value for c4k=-16 [c4k=-1/16]. △ Less", "We study aspects of Wess-Zumino models related to SUSY and R-symmetry breaking at tree-level. We present a recipe for constructing a wide class of tree-level SUSY and R-breaking models. We also deduce a general property shared by all tree-level SUSY breaking models that has broad application to model building. In particular, it explains why many models of direct gauge mediation have anomalously light gauginos (even if the R-symmetry is broken spontaneously by an order one amount). This suggests new approaches to dynamical SUSY breaking which can generate large enough gaugino masses. △ Less", "We propose a simple gauge extension of the minimal supersymmetric standard model (MSSM), where the fine tuning in the Higgs mass parameters is highly reduced. The Higgs boson is insensitive to high energies because of supersymmetry and also because it is a pseudo-Goldstone boson of a global symmetry (referred to as double protection or super-little Higgs mechanism). A large shift in the Higgs quartic self coupling is obtained via a non-decoupling D-term coming from an extra gauge group, resulting in a Higgs that can be as heavy as 135 GeV with a tuning milder than 10%. With an appropriate choice of quantum numbers one can achieve that the additional quartic is generated without a corresponding shift in the Higgs mass, thus preserving the double protection of the Higgs. The model predicts the existence of several top-partner fermions one of which can be as light as 700 GeV, while the ordinary MSSM states could be as light as 400 GeV. In addition to many new particles in the multi-TeV range there would also be an axion-like state very weakly coupled to standard model (SM) matter which could be in the sub-GeV regime, and sterile neutrinos which could be light. △ Less", "We investigate the signals of supersymmetry (SUSY) in a scenario where only the third family squarks and sleptons can be produced at the Large Hadron Collider (LHC), in addition to the gluino, charginos and neutralinos. The final states in such cases are marked by a multiplicity of top and/or bottom quarks. We study in particular, the case when the stop, sbottom and gluino masses are near the TeV scale due to which, the final state t's and b's are very energetic. We point out the difficulty in b-tagging and identifying energetic tops and suggest several event selection criteria which allow the signals to remain significantly above the standard model background. We show that such scenarios with gluino mass up to 2 TeV can be successfully probed at the LHC. Information on $\\tan β$ can also be obtained by looking at associated Higgs production in the cascades of accompanying neutralinos. We also show that a combined analysis of event rates in the different channels and the effective mass distribution allows one to differentiate this scenario from the one where all three sfermion families are accessible. △ Less", "We present a new version of the CompHEP program package, version 4.5. We describe new options and techniques implemented in the version: interfaces to ROOT and HERWIG, parallel calculations, generation of the XML-based header in event files (HepML), full implementation of the Les Houches agreements (LHA I, SUSY LHA, LHA PDF, Les Houches Event format), cascade matching for intermediate scalar resonances, etc. △ Less", "These lectures give an overview of aspects of missing E_T signatures from new physics at the LHC, along with their important connection to dark matter physics. Mostly, I will concentrate on supersymmetric (SUSY) sources of missing E_T, but will also mention Little Higgs models with T-parity (LHT) and universal extra dimensions (UED) models with KK-parity. Lecture 1 covers SUSY basics, model building and spectra computation. Lecture 2 addresses sparticle production and decay mechanisms at hadron colliders and event generation. Lecture 3 covers SUSY signatures at LHC, along with LHT and UED signatures for comparison. In Lecture 4, I address the dark matter connection, and how direct and indirect dark matter searches, along with LHC collider searches, may allow us to both discover and characterize dark matter in the next several years. Finally, the interesting scenario of Yukawa-unified SUSY is examined; this case works best if the dark matter turns out to be a mixture of axion/axino states, rather than neutralinos. △ Less", "We introduce a new model, the Pyramid Scheme, of direct mediation of SUSY breaking, which is compatible with the idea of Cosmological SUSY Breaking (CSB). It uses the trinification scheme of grand unification and avoids problems with Landau poles in standard model gauge couplings. It also avoids problems, which have recently come to light, associated with rapid stellar cooling due to emission of the pseudo Nambu-Goldstone Boson (PNGB) of spontaneously broken hidden sector baryon number. With a certain pattern of R-symmetry breaking masses, a pattern more or less required by CSB, the Pyramid Scheme leads to a dark matter candidate that decays predominantly into leptons, with cross sections compatible with a variety of recent observations. The dark matter particle is not a thermal WIMP but a particle with new strong interactions, produced in the late decay of some other scalar, perhaps the superpartner of the QCD axion, with a reheat temperature in the TeV range. This is compatible with a variety of scenarios for baryogenesis, including some novel ones which exploit specific features of the Pyramid Scheme. △ Less", "We study the U(1)_R-mediated supersymmetry breaking in a flux compactification of 6D chiral gauged supergravity with codimension-two branes. We consider a concrete model with manifest U(1)_R invariance for moduli stabilization and visible sector in the context of 4D effective supergravity with gauged U(1)_R and determine soft scalar masses in the visible sector mainly by a nonzero U(1)_R D-term. We obtain a low energy superparticle spectrum and discuss on the implications of the obtained non-universal scalar soft masses on the SUSY phenomenology such as dark matter relic abundances. △ Less", "We discuss the supersymmetric CP problem that arises when the sfermion soft mass universality is modified. We place the 3rd generation SU(5) ten-plet sfermion masses in the weak scale in view of the naturalness. The other sfermion masses are assumed to be universal and a TeV scale in order to weaken the flavor changing neutral current processes and electric dipole moment (EDM) constraints. However this modification generically induces too large up quark chromo-EDM (CEDM) via the weak scale stop loop. In order to suppress this CEDM, we propose certain type of flavor structure where the parameters of the up-(s)quark sector are real whereas those of the down-(s)quark and the charged (s)lepton sectors are complex at the GUT scale. It is shown that, in this set up, up quark CEDM can be suppressed within the range where the current and future experiments have their sensitivity. We briefly illustrate the simple realization of these particular forms of the modified sfermion universality with real up-(s)quark sector by spontaneous CP violation in E$_6$ SUSY GUT with SU(2) flavor symmetry. △ Less", "Supernatural inflation is an attractive model based just on a flat direction with soft SUSY breaking mass terms in the framework of supersymmetry. The beauty of the model is inferred from its name that the model needs no fine-tuning. However, the prediction of the spectral index is $n_s \\gae 1$, in contrast to experimental data. In this paper, we show that the beauty of supernatural inflation with the spectral index reduced to $n_s=0.96$ without any fine-tuning, by considering the general feature that a flat direction is lifted by a non-renormalizable term with an A-term. △ Less", "We analyze the theory and phenomenology of anomalous global chiral symmetries in the presence of an extra dimension. We propose a simple extension of the Standard Model in 5D whose signatures closely resemble those of supersymmetry with gauge mediation, and we suggest a novel scalar dark matter candidate. △ Less", "It is often true that an invariant mass constructed from visible decay products of a heavy particle may attain a maximum(or minimum) for a certain kinematic configuration only -- this fact can be used to reconstruct relevant particle masses from observed decay product momenta of events near the invariant mass endpoint. MSSM neutralino and chargino mass reconstruction at the LHC from multi-lepton endstates is illustrated by way of example. △ Less", "We analyze all possible extensions of the recently proposed minimal renormalizable SUSY SU(5) grand unified model with the inclusion of an additional A4 flavor symmetry. We find that there are five possible cases but only one of them is phenomenologically interesting. We develop in detail such case and we show how the fermion masses and mixing angles come out. As a prediction we obtain the neutrino masses of order of 0.1 eV with an inverted hierarchy. △ Less", "We discuss the anomalous magnetic moment of fermion in a realistic SU(3) model of gauge-Higgs unification compactified on an orbifold S^1/Z_2 including Z_2-odd bulk mass for fermions. An operator analysis implies that the anomalous magnetic moment should be finite and predictable, even though higher dimensional gauge theories are non-renormalizable. Our main purpose is to clarify the cancellation mechanism of the UV divergences appearing in various types of Feynman diagrams. The cancellation of divergence turns out to take place between the contributions of the \"partners\" in the Higgs-like mechanism present in the non-zero Kaluza-Klein modes to form massive gauge bosons. It is also argued that the cancellation may be attributed to the quantum mechanical SUSY hidden in the scenario of gauge-Higgs unification. △ Less", "The CP asymmetry in neutrino oscillations, assuming new physics at production and/or detection processes, is analyzed. We compute this CP asymmetry using the standard quantum field theory within a general new physics scenario that may generate new sources of CP and flavor violation. Well known results for the CP asymmetry are reproduced in the case of V -A operators, and additional contributions from new physics operators are derived. We apply this formalism to SUSY extensions of the Standard Model where the contributions from new operators could produce a CP asymmetry observable in the next generation of neutrino experiments. △ Less", "We consider a generic renormalizable and gauge invariant messenger sector and derive the sparticle mass spectrum using the formalism introduced for General Gauge Mediation. Our results recover many expressions found in the literature in various limits. Constraining the messenger sector with a global symmetry under which the spurion field is charged, we analyze Extraordinary Gauge Mediation beyond the small SUSY breaking limit. Finally, we include D-term contributions and compute their corrections to the soft masses. This leads to a perturbative framework allowing to explore models capable of fully covering the parameter space of General Gauge Mediation to the Supersymmetric Standard Model. △ Less", "We discuss the predictions of a constrained version of the exceptional supersymmetric standard model (cE6SSM), based on a universal high energy soft scalar mass m_0, soft trilinear coupling A_0 and soft gaugino mass M_1/2. We predict a supersymmetry (SUSY) spectrum containing a light gluino, a light wino-like neutralino and chargino pair and a light bino-like neutralino, with other sparticle masses except the lighter stop being much heavier. In addition, the cE6SSM allows the possibility of light exotic colour triplet charge 1/3 fermions and scalars, leading to early exotic physics signals at the LHC. We focus on the possibility of a Z' gauge boson with mass close to 1 TeV, and low values of (m0,M_1/2), which would correspond to an LHC discovery using \"first data\", and propose a set of benchmark points to illustrate this. △ Less", "We show that in supersymmetric models with gauged B-L symmetry, there is a new source for cosmological lepton asymmetry. The Higgs bosons responsible for B-L gauge symmetry breaking decay dominantly into right-handed sneutrinos \\tilde{N} and \\tilde{N}* producing an asymmetry in \\tilde{N} over \\tilde{N}*. This can be fully converted into ordinary lepton asymmetry in the decays of \\tilde{N}. In simple models with gauged B-L symmetry we show that resonant/soft leptogenesis is naturally realized. Supersymmetry guarantees quasi-degenerate scalar states, while soft breaking of SUSY provides the needed CP violation. Acceptable values of baryon asymmetry are obtained without causing serious problems with gravitino abundance. △ Less", "We compute the full O(alpha_s) supersymmetric (SUSY) QCD corrections for neutralino annihilation into massive quarks through gauge or Higgs bosons and squarks in the Minimal Supersymmetric Standard Model (MSSM), including the known resummation of logarithmically enhanced terms. The numerical impact of the corrections on the extraction of SUSY mass parameters from cosmological data is analyzed for gravity-mediated SUSY breaking scenarios and shown to be sizable, so that these corrections must be included in common analysis tools. △ Less", "Motivated by the recent proliferation of observed astrophysical anomalies, Arkani-Hamed et al. have proposed a model in which dark matter is charged under a non-abelian \"dark\" gauge symmetry that is broken at ~ 1 GeV. In this paper, we present a survey of concrete models realizing such a scenario, followed by a largely model-independent study of collider phenomenology relevant to the Tevatron and the LHC. We address some model building issues that are easily surmounted to accommodate the astrophysics. While SUSY is not necessary, we argue that it is theoretically well-motivated because the GeV scale is automatically generated. Specifically, we propose a novel mechanism by which mixed D-terms in the dark sector induce either SUSY breaking or a super-Higgs mechanism precisely at a GeV. Furthermore, we elaborate on the original proposal of Arkani-Hamed et al. in which the dark matter acts as a messenger of gauge mediation to the dark sector. In our collider analysis we present cross-sections for dominant production channels and lifetime estimates for primary decay modes. We find that dark gauge bosons can be produced at the Tevatron and the LHC, either through a process analogous to prompt photon production or through a rare Z decay channel. Dark gauge bosons will decay back to the SM via \"lepton jets\" which typically contain >2 and as many as 8 leptons, significantly improving their discovery potential. Since SUSY decays from the MSSM will eventually cascade down to these lepton jets, the discovery potential for direct electroweak-ino production may also be improved. Exploiting the unique kinematics, we find that it is possible to reconstruct the mass of the MSSM LSP. We also present decay channels with displaced vertices and multiple leptons with partially correlated impact parameters. △ Less", "We present the dark matter extension of the minimal supersymmetric standard model by one more two component stable fermion N toward explaining the recent rising high energy positron spectrum of the PAMELA data. The needed coupling can arise in the flipped-SU(5) GUT. △ Less", "Current limit on the dark matter relic abundance may suggest that $|μ|$ should be smaller than prediction in the minimal supergravity scenario (mSUGRA) for moderate $m_0$ and $m_{1/2}$. The electroweak-ino parameter $M_1, M_2$ and $|μ|$ are then much closer to each other. This can be realized naturally in the non-universal Higgs mass model (NUHM). Since the heaviest neutralino ($\\tildeχ^0_4$) and chargino ($\\tildeχ^\\pm_2$) have significant gaugino components, they may appear frequently in the left-handed squark decay and then be detectable at the LHC. In such a case, we showed that the hierarchy of $M_1, M_2$ and $|μ|$ can be determined. In the light slepton mass scenario with non-vanishing lepton-flavor violation (LFV) in the right-handed sector, NUHM with small $|μ|$ corresponds to region of parameter space where strong cancellation among leading contributions to $Br(μ\\to eγ)$ can occur. We showed that determination of electroweak-ino hierarchy plays a crucial role in resolving cancellation point of $Br(μ\\to eγ)$ and determination of LFV parameters. We also discussed test of the universality of the slepton masses at the LHC and the implications to SUSY flavor models. △ Less", "We consider 5-dimensional supersymmetric field theories where supersymmetry is broken by the Scherk-Schwarz mechanism (or, equivalently, by the F-term VEV of the radion). In such models, the radion effective potential is calculable in terms of the 5d gauge coupling, the UV cutoff of the 5d field theory, and the field content. We provide simple, explicit formulae for the leading part of the two-loop effective potential. Our analysis applies in particular to 5d orbifold GUTs motivated by heterotic orbifold models. We focus on potentially realistic models of this type and make the additional assumption that the UV cutoff scale is identical with the strong-coupling scale of the 5d gauge theory. Given our stabilization mechanism, the 5d radius is now fixed in terms of the 5d gauge coupling and the field content of the model. This implies a prediction for the effective 4d gauge coupling only in terms of the field content of the model. Given the `micro-landscape' provided by the different possible distributions of Standard Model fields between bulk and branes, we find a subset of models with a realistic unified gauge coupling. We also discuss two possibilities for the `uplifting' of our SUSY-breaking AdS vacua: One is based on the possible presence of a weak warping, the other appeals to F-terms in an extra brane-localized SUSY-breaking sector. △ Less", "Scalar MSSM Higgs boson production via gluon fusion gg -> h,H is mediated by heavy quark and squark loops. The higher order QCD corrections to these processes turn out to be large. The full supersymmetric QCD corrections have been calculated recently. In the limit of large SUSY masses a conceptual problem appears, i.e. the proper treatment of the large gluino mass limit. In this work we will describe the consistent decoupling of heavy gluino effects and derive the effective Lagrangian for decoupled gluinos. △ Less", "We study the minimal gauged U(1)_{B-L} supersymmetric model and show that it provides an attractive theory for spontaneous R-parity violation. Both U(1)_{B-L} and R-parity are broken by the vacuum expectation value of the right-handed sneutrino (proportional to the soft SUSY masses), thereby linking the B-L and soft SUSY scales. In this context we find a consistent mechanism for generating neutrino masses and a realistic mass spectrum, all without extending the Higgs sector of the minimal supersymmetry standard model. We discuss the most relevant collider signals and the connection between the Z' gauge boson and R-parity violation. △ Less", "In this paper we explore the constraints from B-physics observables in SUSY models of Minimal Flavor Violation, in the large tan beta regime, for both low and high scale supersymmetry breaking scenarios. We find that the rare B-decays b -> s gamma and B_s -> mu+ mu- can be quite sensitive to the scale M at which supersymmetry breaking is communicated to the visible sector. In the case of high scale supersymmetry breaking, we show that the additional gluino contribution to the b -> s gamma and B_s -> mu+ mu- rare decay rates can be significant for large tan beta, mu and M_3. The constraints on B_u -> tau nu are relatively insensitive to the precise scale of M. We also consider the additional constraints from the present direct Higgs searches at the Tevatron in the inclusive H/A -> tau tau channel, and the latest CDMS direct dark matter detection experiments. We find that altogether the constraints from B-physics, Higgs physics and direct dark matter searches can be extremely powerful in probing regions of SUSY parameter space for low M_A and large tan beta, leading to a preference for models with a lightest CP-even Higgs mass close to the current experimental limit. We find interesting regions of parameter space that satisfy all constraints and can be probed by Higgs searches at the Tevatron and the LHC and by direct dark matter searches in the near future. △ Less", "Recent progress in realising dynamical supersymmetry breaking allows the construction of simple and calculable models of gauge mediation. We discuss the phenomenology of the particularly minimal case in which the mediation is direct, and show that there are generic new and striking predictions. These include new particles with masses comparable to those of the Standard Model superpartners, associated with the pseudo-Goldstone modes of the dynamical SUSY breaking sector. Consequently there is an unavoidable departure from the MSSM. In addition the gaugino masses are typically significantly lighter than the sfermions, and their mass ratios can be different from the pattern dictated by the gauge couplings in standard (i.e. explicit) gauge mediation. We investigate these features in two distinct realisations of the dynamical SUSY breaking sector. △ Less", "Quantum gravity or string compactification can lead to effective dimension-5 operators in Grand Unified Theories which modify the gauge kinetic terms. We exhaustively discuss the group-theoretic nature of such operators for the popular SU(5), SO(10), and E(6) models. In particular, for SU(5) only a Higgs in the 200 representation can help bring the couplings to unification below the Planck scale and in consistency with proton decay limits while for a supersymmetric version 24, 75, or 200 representations are all acceptable. The results also have a direct application in non-universality of gaugino masses in a class of supersymmetric models where identical group-theoretic features obtain. △ Less", "In this paper, we consider logarithmic radiative corrections and higher order terms to the supersymmetric hilltop F- and D-term hybrid inflation models. Conventional F- and D-term hybrid inflation only predicts $n_s \\gae 0.98$. We show that via a positive quadratic and a negative quartic correction the spectral index can be reduced to $n_s=0.96$ suggested from latest WMAP result and also cosmic string problem appeared in SUSY hybrid inflation can be solved with mild tuning of the parameters if $κ\\lae 0.01$ for F-term inflation and $g \\lae 0.05$ for D-term inflation. △ Less", "We propose a new global and fully inclusive variable \\sqrt{s}_{min} for determining the mass scale of new particles in events with missing energy at hadron colliders. We define \\sqrt{s}_{min} as the minimum center-of-mass parton level energy consistent with the measured values of the total calorimeter energy E and the total visible momentum \\vec{P}. We prove that for an arbitrary event, \\sqrt{s}_{min} is simply given by the formula \\sqrt{s}_{min}=\\sqrt{E^2-P_z^2}+\\sqrt{\\met^2+M_{inv}^2}, where M_{inv} is the total mass of all invisible particles produced in the event. We use t\\bar{t} production and several supersymmetry examples to argue that the peak in the \\sqrt{s}_{min} distribution is correlated with the mass threshold of the parent particles originally produced in the event. This conjecture allows a determination of the heavy superpartner mass scale (as a function of the LSP mass) in a completely general and model-independent way, and without the need for any exclusive event reconstruction. In our SUSY examples of several multijet plus missing energy signals, the accuracy of the mass measurement based on \\sqrt{s}_{min} is typically at the percent level, and never worse than 10%. After including the effects of initial state radiation and multiple parton interactions, the precision gets worse, but for heavy SUSY mass spectra remains 10%. △ Less", "We begin an exploration of the physics associated with the general CP-conserving MSSM with Minimal Flavor Violation, the pMSSM. The 19 soft SUSY breaking parameters in this scenario are chosen so as to satisfy all existing experimental and theoretical constraints assuming that the WIMP is a conventional thermal relic, ie, the lightest neutralino. We scan this parameter space twice using both flat and log priors for the soft SUSY breaking mass parameters and compare the results which yield similar conclusions. Detailed constraints from both LEP and the Tevatron searches play a particularly important role in obtaining our final model samples. We find that the pMSSM leads to a much broader set of predictions for the properties of the SUSY partners as well as for a number of experimental observables than those found in any of the conventional SUSY breaking scenarios such as mSUGRA. This set of models can easily lead to atypical expectations for SUSY signals at the LHC. △ Less", "We study the tensions of domain walls in the deconfined phase of N=4 SUSY Yang-Mills theory on R^3 x S^1, at weak and strong coupling. We calculate the k-wall tension at one-loop order and find that it is proportional to k(N-k) (Casimir scaling). The two-loops analysis suggests that Casimir scaling persists to this order. The strong coupling calculation is performed by using the AdS/CFT correspondence. We argue that the k-wall should be identified with an NS5-brane wrapping an S^4 inside S^5 in the AdS-Schwarzschild x S^5 background in Type IIB string theory. The tension at strong coupling is compared with the weak coupling result. We also compare our results with those from lattice simulations in pure Yang-Mills theory. △ Less", "The chiral structure of supersymmetric particle couplings involving third generation Standard Model fermions depends on left-right squark and slepton mixings as well as gaugino-higgsino mixings. The shapes and intercorrelations of invariant mass distributions of a first or second generation lepton with bottoms and taus arising from adjacent branches of SUSY cascade decays are shown to be a sensitive probe of this chiral structure. All possible cascade decays that can give rise to such correlations within the MSSM are considered. For bottom-lepton correlations the distinctive structure of the invariant mass distributions distinguishes between decays originating from stop or sbottom squarks through either an intermediate chargino or neutralino. For decay through a chargino the spins of the stop and chargino are established by the form of the distribution. When the bottom charge is signed through soft muon tagging, the structure of the same-sign and opposite-sign invariant mass distributions depends on a set function of left-right and gaugino-higgsino mixings, as well as establishes the spins of all the superpartners in the sequential two-body cascade decay. Tau-lepton and tau-tau invariant mass distributions arising from MSSM cascade decays are likewise systematically considered with particular attention to their dependence on tau polarization. All possible tau-lepton and tau-tau distributions are plotted using a semi-analytic model for hadronic one-prong taus. Algorithms for fitting tau-tau and tau-lepton distributions to data are suggested. △ Less", "We propose a simple renormalizable left-right theory where R-parity is spontaneously broken and neutrino masses are generated through the Type I seesaw mechanism and R-parity violation. In this theory R-parity and the gauge symmetry are broken by the sneutrino vacuum expectation values and there is no Majoron problem. The SU(2)_R and R-parity violation scales are determined by the SUSY breaking scale making the model very predictive. We discuss the spectrum and possible tests of the theory through the neutralinos, charginos, Z^' and W_R decays at the Large Hadron Collider. △ Less", "Cascade decays of Supersymmetric (SUSY) particles are likely to be prolific sources of Higgs bosons at the Large Hadron Collider (LHC). In this work, we explore, with the help of detailed simulation, the role of non-universal gaugino masses in the production of the Higgs bosons under SUSY cascades. The analysis is carried out by choosing an appropriate set of benchmark points with non-universal gaugino masses in the relevant SUSY parameter space and then contrasting the resulting observations with the corresponding cases having universal relationship among the same. It is shown that even of data at an early phase of the LHC-run with 10 fb$^{-1}$ one would be able to see, under favourable situations, the imprint of non-universal gaugino masses by reconstructing various Higgs boson resonances and comparing their rates. With increased accumulated luminosities, the indications would naturally become distinct over a larger region of the parameter space. △ Less", "We propose to use the MT2 concept to measure the masses of all particles in SUSY-like events with two unobservable, identical particles. To this end we generalize the usual notion of MT2 and define a new MT2(n,p,c) variable, which can be applied to various subsystem topologies, as well as the full event topology. We derive analytic formulas for its endpoint MT2{max}(n,p,c) as a function of the unknown test mass Mc of the final particle in the subchain and the transverse momentum pT due to radiation from the initial state. We show that the endpoint functions MT2{max}(n,p,c)(Mc,pT) may exhibit three different types of kinks and discuss the origin of each type. We prove that the subsystem MT2(n,p,c) variables by themselves already yield a sufficient number of measurements for a complete determination of the mass spectrum (including the overall mass scale). As an illustration, we consider the simple case of a decay chain with up to three heavy particles, X2 -> X1 -> X0, which is rather problematic for all other mass measurement methods. We propose three different MT2-based methods, each of which allows a complete determination of the masses of particles X0, X1 and X2. The first method only uses MT2(n,p,c) endpoint measurements at a single fixed value of the test mass Mc. In the second method the unknown mass spectrum is fitted to one or more endpoint functions MT2{max}(n,p,c)(Mc,pT) exhibiting a kink. The third method is hybrid, combining MT2 endpoints with measurements of kinematic edges in invariant mass distributions. As a practical application of our methods, we show that the dilepton W+W- and tt-bar samples at the Tevatron can be used for an independent determination of the masses of the top quark, the W boson and the neutrino, without any prior assumptions. △ Less", "We point out the possibility that the magnitude of the bare gauge coupling constant is determined theoretically in a composite model of all particles in SUSY theories. We show explicitly in two space-time dimensions that the NL/L SUSY relation (i.e., a SUSY compositeness condition for all particles) between N = 2 LSUSY QED and N = 2 NLSUSY determines the magnitude of the bare electromagnetic coupling constant (i.e., the fine structure constant) of N = 2 LSUSY QED. △ Less", "The basic idea and some physical implications of nonlinear supersymmetric general relativity (NLSUSY GR) are presented. NLSUSY GR may give new insights into the origin of mass and the mysterious relations between the cosmology and the low energy particle physics, e.g. the spontaneous SUSY breaking scale, the cosmological constant, the (dark) energy density of the universe and the neutrino mass. △ Less", "The sequestering of supersymmetry (SUSY) breaking parameters, which is induced by superconformal hidden sector, is one of the solutions for the mu/B_mu problem in gauge-mediated SUSY-breaking scenario. However, it is found that the minimal messenger model does not derive the correct electroweak symmetry breaking. In this paper we present a model which has the coupling of the messengers with the SO(10) GUT-symmetry breaking Higgs fields. The model is one of the realistic extensions of the gauge mediation model with superconformal hidden sector. It is shown that the extension is applicable for a broad range of conformality breaking scale. △ Less", "We show that in (anomalous) U(1) gauge theories with the Fayet-Iliopoulos (FI) term and with generic interactions there are meta-stable vacua in which supersymmetry (SUSY) is spontaneously broken even without U(1)_R symmetry and various hierarchical structures, for example, Yukawa hierarchy, can be explained by the smallness of the FI parameter. When we introduce generic interactions, i.e., all interactions including higher dimensional interactions which are allowed by the symmetry of the theory with O(1) coefficients, various scales can be determined by the symmetry (U(1) charges of the introduced fields). We examine how to determine the various scales, the vacuum expectation values (VEVs), and the scales of F-term and of D-term. Moreover, we propose a new scenario for the stabilization of the moduli in the SUSY breaking models. △ Less", "Low-energy SUSY and several other theories that address the hierarchy problem predict pair-production at the LHC of particles with Standard Model quantum numbers that decay to jets, missing energy, and possibly leptons. If an excess of such events is seen in LHC data, a theoretical framework in which to describe it will be essential to constraining the structure of the new physics. We propose a basis of four deliberately simplified models, each specified by only 2-3 masses and 4-5 branching ratios, for use in a first characterization of data. Fits of these simplified models to the data furnish a quantitative presentation of the jet structure, electroweak decays, and heavy-flavor content of the data, independent of detector effects. These fits, together with plots comparing their predictions to distributions in data, can be used as targets for describing the data within any full theoretical model. △ Less", "The similarity of massive CSW scalar vertices and quark vertices can be understood using a kind of light-cone SUSY transformation presented in this paper. We also show that the canonical transformation generating the MHV-SQCD lagrangian, can be fixed by applying this light-cone SUSY transformation to the canonical transformation for MHV-QCD obtained in paper arxiv:0805.0239. Most of the massive CSW vertices for SQCD can also be pinned down in this way. △ Less", "An accurate quantum three-body calculation is performed for the new type of big-bang nucleosynthesis (BBN) reactions that are catalyzed by a long-lived negatively-charged, massive leptonic particle (called X^-) such as the supersymmetric (SUSY) particle stau. The reactions studied here includes, i) 4He-transfer reactions such as (4He X)+d --> 6Li+X, ii) radiative capture reactions such as (7Be X)+ p --> (8B X) + gamma, iii) three-body breakup reactions such as (7Li X)+ p --> 4He+4He+X, iv) charge-exchange reactions such as (p X)+4He -->(4He X) +p, and v) neutron induced reactions such as (8Be X)+ n -->9Be+X, where (A X) denotes a Coulombic bound state of a nucleus A and X^-. In recent papers it has been claimed that some of the catalyzed BBN reactions have significantly large cross sections so as to markedly change the abundances of some elements, not only giving a solution to the 6Li-7Li problem (calculated underproduction of 6Li by a factor of 1000 and overproduction of 7Li+7Be by a factor of nearly 3) but also imposing strong restrictions on the lifetime and the primordial abundance of X^-. However, most of the calculations of these reaction cross sections in the literature were performed assuming too naive models or approximations that are unsuitable for the complicated low-energy nuclear reactions. We use a high-accuracy few-body calculational method developed by the authors, and provide precise cross sections and rates of these catalyzed BBN reactions for use in the BBN network calculation. △ Less", "In the very early stages of LHC running, uncertainties in detector performance will lead to large ambiguities in jet, electron and photon energy measurements, along with inferred missing transverse energy. However, muon detection should be quite straightforward, with the added benefit that muons can be reliably detected down to transverse energies of order 5 GeV. Supersymmetry discovery through multimuon channels has been extensively explored in the literature, but always relying on hard ET^miss cuts. Here, we quantify signal and background rates for same-sign (SS) dimuon and multimuon production at the LHC without any ET^miss cuts. The LHC, operating at \\sqrt{s}=10 TeV, should be able to discover a signal over expected background consistent with gluino pair production for m_{\\tg}\\alt 450 (550) GeV in the SS dimuon plus \\ge 4 jets state with just 0.1 (0.2) fb^{-1} of integrated luminosity. △ Less", "Hybrid inflation faces two well-known problems: the blue spectrum of the non-supersymmetric version of the model and the fine-tuning of the initial conditions of the fields leading to sufficient inflation to account for the standard cosmological problems. They are investigated by studying the exact two-fields dynamics instead of assuming slow-roll. When the field values are restricted to be less than the reduced Planck mass, a non-negligible part of the initial condition space (around 15% depending on potential parameters) leads to successful inflation. Most of it is located outside the usual inflationary valley and organized in continuous patterns instead of being isolated as previously found. Their existence is explained and their properties are studied. This shows that no excessive fine-tuning is required for successful hybrid inflation. Moreover, by extending the initial condition space to planckian-like or super-planckian values, inflation becomes generically sufficiently long and can produce a red-tilted scalar power spectrum due to slow-roll violations. The robustness of these properties is confirmed by conducting our analysis on three other models of hybrid-type inflation in various framework: \"smooth\" and \"shifted\" inflation in SUSY and SUGRA, and \"radion assisted\" gauge inflation. A high percentage of successful inflation for smooth hybrid inflation (up to 80%) is observed. △ Less"]