["It is well known that global symmetries protect local supersymmetry and a zero value for the cosmological constant in no--scale supergravity. The breakdown of these symmetries, which ensure the vanishing of the vacuum energy density, results in a set of degenerate vacua with broken and unbroken supersymmetry leading to the natural realisation of the multiple point principle (MPP). Assuming the degeneracy of vacua with broken and unbroken SUSY in the hidden sector we estimate the value of the cosmological constant. We argue that the observed value of the dark energy density can be reproduced in the split-SUSY scenario if the SUSY breaking scale is of the order of 10^{10} GeV. △ Less", "Models like the Supersymmetric Standard Model (SSM) possess simple, but well-hidden, `Outfields'. These Outfields are composite operators that violate superspace invariance, but in a special way. A new mechanism for SUSY breaking arises from the Outfields, for a special non-minimal version of the SSM, which will be called the CSSM. The CSSM has right neutrinos and a Higgs singlet, which we call J, in addition to the usual SSM. This breaking of SUSY cannot be avoided, because it arises from the local BRST cohomology of the theory, which is also the origin of the Outfields. It can also be seen that the Weak SU(2) group, and the well-known remarkable set of doublets and singlets for the Quarks, Leptons and Higgs, have a raison d'etre which relates to this mechanism. The SUSY breaking here depends on only one parameter, which is the VEV that breaks SU(2) X U(1) to U(1). SUSY itself is not spontaneously broken here, so the vacuum energy remains zero after SUSY breaking. The resulting predictions for SUSY breaking are very constrained by the model. △ Less", "In this paper the zero modes of the de Donder gauge Faddeev-Popov operator for three dimensional gravity with negative cosmological constant are analyzed. It is found that the three dimensional AdS vacuum produces (infinitely many) normalizable, smooth zero modes of the Faddeev-Popov operator. On the other hand, it is found that the BTZ black hole (including the zero mass black hole) does not generate zero modes. This differs from the usual Gribov problem in QCD where close to the maximally symmetric vacuum, the Faddeev-Popov determinant is positive definite while \"far enough\" from the vacuum it can vanish. This suggests that the zero mass BTZ black hole could be a suitable ground state of three dimensional gravity with negative cosmological constant. Due to the kinematic origin of this result, it also applies for other covariant gravity theories in three dimensions with AdS_3 as maximally symmetric solution, such as new massive gravity and topologically massive gravity. The relevance of these results for SUSY breaking is pointed out. △ Less", "We study the impact of a type-I SUSY seesaw concerning lepton flavour violation (LFV) at low-energies and at the LHC. At the LHC, $ χ_2^0\\to \\tilde \\ell \\,\\ell \\to \\ell \\,\\ell\\,χ_1^0$ decays, in combination with other observables, render feasible the reconstruction of the masses of the intermediate sleptons, and hence the study of $\\ell_i - \\ell_j$ mass differences. If interpreted as being due to the violation of lepton flavour, high-energy observables, such as large slepton mass splittings and flavour violating neutralino and slepton decays, are expected to be accompanied by low-energy manifestations of LFV such as radiative and three-body lepton decays. We discuss how to devise strategies based in the interplay of slepton mass splittings as might be observed at the LHC and low-energy LFV observables to derive important information on the underlying mechanism of LFV. △ Less", "We review recent developments in models of neutrino masses and mixing. Emphases are given to models based on finite group family symmetries from which the tri-bimaximal neutrino mixing can arise. In particular, we describe one recent model based on SUSY SU(5) combined with a family symmetry based on the double tetrahedral group, T'. All 22 observable fermion masses and mixing angles and CP violating measures are fitted with only 9 parameters. In this model, a near tri-bimaximal MNS matrix and a realistic CKM matrix are simultaneously generated; the MNS matrix gets slightly modified by virtue of having the Georgi-Jarlskog relations. Due to the presence of complex Clebsch-Gordan coefficients in T', CP violation in this model is entirely geometrical in origin. The prediction of the model for the leptonic Dirac CP phase is 227 degrees, which turns out to be very close to the current best fit value of 220 degrees from SuperK. △ Less", "New Physics scenarios generally predict the existence of very heavy quantum states that can possibly manifest themselves as peaks in the cross sections at the LHC. For values of the parameters in certain domains, different nonstandard models can generate peaks with the same mass and same number of events. In this case, the spin determination of a peak, requiring the angular analysis of the events, becomes crucial in order to identify the relevant nonstandard source. We here discuss, using a particularly suitable symmetrically integrated angular asymmetry applied to Drell-Yan dilepton and diphoton events at LHC, the identification reach on the exchanges in these reactions of the following heavy bosons: spin-2 Randall-Sundrum graviton excitations; spin-1 heavy neutral gauge bosons Z^\\prime; and spin-0 SUSY R-parity violating sneutrinos. △ Less", "The long-lived stau scenario is an interesting possibility at the LHC. We study squark mass measurements in this scenario; in particular, we show that left- and right-handed squark masses are both measurable. In SUSY events, multiple jets are expected, which become a source of combinatorial backgrounds. In order to reduce such backgrounds a hemisphere analysis is applied, and we discuss mass measurements of squarks in decay modes of left-handed squark into quark + (neutral / charged) Wino and also right-handed squark into quark + Bino. △ Less", "Properties of Dirac neutralinos and the corresponding EW scalar gauge bosons, as predicted by the N=1/N=2 hybrid supersymmetric model, and prospects for their discovery at colliders are discussed. △ Less", "I present an overview of theoretical expectations for detection of dark matter (DM) at the LHC, concentrating entirely on supersymmetric candidates. En route, I present a unified theory which explains dark matter signals at indirect and direct detection experiments. While direct DM detection is likely impossible at LHC, detection of SUSY matter states is robust, where LHC with \\sqrt{s}=7 TeV and 1fb^{-1} can access m(gluino) 1 TeV for m(squark) m(gluino), and m(gluino) 640 GeV for m(squark)>> m(gluino). Models with well-tempered neutralinos will soon be tested by Xenon-100/LUX, and should provide a distinctive mass edge at LHC in the m(l+l-) distribution. In the case of SUSY, neutralino dark matter now seems highly disfavored by both the magnitude of the dark matter density, and also the gravitino problem. Alternatively, the PQMSSM yields a solution to the strong CP problem, provides all the benefits of SUSY, and solves several cosmological problems. Predictions for SUSY particles at the LHC from the PQMSSM are quite different from the case of neutralino dark matter. Compelling models such as Yukawa-unifed SUSY or Effective SUSY, which would be excluded with neutralino DM, are perfectly viable with mixed axion/axino DM. △ Less", "We compute the potential between a $q{\\bar q}$ singlet for ${\\cal N}=4$ $SUSY$ with gauge group $SU(N)$ at finite temperature $T$, large distances $rT \\gg 1$ and weak coupling $g$. As a first step, we only consider at the electric modes and we compute the Debye mass $m_D$ where we find that each of the $8N$ bosonic degrees of freedom contributes to $m_D^2$ with $\\frac{1}{6}g^2 T^2$ while each of the $8N$ fermionic degrees of freedom contributes with $\\frac{1}{12}g^2 T^2$ yielding to $m_D^2=2Ng^2T^2$. Then, motivated by results obtained in the literature from both, a weak coupling approach for $QCD$ and a large coupling investigation of ${\\cal N}=4$ $SUSY$ through $AdS/CFT$, we attempt to include magnetic mode corrections. △ Less", "We have been developing a program package called GRACE/SUSY-loop which is for the automatic calculations of the MSSM amplitudes in one-loop order. The non-linear gauge (NLG) fixing conditions play the crucial role in the calculations in one-loop order which contain a large number of Feynman diagrams. We present the recent progress in GRACE/SUSY-loop which is obtained by extending the non-linear gauge formalism to the slepton sector. △ Less", "We construct a Minimum Supersymmetry Standard Model expanded by a non-anomalous family (NAF) U(1)'_{NAF} gauge symmetry. All gauge anomalies are cancelled with no additional exotics other than the three right-handed neutrinos. The FI D-terms associated with the U(1)'_{NAF} symmetry lead to additional positive contributions to slepton squared masses. In a RG invariant way, this thus solves the tachyonic slepton mass problem in Anomaly Mediated Supersymmetry Breaking. In addition, the U(1)'_{NAF} symmetry naturally gives rise to the fermion mass hierarchy and mixing angles, and determines the mass spectrum of the sparticles. Our model also provides a counter example to the previous claim that the only U(1)' that can give rise to realistic fermion mass hierarchy and mixing pattern must be anomalous. △ Less", "We propose the complex group theoretical Clebsch-Gordon coefficients as a novel origin of CP violation. This is manifest in our model based on SUSY SU(5) combined with the double tetrahedral group, T', as a family symmetry. Due to the presence of the doublet representations in T', there exist complex CG coefficients, leading to explicit CP violation in the model, while the Yukawa couplings and the vacuum expectation values of the scalar fields remain real. The tri-bimaximal neutrino mixing matrix arises from the CG coefficients of T'. In addition to the prediction for theta_{13} ~ (1/ (3\\sqrt{2}) theta_{c}, the model gives rise to a sum rule, tan^{2} theta_{sol} ~ tan^{2} theta_{sol, TBM}} + (1/2) theta_{c} cos(delta_{lep}), which is a consequence of the Georgi-Jarlskog relations in the charged fermion sector. The predicted leptonic Dirac CP phase, delta_{lep}, gives the correct value of the solar mixing angle, and the predicted CP violation measures in the quark sector are consistent with the current experimental data. Since the Dirac CP phase is the only non-vanishing phase predicted in the lepton sector, there is a connection between leptogenesis and low energy leptonic CP violating processes in our model. △ Less", "We study cascade hierarchy in supersymmetric SU(5) grand unified theory. The neutrino Dirac mass matrix of the cascade form can lead to the tri-bimaximal generation mixing at the leading order in the seesaw mechanism while the down quark mass matrix of a hybrid cascade form naturally gives the CKM structure. We embed such experimentally favored mass textures into supersymmetric SU(5) GUT, which gives a relation between the down quark and charged lepton mass matrices. Related phenomenologies, such as lepton flavor violating processes and leptogenesis, are also investigated in addition to lepton mixing angles. △ Less", "A canonical signature of the Minimal Supersymmetric Standard Model (MSSM) is the presence of a neutral Higgs boson with mass bounded from above by about 135 GeV and Standard Model (SM)-like couplings to the electroweak gauge bosons. In this note we investigate the reach of the Tevatron collider for the MSSM Higgs sector parameter space associated with a variety of high-scale minimal models of supersymmetry (SUSY)-breaking, including the Constrained MSSM (CMSSM), minimal Gauge Mediated SUSY-breaking (mGMSB), and minimal Anomaly Mediated SUSY-breaking (mAMSB). We find that the Tevatron can provide strong constraints on these models via Higgs boson searches. Considering a simple projection for the efficiency improvements in the Tevatron analyses, we find that with an integrated luminosity of 16 fb^-1 per detector and an efficiency improvement of 20% compared to the present situation, these models could be probed essentially over their entire ranges of validity. With 40% analysis improvements and 16 fb^-1, our projection shows that evidence at the 3-sigma level for the light Higgs boson could be expected in extended regions of parameter space. △ Less", "Supersymmetric (SUSY) Grand Unified theories (GUTs) generally predict FCNC and CP violating processes to occur both in the leptonic and hadronic sectors. Assuming an underlying SU(5) group plus right-handed neutrinos (RN), we perform an extensive study of FCNC and CP violation, analyzing the correlations between leptonic and hadronic processes like mu-> e gamma and K-Kbar mixing, tau->mu gamma and b -> s transitions such as B_d -> phi K_s and Bs-Bsbar mixing. Moreover, we examine the impact of the considered scenario on the UT analyses, monitoring the low energy consequences implied by possible solutions to the various tensions in the present UT analyses. We compare the phenomenological implications of this NP scenario with the ones of supersymmetric flavour models finding a few striking differences that could allow to distinguish these different NP models. △ Less", "We give a progress report on the calculation of B meson mixing matrix elements, focusing on contributions that could arise beyond the Standard Model. The calculation uses asqtad (light quark) and Fermilab (heavy quark) valence actions and MILC ensembles with 2+1 flavors of asqtad sea quarks. We report preliminary B^0_s fit results, at a lattice spacing of 0.12 fm, for the SUSY basis of effective four-quark mixing operators and include an estimate for the final error budget. △ Less", "I analyze a fourth generation lepton sector in which the lightest particle is a stable Majorana neutrino. In this scenario fourth generation neutrinos have both a Dirac and Majorana mass, resulting in two Majorana neutrino mass eigenstates. A reanalysis of LEP's lower mass bound is performed on stable Majorana neutrinos from the Z width and the lower mass bound is loosened. I also extrapolate LEP's SUSY squark search with a 2 jet plus missing missing energy final state to the production and decay of a pair of heavy Majorana neutrinos; here it is expected that significant regions of the neutrino mass plane may be ruled out. Finally, a search strategy is proposed for heavy fourth generation neutrino pairs at LHC in the four lepton plus missing energy channel. Exclusions are set in the neutrino mass plane for 30 inverse fb of data at LHC for 13 TeV. △ Less", "Supersymmetry, a new symmetry that relates bosons and fermions in particle physics, still escapes observation. Search for SUSY is one of the main aims of the recently launched Large Hadron Collider. The other possible manifestation of SUSY is the Dark Matter in the Universe. The present lectures contain a brief introduction to supersymmetry in particle physics. The main notions of supersymmetry are introduced. The supersymmetric extension of the Standard Model - the Minimal Supersymmetric Standard Model - is considered in more detail. Phenomenological features of the MSSM as well as possible experimental signatures of SUSY at the LHC are described. The DM problem and its possible SUSY solution is presented. △ Less", "We propose two viable scenarios explaining the recent observations on cosmic positron excess. In both scenarios, the present relic density in the Universe is assumed to be still supported by thermally produced WIMP or LSP (χ). One of the scenarios is based on two dark matter (DM) components (χ,X) scenario, and the other is on SO(10) SUSY GUT. In the two DM components scenario, extremely small amount of non-thermally produced meta-stable DM component [O(10^{-10}) < n_X /n_χ] explains the cosmic positron excess. In the SO(10) model, extremely small R-parity violation for LSP decay to e^\\pm is naturally achieved with a non-zero VEV of the superpartner of one right-handed neutrino (\\tildeν^c) and a global symmetry. △ Less", "Gaugino AMSB models-- wherein scalar and trilinear soft SUSY breaking terms are suppressed at the GUT scale while gaugino masses adopt the AMSB form-- yield a characteristic SUSY particle mass spectrum with light sleptons along with a nearly degenerate wino-like lightest neutralino and quasi-stable chargino. The left- sleptons and sneutrinos can be pair produced at sufficiently high rates to yield observable signals at the Fermilab Tevatron. We calculate the rate for isolated single and dilepton plus missing energy signals, along with the presence of one or two highly ionizing chargino tracks. We find that Tevatron experiments should be able to probe gravitino masses into the ~55 TeV range for inoAMSB models, which corresponds to a reach in gluino mass of over 1100 GeV. △ Less", "We review progress made over the past couple of years in the field of Swiss Cheese Phenomenology involving a mobile space-time filling D3-brane and stack(s) of fluxed D7-branes wrapping the \"big\" (as opposed to the \"small\") divisor in (the orientifold of a) Swiss-Cheese Calabi-Yau. The topics reviewed include reconciliation of large volume cosmology and phenomenology, evaluation of soft supersymmetry breaking parameters, one-loop RG-flow equations' solutions for scalar masses, obtaining fermionic (possibly first two generations' quarks/leptons) mass scales in the O(MeV-GeV)-regime as well as (first two generations') neutrino masses (and their one-loop RG flow) of around an eV. The heavy sparticles and the light fermions indicate the possibility of \"split SUSY\" large volume scenario. △ Less", "We analyze the prospect for observing the intermediate neutral Higgs boson ($h_2$) in its decay to two lighter Higgs bosons ($h_1$) at the presently operating hadron colliders in the framework of the CP violating MSSM using the PYTHIA event generator. We consider the lepton+ 4-jets+ $\\met$ channel from associate $W h_2$ production, with $W h_2 \\ra W h_1 h_1 \\ra \\ell ν_\\ell b \\bar b b\\bar b$. We require two or three tagged $b$-jets. We explicitly consider all relevant Standard Model backgrounds, treating $c$-jets separately from light flavor and gluon jets and allowing for mistagging. We find that it is very hard to observe this signature at the Tevatron, even with 20 fb$^{-1}$ of data, in the LEP--allowed region of parameter space due to the small signal efficiency. At the LHC, a priori huge SM backgrounds can be suppressed by applying judiciously chosen kinematical selections. After all cuts, we are left with a signal cross section of around 0.5 fb, and a signal to background ratio between 1.2 and 2.9. According to our analysis this Higgs signal should be viable at the LHC in the vicinity of present LEP exclusion once 20 to 50 fb$^{-1}$ of data have been accumulated at $\\sqrt{s}=14$ TeV. △ Less", "We discuss supersymmetric scenarios in which neutrino masses arise from effective d=6 operators in the Kahler potential (including SUSY-breaking insertions). Simple explicit realizations of those Kahler operators are presented in the context of the type II seesaw. An appealing scenario emerges upon identifying the seesaw mediators with SUSY-breaking messengers. △ Less", "The seesaw mechanism is the most popular explanation for the smallness of neutrino masses. However, its high scale makes direct tests impossible and only indirect signals at low energies are reachable for collider experiments. One of these indirect links with the high scale is lepton flavor violation (LFV). We discuss LFV decays of sleptons in the context of a SUSY left-right symmetric model that naturally incorporates the seesaw mechanism. This non-minimal embedding of the seesaw leads to observable LFV effects in the right-handed sleptons sector, contrary to minimal models where these are found to be totally negligible. Therefore, LFV observables can be used as a powerful tool to study physics right below the GUT scale. △ Less", "Successful Soft Leptogenesis (SL) requires a relatively low mass scale for the SU(2) singlet neutrinos of $10^5-10^8$ GeV. However, conventional SL (unflavoured) requires an unnaturally small soft supersymmetry(SUSY)-breaking bilinear $B \\ll \\mathcal{O}({\\rm TeV})$ coupling for successful leptogenesis. On the other hand, in this regime, the interactions mediated by $τ$, $μ$ (and even $e$) charged lepton Yukawa interactions are in equilibrium, making the lepton number asymmetries and the washouts flavour dependent. Hence, it is crucial to take into account the flavour effects. Considering a general soft SUSY-breaking trilinear $A$ couplings, it is possible to enhance the efficiency up to $\\mathcal{O}(1000)$ compared to the unflavoured case. With the enhanced efficiency, we can raise the $B$ up to TeV scale for successful leptogenesis. Taking into account the low energy constraints, we verify that the fast lepton flavour violation processes induced by the soft SUSY-breaking slepton masses would not destroy the enhancement. △ Less", "In this paper, we consider a chaotic inflation model where the role of inflaton is played by the Higgs triplet in type II seesaw mechanism for generating the small masses of left-handed neutrinos. Leptogenesis could happen after inflation. This model is constructed without introducing supersymmetry (SUSY). △ Less", "Two-loop threshold corrections for both the strong coupling constant and Yukawa couplings of heavy SM fermions are considered in the context of Minimal Supersymmetric Standard Model (MSSM). With the help of the well-known SOFTSUSY code the dependence of the corrections on universal MSSM parameters is analyzed. For a consistent study of the influence of the corrections on SUSY mass spectrum three-loop renormalization group equations are implemented. A particular scenario (SPS4) is considered and the shifts of the particle masses due to contributions of different threshold corrections are presented. Additionally, the impact on certain forbidden regions of the parameter space is studied. △ Less", "We show that the like-sign di-muon anomaly reported recently by the D0 Collaboration can be explained in the supersymmetric standard model (SM) if the squarks and the sleptons in the first two generations have relatively small, but degenerate mass spectrum, and those in the third generation are larger as O(1-10)TeV. This split generation model provides large contributions to the B_s-{\\bar B}_s mixing, although most of the FCNC's are suppressed due to the large masses of the third generation squarks or the GIM mechanism partially acting on the first and second generations. △ Less", "Successful implementation of thermal leptogenesis requires re-heat temperatures T_R\\agt 2\\times 10^9 GeV, in apparent conflict with SUSY models with TeV-scale gravitinos, which require much lower T_R in order to avoid Big Bang Nucleosynthesis (BBN) constraints. We show that mixed axion/axino dark matter can reconcile thermal leptogenesis with the gravitino problem in models with m_{\\tG}\\agt 30 TeV, a rather high Peccei-Quinn breaking scale and an initial mis-alignment angle θ_i < 1. We calculate axion and axino dark matter production from four sources, and impose BBN constraints on long-lived gravitinos and neutralinos. Moreover, we discuss several SUSY models which naturally have gravitino masses of the order of tens of TeV. We find a reconciliation difficult in Yukawa-unified SUSY and in AMSB with a wino-like lightest neutralino. However, T_R\\sim 10^{10}-10^{12} GeV can easily be achieved in effective SUSY and in models based on mixed moduli-anomaly mediation. Consequences of this scenario include: 1. an LHC SUSY discovery should be consistent with SUSY models with a large gravitino mass, 2. an apparent neutralino relic abundance Ω_{\\tz_1}h^2\\alt 1, 3. no WIMP direct or indirect detection signals should be found, and 4. the axion mass should be less than \\sim 10^{-6} eV, somewhat below the conventional range which is explored by microwave cavity axion detection experiments. △ Less", "We analyze the potential of the first LHC physics run, assuming 1/fb at sqrt[s] = 7 TeV, to discover Supersymmetry (SUSY). The results are based on SUSY parameter fits following a frequentist approach. They include the experimental constraints from electroweak precision data, (g-2)_mu, B-physics and cosmological data. The two SUSY models under consideration are the constrained MSSM (CMSSM) with universal soft supersymmetry-breaking mass parameters, and a model with common non-universal Higgs mass parameters in the superpotential (NUHM1). We find that large parts of the regions preferred at the 68% C.L. are accessible to early LHC running. △ Less", "We derive predictions for Yukawa coupling ratios within GUTs generated from operators with mass dimension four and five. These relations are a characteristic property of unified flavour models and can reduce the large number of free parameters related to the flavour sector of the SM. The Yukawa couplings of the down-type quarks and charged leptons are affected within SUSY models by tan beta-enhanced threshold corrections. We analyse these corrections and give simple analytic expressions and numerical estimates for them. The threshold corrections sensitively depend on the soft SUSY breaking parameters. Especially, they determine if the affected Yukawa couplings are enhanced or suppressed. In a first approach, we make some plausible assumptions about the soft SUSY parameters. In a second, more sophisticated approach we use three common breaking schemes in which all the soft breaking parameters at the electroweak scale can be calculated from only a handful of parameters. Within this approach, we apply various phenomenological constraints on the supersymmetric parameters and find in this way new viable Yukawa coupling relations, for example y_mu/y_s = 9/2 or 6 or y_tau/y_b = 3/2 in SU(5). Furthermore, we study a special class of quark mass matrix textures for small tan beta where theta_13^u = theta_13^d = 0. We derive sum rules for the quark mixing parameters and find a simple relation between the two phases delta_12^u and delta_12^d and the right unitarity triangle angle alpha which suggests a simple phase structure for the quark mass matrices. To complement the aforementioned considerations, we give two explicit examples in an SU(5) context, one for large and one for small tan beta which implement the Yukawa coupling relations mentioned before. The models have interesting phenomenological consequences like, for example, quasi-degenerate neutrino masses in the case of small tan beta. △ Less", "We study the Tevatron signatures of promptly-decaying slepton co-NLSPs in the context of General Gauge Mediation (GGM). The signatures consist of trileptons plus MET and same-sign dileptons plus MET. Focusing first on electroweak production, where the Tevatron has an advantage over the early LHC, we establish four simple benchmark scenarios within the parameter space of GGM which qualitatively capture all the relevant phenomenology. We derive limits on these benchmarks from existing searches, estimate the discovery potential with 10 fb^-1, and discuss ways in which these searches can be optimized for slepton co-NLSPs. We also analyze the Tevatron constraints on a scenario with light gluinos that could be discovered at the early LHC. Overall, we find that the Tevatron still has excellent reach for the discovery of SUSY in multilepton final states. Finally, we comment on the possible interpretation of a mild \"excess\" in the CDF same-sign dilepton search in terms of slepton co-NLSPs. △ Less", "We present benchmark points for Pure General Gauge Mediation (GGM) models specifically optimised for early LHC searches. The pure GGM set-up is as defined in our previous paper arXiv:0910.2674: namely we adopt the minimal set-up in which B_mu is generated only through gauge interactions, and as a result tan beta is a prediction rather than an input. The only input parameters are messenger masses together with two independent scales which generate gaugino and scalar masses. The parameter space favoured by current experimental data includes an interesting region with light gluinos (m_g < 500 GeV and relatively heavy squarks) and a bino-like NLSP where early discovery is likely. We also find interesting regions of parameter space where the NLSP is a stau or stau/neutralino co-NLSP and the squark masses are relatively low. We present benchmark points which are typical for each of these three regions, and give the spectrum, branching ratios, and also the overall 2 -> 2 cross-sections. This data in SLHA format can be found at http://www.ippp.dur.ac.uk/~SUSY △ Less", "The SU(5) GUT model extended with fermions in the adjoint $24_F$ representation predicts triplet fermions in the 100 GeV mass range, opening up the possibility of testing seesaw at LHC. However, once the model is supersymmerized, the triplet fermion mass is constrained to be close to the GUT scale for the gauge couplings to unify. We propose an extension of the SUSY SU(5) model where type II seesaw can be tested at LHC. In this model we add a matter chiral field in the adjoint $\\hat{24}_F$ representation and Higgs chiral superfields in the symmetric $\\hat{15}_H$ and $\\hat{\\bar{15}}_H$ representations. We call this the symmetric adjoint SUSY SU(5) model. The triplet scalar and triplet fermion masses in this model are predicted to be in the 100 GeV and $10^{13}$ GeV range respectively, while the mass of the singlet fermion remains unconstrained. This gives a type I plus type II plus type III seesaw mass term for the neutrinos. The triplet scalars with masses $\\sim 100$ GeV range can be produced at the LHC. We briefly discuss the collider phenomenology and predictions for proton decay in this model. △ Less", "We study the potential to observe CP-violating effects in SUSY cascade decay chains at the LHC. Asymmetries composed by triple products of momenta of the final state particles are sensitive to CP-violating effects. Due to large boosts that dilute the asymmetries, these can be difficult to observe. Extending the methods of momentum reconstruction we show that the original size of these asymmetries may be measurable. A study is done at the hadronic level with backgrounds to estimate the expected sensitivity at the LHC. △ Less", "Supersymmetric GUTs are the most natural extension of the Standard model unifying electroweak and strong forces. Despite their indubitable virtues, among these the gauge coupling unification and the quantization of the electric charge, one of their shortcomings is the large number of parameters used to describe the high energy thresholds (HET), which are hard to handle. We present a new method according to which the effects of the HET, in any GUT model, can be described by fewer parameters that are randomly produced from the original set of the parameters of the model. In this way, regions favoured by the experimental data are easier to locate, avoiding a detailed and time consuming exploration of the parameter space, which is multidimensional even in the most economic unifying schemes. To check the efficiency of this method, we directly apply it to a SUSY SO(10) GUT model in which the doublet-triplet splitting is realized through the Dimopoulos-Wilczek mechanism. We show that the demand of gauge coupling unification, in conjunction with precision data, locates regions of the parameter space in which values of the strong coupling \\astrong are within the experimental limits, along with a suppressed nucleon decay, mediated by a higgsino driven dimension five operators, yielding lifetimes that are comfortably above the current experimental bounds. These regions open up for values of the SUSY breaking parameters m_0, M_1/2 < 1 TeV being therefore accessible to LHC. △ Less", "Based on the low energy effective Hamiltonian with naive factorization, we calculate the branching ratios(BRs) and CP asymmetries (CPAs) for the twenty three double charm decays $B/B_s \\to D^{(*)}_{(s)} D^{(*)}_{(s)}$ in both the standard model (SM) and the minimal supergravity (mSUGRA) model. Within the considered parameter space, we find that (a) the theoretical predictions for the BRs, CPAs and the polarization fractions in the SM and the mSUGRA model are all consistent with the currently available data within $\\pm 2σ$ errors; (b) For all the considered decays, the supersymmetric contributions in the mSUGRA model are very small, less than $7\\%$ numerically. It may be difficult to observe so small SUSY contributions even at LHC. △ Less", "Formulae are derived for the positions of end-points in the invariant mass and transverse mass distributions obtained from the products of heavy states decaying to pairs of semi-invisibly decaying lighter states. Formulae are derived both for the special case where the two decay chains are identical and the more general case where they are different. The formulae are tested with a simple case study of heavy SUSY higgs particles decaying to gauginos at the LHC. △ Less", "We carry out an analysis of the potential of the Large Hadron Collider (LHC) to discover supersymmetry in runs at $\\sqrt s=7$ TeV with an accumulated luminosity of (0.1--2) fb$^{-1}$ of data. The analysis is done both with minimal supergravity (mSUGRA) and supergravity (SUGRA) models with non-universal soft breaking. Benchmarks for early discovery with (0.1--2) fb$^{-1}$ of data are given. We provide an update of b-tagging efficiencies in PGS 4 appropriate for LHC analyses. A large number of signature channels are analyzed and it is shown that each of the models exhibited are discoverable at the 5$σ$ level or more above the standard model background in several signature channels which would provide cross checks for a discovery of supersymmetry (SUSY). It is shown that some of the benchmarks are discoverable with 0.1 fb$^{-1}$ of data again with detectable signals in several channels. △ Less", "We apply a model-independent, agnostic approach to the collider phenomenology of supersymmetry (SUSY), in which all mass parameters are taken as free inputs at the weak scale. We consider the gauginos, higgsinos, and the first two generations of sleptons and squarks, and analyze all possible mass hierarchies among them ($4\\times 8!=161,280$ in total) in which the lightest superpartner is neutral, leading to missing energy. In each case, we identify the full set of the dominant (i.e. least suppressed by phase space, small mixing angles or Yukawa couplings) decay chains originating from the lightest colored superpartner. Our exhaustive search reveals several quite dramatic yet unexplored multilepton signatures with up to 8 isolated leptons (plus possibly up to 2 massive gauge or Higgs bosons) in the final state. Such events are spectacular, background-free for all practical purposes, and may lead to a discovery of SUSY in the very early stage ($\\sim 10\\ {\\rm pb}^{-1}$) of LHC operations at 7 TeV. △ Less", "Among the theories beyond the Standard Model (SM) of particle physics Supersymmetry (SUSY) provides an excellent dark matter (DM) candidate, the neutralino. One clear prediction of cosmology is the annihilation cross section of DM particles, assuming them to be a thermal relic from the early universe. In most of the parameter space of Supersymmetry the annihilation cross section is too small compared with the prediction of cosmology. However, for large values of the tan beta parameter the annihilation through s-channel pseudoscalar Higgs exchange yields the correct relic density in practically the whole range of possible SUSY masses up to the few TeV range. The required values of tan beta are typically around 50, i.e. of the order of top and bottom mass ratio, which happens to be also the range allowing for Yukawa unification in a Grand Unified Theory with gauge coupling unification. For such large values of tan beta the associated production of the heavier Higgses, which is enhanced by tan beta squared, becomes three orders of magnitude larger than the production of a simlar SM-like Higgs and could be observable as one of the first hints of new physics at the LHC. △ Less", "Mixed anomaly and gauge mediation (\"gaugomaly'' mediation) gives a natural solution to the SUSY flavor problem with a conventional LSP dark matter candidate. We present a minimal version of gaugomaly mediation where the messenger masses arise directly from anomaly mediation, automatically generating a messenger scale of order 50 TeV. We also describe a simple relaxation mechanism that gives rise to realistic mu and B mu terms. B is naturally dominated by the anomaly-mediated contribution from top loops, so the mu/B mu sector only depends on a single new parameter. In the minimal version of this scenario the full SUSY spectrum is determined by two continuous parameters (the anomaly- and gauge-mediated SUSY breaking masses) and one discrete parameter (the number of messengers). We show that these simple models can give realistic spectra with viable dark matter. △ Less", "We propose a direct gauge mediation model based on an uplifted metastable SUSY breaking coupled to supergravity. A constant superpotential plays an essential role to fix the moduli as well as breaking SUSY and R-symmetry and the cancellation of the cosmological constant. Gaugino masses are generated at leading order of SUSY breaking scale, and comparable to the sfermion masses as in the ordinary gauge mediation. Landau pole problem for QCD coupling can be easily solved since more than half of messengers become superheavy, which are heavier than the GUT scale. △ Less", "We propose a E_6 inspired supersymmetric model with a non-Abelian discrete flavor symmetry; SU(3)_c x SU(2)_W x U(1)_Y x U(1)_X x S_4 x Z_2. In our scenario, the additional abelian gauge symmetry; U(1)_X, not only solves the mu-problem in the minimal Supersymmetric Standard Model(MSSM), but also requires new exotic fields which play an important role in solving flavor puzzles. If our exotic quarks can be embedded into a S_4 triplet, which corresponds to the number of the generation, one finds that dangerous proton decay can be well-suppressed. Hence, it might be expected that the generation structure for lepton and quark in the SM(Standard Model) can be understood as a new system in order to stabilize the proton in a supersymemtric standard model (SUSY). Moreover, due to the nature of the discrete non-Abelian symmetry itself, Yukawa coupling constants of our model are drastically reduced. In our previous work, we actually have found much success. However, we also have to solve Higgs mediated FCNC at tree level, as is often the case with such extended Higgs models. In this paper, we propose a promising mechanism which could make cancellation between Higgs and SUSY contributions. △ Less", "We study methods for reconstructing the momenta of invisible particles in cascade decay chains at hadron colliders. We focus on scenarios, such as SUSY and UED, in which new physics particles are pair produced. Their subsequent decays lead to two decay chains ending with neutral stable particles escaping detection. Assuming that the masses of the decaying particles are already measured, we obtain the momenta by imposing the mass-shell constraints. Using this information, we develop techniques of determining spins of particles in theories beyond the standard model. Unlike the methods relying on Lorentz invariant variables, this method can be used to determine the spin of the particle which initiates the decay chain. We present two complementary ways of applying our method by using more inclusive variables relying on kinematic information from one decay chain, as well as constructing correlation variables based on the kinematics of both decay chains in the same event. △ Less", "The Minimal Supersymmetric extension of the Standard Model (MSSM) predicts the existence of a light neutral Higgs boson. Once found at the LHC, its mass will immediately become a precision observable. The theoretical value of the Higgs mass Mh is subject to large radiative corrections. Due to the large top Yukawa coupling, loops of top quarks and their superpartners provide the dominant contribution to the radiative corrections. We present a calculation of the SUSY-QCD corrections to these diagrams, up to the three-loop order. We find that our three-loop results can be in the range of one GeV, and are thus relevant when compared with the expected experimental accuracy at the LHC. We also find a significantly reduced dependency on the renormalisation prescription, thus decreasing the theoretical uncertainty of the prediction of Mh. △ Less", "We study the role of D-terms in supersymmetry (SUSY) breaking. By carefully analyzing the SUSY multiplets containing various conserved currents in theories with global symmetries, we obtain a number of constraints on the renormalization group flow in supersymmetric field theories. Under broad assumptions, these results imply that there are no SUSY-breaking vacua, not even metastable ones, with parametrically large D-terms. This explains the absence of such D-terms in models of dynamical SUSY-breaking. There is, however, a rich class of calculable models which generate comparable D-terms and F-terms through a variety of non-perturbative effects; these D-terms can be non-abelian. We give several explicit examples of such models, one of which is a new calculable limit of the 3-2 model. △ Less", "We review the physics potential of top mass measurements and the GigaZ/MegaW options of the International Linear Collider (ILC) for probing New Physics models and especially the Minimal Supersymmetric Standard Model (MSSM). We demonstrate that the anticipated experimental accuracies at the ILC for the top-quark mass, m_t, the W boson mass, M_W, and the effective leptonic weak mixing angle, sin^2 theta_eff, will provide a high sensitivity to quantum effects of New Physics. In particular, a new and more precise measurement of sin^2 theta_eff, for which the experimental central value is currently obtained from an average where the most precise single measurements differ by more than three standard deviations, could lead to a situation where both the Standard Model and the MSSM in its most general form are ruled out. Alternatively, the precision measurements may resolve virtual effects of SUSY particles even in scenarios where the SUSY particles are so heavy that they escape direct detection at the LHC and the first phase of the ILC. △ Less", "We explore low-scale leptogenesis in a class of supersymmetric SO(10) models using extra singlet neutrinos and the Higgs representations {126}_H\\oplus {\\ovl{126}}_H as well as {16}_H \\oplus {\\bar {16}}_H. A singlet neutrino, which can be as light as 10^5-10^6 GeV, decays through its small mixings with right-handed neutrinos creating a lepton asymmetry which is shown to be flavor dependent. While the doublet vacuum expectation value in {\\ovl{16}}_H triggers the generation of desired mixings, it also induces a large RH triplet vev that breaks the LR intermediate gauge symmetry and gives large RH neutrino masses. Manifest unification of gauge couplings and generation of heavy RH neutrino masses are achieved by renormalizable interactions. The canonical (Type-I) see-saw contributions to the light neutrino mass matrix cancel out while the Type-II see-saw contribution is negligible. Determining the parameters of the dominant inverse see-saw formula using the underlying quark-lepton symmetry and neutrino oscillation data, we show how leptogenesis under the gravitino constraint is successfully implemented. New formulas for the decay rate and the asymmetry parameter are derived leading to baryon asymmetry within the observed range. The model is found to work for hierarchical as well as inverted hierarchical light neutrino masses. Testable predictions of the model are RH doubly charged Higgs bosons which may be leptophilic and accessible to the Tevatron, LHC or a linear collider. In a model-independent manner, the Drell-Yan pair production cross section is shown to be bounded between 59%-79% of their left-handed counterparts with same mass. In contrast to single-step breaking SUSY GUTs, which predict a long proton lifetime for p\\to e^+π^0, here this lifetime is substantially reduced, bringing it within one order of the current experimental limit. △ Less", "We refine a previous zeroth order analysis of the nuclear properties of a supersymmetric (susy) universe with standard model particle content plus degenerate susy partners. No assumptions are made concerning the Higgs structure except we assume that the degenerate fermion/sfermion masses are non-zero. This alternate universe has been dubbed Susyria and it has been proposed that such a world may exist with zero vacuum energy in the string landscape. △ Less", "We examine the dark matter phenomenology in supersymmetric light higgs boson scenarios, adapting nonuniversal Higgs masses at the gauge coupling unification scale. The correct relic density is obtained mostly through the annihilation into a pseudoscalar $A$, which gives high values for the self-annihilation cross-section at present times. Our analysis shows that most part of the $A$ pole region can produce detectable gamma-rays and antiproton signals, and still be compatible with with recent direct detection data from XENON100 and CDMS-II. △ Less", "I argue that the conventional field theoretic notion of vacuum state is not valid in quantum gravity. The arguments use gravitational effective field theory, as well as results from string theory, particularly the AdS/CFT correspondence. Different solutions of the same low energy gravitational field equations correspond to different quantum systems, rather than different states in the same system. I then introduce {\\it holographic space-time} a quasi-local quantum mechanical construction based on the holographic principle. I argue that models of quantum gravity in asymptotically flat space-time will be exactly super-Poincare invariant, because the natural variables of holographic space-time for such a system, are the degrees of freedom of massless superparticles. The formalism leads to a non-singular quantum Big Bang cosmology, in which the asymptotic future is required to be a de Sitter space, with cosmological constant (c.c.) determined by cosmological initial conditions. It is also approximately SUSic in the future, with the gravitino mass $K Λ^{1/4}$. △ Less", "We investigate the phenomenology of Effective Supersymmetry (ESUSY) models wherein electroweak gauginos and third generation scalars have masses up to about 1~TeV while first and second generation scalars lie in the multi-TeV range. Such models ameliorate the SUSY flavor and CP problems via a decoupling solution, while at the same time maintaining naturalness. In our analysis, we assume independent GUT scale mass parameters for third and first/second generation scalars and for the Higgs scalars, in addition to m_{1/2}, \\tanβand A_0, and require radiative electroweak symmetry breaking as usual. We analyse the parameter space which is consistent with current constraints, by means of a Markov Chain Monte Carlo scan. The lightest MSSM particle (LMP) is mostly, but not always the lightest neutralino, and moreover, the thermal relic density of the neutralino LMP is frequently very large. These models may phenomenologically be perfectly viable if the LMP before nucleosynthesis decays into the axino plus SM particles. Dark matter is then an axion/axino mixture. At the LHC, the most important production mechanisms are gluino production (for m_{1/2} ~<700~GeV) and third generation squark production, while SUSY events rich in b-jets are the hallmark of the ESUSY scenario. We present a set of ESUSY benchmark points with characteristic features and discuss their LHC phenomenology. △ Less", "We consider a supersymmetric SU(5) model where two neutrino masses are obtained via a mixed type I+III seesaw mechanism induced by the component fields of a single SU(5) adjoint. We have analyzed the phenomenology of the model paying particular attention to flavour violating processes and dark matter relic density, assuming universal boundary conditions. We have found that, for a seesaw scale larger than $10^{12÷13}$ GeV, BR$(μ\\to e γ)$ is in the reach of the MEG experiment in sizable regions of the parameter space. On the other side, current bounds on it force BR$(τ\\to μγ)$ to be well below the reach of forthcoming experiments, rendering thus the model disprovable if a positive signal is found. The same bounds still allow for a sizable positive contribution to $ε_K$, while the CP violation in the $B_s$ mixing turns out to be too small to account for the di-muon anomaly reported by the D0 collaboration. Finally, the regions where the neutralino relic density is within the WMAP bounds can be strongly modified with respect to the constrained MSSM case. In particular, a peculiar coannihilation region, bounded from above, can be realized, which allows us to put an upper bound on the dark matter mass for certain set-ups of the parameters. △ Less", "The inclusion of gauge messengers in models of gauge mediation allows for more general predictions that those described by the framework of general gauge mediation. Motivated by this, we explore some models of gauge mediation with gauge messengers in SU(5) GUTs. In most previous attempts of building viable models where gauge messengers play a role in determining the soft terms, squark and/or slepton masses turned out to be tachyonic. The objective of this paper is to address this problem and propose two possible solutions, one of which has a natural realization in the solution of the doublet-triplet problem. Another interesting result is that in these models the association of SUSY breaking with the breaking of the GUT group provides a simple mechanism that can explain why $SU(5)\\rightarrow SU(3)\\times SU(2) \\times U(1)$ is preferred over other symmetry breaking patterns. △ Less", "Long-lived stau shows up in various supersymmetric models, like gauge-mediated supersymmetry (SUSY) breaking model. At the LHC experiment, long-lived stau is useful not only for the discovery of SUSY signals but also for the study of the detailed properties of superparticles. We discuss a method to obtain information on spins and chiralities of superparticles in the framework with long-lived stau. We also show that such a study can be used to distinguish SUSY model from other models of new physics, like the universal extra dimension model. △ Less", "The experimental prospects for precise measurements of the leptonic decays B_u -> tau nu / mu nu, B_s -> mu+ mu-, D -> mu nu and D_s -> mu nu / tau nu are very promising. Double ratios involving four of these decays can be defined in which the dependence on the values of the decay constants is essentially eliminated, thus enabling complementary measurements of the CKM matrix element V_ub with a small theoretical error. We quantify the experimental error in a possible future measurement of |V_ub| using this approach, and show that it is competitive with the anticipated precision from the conventional approaches. Moreover, it is shown that such double ratios can be more effective than the individual leptonic decays as a probe of the parameter space of supersymmetric models. We emphasize that the double ratios have the advantage of using |V_ub| as an input parameter (for which there is experimental information), while the individual decays have an uncertainty from the decay constants (e.g. f_B_s), and hence a reliance on theoretical techniques such as lattice QCD. △ Less", "We propose an SU(5) SUSY GUT of flavour with A_4 family symmetry in 8d where the vacuum alignment is achieved in an elegant way by the use of boundary conditions on orbifolds. The model involves SU(5) living in the 8d bulk, with matter living in 6d (or 4d) subspaces and Yukawa interactions occurring at a 4d point. The GUT group is broken to the Standard Model by the orbifold compactification, setting the GUT scale and leading to low energy supersymmetry and Higgs doublet-triplet splitting. The first two families of 10-plets are doubled resulting in a lack of both desirable and unwanted GUT relations. The resulting four dimensional effective superpotential leads to a realistic description of quark and lepton masses and mixing angles including tri-bimaximal neutrino mixing and an inter-family mass hierarchy provided in part by volume suppression and in part by a Froggatt-Nielsen mechanism. △ Less", "We investigate supersymmetric scenarios in which neutrino masses are generated by effective d=6 operators in the Kahler potential, rather than by the standard d=5 superpotential operator. First, we discuss some general features of such effective operators, also including SUSY-breaking insertions, and compute the relevant renormalization group equations. Contributions to neutrino masses arise at low energy both at the tree level and through finite threshold corrections. In the second part we present simple explicit realizations in which those Kahler operators arise by integrating out heavy SU(2)_W triplets, as in the type II seesaw. Distinct scenarios emerge, depending on the mechanism and the scale of SUSY-breaking mediation. In particular, we propose an appealing and economical picture in which the heavy seesaw mediators are also messengers of SUSY breaking. In this case, strong correlations exist among neutrino parameters, sparticle and Higgs masses, as well as lepton flavour violating processes. Hence, this scenario can be tested at high-energy colliders, such as the LHC, and at lower energy experiments that measure neutrino parameters or search for rare lepton decays. △ Less", "In this note we discuss a supersymmetric (SUSY) D4 x Z5 model which leads to vanishing reactor mixing angle theta_13=0 and maximal atmospheric mixing theta_23=pi/4 in the lepton sector at leading order (LO), due to the preservation of non-trivial distinct D4 subgroups in the charged lepton and neutrino sectors, respectively. The solar mixing angle theta_12 remains undetermined and is expected to be of order one. Since right-handed charged leptons transform as singlets under D4, the charged lepton mass hierarchy can be naturally accounted for. The model predicts inverted mass hierarchy for neutrinos. Additionally, we show that, unlike in most of the other models of this type, all vacuum expectation values (VEVs) of gauge singlets (flavons) can be fixed through mass parameters of the superpotential. Next-to-leading order (NLO) corrections to lepton masses and mixings are calculated and shown to be under control, especially the corrections to theta_23=pi/4 and theta_13=0 are of the order of the generic expansion parameter epsilon = 0.04 and arise dominantly from the charged lepton sector. △ Less", "We study the 'goldstini' scenario of Cheung, Nomura, and Thaler, in which multiple independent supersymmetry (SUSY) breaking sectors lead to multiple would-be goldstinos, changing collider and cosmological phenomenology. In supergravity, potentially large corrections to the previous prediction of twice the gravitino mass for goldstini masses can arise when their scalar partners are stabilized far from the origin. Considerations arising from the complexity of realistic string compactifications indicate that many of the independent SUSY-breaking sectors should be conformally sequestered or situated in warped Randall-Sundrum-like throats, further changing the predicted goldstini masses. If the sequestered hidden sector is a metastable SUSY-breaking sector of the Intriligator-Seiberg-Shih (ISS) type then multiple goldstini can originate from within a single sector, along with many supplementary 'modulini', all with masses of order twice the gravitino mass. These fields can couple to the Supersymmetric Standard Model (SSM) via the 'Goldstino Portal'. Collider signatures involving SSM sparticle decays can provide strong evidence for warped-or-conformally-sequestered sectors, and of the ISS mechanism of SUSY breaking. Along with axions and photini, the Goldstino Portal gives another potential window to the hidden sectors of string theory. △ Less", "One can always write the mass matrix for Weyl spinors so that it is symmetric. However this is often not a good idea. It is usually incompatible with irreducibility of the fermion representations. As a result, a symmetrized mass term hides important symmetries and creates misleading difficulties that are not genuinely part of the theory. This is true for the Standard Model for example, and for its supersymmetric versions. There is a related subtlety, involving symmetrization of the interaction terms, that is central to the SUSY breaking mechanism of Cybersusy. △ Less", "We consider more than one pair of SU(2)_L doublet Higgs supermultiplets in a generic supersymmetric extension of the standard model, and calculate their one-loop contributions to the soft mass insertions delta_{LL} etc. We find that if large supersymmetry breaking in this sector is realized, the loop effects can give rise to large contributions to the soft mass insertions, meaning that they We apply our result to a recently proposed model based on the discrete Q_6 family group, and calculate the non-diagonal matrix element M_{12} of the neutral meson systems. We focus our attention on the extra phases phi_{d,s}^Delta in B_{d,s}-mixing and flavor-specific CP-asymmetries a_{sl}^{d,s} in neutral B decays and obtain values that can be about one order of magnitude larger than the standard model predictions. Our final results are comparable with the recent experimental observations at D0 and CDF, but they are still about a factor of 5 smaller than the recently measured dimuon asymmetry from D0. △ Less", "In some extensions of the standard model with extended Higgs sectors, events from new particle production may pass the selection criteria for Higgs search in different channels at the LHC - 14 TeV and mimic Higgs signals. This intriguing possibility is illustrated by PYTHIA based simulations using several representative points in the parameter space of the minimal supersymmetric standard model (MSSM) including a point in the minimal supergravity model consistent with the Dark matter (DM) relic density data. Our simulations explore the interplay between the charged Higgs signal and typical squark-gluino events. We argue that the standard selections like the one based on the polarization properties of the $τ$'s from charged Higgs decay, though adequate for handling the SM background, may not be very efficient in the presence of SUSY backgrounds. We then propose an alternative search strategy based on pure kinematics which sufficiently controls both the SM and the MSSM backgrounds. For charged Higgs masses ($H^{\\pm}$) in the deep decoupling regime (600 GeV $\\lsim m_{H^{\\pm}} \\lsim$ 800 GeV) this method works well and extends the LHC reach close to 800 GeV for an integrated luminosity of 30 $fb^{-1}$ with or without the SUSY background. For a lighter charged Higgs a judicious combination of the old selections and some of the cuts proposed by us may disentangle the Higgs signal from the squark-gluino backgrounds quite effectively. △ Less", "Many techniques exist to reconstruct New Physics masses from LHC data, though these tend to either require high luminosity O(100) fb^-1, or an accurate measurement of missing transverse energy (MET) which may not be available in the early running of the LHC. Since in popular models such as SUSY a fairly sharp, triangular dilepton invariant mass spectrum can emerge already at low luminosity O(1) fb^-1, a Decay Kinematics (DK) technique can be used on events near the dilepton mass endpoint to estimate squark, slepton, and neutralino masses without relying on MET. With the first 2 fb^-1 of 7 TeV LHC data SPS1a masses can thus be found to 20% or better accuracy, at least several times better than what has been taken to be achievable. △ Less", "Certain supersymmetric grand unified models predict that the coefficients of the quadratic terms in the MSSM Higgs potential should be degenerate at the GUT scale. We discuss some examples for such models, and we analyse the implications of this peculiar condition of a GUT-scale degenerate Higgs mass matrix for low-scale MSSM phenomenology. To this end we explore the parameter space which is consistent with existing experimental constraints by means of a Markov Chain Monte Carlo analysis. △ Less", "We review the result of SUSY parameter fits based on frequentist analyses of experimental constraints from electroweak precision data, (g-2)_mu, B-physics and cosmological data. We investigate the parameters of the constrained MSSM (CMSSM) with universal soft supersymmetry-breaking mass parameters, and a model with common non-universal Higgs mass parameters in the superpotential (NUHM1). Shown are the results for the SUSY and Higgs spectrum of the models. Many sparticle masses are highly correlated in both the CMSSM and NUHM1, and parts of the regions preferred at the 68% C.L. are accessible to early LHC running. The best-fit points could be tested even with 1/fb at sqrt[s] = 7 Tev. △ Less", "Following the anomalous like-sign dimuon charge asymmetry measured by the D0 collaboration at the Tevatron collider we discuss the implications of large CP violation in $B_{d,s}$ mixing for Supersymmetric (SUSY) Standard Models, focussing on those models which allow a family symmetry and unification. For the Minimal Supersymmetric Standard Model (MSSM) we show that it is only possible to account for $B_{s}$ mixing and CP violation at the expense of large squark mixing which would require a new approach to family symmetry models. In order to describe both $B_{s}$ and $B_{d}$ mixing and CP violation we are led to consider SUSY models with Higgs fields transforming as triplets under a family symmetry. We describe a realistic such model based on $Δ_{27}$ family symmetry in which tree-level exchange of the second Higgs family predicts $B_{s}$ and $B_{d}$ mixing and CP violation in good agreement with a recent global fit, while naturally suppressing flavour and CP violation involving the first and second quark and lepton families. △ Less", "The cascade mass reconstruction approach was applied to simulated production of the lightest stop quark at the LHC in the cascade decay $\\tilde{g} \\to \\sTop \\, \\Top \\to \\tildeχ_{2}^{0} \\, \\Top \\, \\Top \\to \\tilde{\\ell}_{R} \\, \\ell \\, \\Top \\, \\Top \\to \\tildeχ_{1}^{0} \\, \\ell \\, \\ell \\, \\Top \\, \\Top$ with top quarks decaying into hadrons. The stop quark mass was reconstructed assuming that the masses of gluino, slepton and of the two lightest neutralinos were reconstructed in advance. A data sample set for the SU3 model point containing 400k SUSY events was generated which corresponded to an integrated luminosity of about 20 $\\rm fb^{-1}$ at 14 TeV. These events were passed through the AcerDET detector simulator, which parametrized the response of a generic LHC detector. The mass of the $\\tilde{t}_{1}$ was reconstructed with a precision of about $10\\%$. △ Less", "This is an addendum to the previous publication, P. Ko and J.-h. Park, Phys. Rev. D80, 035019 (2009). The semileptonic charge asymmetry in B_s decays is discussed in the context of general MSSM with gluino-mediated flavor and CP violation in light of the recent measurements at the Tevatron. △ Less", "We investigate the NLO QCD and the CP-violation effects in $t\\bar{t}Z^0$ production at the Large Hadron Collider(LHC) in the minimal supersymmetric standard model(MSSM). Our calculation shows that the total NLO QCD correction in the framework of the CP-conserving MSSM significantly improves the scale uncertainty at the leading order, and the contribution from the pure supersymmetric QCD (pSQCD) correction can exceed $-8\\%$ with the restrictions of $90~GeV < p_T^t < 120~GeV$ and $120~GeV < p_T^Z < 150~GeV$, where $p_T^t$ and $p_T^Z$ are the transverse momenta of the top-quark and $Z^0$ gauge boson, respectively. Our numerical results demonstrate that the pure SUSY QCD correction generally suppresses the total SM-like QCD correction in the CP-conserving MSSM, and tends to be a constant when either $\\tilde{t}_1$ or $\\tilde{g}$ is heavy enough. We find also that the CP-odd asymmetry ${\\cal A}_Φ$ can reach $2.17 \\times 10^{-3}$, if the CP-phase angle really exists in the coupling of gluino-stop-top. △ Less", "We consider extensions of the Minimal Supersymmetric Standard Model (MSSM) where the extra degrees of freedom interact weakly with the Higgs sector. These models allow to relax the tension between the lower bound on the lightest CP even Higgs mass from direct LEP searches and the theoretical upper bound of the MSSM. We study the beyond MSSM (BMSSM) effects via an effective field-theory approach, assuming that the MSSM is valid up to a heavy physics scale M. We compute the masses, couplings and branching fractions of the Higgs sector, including all the relevant corrections up to order 1/M^2. We find that the collider phenomenology can be greatly different with respect to both the SM and the MSSM. △ Less", "If collider experiments demonstrate that the Minimal Supersymmetric Standard Model (MSSM) is a good description of nature at the weak scale, the experimental priority will be the precise determination of superpartner masses. These masses are governed by the weak scale values of the soft supersymmetry (SUSY)-breaking parameters, which are in turn highly dependent on the SUSY-breaking scheme present at high scales. It is therefore of great interest to find patterns in the soft parameters that can distinguish different high scale SUSY-breaking structures, identify the scale at which the breaking is communicated to the visible sector, and determine the soft breaking parameters at that scale. In this work, we demonstrate that 1-loop Renormalization Group~(RG) invariant quantities present in the MSSM may be used to answer each of these questions. We apply our method first to generic flavor-blind models of SUSY-breaking, and then examine in detail the subset of these models described by General Gauge Mediation and the constrained MSSM with non-universal Higgs masses. As RG invariance generally does not hold beyond leading-log order, we investigate the magnitude and direction of the 2-loop corrections. We find that with superpartners at the TeV scale, these 2-loop effects are either negligible, or they are of the order of optimistic experimental uncertainties and have definite signs, which allows them to be easily accounted for in the overall uncertainty. △ Less", "GRACE/SUSY-loop is a program package for the automatic calculation of the MSSM amplitudes in one-loop order. We present features of GRACE/SUSY-loop, processes calculated using GRACE/SUSY-loop and an extension of the non-linear gauge formalism applied to GRACE/SUSY-loop. △ Less", "In supergravity where the gravitino is the lightest supersymmetric particle (LSP), the next-to-lightest supersymmetric particle (NLSP) decays to the gravitino with a naturally long lifetime (10^4 - 10^8). However, cosmological constraints favour charged sleptons with lifetimes below a year as the natural NLSP candidate. For this scenario we report a method to accurately determine the slepton lifetime and SUSY cross-section from observation of the decays of sleptons trapped in the material comprising the main detector (ATLAS, CMS). A measurement of the lifetime to 5% is possible after 3 years at nominal luminosity and running conditions. This method is sensitive to the cosmologically preferred stau lifetime of ~37 days and does not require the use of ancillary trapping volumes. △ Less", "We analyze the constraints imposed by experimental upper limits on electric dipole moments (EDMs) within the Maximally CP- and Minimally Flavour-Violating (MCPMFV) version of the MSSM. Since the MCPMFV scenario has 6 non-standard CP-violating phases, in addition to the CP-odd QCD vacuum phase θ_QCD, cancellations may occur among the CP-violating contributions to the three measured EDMs, those of the Thallium, neutron and Mercury, leaving open the possibility of relatively large values of the other CP-violating observables. We develop a novel geometric method that uses the small-phase approximation as a starting point, takes the existing EDM constraints into account, and enables us to find maximal values of other CP-violating observables, such as the EDMs of the Deuteron and muon, the CP-violating asymmetry in b --> s γdecay, and the B_s mixing phase. We apply this geometric method to provide upper limits on these observables within specific benchmark supersymmetric scenarios, including extensions that allow for a non-zero θ_QCD. △ Less", "Supersymmetry (SUSY) with a long-lived stau is an attractive scenario in the LHC experiments because one can directly observe stau tracks in each SUSY event, and thus precise measurements of SUSY particle masses are possible. In this scenario, we discuss the possibility to observe/measure parity violation in interactions among SUSY particles. Such a measurement will be important in determining spins and chiralities of SUSY particles. We use the last step of the cascade-decay chain: $χ^0\\to\\tildeττ\\to\\tildeτ(lν\\barν)$, where the polarization of the tau lepton can be determined statistically by looking at the energy distribution of the final state lepton. Comparing with the theoretical formula of the neutralino differential decay width, one can extract the size of parity violation in the interaction vertices among the stau, the tau lepton and the neutralino. We perform a Monte Carlo simulation to see if the effect is visible at the LHC experiments. △ Less", "Within a supersymmetric (SUSY) type-I seesaw framework with flavor-blind universal boundary conditions, we study the consequences of requiring that the observed baryon asymmetry of the Universe be explained by either thermal or non-thermal leptogenesis. In the former case, we find that the parameter space is very constrained. In the bulk and stop-coannihilation regions of mSUGRA parameter space (that are consistent with the measured dark matter abundance), lepton flavor-violating (LFV) processes are accessible at MEG and future experiments. However, the very high reheat temperature of the Universe needed after inflation (of about 10^{12} GeV) leads to a severe gravitino problem, which disfavors either thermal leptogenesis or neutralino dark matter. Non-thermal leptogenesis in the preheating phase from SUSY flat directions relaxes the gravitino problem by lowering the required reheat temperature. The baryon asymmetry can then be explained while preserving neutralino dark matter, and for the bulk or stop-coannihilation regions LFV processes should be observed in current or future experiments. △ Less", "We present a comment on the kinematic variable $m_{CT2}$ recently proposed in \"Amplification of endpoint structure for new particle mass measurement at the LHC\". The variable is designed to be applied to models such as R-parity conserving Supersymmetry (SUSY) when there is pair production of new heavy particles each of which decays to a single massless visible and a massive invisible component. It was proposed in \"Amplification of endpoint structure for new particle mass measurement at the LHC\" that a measurement of the peak of the $m_{CT2}$ distribution could be used to precisely constrain the masses of the SUSY particles. We show that when Standard Model backgrounds are included in simulations, the sensitivity of the $m_{CT2}$ variable to the SUSY particle masses is more seriously impacted for $m_{CT2}$ than for other previously proposed variables. △ Less", "Nuclear double beta decay, an extremely rare radioactive decay process, is - in one of its variants - one of the most exciting means of research into particle physics beyond the standard model. The large progress in sensitivity of experiments searching for neutrinoless double beta decay in the last two decades - based largely on the use of large amounts of enriched source material in \"active source experiments\" - has lead to the observation of the occurrence of this process in nature (on a 6.4 sigma level), with the largest half-life ever observed for a nuclear decay process (2.2 x 10^{25} y). This has fundamental consequences for particle physics - violation of lepton number, Majorana nature of the neutrino. These results are independent of any information on nuclear matrix elements (NME)*. It further leads to sharp restrictions for SUSY theories, sneutrino mass, right-handed W-boson mass, superheavy neutrino masses, compositeness, leptoquarks, violation of Lorentz invariance and equivalence principle in the neutrino sector. The masses of light-neutrinos are found to be degenerate, and to be at least 0.22 +- 0.02 eV. This fixes the contribution of neutrinos as hot dark matter to >=4.7% of the total observed dark matter. The neutrino mass determined might solve also the dark energy puzzle. *(It is briefly discussed how important NME for 0nubb decay really are.) △ Less", "If the supersymmetry (SUSY) is a solution to the hierarchy problem, it is puzzling that any SUSY particle has not been discovered yet. We show that there is a low-scale conformal gauge mediation model which contains all necessary ingredients, i.e. not only a SUSY-breaking dynamics and a gauge mediation mechanism, but also a candidate for the dark matter. The model has only one free parameter, that is, the mass for messengers. In this model, the dark matter is provided by a composite particle in the SUSY-breaking sector, and the observed value of the dark matter density uniquely fixes the mass of messengers at the order of 10^2 TeV. Then, the sfermion and gaugino masses are fixed to be of order 10^2~10^3 GEV without any arbitrariness, thus the SUSY particles are expected not to be discovered at the Tevatron or LEP, while having a discovery possibility at the LHC. △ Less", "We study the consequences of the large dimuon asymmetry observed at D0. Physics beyond the standard model (SM) in $B_s-\\bar B_s$ mixing is required to explain the data. We first present a detailed analysis for model independent constraints on physics beyond the SM, and then study the implications for theoretical models which modify the SM results in different ways, such as $Z'$ with FCNC and R-parity violating SUSY contributions. △ Less", "We present the one-loop corrections originating from Quantum Chromo-Dynamics (QCD) and Electro-Weak (EW) interactions of Supersymmetric (SUSY) origin within the Minimal Supersymmetric Standard Model (MSSM) to the single-top processes bq -> tq' and qbar q' -> tbar b. We illustrate their impact onto top quark observables accessible at the Large Hadron Collider (LHC) in the 't+jet' final state, such as total cross section, several differential distributions and left-right plus forward-backward asymmetries. We find that in many instances these effects can be observable for planned LHC energies and luminosities, quite large as well as rather sensitive to several MSSM parameters. △ Less", "The top quark has a large Yukawa coupling with the Higgs boson. In the usual extensions of the standard model the Higgs sector includes extra scalars, which also tend to couple strongly with the top quark. Unlike the Higgs, these fields have a natural mass above 2m_t, so they could introduce anomalies in ttbar production at the LHC. We study their effect on the ttbar invariant mass distribution at sqrt{s}=7 TeV. We focus on the bosons (H,A) of the minimal SUSY model and on the scalar field (r) associated to the new scale f in Little Higgs (LH) models. We show that in all cases the interference with the standard amplitude dominates over the narrow-width contribution. As a consequence, the mass difference between H and A or the contribution of an extra T-quark loop in LH models become important effects in order to determine if these fields are observable there. We find that a 1 fb^{-1} luminosity could probe the region tan beta \\le 3 of SUSY and v/(sqrt{2}f) \\ge 0.3 in LH models. △ Less", "We give a unified treatment of different models of supersymmetry breaking and mediation from a four dimensional effective field theory standpoint. In particular a comparison between GMSB and various gravity mediated versions of SUSY breaking shows that, once the former is embedded within a SUGRA framework, there is no particular advantage to that mechanism from the point of view of FCNC suppression. We point out the difficulties of all these scenarios - in particular the cosmological modulus problem. We end with a discussion of possible string theory realizations. △ Less", "We propose a quasiparticle approach allowing to compute the equation of state of a generic gauge theory with gauge group SU($N_c$) and quarks in an arbitrary representation. Our formalism relies on the thermal quasiparticle masses (quarks and gluons) computed from Hard-Thermal-Loop techniques, in which the standard two-loop running coupling constant is used. Our model is minimal in the sense that we do not allow any extra ansatz concerning the temperature-dependence of the running coupling. We first show that it is able to reproduce the most recent equations of state computed on the lattice for temperatures higher than 2 $T_c$. In this range of temperatures, an ideal gas framework is indeed expected to be relevant. Then we study the accuracy of various inequivalent large-$N_c$ limits concerning the description of the QCD results, as well as the equivalence between the QCD$_{AS}$ limit and the ${\\cal N}=1$ SUSY Yang-Mills theory. Finally, we estimate the dissociation temperature of the $Υ$-meson and comment on the estimations' stability regarding the different considered large-$N_c$ limits. △ Less", "We study supersymmetry breaking in metastable vacua on the Coulomb branch of perturbed N=2 gauge theories, with gauge group SU(2) and different matter content (N_f=0,2,4). The theory is deformed with a superpotential which is a cubic polynomial in u=Tr Φ^2, where Φis the adjoint superfield. The allowed region of the perturbation parameters in this N=1 theory is plotted as a function of the moduli space coordinate. In the asymptotically free cases a significant fine-tuning in the perturbation parameters is needed to achieve metastable vacua in the weakly coupled region of the moduli space; a lower degree of fine-tuning is required in the strongly coupled regime. In the conformal case (N_f=4 fundamentals) we find that also an explicit mass for the hypermultiplets must be introduced in order to generate metastable vacua. In the case of N_f=2 fundamentals it is possible to achieve a metastable vacuum also in the neighborhood of the Argyres-Douglas fixed point (even if a large degree of fine-tuning is needed in this limit). Direct gauge mediation is discussed; gaugino masses of the same order of the SUSY-breaking can be obtained. △ Less", "It is well known that there exist many mechanisms that may contribute to neutrinoless double beta decay (0nbb-decay). By exploiting the fact that the associated nuclear matrix elements are target dependent we show that, given definite experimental results on a sufficient number of targets, one can determine or sufficiently constrain all lepton violating parameters including the mass term. As a specific example we show that, assuming the observation of the 0nbb-decay in three different nuclei, e.g., 76Ge, 100Mo and 130Te, and just three lepton number violating mechanisms (light and heavy neutrino mass mechanisms as well as R-parity breaking SUSY mechanism) being active, there are only four different solutions for the lepton violating parameters, provided that they are relatively real. In particular, assuming evidence of the 0nbb-decay of 76Ge, the effective neutrino Majorana mass |m_bb| can be almost uniquely extracted by utilizing other existing constraints (cosmological observations and tritium beta-decay experiments). We also point out the possibility that the non-observation of the 0nbb-decay for some isotopes could be in agreement with a value of |m_bb| in sub eV region. We thus suggest that it is important to have at least two different 0nbb-decay experiments for a given nucleus. △ Less", "The neutrino oscillation data are in very good agreement with the tribimaximal mixing pattern: \\sin^2θ_{23}=1/2, \\sin^2θ_{12}=1/3, and \\sin^2θ_{13}=0. Attempts to generate this pattern based on finite family symmetry groups typically assume that the family symmetry is broken to different subgroups in the charged lepton and the neutrino mass matrices. This leads to a technical problem, where the cross-couplings between the Higgs fields responsible for the two symmetry breaking chains force their vacuum expectation values to align, upsetting the desired breaking pattern. Here, we present a class of models based on the semidirect product group (S_3)^4 \\rtimes A_4, where the lepton families belong to representations which are not faithful. In effect, the Higgs sector knows about the full symmetry while the lepton sector knows only about the A_4 factor group. This can solve the alignment problem without altering the desired properties of the family symmetry. Inclusion of quarks into the framework is straightforward, and leads to small and arbitrary CKM mixing angles. Supersymmetry is not essential for our proposal, but the model presented is easily supersymmetrized, in which case the same family symmetry solves the SUSY flavor problem. △ Less", "We analyze the most general dimension six effective Lagrangian, invariant under the flavour symmetry A4 x Z3 x U(1) proposed to reproduce the near tri-bimaximal lepton mixing observed in neutrino oscillations. The effective Lagrangian includes four-lepton operators that violate the individual lepton numbers in the limit of exact flavor symmetry and allow unsuppressed processes satisfying the rule |Delta L_e x Delta L_mu x Delta L_tau| = 2. The most stringent bounds on the strength of the new interactions come from the observed universality of leptonic muon and tau decays, from the agreement between the Fermi constant measured in the muon decay and that extracted from the mW/mZ ratio, and from the limits on the rare decays tau^- -> mu^+ e^- e^- and tau^- -> e^+ mu^- mu^-. We also investigate these effects in a specific supersymmetric (SUSY) realization of the flavour symmetry and we find large suppression factors for all the processes allowed by the selection rule. We explain why this rule is violated in the SUSY context and we provide a complete picture of lepton flavour violation in the SUSY version of A4 x Z_3 x U(1). △ Less", "We point out some of the outstanding challenges for embedding inflationary cosmology within string theory studying the process of reheating for models where the inflaton is a closed string mode parameterising the size of an internal cycle of the compactification manifold. A realistic model of inflation must explain the tiny perturbations in the cosmic microwave background radiation and also how to excite the ordinary matter degrees of freedom after inflation, required for the success of Big Bang Nucleosynthesis. We study these issues focusing on two promising inflationary models embedded in LARGE volume type IIB flux compactifications. We show that phenomenological requirements and consistency of the effective field theory treatment imply the presence at low energies of a hidden sector together with a visible sector, where the Minimal Supersymmetric Standard Model fields are residing. A detailed calculation of the inflaton coupling to the fields of the hidden sector, visible sector, and moduli sector, reveals that the inflaton fails to excite primarily the visible sector fields, instead hidden sector fields are excited copiously after the end of inflation. This sets severe constraints on hidden sector model building where the most promising scenario emerges as a pure N=1 SYM theory, forbidding the kinematical decay of the inflaton to the hidden sector. In this case it is possible to reheat the Universe with the visible degrees of freedom even though in some cases we discover a new tension between TeV scale SUSY and reheating on top of the well-known tension between TeV scale SUSY and inflation. △ Less", "We study how the property of asymptotic helicity conservation (HCns), expected for any 2-to-2 process in the minimal supersymmetric model (MSSM), is realized in the processes $gg \\to γγ,γZ,ZZ,W^+W^-$, at the 1loop electroweak order and very high energies. The violation of this property for the same process in the standard model (SM), is also shown. This strengthens the claim that HCns is specific to the renormalizable SUSY model, and not generally valid in SM. HCns strongly reduces the number of non-vanishing 2-to-2 amplitudes at asymptotic energies in MSSM. Consequences at LHC and higher energy colliders are identified. △ Less", "Dark matter (DM) is currently searched for with a variety of detection strategies. Accelerator searches are particularly promising, but even if Weakly Interacting Massive Particles (WIMPs) are found at the Large Hadron Collider (LHC), it will be difficult to prove that they constitute the bulk of the DM in the Universe. We show that a significantly better reconstruction of the DM properties can be obtained with a combined analysis of LHC and direct detection (DD) data, by making a simple Ansatz on the WIMP local density, i.e. by assuming that the local density scales with the cosmological relic abundance. We demonstrate this method in an explicit example in the context of a 24-parameter supersymmetric model, with a neutralino LSP in the stau co-annihilation region. Our results show that future ton-scale DD experiments will allow to break degeneracies in the SUSY parameter space and achieve a significantly better reconstruction of the neutralino composition and its relic density than with LHC data alone. △ Less", "While SUSY particles, if they exist at the TeV-scale, will be discovered at the Tevatron or the LHC, the determination of the SUSY-breaking scenario and its free parameters will require additional information, e.g. from a future International Linear Collider. We point out that such information, in particular on SUSY-particle mixing and the associated soft SUSY-breaking parameters, can also be obtained from measurements at existing or future polarized hadron colliders, since the polarization of initial-state quarks, transmitted through weak gauge bosons or squarks, can be strongly correlated with the helicity and gaugino/higgsino mixing of final-state sleptons, squarks, neutralinos and charginos. △ Less", "We inspect the mass spectrum of heavy-light mesons in deformed N=2 super Yang-Mills theory using the AdS/CFT correspondence. We demonstrate how some of the degeneracies of the supersymmetric meson spectrum can be removed upon breaking the supersymmetry, thus leading to the emergence of hyperfine structure. The explicit SUSY breaking scenarios we consider involve on one hand tilting one of the two fundamental D7 branes inside the internal R^6 space, and on the other hand applying an external magnetic field on the (untilted) branes. The latter scenario leads to the well-known Zeeman effect, which we inspect for both weak and strong magnetic fields. △ Less", "We present a complete analysis of threshold resummation effects on direct light and heavy gaugino pair production at the Tevatron and the LHC. Based on a new perturbative calculation at next-to-leading order of SUSY-QCD, which includes also squark mixing effects, we resum soft gluon radiation in the threshold region at leading and next-to-leading logarithmic accuracy, retaining at the same time the full SUSY-QCD corrections in the finite coefficient function. This allows us to correctly match the resummed to the perturbative cross section. Universal subleading logarithms are resummed in full matrix form. We find that threshold resummation slightly increases and considerably stabilizes the invariant mass spectra and total cross sections with respect to the next-to-leading order calculation. For future reference, we present total cross sections and their theoretical errors in tabular form for several commonly used SUSY benchmark points, gaugino pairs, and hadron collider energies. △ Less", "We study single top production at the LHC in a SUSY-QCD model with a heavy Dirac gluino. The presence of a heavy Dirac gluino allows for notable top-up flavour changing neutral currents. In this scenario, we find that the process ug->tg gives the largest contribution to single top production via FCNCs at the LHC. The key features of this signal are that the top quark is produced very forward and that it is asymmetric to its anti-top counterpart, as the latter lacks a valence quark. △ Less", "We have analysed the early LHC signatures of the minimal supergravity (mSUGRA) model. Our emphasis is on the 7 - $TeV$ run corresponding to an integrated luminosity of $\\sim 1.0 ~fb^{-1}$ although we have also discussed briefly the prospects at LHC-10 $TeV$. We focus on the parameter space yielding relatively light squark and gluinos consistent with the darkmatter relic density data and the LEP bounds on the lightest Higgs scalar mass. This parameter space is only allowed for non-vanishing trilinear soft breaking term $A_0$. A significant region of the parameter space with large to moderate negative values of $A_0$ consistent with the stability of the scalar potential and relic density production via neutralino annihilation and/or neutralino - stau coannihilation yields observable signal via the jets + missing transverse energy channel. The one lepton + jets + missing energy signal is also viable over a smaller but non-trivial parameter space. The ratio of the size of the two signals - free from theoretical uncertainties - may distinguish between different relic density generating mechanisms. With efficient $τ$-tagging facilities at 7 $TeV$ the discriminating power may increase significantly. We also comment on other dark matter relic density allowed mSUGRA scenarios and variants there of in the context of LHC-7 $TeV$. △ Less", "The search for physics beyond the Standard Model (BSM) is one of the most important goals for the general purpose detector ATLAS at the Large Hadron Collider at CERN. We review some of the current strategies to search for generic SUSY models with R-parity conservation in channels with jets, leptons and missing transverse energy for an integrated luminosity of L = 200 pb-1 at a centre-of-mass energy s = 10 TeV. Only a selection of the results is presented with a focus on the discovery potential for inclusive searches. The discovery reach for a centre-of-mass energy of s = 7 TeV and an integrated luminosity of L = 1 f b-1 is expected to be similar to the one discussed in this note. △ Less", "We present a generalization of the Next-to-Minimal Supersymmetric Standard Model (NMSSM), with an explicit mu-term and a supersymmetric mass for the singlet superfield, as a route to alleviating the little hierarchy problem of the Minimal Supersymmetric Standard Model (MSSM). Though this model does not address the mu-problem of the MSSM, we are able to generate masses for the lightest neutral Higgs boson up to 140 GeV with top squarks below the TeV scale, all couplings perturbative to the gauge unification scale, and with no need to fine tune parameters in the scalar potential. This model, which we call the S-MSSM, more closely resembles the MSSM phenomenologically than the NMSSM as usually defined. △ Less", "We perform a comparative study of the neutralino dark matter scattering on nucleon in three popular supersymmetric models: the minimal (MSSM), the next-to-minimal (NMSSM) and the nearly minimal (nMSSM). First, we give the predictions of the elastic cross section by scanning over the parameter space allowed by various direct and indirect constraints, which are from the measurement of the cosmic dark matter relic density, the collider search for Higgs boson and sparticles, the precision electroweak measurements and the muon anomalous magnetic moment. Then we demonstrate the property of the allowed parameter space with/without the new limits from CDMS II. We obtain the following observations: (i) For each model the new CDMS limits can exclude a large part of the parameter space allowed by current collider constraints; (ii) The property of the allowed parameter space is similar for MSSM and NMSSM, but quite different for nMSSM; (iii) The future SuperCDMS can cover most part of the allowed parameter space for each model. △ Less", "We explore, in a concrete example, to which extent new particle mass determinations are practicable with LHC data. Our chosen example is that of Yukawa-unified SUSY GUTs, whose viability has been recently studied for two general patterns of soft SUSY-breaking terms. We note that both patterns of SUSY spectra do not admit long decay chains, which would make it possible to determine the masses of the SUSY particles involved using endpoints or mass relations. We thus take the so-called mT2-kink method as our key strategy, since it does not rely on the presence of long decay chains. We then discuss a procedure allowing to determine the masses of the gluino, of the lightest chargino as well as of the first two neutralinos and, for the scenario where a stop is lighter than the gluino, the mass of the light stop too. Our worked example of Yukawa-unified SUSY GUTs may offer a useful playground for dealing with other theories which predict similar patterns of SUSY spectra. △ Less", "We propose the \"supersymmetric (SUSY) Yukawa sum rule\", a relationship between physical masses and mixing angles of the third-generation quarks and squarks. The sum rule follows directly from a relation between quark and squark couplings to the Higgs, enforced by SUSY. It is exactly this relation that ensures the cancellation of the one-loop quadratic divergence in the Higgs mass from the top sector. Testing the sum rule experimentally would thus provide a powerful consistency check on SUSY as the solution to the gauge hierarchy problem. While such a test will most likely have to await a future next-generation lepton collider, the LHC experiments may be able to make significant progress towards this goal. If some of the terms entering the sum rule are measured at the LHC, the sum rule can be used (within SUSY framework) to put interesting constraints on the other terms, such as the mixing angles among third-generation squarks. We outline how the required mass measurements could be performed, and estimate the accuracy that can be achieved at the LHC. △ Less", "We present a flavor model of quarks and leptons with the non-Abelian discrete symmetry $S_4$ in the framework of the SU(5) SUSY GUT. Three generations of $\\bar 5$-plets in SU(5) are assigned to ${\\bf 3}$ of $S_4$ while the first and second generations of 10-plets in SU(5) are assigned to ${\\bf 2}$ of $S_4$, and the third generation of 10-plet is assigned to ${\\bf 1}$ of $S_4$. Right-handed neutrinos are also assigned to ${\\bf 2}$ for the first and second generations and ${\\bf 1}'$ for the third generation. We predict the Cabibbo angle as well as the tri-bimaximal mixing of neutrino flavors. We also predict the non-vanishing $U_{e3}$ of the neutrino flavor mixing due to higher dimensional mass operators. Our predicted CKM mixing angles and the CP violation are consistent with experimental values. We also study SUSY breaking terms in the slepton sector. Our model leads to smaller values of flavor changing neutral currents than the present experimental bounds. △ Less", "Kinematic limits on an invariant mass distribution of bc-pairs for a three-step decay chain A -> bB -> bcC involving all massive particles are found. It is shown that an application of these limits to a stop quark production at the LHC could reduce significantly Standard Model background contribution. △ Less", "In the anomaly-mediated supersymmetry (SUSY) breaking scenario, neutral gaugino of SU(2)_L multiplet, Wino, can be the lightest SUSY particle and become a candidate for dark matter. We calculated scattering cross section of Wino dark matter with nucleon, which is responsible for direct detection of the dark matter, on the assumption that the SUSY particles and the heavier Higgs bosons have masses of the order of the gravitino mass in the SUSY standard model. In such a case, the Wino-nucleon coupling is generated by loop processes. We have included two-loop contribution to Wino-gluon interaction in the calculation, since it is one of the leading contributions to the Wino-nucleon coupling. It was found that the spin-independent scattering cross section with proton is 10^-(46-48) cm^2. While it is almost independent of the Wino mass, the result is quite sensitive to the Higgs boson mass due to the accidental cancellation. △ Less", "We propose to address the fine tuning problem of inflection point inflation by the addition of extra vacuum energy that is present during inflation but disappears afterwards. We show that in such a case, the required amount of fine tuning is greatly reduced. We suggest that the extra vacuum energy can be associated with an earlier phase transition and provide a simple model, based on extending the SM gauge group to SU(3)_C \\times SU(2)_L\\times U(1)_Y\\times U(1)_{B-L}, where the Higgs field of U(1)_{B-L} is in a false vacuum during inflation. In this case, there is virtually no fine tuning of the soft SUSY breaking parameters of the flat direction which serves as the inflaton. However, the absence of radiative corrections which would spoil the flatness of the inflaton potential requires that the U(1)_{B-L} gauge coupling should be small with g_{B-L}\\leq 10^{-4}. △ Less", "We examine the capability of the CERN Large Hadron Collider to discovery supersymmetry (SUSY) with energy \\sqrt{s}=7 TeV and integrated luminosity of about 1 fb^{-1}. Our results are presented within the paradigm minimal supergravity model (mSUGRA or CMSSM). Using a 6-dimensional grid of cuts for optimization of signal to background-- including missing E_T-- we find for m_{\\tg}\\sim m_{\\tq} an LHC reach of m_{\\tg}\\sim 800,\\ 950,\\ 1100 and 1200 GeV for 0.1, 0.3, 1 and 2 fb^{-1}, respectively. For m_{\\tg}<< m_{\\tq}, the reach is instead near m_{\\tg}\\sim 480,\\ 540,\\ 620 and 700 GeV, for the same integrated luminosities. We also examine the LHC reach in the case of very low integrated luminosity where missing E_T may not be viable. We focus on the multi-muon, multi-lepton (including electrons) and dijet signals. Although the LHC reach without E_T^{miss} is considerably lower in these cases, it is still substantial: for 0.3 fb^{-1}, the dijet reach in terms of gluino mass is up to 600 GeV for very low m_0, while the dilepton reach is to gluino masses of \\sim 500 GeV over a range of m_0 values. △ Less", "We use the \"General Gauge Mediation\" formalism to describe a 5D setup with an $S^{1}/Z_{2}$ orbifold. We first consider a model independent SUSY breaking hidden sector on one boundary and generic chiral matter on another. Using the definition of GGM, the effects of the hidden sector are contained in a set of global symmetry current correlator functions and is mediated through the bulk. We find the gaugino, sfermion and hyperscalar mass formulas for minimal and generalised messengers in different regimes of a large, small and intermediate extra dimension. Then we use the 5D GGM formalism to construct a model in which an SU(5) ISS model is located on the hidden boundary. We weakly gauge a global symmetry of the ISS model and associate it with the bulk vector superfield. Compared to 4D GGM, there is a natural way to adjust the gaugino versus sfermion mass ratio by a factor $(M l)^{2}$, where M is a characteristic mass scale of the SUSY breaking sector and l is the length of the extra dimension. △ Less", "Supersymmetric models based on anomaly-mediated SUSY breaking (AMSB) generally give rise to a neutral wino as a WIMP cold dark matter (CDM) candidate, whose thermal abundance is well below measured values. Here, we investigate four scenarios to reconcile AMSB dark matter with the measured abundance: 1. non-thermal wino production due to decays of scalar fields ({\\it e.g} moduli), 2. non-thermal wino production due to decays of gravitinos, 3. non-thermal wino production due to heavy axino decays, and 4. the case of an axino LSP, where the bulk of CDM is made up of axions and thermally produced axinos. In cases 1 and 2, we expect wino CDM to constitute the entire measured DM abundance, and we investigate wino-like WIMP direct and indirect detection rates. Wino direct detection rates can be large, and more importantly, are bounded from below, so that ton-scale noble liquid detectors should access all of parameter space for m_{\\tz_1}\\alt 500 GeV. Indirect wino detection rates via neutrino telescopes and space-based cosmic ray detectors can also be large. In case 3, the DM would consist of an axion plus wino admixture, whose exact proportions are very model dependent. In this case, it is possible that both an axion and a wino-like WIMP could be detected experimentally. In case 4., we calculate the re-heat temperature of the universe after inflation. In this case, no direct or indirect WIMP signals should be seen, although direct detection of relic axions may be possible. For each DM scenario, we show results for the minimal AMSB model, as well as for the hypercharged and gaugino AMSB models. △ Less", "We propose a supersymmetric (SUSY) SU(5) Grand Unified Theory (GUT) including a single right-handed neutrino singlet and an adjoint matter representation below the GUT scale and extend this model to include an A4 family symmetry and a gauged anomaly-free Abelian group. In our approach hierarchical neutrino masses result from a combined type I and type III seesaw mechanism, and the A4 symmetry leads to tri-bimaximal mixing which arises indirectly. The mixing between the single right-handed neutrino and the matter in the adjoint is forbidden by excluding an adjoint Higgs, leading to a diagonal heavy Majorana sector as required by constrained sequential dominance. The model also reproduces a realistic description of quark and charged lepton masses and quark mixings, including the Georgi-Jarlskog relations and the leptonic mixing sum rules s=r*cos(delta) and a=-r^2/4 with r=theta_C/3. △ Less", "We consider explicit models of dynamical supersymmetry breaking where dark matter is a 10 -- 100 TeV strongly-interacting composite state carrying no standard model quantum numbers. These constructions are simple variants of well-known supersymmetry breaking mechanisms, augmented to allow for a large \"flavor\" symmetry. Dark matter is the lightest composite modulus charged under this symmetry and is a viable cold dark matter candidate with a thermal relic abundance. This is an attractive possibility in low-scale gauge-mediated scenarios where the gravitino is the lightest superparticle. A light R-axion associated with supersymmetry breaking is present in these hidden sectors and serves as the portal between dark matter and the standard model. Such scenarios are relevant for present and future indirect detection experiments. △ Less", "In a recent paper, we proposed a new class of supersymmetric SO(10) models for neutrino masses where the TeV scale electroweak symmetry is SU(2)_L\\times SU(2)_R\\times U(1)_{B-L} making the associated gauge bosons W_R and Z' accessible at the Large Hadron Collider. We showed that there exists a domain of Yukawa coupling parameters and symmetry breaking patterns which give an excellent fit to all fermion masses including neutrinos. In this sequel, we discuss an alternative Yukawa pattern which also gives good fermion mass fit and then study the predictions of both models for proton lifetime. Consistency with current experimental lower limits on proton life time require the squark masses of first two generations to be larger than ~ 1.2 TeV. We also discuss how one can have simultaneous breaking of both SU(2)_R\\times U(1)_{B-L} and standard electroweak symmetries via radiative corrections. △ Less", "We consider the wrong-Higgs interactions such as type-III two Higgs doublet models. Generally, such interactions cause flavor problems. However, if new Yukawa interactions have the same flavor structure as that of the standard model(SM), we do not have any flavor problems. In this work we propose a microscopic model for the wrong-Higgs interactions aligned with SM ones in the context of supersymmetry(SUSY) and show their phenomenological implications. Low energy contraints from muon g-2 and rare B decays can be relieved and it can be viable to have low mass superparticle spectra with light dark matter which is preferred by recent experiments such as DAMA/LIBRA, CDMS-II and CoGeNT. We also briefly discuss modification of Higgs decay in colliders. △ Less", "Photonic SUSY two-loop corrections to the muon magnetic moment are contributions from diagrams where an additional photon loop is attached to a SUSY one-loop diagram. These photonic corrections are evaluated exactly, extending a leading-log calculation by Degrassi and Giudice. Compact analytical expressions are provided and the numerical behaviour is discussed. The photonic corrections reduce the SUSY one-loop result by 7...9%. The new terms are typically around ten times smaller than the leading logarithms, but they can be larger and have either sign in cases with large SUSY mass splittings. We also provide details on renormalization and regularization and on how to incorporate the photonic corrections into a full SUSY two-loop calculation. △ Less", "Although the sneutrino is a viable NLSP candidate with gravitino LSP, spectra of this type occupy a part of SUSY parameter space in which collider signatures are poorly studied. In this paper we will extend previous work on this topic to include sneutrino NLSP spectra with non-minimal phenomenology. Generally, these spectra exhibit very leptophilic behavior, which can be easily observed at the LHC. We show that a variety of such spectra can be analysed with similar techniques, leading in each case to very suggestive evidence for complicated decay chains that end in sneutrinos. Amongst the variations considered, we find a simple class of spectra that produce signals with strong electron-muon asymmetries. These signals could naively be interpreted as evidence for lepton flavor violation, but can occur even with flavor-blind SUSY. △ Less", "We study CP asymmetries in two-body decays of bottom squarks into charginos and tops. These asymmetries probe the SUSY CP phases of the sbottom and the chargino sector in the Minimal Supersymmetric Standard Model. We identify the MSSM parameter space where the CP asymmetries are sizeable, and analyze the feasibility of their observation at the LHC. As a result, potentially detectable CP asymmetries in sbottom decays are found, which motivates further detailed experimental studies for probing the SUSY CP phases. △ Less", "With present and upcoming SUSY searches both directly, indirectly and at accelerators, the need for accurate calculations is large. We will here go through some of the tools available both from a dark matter point of view and at accelerators. For natural reasons, we will focus on public tools, even though there are some rather sophisticated private tools as well. △ Less", "It has been argued that rather generic features of string-inspired inflationary theories with low-energy supersymmetry (SUSY) make it difficult to achieve inflation with a Hubble scale H > m_{3/2}, where m_{3/2} is the gravitino mass in the SUSY-breaking vacuum state. We present a class of string-inspired supergravity realizations of chaotic inflation where a simple, dynamical mechanism yields hierarchically small scales of post-inflationary supersymmetry breaking. Within these toy models we can easily achieve small ratios between m_{3/2} and the Hubble scale of inflation. This is possible because the expectation value of the superpotential <W> relaxes from large to small values during the course of inflation. However, our toy models do not provide a reasonable fit to cosmological data if one sets the SUSY-breaking scale to m_{3/2} < TeV. Our work is a small step towards relieving the apparent tension between high-scale inflation and low-scale supersymmetry breaking in string compactifications. △ Less", "We construct a Supersymmetric (SUSY) Grand Unified Theory (GUT) of Flavour based on S4 x SU(5), together with an additional (global or local) Abelian symmetry, and study it to next-to-leading order (NLO) accuracy. The model includes a successful description of quark and lepton masses and mixing angles at leading order (LO) incorporating the Gatto-Sartori-Tonin (GST) relation and the Georgi-Jarlskog (GJ) relations. We study the vacuum alignment arising from F-terms to NLO and such corrections are shown to have a negligible effect on the results for fermion masses and mixings achieved at LO. Tri-bimaximal (TB) mixing in the neutrino sector is predicted very accurately up to NLO corrections of order 0.1%. Including charged lepton mixing corrections implies small deviations from TB mixing described by a precise sum rule, accurately maximal atmospheric mixing and a reactor mixing angle close to three degrees. △ Less", "We propose an extended version of the gauge-mediated SUSY breaking models where extra $SU(2)_L$ doublets and singlet field are introduced. These fields are assumed to be parity-odd under an additional matter parity. In this model, the lightest parity-odd particle among them would be dark matter in the Universe. In this paper, we discuss direct detection of the dark matter and the collider signatures of the model △ Less", "We explore the novel possibility that the inflaton responsible for cosmological inflation is a gauge non-singlet in supersymmetric (SUSY) Grand Unified Theories (GUTs). For definiteness we consider SUSY hybrid inflation where we show that the scalar components of gauge non-singlet superfields, together with fields in conjugate representations, may form a D-flat direction suitable for inflation. We apply these ideas to SUSY models with an Abelian gauge group, a Pati-Salam gauge group and finally Grand Unified Theories based on SO(10) where the scalar components of the matter superfields in the $\\sixteen$s may combine with a single $\\bar {sixteen}$ to form the inflaton, with the right-handed sneutrino direction providing a possible viable trajectory for inflation. Assuming sneutrino inflation, we calculate the one-loop Coleman-Weinberg corrections and the two-loop corrections from gauge interactions giving rise to the \"gauge η-problem\" and show that both corrections do not spoil inflation, and the monopole problem can be resolved. The usual η-problem arising from supergravity may also be resolved using a Heisenberg symmetry. △ Less", "We study the determination of supersymmetric parameters at the LHC from a global fit including cross sections and edges of kinematic distributions. For illustration, we focus on a minimal supergravity scenario and discuss how well it can be constrained at the LHC operating at 7 and 14 TeV collision energy, respectively. We find that the inclusion of cross sections greatly improves the accuracy of the SUSY parameter determination, and allows to reliably extract model parameters even in the initial phase of LHC data taking with 7 TeV collision energy and 1/fb integrated luminosity. Moreover, cross section information may be essential to study more general scenarios, such as those with non-universal gaugino masses, and distinguish them from minimal, universal, models. △ Less", "We show that the mu problem and the strong CP problem can be resolved in the context of the gauged U(1)_R symmetry, realizing an automatic Peccei-Quinn symmetry. In this scheme, right-handed neutrinos can be introduced to explain small Majorana or Dirac neutrino mass. The U(1)_R D-term mediated SUSY breaking, called the U(1)_R mediation, gives rise to a specific form of the flavor-conserving superpartner masses. For the given solution to the mu problem, electroweak symmetry breaking condition requires the superpartners of the Standard Model at low energy to be much heavier than the gravitino. Thus dark matter candidate can be either gravitino or right-handed sneutrino. In the Majorana neutrino case, only gravitino is a natural dark matter candidate. On the other hand, in the Dirac neutrino case, the right-handed sneutrino can be also a dark matter candidate as it gets mass only from SUSY breaking. We discuss the non-thermal production of our dark matter candidates from the late decay of stau and find that the constraints from the Big Bang Nucleosynthesis can be evaded for a TeV-scale stau mass. △ Less", "We examine the supersymmetry phenomenology of a novel scenario of supersymmetry (SUSY) breaking which we call Gaugino Anomaly Mediation, or inoAMSB. This is suggested by recent work on the phenomenology of flux compactified type IIB string theory. The essential features of this scenario are that the gaugino masses are of the anomaly-mediated SUSY breaking (AMSB) form, while scalar and trilinear soft SUSY breaking terms are highly suppressed. Renormalization group effects yield an allowable sparticle mass spectrum, while at the same time avoiding charged LSPs; the latter are common in models with negligible soft scalar masses, such as no-scale or gaugino mediation models. Since scalar and trilinear soft terms are highly suppressed, the SUSY induced flavor and CP-violating processes are also suppressed. The lightest SUSY particle is the neutral wino, while the heaviest is the gluino. In this model, there should be a strong multi-jet +etmiss signal from squark pair production at the LHC. We find a 100 fb^{-1} reach of LHC out to m_{3/2}\\sim 118 TeV, corresponding to a gluino mass of \\sim 2.6 TeV. A double mass edge from the opposite-sign/same flavor dilepton invariant mass distribution should be visible at LHC; this, along with the presence of short-- but visible-- highly ionizing tracks from quasi-stable charginos, should provide a smoking gun signature for inoAMSB. △ Less", "Supersymmetric grand unified theories based on the gauge group SO(10) are highly motivated. In the simplest models, one expects t-b-τYukawa coupling unification, in addition to gauge, matter and Higgs unification. Yukawa unification only occurs with very special GUT scale boundary conditions, leading to a spectra with ~10 TeV first and second generation scalars, TeV-scale third generation scalars, and light gauginos. The relic density of neutralino cold dark matter is calculated to be 10^2-10^4 times higher than observation. If we extend the theory with the PQWW solution to the strong CP problem, then instead a mixture of axions and axinos comprises the dark matter, with the measured abundance. Such a solution solves several cosmological problems. We predict a rather light gluino with m(gluino)~300-500 GeV that should be visible in either Tevatron or forthcoming LHC run 1 data. We would also expect ultimately a positive result from relic axion search experiments. △ Less", "Direct gauge mediation models using the Intriligator-Seiberg-Shih (ISS) metastable vacua suffer from the Landau pole problem of the standard model gauge couplings and the existence of R symmetry forbidding gaugino masses. These problems may be solved by using the recently proposed SUSY breaking models in a conformal window of the vector-like $SU(N_C)$ gauge theory with gauge singlets. In this paper we propose a model of gauge mediation based on the SUSY-breaking model in the conformal window, and study the dynamics for the SUSY breaking. In the model, there are massive vector-like bifundamental fields charged under both $SU(N_C)$ and the standard model gauge group, and our model can be regarded as a semi-direct gauge mediation model. The color number $N_C$ can be small to avoid the Landau pole problem, and the R symmetry is also broken under a reasonable assumption on the strong dynamics of the model. The model possesses only one free parameter, and the gaugino and sfermion masses are naturally of the same order. △ Less", "The Higgs and some of the Standard Model superpartners may have been copiously produced at LEP and the Tevatron without being detected. We study a novel scenario of this type in which the Higgs decays predominantly into a light hidden sector either directly or through light SUSY states. Subsequent cascades increase the multiplicity of hidden sector particles which, after decaying back into the Standard Model, appear in the detector as clusters of collimated leptons known as lepton jets. We identify the relevant collider observables that characterize this scenario, and study a wide range of LEP and Tevatron searches to recover the viable regions in the space of observables. We find that the Higgs decaying to lepton jets can be hidden when the event topology mimics that of hadronic backgrounds. Thus, as many as 10^4 leptonic Higgs and SUSY decays may be hiding in the LEP and Tevatron data. We present benchmark models with a 100 GeV Higgs that are consistent with all available collider constraints. We end with a short discussion of strategies for dedicated searches at LEP, the Tevatron and the LHC, that allow for a discovery of the Higgs or SUSY particles decaying to lepton jets. △ Less", "In this paper we discuss the issues of supersymmetry breaking and moduli stabilization within the context of E_8 x E_8 heterotic orbifold constructions and, in particular, we focus on the class of \"mini-landscape\" models. In the supersymmetric limit, these models admit an effective low energy field theory with a spectrum of states and dimensionless gauge and Yukawa couplings very much like that of the MSSM. These theories contain a non-Abelian hidden gauge sector which generates a non-perturbative superpotential leading to supersymmetry breaking and moduli stabilization. We demonstrate this effect in a simple model which contains many of the features of the more general construction. In addition, we argue that once supersymmetry is broken in a restricted sector of the theory, then all moduli are stabilized by supergravity effects. Finally, we obtain the low energy superparticle spectrum resulting from this simple model. △ Less", "The top quark has a large Yukawa coupling with the Higgs boson. In the usual extensions of the standard model the Higgs sector includes extra scalars, which also tend to couple strongly with the top quark. Unlike the Higgs, these fields have a natural mass above 2m_t, so they could introduce anomalies in ttbar production at the LHC. We study their effect on the ttbar invariant mass distribution at sqrt{s}=7 TeV. We focus on the bosons (H,A) of the minimal SUSY model and on the scalar field (r) associated to the new scale f in Little Higgs (LH) models. We show that in all cases the interference with the standard amplitude dominates over the narrow-width contribution. As a consequence, the mass difference between H and A or the contribution of an extra T-quark loop in LH models become important effects in order to determine if these fields are observable there. We find that a 1 fb^{-1} luminosity could probe the region tan beta \\le 3 of SUSY and v/(sqrt{2}f) \\ge 0.3 in LH models. △ Less", "We generalize the General Gauge Mediation formalism to allow for the possibility of gauge messengers. Gauge messengers occur when charged matter fields of the susy-breaking sector have non-zero F-terms, which leads to tree-level, susy-breaking mass splittings in the gauge fields. A classic example is that SU(5) / SU(3) x SU(2) x U(1) gauge fields could be gauge messengers. We give a completely general, model independent, current-algebra based analysis of gauge messenger mediation of susy-breaking to the visible sector. Characteristic aspects of gauge messengers include enhanced contributions to gaugino masses, (tachyonic) sfermion mass-squareds generated already at one loop, and also at two loops, and significant one-loop A-terms, already at the messenger scale. △ Less", "We summarize the extensive work started in ref.1, according to which total helicity is conserved for any two-to-two process, at sqrt{s} larger than M_{SUSY} and fixed angles, in any SUSY extension of SM. Asymptotically the theorem is exact. But it may also have important implications at lower energies sqrt{s} close to M_{SUSY}. Up to now, these have been investigated to 1loop electroweak (EW) order for the processes ug to d W+, sd_L chi+; as well as the 17 gg to HH', and the 9 gg to VH processes, where H,H' denote Higgs or Goldstone bosons, and V=Z, W. △ Less", "We study gauge mediation in a wide class of O'Raifeartaigh type models where supersymmetry breaking metastable vacuum is created by gravity and/or quantum corrections. We examine their thermal evolution in the early universe and the conditions under which the susy breaking vacuum can be selected. It is demonstrated that thermalization typically makes the metastable supersymmetry breaking cosmologically disfavoured but this is not always the case. Initial conditions with the spurion displaced from the symmetric thermal minimum and a small coupling to the messenger sector can result in the realization of the susy breaking vacuum even if the reheating temperature is high. We show that this can be achieved without jeopardizing the low energy phenomenology. In addition, we have found that deforming the models by a supersymmetric mass term for messengers in such a way that the susy breaking minimum and the susy preserving minima are all far away from the origin does not change the conclusions. The basic observations are expected to hold also in the case of models with an anomalous U(1) group. △ Less", "In the framework of the Constrained Minimal Supersymmetric Standard Model (CMSSM) we evaluate the electroweak fine tuning measure that provides a quantitative test of supersymmetry as a solution to the hierarchy problem. Taking account of current experimental constraints we compute the fine tuning at two-loop order and determine the limits on the CMSSM parameter space and the measurements at the LHC most relevant in covering it. Without imposing the LEPII bound on the Higgs mass, it is shown that the fine tuning computed at two-loop has a minimum $Δ=8.8$ corresponding to a Higgs mass $m_h=114\\pm 2$ GeV. Adding the constraint that the SUSY dark matter relic density should be within present bounds we find $Δ=15$ corresponding to $m_h=114.7\\pm 2$ GeV and this rises to $Δ=17.8$ ($m_h=115.9\\pm 2$ GeV) for SUSY dark matter abundance within 3$σ$ of the WMAP constraint. We extend the analysis to include the contribution of dark matter fine tuning. In this case the overall fine tuning and Higgs mass are only marginally larger for the case SUSY dark matter is subdominant and rises to $Δ=28.7$ ($m_h=116.98\\pm 2$ GeV) for the case of SUSY dark matter saturates the WMAP bound. For a Higgs mass above these values, fine tuning rises exponentially fast. The CMSSM spectrum that corresponds to minimal fine tuning is computed and provides a benchmark for future searches. It is characterised by heavy squarks and sleptons and light neutralinos, charginos and gluinos. △ Less", "The SM predictions for CP violating effects in D meson systems are highly suppressed at the per mill level. Therefore, any experimental evidence for a sizable CP violation in D0-D0bar mixing would unambiguously point towards a New Physics (NP) signal. Within supersymmetric scenarios, the popular alignment models can naturally account for large, non-standard effects in D0-D0bar mixing. We demonstrate that, within alignment models, detectable CP violating effects in D0-D0bar mixing would unambiguously imply a lower bound for the electric dipole moment (EDM) of hadronic systems, like the neutron EDM and the mercury EDM, in the reach of future experimental sensitivities. The simultaneous evidence of CP violation in D meson systems together with non vanishing hadronic EDMs would strongly support the idea of SUSY alignment models and disfavour gauge-mediated SUSY breaking models, SUSY models with MFV and non-Abelian SUSY flavour models. As a byproduct of our analysis, we study the correlation between the time dependent CP asymmetry in decays to CP eigenstates S_f and the semileptonic asymmetry a_SL both model independently and in SUSY alignment models. △ Less", "By using a No-Scale Supergravity model, which was proved well to explain WMAP observations appropriately, a mechanism of preheating just after the end of inflation is investigated. By using the canonically normalized and diagonalized scalars, the decay rates of these fields are calculated inflaton $S$ into gauge sector fields. The reheating temperature is estimated by both the stability condition of Boltzmann equation and the instant preheating mechanism. The both of reheating temperatures are almost the same order of magnitude $\\sim O(10^{10})$ GeV. Because two mechanisms are completely independent processes, the former is caused through the inflaton decays into gauge fields and gauginons and the latter is caused by the scattering process of two inflatons into two right handed sneutrinos, which will decay into Higgs fields and other minimal SUSY standard model (MSSM) particles, we conclude that both mechanisms play essential roles in the preheating process after inflation. △ Less", "In the MSSM scalar h,H production is mediated by heavy quark and squark loops. The higher order QCD corrections have been obtained some time ago and turned out to be large. The full SUSY QCD corrections have been obained recently including the full mass dependence of the loop particles. We describe our calculation and present first numerical results. We also address the question of the proper treatment of the large gluino mass limit, i.e. the consistent decoupling of heavy gluino effects, and present the effective Lagrangian for decoupled gluinos. △ Less", "The 1-loop corrected decay widths of sparticles (charginos, neutralinos, gluino and sfermions) in the framework of the MSSM are calculated systematically using GRACE/SUSY-loop, which is the program package for the automatic calculation of the MSSM amplitudes in the 1-loop order. We present the renormalization scheme used in our system and show some numerical results of decay widths of sfermions and gluino using the SPS1a' parameter set and other SUSY parameter sets. △ Less", "There are many flat directions in SUSY models, which may dissipate their energy and source the radiation background during inflation. However, the only possibility that has been studied in this direction is warm inflation, which uses \"warm\" (or \"dissipative\" if we consider more modest situation) direction as the inflaton. In this talk we discuss other significant possibilities of such directions which are dissipative and may or may not be \"warm\". Affleck-Dine (AD) mechanism and other cosmological scenarios are discussed in the light of \"dissipative field\", instead of using the conventional light field with mass protection. We sometimes consider Morikawa-Sasaki coefficient for the non-thermal background, which is important because the dissipation calculated for a naive thermal background with $T\\to 0$ is not enough to discuss the dissipation with the non-thermal background. △ Less", "We search for viable models of direct gauge mediation, where the SUSY-breaking sector is (generalized) SQCD, which has cosmologically favorable uplifted vacua even when the reheating temperature is well above the messenger scale. This requires a relatively large tadpole term in the scalar potential for the spurion field X and, consequently, we argue that pure (deformed) SQCD is not a viable model. On the other hand, in SQCD with an adjoint, which is natural e.g. in string theory, assuming an appropriate sign in the Kahler potential for X, such metastable vacua are possible. △ Less", "In the minimal supersymmetric standard model (MSSM), a strongly first-order electroweak phase transition (EWPT) is only possible in a confined parameter region where one of the scalar top quarks is lighter than the top quark and the other one is as heavy as the SUSY breaking scale. If the MSSM is enlarged to accommodate vector-like quarks and their superpartners, we find that the strongly first-order EWPT is possible without requiring light scalar top quark at the one-loop level, in the limit where the lightest scalar Higgs boson of the MSSM behaves like the Higgs boson of the standard model and the other Higgs bosons are all as heavy as the SUSY breaking scale. The strength of the first-order EWPT is found to be dependent on the mass of the lightest neutral Higgs boson and the mixing effects of the vector-like scalar quarks. △ Less", "In this letter, we investigate the production of light dark matter particles at LHC in light of the model (N = 2 SUSY inspired) proposed in Ref. [1] and demonstrate that they will be copiously produced if the colored messengers Fq are lighter than 1 TeV. We expect up to a million events if the Fq mass is about 500 GeV, assuming a ~1 inverse fb luminosity. In addition, we show that, even if the Fq mass is above a few TeV, searches for Fq production at LHC are promising because a kinematical signature can be used to separate the signal from background. This signature is similar to that expected in supersymmetric scenarios. Hence, our study shows that most of the Fq mass range could be constrained using LHC data. This should encourage further studies since they could infirm/confirm the MeV DM scenario. △ Less", "We present the consequences of a large radiative correction term coming from Supersymmetry (SUSY) upon the electron neutrino fluxes streaming off a core- collapse supernova using a 3-flavor neutrino-neutrino interaction code. We explore the interplay between the neutrino-neutrino interaction and the effects of the resonance associated with the mu-tau neutrino index of refraction. We find that sizeable effects may be visible in the flux on Earth and, consequently, on the number of events upon the energy signal of electron neutrinos in a liquid argon detector. Such effect could lead to a probe for Beyond Standard Model (BSM) physics and, ideally, to constraints in the SUSY parameter space. △ Less", "In a recent work, a model of gauge mediation with sequestered supersymmetry (SUSY) breaking was proposed. In this model, the mass of the gravitino is O(100) GeV without causing the flavor-changing neutral-current problem. In contrast to traditional gauge mediation, the gravitino is not the lightest SUSY particle and the neutralino is the candidate of the dark matter. In this paper, we investigate phenomenological aspects of this model and discuss the possibility of the direct detection of the dark matter. In particular, we focus on the light neutralino case and find that the light-Higgsino scenario such as the focus point is interesting, taking account of the recent CDMS result. △ Less", "In this paper we consider U(1)-gauged Polony'i model with two spurions coupled to a twisted closed string modulus. This offers a consistent setup for metastable SUSY breakdown which allows for moduli stabilization and naturally leads to gauge or hybrid gauge/gravitational mediation mechanism. Due to the presence of the second spurion one can arrange for a solution of the μand B_μproblems in a version of modified Giudice-Masiero mechanism, which works both in the limit of pure gauge mediation and in the mixed regime of hybrid mediation. △ Less", "We discuss the calculation of soft supersymmetry breaking terms in type IIB string theoretic models in the Large Volume Scenario (LVS). The suppression of FCNC gives a lower bound on the size of the compactification volume. This leads to soft terms which are strongly suppressed relative to the gravitino mass so that the dominant contribution to the gaugino masses comes from the Weyl anomaly. The other soft terms are essentially generated by the renormalization group running from the string scale to the TeV scale. △ Less", "In a class of direct gauge mediation with a perturbatively stable SUSY breaking vacuum, gaugino masses vanish at the leading order of SUSY breaking F-term. We study the allowed parameter space of the gauge mediation models. By imposing a Tevatron bound on the lightest chargino mass m_{{\\tilde χ}^\\pm_1} > 270 GeV and a warm dark-matter mass bound on the light gravitino mass m_{3/2} < 16 eV, we find that almost all the parameter space is excluded. Near future experiments may completely exclude, or possibly discover, the scenario. △ Less", "Precise measurements of slepton mass-splittings might represent a powerful tool to probe supersymmetric (SUSY) lepton flavour violation (LFV) at the LHC. We point out that mass-splittings of the first two generations of sleptons are especially sensitive to LFV effects involving $τ-μ$ transitions. If these mass-splittings are LFV induced, high-energy LFV processes like the neutralino decay ${\\nt}_2\\to\\nt_1τ^{\\pm}μ^{\\mp}$ as well as low-energy LFV processes like $τ\\toμγ$ are unavoidable. We show that precise slepton mass-splitting measurements and LFV processes both at the high- and low-energy scales are highly complementary in the attempt to (partially) reconstruct the flavour sector of the SUSY model at work. The present study represents another proof of the synergy and interplay existing between the LHC, i.e. the {\\em high-energy frontier}, and high-precision low-energy experiments, i.e. the {\\em high-intensity frontier}. △ Less", "In the version 1, we proposed a mechanism to create baryon asymmetry in a conformally sequestered supersymmetry (SUSY) breaking scenario through the Affleck-Dine (AD) mechanism. After the submission, however, we found a critical error in our discussion. This is a note on the article of version 1. △ Less", "The sneutrino is a viable candidate for the NLSP in SUSY spectra with gravitino LSP. In this work we study the collider implications of this possibility. In particular, we investigate whether the LHC can distinguish it (at least, in some cases) from alternative spectra, such as those with a neutralino LSP. We show that there exists a complete family of experimentally allowed and theoretically motivated spectra with sneutrino NLSP, which exhibit very distinctive multilepton signals that are difficult to fake within the MSSM. We study these signals in detail, including the techniques necessary to find them. We demonstrate our analysis approach on simulations incorporating backgrounds. △ Less", "We consider SUSY-like missing energy events at hadron colliders and critically examine the common assumption that the missing energy is the result of two identical missing particles. In order to experimentally test this hypothesis, we generalize the subsystem MT2 variable to the case of asymmetric event topologies, where the two SUSY decay chains terminate in different \"children\" particles. In this more general approach, the endpoint MT2max of the MT2 distribution now gives the mass Mp(Mc(a),Mc(b)) of the parent particle as a function of two input children masses Mc(a) and Mc(b). We propose two methods for an independent determination of the individual children masses Mc(a) and Mc(b). First, in the presence of upstream transverse momentum P(UTM) the corresponding function Mp(Mc(a),Mc(b),P(UTM)) is independent of P(UTM) at precisely the right values of the children masses. Second, the previously discussed MT2 \"kink\" is now generalized to a \"ridge\" on the 2-dimensional surface Mp(Mc(a),Mc(b)). As we show in several examples, quite often there is a special point along that ridge which marks the true values of the children masses. Our results allow collider experiments to probe a multi-component dark matter sector directly and without any theoretical prejudice. △ Less", "We present a simple scenario for gauge mediated supersymmetry breaking where the messengers are also the fields that generate neutrino masses. We show that the simplest such scenario corresponds to the case where neutrino masses are generated through the Type I and Type III seesaw mechanisms. The entire supersymmetric spectrum and Higgs masses are calculable from only four input parameters. Since the electroweak symmetry is broken through a doubly radiative mechanism, meaning a nearly zero B-term at the messenger scale which runs down to acceptable values, one obtains quite a constrained spectrum for the supersymmetric particles whose properties we describe. We refer to this mechanism as \"nu-GMSB\". △ Less", "If SUSY provides a solution to the hierarchy problem then supersymmetric states should not be too heavy. This requirement is quantified by a fine tuning measure that provides a quantitative test of SUSY as a solution to the hierarchy problem. The measure is useful in correlating the impact of the various experimental measurements relevant to the search for supersymmetry and also in identifying the most sensitive measurements for testing SUSY. In this paper we apply the measure to the CMSSM, computing it to two-loop order and taking account of current experimental limits and the constraint on dark matter abundance. Using this we determine the present limits on the CMSSM parameter space and identify the measurements at the LHC that are most significant in covering the remaining parameter space. Without imposing the LEP Higgs mass bound we show that the smallest fine tuning (1:13) consistent with a relic density within the WMAP bound corresponds to a Higgs mass of 114$\\pm$2 GeV. Fine tuning rises rapidly for heavier Higgs. △ Less", "Recent re-evaluations of the Standard Model (SM) contribution to ${\\mathcal Br(b\\to sγ)$ hint at a positive correction from new physics. Since a charged Higgs boson exchange always gives a positive contribution to this branching ratio, the constraint points to the possibility of a relatively light charged Higgs. It is found that under the HFAG constraints and with re-evaluated SM results large cancellations between the charged Higgs and the chargino contributions in supersymmetric models occur. Such cancellations then correlate the charged Higgs and the chargino masses often implying both are light. Inclusion of the more recent evaluation of $g_μ-2$ is also considered. The combined constraints imply the existence of several light sparticles. Signatures arising from these light sparticles are investigated and the analysis indicates the possibility of their early discovery at the LHC in a significant part of the parameter space. We also show that for certain restricted regions of the parameter space, such as for very large $\\tanβ$ under the $1σ$ HFAG constraints, the signatures from Higgs production supersede those from sparticle production and may become the primary signatures for the discovery of supersymmetry. △ Less", "In this note we discuss the vacuum alignment in supersymmetric models with spontaneously broken flavour symmetries in the presence of soft supersymmetry (SUSY) breaking terms. We show that the inclusion of soft SUSY breaking terms can give rise to non-vanishing vacuum expectation values (VEVs) for the auxiliary components of the flavon fields. These non-zero VEVs can have an important impact on the phenomenology of this class of models, since they can induce an additional flavour violating contribution to the sfermion soft mass matrix of right-left (RL) type. We carry out an explicit computation in a class of SUSY A4 models predicting tri-bimaximal mixing in the lepton sector. The flavour symmetry breaking sector is described in terms of flavon and driving supermultiplets. We find non-vanishing VEVs for the auxiliary components of the flavon fields and for the scalar components of the driving fields which are of order m_{SUSY} x <phi> and m_{SUSY}, respectively. Thereby, m_{SUSY} is the generic soft SUSY breaking scale which is expected to be around 1 TeV and <phi> is the VEV of scalar components of the flavon fields. Another effect of these VEVs can be the generation of a mu term. △ Less", "We propose a E_6 inspired supersymmetric model with a non-Abelian discrete flavor symmetry (S_4 group); that is, SU(3)_c x SU(2)_W x U(1)_Y x U(1)_X x S_4 x Z_2. In our scenario, the additional abelian gauge symmetry; U(1)_X, not only solves the mu-problem in the minimal Supersymmetric Standard Model(MSSM), but also requires new exotic fields which play an important role in solving flavor puzzles. If our exotic quarks can be embedded into a S_4 triplet, which corresponds to the number of the generation, one finds that dangerous proton decay can be well-suppressed. Hence, it might be expected that the generation structure for lepton and quark in the SM(Standard Model) can be understood as a new system in order to stabilize the proton in a supersymemtric standard model (SUSY). Moreover, due to the nature of the discrete non-Abelian symmetry itself, Yukawa coupling constants of our model are drastically reduced. In our paper, we show two predictive examples of the models for quark sector and lepton sector, respectively. △ Less", "Simple SUSY GUT models based on the gauge group SO(10) require t-b-τYukawa coupling unification, in addition to gauge coupling and matter unification. The Yukawa coupling unification places strong constraints on the expected superparticle mass spectrum, with scalar masses \\sim 10 TeV while gluino masses are much lighter: in the 300--500 GeV range. The very heavy squarks suppress negative interference in the q\\bar{q}\\to\\tg\\tg cross section, leading to a large enhancement in production rates. The gluinos decay almost always via three-body modes into a pair of b-quarks, so we expect at least four b-jets per signal event. We investigate the capability of Fermilab Tevatron collider experiments to detect gluino pair production in Yukawa-unified SUSY. By requiring events with large missing E_T and \\ge 2 or 3 tagged b-jets, we find a 5σreach in excess of m_{\\tg}\\sim 400 GeV for 5 fb^{-1} of data. This range in m_{\\tg} is much further than the conventional Tevatron SUSY reach, and should cut a significant swath through the most favored region of parameter space for Yukawa-unified SUSY models. △ Less", "We derive new constraints on the quantities delta_{XY}^{ij}, X,Y=L,R, which parametrise the flavour-off-diagonal terms of the charged slepton mass matrix in the MSSM. Considering mass and anomalous magnetic moment of the electron we obtain the bound |delta^{13}_{LL} delta^{13}_{RR}|<0.1 for tan beta=50, which involves the poorly constrained element delta^{13}_{RR}. We improve the predictions for the decays tau -> mu gamma, tau -> e gamma and mu -> e gamma by including two-loop corrections which are enhanced if tan beta is large. The finite renormalisation of the PMNS matrix from soft SUSY-breaking terms is derived and applied to the charged-Higgs-lepton vertex. We find that the experimental bound on BR(tau -> e gamma) severely limits the size of the MSSM loop correction to the PMNS element U_{e3}, which is important for the proper interpretation of a future U_{e3} measurement. Subsequently we confront our new values for delta^{ij}_{LL} with a GUT analysis. Further, we include the effects of dimension-5 Yukawa terms, which are needed to fix the Yukawa unification of the first two generations. If universal supersymmetry breaking occurs above the GUT scale, we find the flavour structure of the dimension-5 Yukawa couplings tightly constrained by mu -> e gamma. △ Less", "We construct a model of spontaneous CP violation in E6 supersymmetric grand unified theory. In the model, we employ an SU(2)F flavor symmetry and an anomalous U(1)A symmetry. The SU(2)F flavor symmetry is introduced to provide the origin of hierarchical structures of Yukawa coupling and to ensure the universality of sfermion soft masses. The anomalous U(1)A symmetry is introduced to realize the doublet-triplet mass splitting, to provide the origin of hierarchical structures of Yukawa couplings, and to solve the mu problem. In the model, CP is spontaneously broken by the SU(2)F breaking in order to provide a Kobayashi-Maskawa phase and to evade the supersymmetric CP problem. However, a naive construction of the model generally leads to unwanted outcome, Arg[mu b*]=O(1), when CP violating effects in the flavor sector are taken into account. We cure this difficulty by imposing a discrete symmetry and find that this prescription can play additional roles. It ensures that realistic up-quark mass and Cabibbo angle are simultaneously realized without cancellation between O(1) coefficients. Also, severe constraints from the chromo-electric dipole moment of the quark can be satisfied without destabilizing the weak scale. The discrete symmetry reduces the number of free parameters, but the model is capable of reproducing quark and lepton mass spectra, mixing angles, and a Jarlskog invariant. We obtain characteristic predictions Vub sim O(lambda^4) (lambda=0.22) and |Vcb Yb| = |Yc| at the grand unified theory scale. △ Less", "We investigate an extension of the MSSM Higgs sector by including the effects of all dimension-five and dimension-six effective operators and their associated supersymmetry breaking terms. The corrections to the masses of the neutral CP-even and CP-odd Higgs bosons due to the d=5 and d=6 operators are computed. When the d=5 and d=6 operators are generated by the same physics (i.e. when suppressed by powers of the same scale M), due to the relative $\\tanβ$ enhancement of the latter, which compensates their extra scale suppression (1/M), the mass corrections from d=6 operators can be comparable to those of d=5 operators, even for conservative values of the scale M. We identify the effective operators with the largest individual corrections to the lightest Higgs mass and discuss whether at the microscopic level and in the simplest cases, these operators are generated by \"new physics\" with a sign consistent with an increase of m_h. Simple numerical estimates easily allow an increase of m_h due to d=6 operators alone in the region of 10-30 GeV, while for a much larger increase light new states beyond MSSM may be needed, in which case the effective description is unreliable. Special attention is paid to the treatment of the effective operators with higher derivatives. These can be removed by non-linear field redefinitions or by an \"unfolding\" technique, which effectively ensure that any ghost degrees of freedom (of mass $\\geqsim M$) are integrated out and absent in the effective theory at scales much smaller than M. Considering general coefficients of the susy operators with a scale of new physics above the LHC reach, it is possible to increase the tree-level prediction for the Higgs mass to the LEPII bound, thus alleviating the MSSM fine-tuning. △ Less", "Over almost all of minimal supergravity (mSUGRA or CMSSM) model parameter space, there is a large overabundance of neutralino cold dark matter (CDM). We find that the allowed regions of mSUGRA parameter space which match the measured abundance of CDM in the universe are highly fine-tuned. If instead we invoke the Peccei-Quinn-Weinberg-Wilczek solution to the strong CP problem, then the SUSY CDM may consist of an axion/axino admixture with an axino mass of order the MeV scale, and where mixed axion/axino or mainly axion CDM seems preferred. In this case, fine-tuning of the relic density is typically much lower, showing that axion/axino CDM (a\\tilde{a}CDM) is to be preferred in the paradigm model for SUSY phenomenology. For mSUGRA with a\\tilde{a}CDM, quite different regions of parameter space are now DM-favored as compared to the case of neutralino DM. Thus, rather different SUSY signatures are expected at the LHC in the case of mSUGRA with a\\tilde{a}CDM, as compared to mSUGRA with neutralino CDM. △ Less", "A modification to the contransverse mass (MCT) technique for measuring the masses of pair-produced semi-invisibly decaying heavy particles is proposed in which MCT is corrected for non-zero boosts of the centre-of-momentum (CoM) frame of the heavy states in the laboratory transverse plane. Lack of knowledge of the mass of the CoM frame prevents exact correction for this boost, however it is shown that a conservative correction can nevertheless be derived which always generates an MCT value which is less than or equal to the true value of MCT in the CoM frame. The new technique is demonstrated with case studies of mass measurement with fully leptonic ttbar events and with SUSY events possessing a similar final state. △ Less", "We study the phenomenon of accidental or \"emergent\" supersymmetry within gauge theory and connect it to the scenarios of Split Supersymmetry and Higgs compositeness. Combining these elements leads to a significant refinement and extension of the proposal of Partial Supersymmetry, in which supersymmetry is broken at very high energies but with a remnant surviving to the weak scale. The Hierarchy Problem is then solved by a non-trivial partnership between supersymmetry and compositeness, giving a promising approach for reconciling Higgs naturalness with the wealth of precision experimental data. We discuss aspects of this scenario from the AdS/CFT dual viewpoint of higher-dimensional warped compactification. It is argued that string theory constructions with high scale supersymmetry breaking which realize warped/composite solutions to the Hierarchy Problem may well be accompanied by some or all of the features described. The central phenomenological considerations and expectations are discussed, with more detailed modelling within warped effective field theory reserved for future work. △ Less", "We propose a model in which $A_4$ Family Symmetry arises dynamically from a six dimensional orbifold SU(5) Supersymmetric Grand Unified Theory. The SU(5) is broken to the Standard Model gauge group by a particular orbifold compactification leading to $A_4$ Family Symmetry, low energy Supersymmetry and Higgs doublet-triplet splitting. The resulting four dimensional effective superpotential leads to a realistic description of quark and lepton masses and mixing angles including tri-bimaximal neutrino mixing and an inter-family mass hierarchy provided by a Froggatt-Nielsen mechanism. This model is the first which combines the idea of orbifold GUTs with $A_4$ family symmetry resulting from the orbifolding. △ Less", "We perform an extensive study of FCNC and CP Violation within Supersymmetric (SUSY) theories with particular emphasis put on processes governed by b->s transitions and of their correlations with processes governed by b->d transitions, s->d transitions, $D^0-\\bar D^0$ oscillations, lepton flavour violating decays, electric dipole moments and (g-2)_mu. We first perform a comprehensive model-independent analysis of Delta F=2 observables and we emphasize the usefulness of the R_b-gamma plane in exhibiting transparently various tensions in the present UT analyses. Secondly, we consider a number of SUSY models: the general MSSM, a flavour blind MSSM, the MSSM with Minimal Flavour Violation as well as SUSY flavour models based on abelian and non-abelian flavour symmetries that show representative flavour structures in the soft SUSY breaking terms. We show how the characteristic patterns of correlations among the considered flavour observables allow to distinguish between these different SUSY scenarios. Of particular importance are the correlations between the CP asymmetry S_psi phi and B_s->mu^+μ^-, between the anomalies in S_phi K_S and S_psi phi, between S_phi K_S and d_e, between S_psi phi and (g-2)_mu and also those involving lepton flavour violating decays. In our analysis, the presence of right-handed currents and of the double Higgs penguin contributions to B_s mixing plays a very important role. We propose a \"DNA-Flavour Test\" of NP models including Supersymmetry, the Littlest Higgs model with T-parity and the Randall-Sundrum model with custodial protection, with the aim of showing a tool to distinguish between these NP scenarios, once additional data on flavour changing processes become available. △ Less", "We examine a metastable $\\mathcal{N}=1$ Macroscopic SO(N) SQCD model of Intriligator, Seiberg and Shih (ISS). We introduce various baryon and meson deformations, including multitrace operators and explore embedding an SO(10) parent of the standard model into two weakly gauged flavour sectors. Direct fundamental messengers and the symmetric pseudo-modulus messenger mediate SUSY breaking to the MSSM. Gaugino and sfermion masses are computed and compared for each deformation type. We also explore reducing the rank of the magnetic quark matrix of the ISS model and find an additional fundamental messenger. △ Less", "We consider type IIB large volume compactifications involving orientifolds of the Swiss-Cheese Calabi-Yau WCP^4[1; 1; 1; 6; 9] with a single mobile space-time filling D3-brane and stacks of D7-branes wrapping the \"big\" divisor (as opposed to the \"small\" divisor usually done in the literature thus far) as well as supporting D7-brane fluxes. After reviewing our proposal of [1] for resolving a long-standing tension between large volume cosmology and phenomenology pertaining to obtaining a 10^12 GeV gravitino in the inflationary era and a TeV gravitino in the present era, and summarizing our results of [1] on soft supersymmetry breaking terms and open-string moduli masses, we discuss the one-loop RG running of the squark and slepton masses in mSUGRA-like models (using the running of the gaugino masses) to the EW scale in the large volume limit. Phenomenological constraints and some of the calculated soft SUSY parameters identify the D7-brane Wilson line moduli as the first two generations/families of squarks and sleptons and the D3-brane (restricted to the big divisor) position moduli as the two Higgses for MSSM-like models at TeV scale. We also discuss how the obtained open-string/matter moduli make it easier to impose FCNC constraints, as well as RG flow of off-diagonal squark mass(-squared) matrix elements. △ Less", "Considering the mechanism of dissipative slow-roll that has been used in warm inflation scenario, we show that dissipation may alter usual cosmological scenarios associated with SUSY-flat directions. We mainly consider SUSY-flat directions that have strong interactions with non-flat directions and may cause strong dissipation both in thermal and non-thermal backgrounds. An example is the Affleck-Dine mechanism in which dissipation may create significant (both qualitative and quantitative) discrepancies between the conventional scenario and the dissipative one. We also discuss several mechanisms of generating curvature perturbations in which the dissipative field, which is distinguished from the inflaton field, can be used as the source of cosmological perturbations. Considering the Morikawa-Sasaki dissipative coefficient, the damping caused by the dissipation may be significant for many MSSM flat directions even if the dissipation is far from thermal equilibrium. △ Less", "We perform a multilepton channel analysis in the context of the Large Hadron Collider (LHC) for Wilkinson Microwave Anisotropy Probe (WMAP) compatible points in a model with non-universal scalar masses, which admits a Higgs funnel region of supersymmetry dark matter even for a small $\\tanβ$. In addition to two and three-lepton final states, four-lepton events, too, are shown to be useful for this purpose. We also compare the collider signatures in similar channels for WMAP compatible points in the minimal supergravity (mSUGRA) framework with similar gluino masses. Some definite features of such non-universal scenario emerge from the analysis. △ Less", "Supersymmetric B-L extension of the Standard Model (SM) is one of the best candidate for physics beyond the SM that accounts for TeV scale seesaw mechanism and provides an attractive solution for the Higgs naturalness problem. We analyze the charged lepton flavor violation (LFV) in this class of models. We show that due to the smallness of Dirac neutrino Yukawa coupling, the decay rates of l_i -> l_j gamma and l_i -> 3 l_j, generated by the renormalization group evolution of soft SUSY breaking terms from GUT to seesaw scale, are quite suppressed. Therefore, this model is free from the stringent LFV constraints usually imposed on the supersymmetric seesaw model. We also demonstrate that the right-sneutrino is a long-lived particle and can be pair produced at the LHC through the B-L gauge boson. Then, they decay into same-sign dilepton, with a total cross section of order O(1) pb. This signal is one of the striking signatures of supersymmetric B-L extension of the SM. △ Less", "We address the SUSY CP problem in the framework of Minimal Flavor Violation (MFV), where the SUSY flavor problem finds a natural solution. By contrast, the MFV principle does not solve the SUSY CP problem as it allows for the presence of new {\\it flavor blind} CP-violating phases. Then, we generalize the MFV ansatz accounting for a natural solution of it. The phenomenological implications of the generalized MFV ansatz are explored for MFV scenarios defined both at the electroweak (EW) and at the GUT scales. △ Less", "The sensitivity of the lightest supersymmetric particle relic density calculation to different cosmological scenarios is discussed. In particular, we investigate the effects of modifications of the expansion rate and of the entropy content in the Early Universe. These effects, even with no observational consequences, can still drastically modify the relic density constraints on the SUSY parameter space. We suggest general parametrizations to evaluate such effects, and derive also constraints from Big-Bang nucleosynthesis. We show that using the relic density in the context of supersymmetric constraints requires a clear statement of the underlying cosmological model assumptions to avoid misinterpretations. On the other hand, we note that combining the relic density calculation with the eventual future discoveries at the LHC will hopefully shed light on the Very Early Universe properties. △ Less", "We study CP asymmetries in two-body decays of top squarks into neutralinos and sleptons at the LHC. These asymmetries are used to probe the CP phases possibly present in the stop and neutralino sector of the Minimal Supersymmetric Standard Model. Taking into account bounds from experimental electric dipole moment searches, we identify areas in the mSUGRA parameter space where CP asymmetries can be sizeable and discuss the feasibility of their observation at the LHC. As a result, potentially detectable CP asymmetries in stop decays at the LHC are found, motivating further detailed experimental studies for probing SUSY CP phases. △ Less", "We discuss kinematic methods for determining the masses of the particles in events at a hadron collider in which a pair of identical particles is produced with each decaying via a series of on-shell intermediate beyond-the-SM (BSM) particles to visible SM particles and an invisible particle (schematically, pp -> ZZ + jets with Z -> Aa -> Bba -> Ccba -> ... -> cba... + N where a,b,c,... are visible SM particles or groups of SM particles, A,B,C,... are on-shell BSM particles and N is invisible). This topology arises in many models including SUSY processes such as squark and gluino pair production and decay. We present the detailed procedure for the case of Z -> 3 visible particles + N and demonstrate that the masses obtained from the kinematic procedure are independent of the model by comparing SUSY to UED. △ Less", "We re-examine the one-loop renormalization group equations (RGEs) for the dimensionful parameters of the minimal supersymmetric Standard Model with broken supersymmetry, allowing for arbitrary flavour structure of the soft SUSY breaking (SSB) parameters. We include threshold effects by evaluating the $β$-functions in a sequence of (non-supersymmetric) effective theories with heavy particles decoupled at the scale of their mass. We present the most general form for high scale SSB parameters that obtains if we assume that the supersymmetry breaking mechanism does not introduce new inter-generational couplings. This form, possibly amended to allow additional sources of flavour-violation, serves as a boundary condition for solving the RGEs for the dimensionful MSSM parameters. We then present illustrative examples of numerical solutions to the RGEs. We find that in a SUSY GUT with the scale of SUSY scalars split from that of gauginos and higgsinos, the gaugino mass unification condition may be violated by ${\\cal O}$(10%). As another illustration, we show that in mSUGRA, the rate for the flavour-violating $\\tilde{t}_1\\to c\\tilde{Z}_1$ decay obtained using the complete RGE solution is smaller than that obtained using the commonly-used \"single-step\" integration of the RGEs by a factor 10-25, and so may qualitatively change expectations for topologies from top-squark pair production at colliders. Together with the RGEs for dimensionless couplings presented in a companion paper, the RGEs in Appendix B of this paper form a complete set of one-loop MSSM RGEs that include threshold and flavour-effects necessary for two-loop accuracy. △ Less", "We look at the possibility of non-perturbative particle production after inflation from SUSY flat directions produced by rotating eigenstates thereby avoiding the standard adiabaticity conditions. This might lead to preheating and prevent the delay of thermalisation of the universe. We investigate the flat directions $LLE^c$ and $U^cD^cD^c$ and find no particle production. These 2 directions are very important, since they have been named as possible candidates for being the inflaton. We investigate $QLQLQLE^c$ and find particle production and therefore the possibility of preheating. We investigate the $LLE^c$ and $U^cD^cD^c$ directions appearing simultaneously, and find no production. Finally, we investigate $LLE^c$ and $QLD^c$ simultaneously - with one L-field in common. Here we do find particle production and therefore the possibility of preheating. This means that if SUSY flat directions are to delay thermalisation and thus explain the (lack of) gravitino production, it is necessary to explain why complicated directions as $QLQLQLE^c$ are not exited, and why combinations like $LLE^c$ and $QLD^c$ are not both exited. △ Less", "In a theory with broken supersymmetry, gaugino couplings renormalize differently from gauge couplings, as do higgsino couplings from Higgs boson couplings. As a result, we expect the gauge (Higgs boson) couplings and the corresponding gaugino (higgsino) couplings to evolve to different values under renormalization group evolution. We re-examine the renormalization group equations (RGEs) for these couplings in the Minimal Supersymmetric Standard Model (MSSM). To include threshold effects, we calculate the $β$-functions using a sequence of (non-supersymmetric) effective theories with heavy particles decoupled at the scale of their mass. We find that the difference between the SM couplings and their SUSY cousins that is ignored in the literature may be larger than two-loop effects which are included, and further that renormalization group evolution induces a non-trivial flavour structure in gaugino interactions. We present here the coupled set of RGEs for these dimensionless gauge and \"Yukawa\"-type couplings. The RGEs for the dimensionful SSB parameters of the MSSM will be presented in a companion paper. △ Less", "We study the SUSY flavor problem in the MSSM, we are namely interested in estimating the size of the SUSY flavor problem and its dependence on the MSSM parameters. For that, we made a numerical analysis randomly generating the entries of the sfermion mass matrices and then determinated which percentage of the points are consistent with current bounds on the flavor violating transitions on lepton flavor violating (LFV) decays $l_i \\to l_j γ$. We applied two methods, mass-insertion approximation method (MIAM) and full diagonalization method (FDM). Furthermore, we determined which fermion masses could be radiatively generated (through gaugino-sfermion loops) in a natural way, using those random sfermion matrices. In general, the electron mass generation can be done with 30% of points for large $\\tanβ$, in both schemes the muon mass can be generated by 40% of points only when the most precise sfermion splitting (from the FDM) is taken into account. △ Less"]