["These lectures are a very brief introduction to low energy supersymmetry (SUSY). The approach to the construction of SUSY Lagrangians based on the superfield formalism is considered. The minimal supersymmetric standard model (MSSM) is specified. The breakdown of gauge symmetry and Higgs phenomenology within the simplest SUSY extensions of the standard model (SM) are briefly reviewed. The upper bound on the mass of the lightest Higgs boson and little hierarchy problem in SUSY models are discussed. △ Less", "We investigate the prospects for the discovery of a neutral Higgs boson produced in association with a $b$ quark, followed by the Higgs decay into a pair of bottom quarks, $pp \\to bφ^0 \\to b b\\bar{b} +X$, at the CERN Large Hadron Collider (LHC) within the framework of unified supersymmetric models. The Higgs boson $φ^0$ can be a heavy scalar $H^0$ or a pseudoscalar $A^0$. Furthermore, this direct discovery channel is compared with the indirect Higgs searches in the rare decay $B_s \\to μ^+μ^-$ at hadron colliders. Promising results are found for the minimal supergravity (mSUGRA) model, the anomaly mediated supersymmetry breaking (AMSB) model, and the gauge mediated supersymmetry breaking (GMSB) model. We find that the indirect search for $B(B_s \\to μ^+μ^-) \\ge 5\\times 10^{-9}$ is complementary to the direct search for $bφ^0 \\to bb\\bar{b}$ with $\\sqrt{s} = 14$ TeV and an integrated luminosity ($L$) of 300 fb$^{-1}$. In the AMSB and GMSB models, $bφ^0 \\to bb\\bar{b}$ with $L = 300$ fb$^{-1}$ covers a larger area in the parameter space than $B(B_s \\to μ^+μ^-) \\ge 5\\times 10^{-9}$. In addition, we present constraints from $b \\to sγ$ and muon anomalous dipole moment ($Δa_μ$) on the parameter space. △ Less", "Recently the ATLAS and CMS collaborations presented preliminary results of Standard Model Higgs searches and reported excesses of events for a Higgs boson at 124-126 GeV. Such a Higgs mass can be naturally realized, simultaneously explaining the muon g-2 anomaly, in gauge-mediated SUSY breaking models with extra vector-like matters. Upper bounds are obtained on the gluino mass, m_{\\tilde g}\\lesssim 1.2 (1.8) TeV, and on the extra vector-like quark mass, M_{Q'} \\lesssim 1.0 (1.8) GeV, in the parameter region where the Higgs boson mass is 124-126 GeV and the muon g-2 is consistent with the experimental value at the 1 sigma (2 sigma) level. The LHC prospects are explored in the parameter region. It is found that some of the regions are already excluded by the LHC, and most of the parameter space is expected to be covered at \\sqrt{s} = 14 TeV. A study on the extra vector-like quarks, especially current bounds on their masses and prospects for future searches, is also included. △ Less", "We calculate supersymmetric mass spectra with cMSSM boundary conditions and a type-I seesaw mechanism added to explain current neutrino data. Using published, estimated errors on SUSY mass observables for a combined LHC+ILC analysis, we perform a theoretical $χ^2$ analysis to identify parameter regions where pure cMSSM and cMSSM plus seesaw type-I might be distinguishable with LHC+ILC data. The most important observables are determined to be the (left) smuon and selectron masses and the splitting between them, respectively. Splitting in the (left) smuon and selectrons is tiny in most of cMSSM parameter space, but can be quite sizeable for large values of the seesaw scale, $m_{SS}$. Thus, for very roughly $m_{SS} \\ge 10^{14}$ GeV hints for type-I seesaw might appear in SUSY mass measurements. Since our numerical results depend sensitively on forecasted error bars, we discuss in some detail the accuracies, which need to be achieved, before a realistic analysis searching for signs of type-I seesaw in SUSY spectra can be carried out. △ Less", "The neutrinoless double beta decay is analyzed using a general Lorentz invariant effective Lagrangian for various decaying nuclei of current experimental interest: $^{76}$Ge, $^{82}$Se, $^{100}$Mo, $^{130}$Te, and $^{136}$Xe. We work out the half-lives and angular correlation coefficients of the outgoing electrons in several scenarios for new physics: the left-right symmetric models, the R-parity-violating SUSY and models with leptoquarks. The theoretical uncertainty in the nuclear matrix elements is discussed. △ Less", "Recently, the ATLAS and CMS collaborations have announced exciting hints for a Standard Model-like Higgs boson at a mass of approximately 125 GeV. In this paper, we explore the potential consequences for the MSSM and low scale SUSY-breaking. As is well-known, a 125 GeV Higgs implies either extremely heavy stops (>~ 10 TeV), or near-maximal stop mixing. We review and quantify these statements, and investigate the implications for models of low-scale SUSY breaking such as gauge mediation where the A-terms are small at the messenger scale. For such models, we find that either a gaugino must be superheavy or the NLSP is long-lived. Furthermore, stops will be tachyonic at high scales. These are very strong restrictions on the mediation of supersymmetry breaking in the MSSM, and suggest that if the Higgs truly is at 125 GeV, viable models of gauge-mediated supersymmetry breaking are reduced to small corners of parameter space or must incorporate new Higgs-sector physics. △ Less", "We evaluate all two-body decay modes of the gluino, in the Minimal Supersymmetric Standard Model with complex parameters (cMSSM). This constitutes an important step in the cascade decays of SUSY particles at the LHC. The evaluation is based on a full one-loop calculation of all two-body decay channels, also including hard QED and QCD radiation. The dependence of the gluino decay to a scalar quark and a quark on the relevant cMSSM parameters is analyzed numerically. We find sizable contributions to the decay widths and branching ratios. They are, roughly of O(5%), but can go up to +-10% or higher, where the pure SUSY QCD contributions alone can give an insufficient approximation to the full one-loop result. Therefore the full corrections are important for the correct interpretation of gluino decays at the LHC. The results will be implemented into the Fortran code FeynHiggs. △ Less", "We compute the one-loop threshold corrections to hard supersymmetric relations involving gauge and gaugino couplings for the case of a Split-SUSY-like spectrum with moderate splitting. We show that these contributions are small, however in principle they will typically have to be taken into account if the heavy scalar sector is below 100 TeV and if one reaches, at future linear colliders, the precision that is necessary to perform this kind of measurements. △ Less", "A generalization of the Lagrangian introduced earlier in [2011 {\\it J. Phys. G} ${\\bf 37}$ 105001] for a classical color spinning particle interacting with background non-Abelian gauge and fermion fields for purpose of considering a change in time of the spin particle degree of freedom, is suggested. In the case under consideration the spin degree of freedom is described by a commuting $c$-number Dirac spinor $ψ_α$. A mapping of this spinor into new variables: anticommuting pseudovector $ξ_μ$ and pseudoscalar $ξ_5$ commonly used in a description of the spin degree of freedom of a massive spin-1/2 particle, is constructed. An analysis of one-to-one correspondence of this mapping is given. It is shown that for the one-to-one correspondence it is necessary to extend a class of real tensor quantities including besides $ξ_μ$ and $ξ_5$, also odd vector $\\hatξ_μ$, scalar $\\hatξ_5$, and (dual) pseudotensor $^{\\ast}ζ_{μν}$. In addition, it is shown that it is necessary either to restrict a class of the initial spinor $ψ_α$ to Majorana one or to double the number of variables in the tensor aggregate $(ξ_μ,\\,ξ_5,, ^{\\ast}ζ_{μν},\\,\\hatξ_μ,\\,\\hatξ_5)$. Various special cases of the desired mapping are considered. In particular, a connection with the Lagrangian suggested by A.M. Polyakov, is studied. It is also offered the way of obtaining the supersymmetric Lagrangian in terms of the even $ψ_α$ and odd $θ_α$ spinors. The map of the Lagrandian leads to local SUSY Lagrangian in terms of $ξ_μ$ and $ξ_5$. △ Less", "A Key feature of the minimal supersymmetric extension of the Standard Model (MSSM) is the existence of a light Higgs boson, the mass of which is not a free parameter but an observable that can be predicted from the theory. Given that the LHC is able to measure the mass of a light Higgs with very good accuracy, a lot of effort has been put into a precise theoretical prediction. We present a calculation of the SUSY-QCD corrections to this observable to three-loop order. We perform multiple asymptotic expansions in order to deal with the multi-scale three-loop diagrams, making heavy use of computer algebra and keeping a keen eye on the numerical error introduced. We provide a computer code in the form of a Mathematica package that combines our three-loop SUSY-QCD calculation with the literature of one- and two-loop corrections to the Higgs mass, providing a state-of-the-art prediction for this important observable. △ Less", "Supersymmetric left-right models are well motivated extensions of the Minimal Supersymmetric Standard Model since they automatically contain the ingredients to explain the observed neutrino masses and mixings. Here we study a SUSY model in which the left-right symmetry is broken by triplets at a high scale leading to automatic R-parity conservation at low energies. The sparticle spectra in this model differ from the usual constrained MSSM expectations and these changes affect the relic abundance of the lightest neutralino. We discuss two examples: (1) the standard stau co-annihilation region, and (2) flavoured co-annihilation. △ Less", "Naturalness considerations, together with the non-observation of superpartners of the Standard Model particles at the Large Hadron Collider (LHC) so far, favor supersymmetric (SUSY) models in which third generation squarks are significantly lighter than those of the first two generations. In such models, gluino pair-production is typically the dominant SUSY production process at the LHC, and it often leads to final states with multiple top quarks. Some of these top quarks may be relativistic in the lab frame, in which case their hadronic decays may produce \"top jets\". We propose that the recently developed techniques for tagging top jets can be used to boost sensitivity of the LHC searches for this scenario. For example, within the simplified model used for this study, we estimate that a search with 2 top-tagged jets can probe gluino masses of up to about 1 TeV at the 7 TeV LHC with 30 inverse fb integrated luminosity. △ Less", "We discuss if the Tevatron ttbar asymmetry can be explained by T-channel exchange of a W' gauge boson coupling to down and top quarks. In a spontaneously broken gauge theory, such a W' is necessarily accompanied by a Z' at a similar mass scale. Null results from Tevatron searches for dijet and dilepton resonances imply large mass splitting between the $W'$ and $Z'$. We argue that such splitting can only be accomplished if the gauge symmetry is broken by a scalar in a large dimension representation of the gauge group, for which no perturbative description exists. △ Less", "In the last years we have learnt a lot about neutrino masses and mixings. Neutrinos are not all massless but their masses are very small. Probably masses are small because neutrinos are Majorana particles with masses inversely proportional to the large scale M of lepton number (L) violation, which turns out to be compatible with the GUT scale. We have understood that there is no contradiction between large neutrino mixings and small quark mixings, even in the context of GUTs and that neutrino masses fit well in the SUSY GUT picture. Out of equilibrium decays with CP and L violation of heavy RH neutrinos can produce a B-L asymmetry, then converted near the weak scale by instantons into an amount of B asymmetry compatible with observations (baryogenesis via leptogenesis). It appears that active neutrinos are not a significant component of Dark Matter in the Universe. A long list of models have been formulated over the years to understand neutrino masses and mixings. With the continuous improvement of the data most of the models have been discarded by experiment. The surviving models still span a wide range going from a maximum of symmetry, with discrete non-abelian flavour groups, to the opposite extreme of anarchy. △ Less", "The current 7 TeV run of the LHC experiment shall be able to probe gluino and squark masses up to values of about 1 TeV. Assuming that hints for SUSY are found by the end of a 2 fb$^{-1}$ run, we explore the flavour constraints on the parameter space of the CMSSM, with and without massive neutrinos. In particular, we focus on decays that might have been measured by the time the run is concluded, such as $B_s\\toμμ$ and $μ\\to eγ$. We also briefly show the impact such a collider--flavour interplay would have on a Flavoured CMSSM. △ Less", "A recently proposed class of supersymmetric models predicts rather light and nearly mass-degenerate higgsinos, while the other superparticles are significantly heavier. In this paper we study the early LHC phenomenology of a benchmark model of this kind. If the squarks and gluinos, and in particular the lighter stop, are still light enough to be within reach, then evidence for our model can be found in hadronic SUSY searches. Moreover, with dedicated searches it will be possible to distinguish the light higgsino model from generic SUSY models with a bino LSP. Search channels with b-jets and with isolated leptons play a crucial role for model discrimination. △ Less", "After a very successful startup of the LHC in 2010, the CMS experiment has already accumulated significantly more data in 2011. After the successful re-discovery of the Standard Model, the search for signs of new physics has already reached, and in most cases enlarged, the limits from previous experiments. In this conference report I review the recent discovery reach of SUSY searches that will be performed with the 2011 data. △ Less", "We propose a new chiral model of metastable supersymmetry breaking in the conformal window via chiral/nonchiral Seiberg duality, which is focused on Spin(7)/SU(N_f-4) duality in this letter. Following the approach of Intriligator-Seiberg-Shih model, a small mass perturbation in the nonchiral theory leads to supersymmetry breaking by rank condition in the chiral dual description. △ Less", "In the multiverse the scale of SUSY breaking, \\tilde{m} = F_X/M_*, may scan and environmental constraints on the dark matter density may exclude a large range of \\tilde{m} from the reheating temperature after inflation down to values that yield a LSP mass of order a TeV. After selection effects, the distribution for \\tilde{m} may prefer larger values. A single environmental constraint from dark matter can then lead to multi-component dark matter, including both axions and the LSP, giving a TeV-scale LSP lighter than the corresponding value for single-component LSP dark matter. If SUSY breaking is mediated to the SM sector at order X^* X, only squarks, sleptons and one Higgs doublet acquire masses of order \\tilde{m}. The gravitino mass is lighter by a factor of M_*/M_Pl and the gaugino masses are suppressed by a further loop factor. This Spread SUSY spectrum has two versions; the Higgsino masses are generated in one from supergravity giving a wino LSP and in the other radiatively giving a Higgsino LSP. The environmental restriction on dark matter fixes the LSP mass to the TeV domain, so that the squark and slepton masses are order 10^3 TeV and 10^6 TeV in these two schemes. We study the spectrum, dark matter and collider signals of these two versions of Spread SUSY. The Higgs is SM-like and lighter than 145 GeV; monochromatic photons in cosmic rays arise from dark matter annihilations in the halo; exotic short charged tracks occur at the LHC, at least for the wino LSP; and there are the eventual possibilities of direct detection of dark matter and detailed exploration of the TeV-scale states at a future linear collider. Gauge coupling unification is as in minimal SUSY theories. If SUSY breaking is mediated at order X, a much less hierarchical spectrum results---similar to that of the MSSM, but with the superpartner masses 1--2 orders of magnitude larger than in natural theories. △ Less", "We present persistently amassing evidence that the CMS and ATLAS Collaborations may indeed be already registering supersymmetry events at the Large Hadron Collider (LHC). Our analysis is performed in the context of a highly phenomenologically favorable model named No-Scale F-SU(5), which represents the unification of the F-lipped SU(5) Grand Unified Theory (GUT), two pairs of hypothetical TeV-scale vector-like supersymmetric multiplets derived out of F-Theory, and the dynamically established boundary conditions of No-Scale supergravity. We document highly suggestive correlations between the first inverse femtobarn of observations by CMS and ATLAS, where seductive excesses in multijet events, particularly those with nine or more jets, are unambiguously accounted for by a precision Monte-Carlo simulation of the F-SU(5) model space. This intimate correspondence is optimized by a unified gaugino mass in the neighborhood of M_{1/2}=518 GeV. We supplement this analysis by extrapolating for the expected data profile to be realized with five inverse femtobarns of integrated luminosity, as expected to be observed at the LHC by the conclusion of 2011. Significantly, we find that this luminosity may be sufficient to constitute a SUSY discovery for the favored benchmark spectrum. Indeed, the winds wafting our way from Geneva may already be heavy with the delicate perfume of Supersymmetry. △ Less", "We perform a comprehensive and systematic analysis of the SUSY flavor structure of generic 5D supergravity models on $S^1/Z_2$ with multiple $Z_2$-odd vector multiplets that generate multiple moduli. The SUSY flavor problem can be avoided due to contact terms in the 4D effective Kähler potential peculiar to the multi-moduli case. A detailed phenomenological analysis is provided based on an illustrative model. △ Less", "Supersymmetric SO(10) Grand Unified Theories with Yukawa unification represent an appealing possibility for physics beyond the Standard Model. However Yukawa unification is made difficult by large threshold corrections to the bottom mass. Generally one is led to consider models where the sfermion masses are large in order to suppress these corrections. Here we present another possibility, in which the top and bottom GUT scale Yukawa couplings are equal to a component of the charged lepton Yukawa matrix at the GUT scale in a basis where this matrix is not diagonal. Physically, this weak eigenstate Yukawa unification scenario corresponds to the case where the charged leptons that are in the 16 of SO(10) containing the top and bottom quarks mix with their counterparts in another SO(10) multiplet. Diagonalizing the resulting Yukawa matrix introduces mixings in the neutrino sector. Specifically we find that for a large region of parameter space with relatively light sparticles, and which has not been ruled out by current LHC or other data, the mixing induced in the neutrino sector is such that $sin^2 2Θ_{23} \\approx 1$, in agreement with data. The phenomenological implications are analyzed in some detail. △ Less", "In this work, we study the light stop pair signals at the LHC. We explore the SUSY parameter space with non-universal gaugino and third generation masses at the GUT scale. Recent LHC SUSY search results based on 35pb$^{-1}$ and 1fb$^{-1}$ of data are implemented to put the limits on stop pair events. The dark matter relic density and direct detection constraints are also taken into account. Detailed simulations on the signals and background for some benchmark points are performed, and it is found that the stop pair signals usually escape the LHC search if the present cut conditions are used. We also explore the potential and sensitivity of ILC to probe such scenarios. It is found that the ILC can detect them with an integrated luminosity of a few tens of fb$^{-1}$. △ Less", "We consider the Higgs sector in extensions of the Minimal Supersymmetric Standard Model by higher-dimension operators in the superpotential and the Kähler potential, in the context of Higgs searches at the LHC 7 TeV run. Such an effective field theory (EFT) approach, also referred to as BMSSM, allows for a model-independent description that may correspond to the combined effects of additional supersymmetric sectors, such as heavy singlets, triplets or gauge bosons, in which the supersymmetry breaking mass splittings can be treated as a perturbation. We consider the current LHC dataset, based on about $1-2 {\\rm fb}^{-1}$ of data to set exclusion limits on a large class of BMSSM models. We also present projections for integrated luminosities of 5 and 15 fb$^{-1}$, assuming that the ATLAS and CMS collaborations will combine their results in each channel. Our study shows that the majority of the parameter space will be probed at the $2σ$ level with 15 fb$^{-1}$ of data. A non-observation of a Higgs boson with about 10 fb$^{-1}$ of data will point towards a Higgs SUSY spectrum with intermediate $\\tan β$ ($\\approx$ a few to 10) and a light SM-like Higgs with somewhat enhanced couplings to bottom and tau pairs. We define a number of BMSSM benchmark scenarios and analyze the possible exclusion/discovery channels and the projected required luminosity to probe them. We also discuss the results of the EFT framework for two specific models, one with a singlet superfield and one with SU(2)$_L$ triplets. △ Less", "We consider a scenario in which Supersymmetry breaking is communicated to the MSSM fields through the interplay of yukawa and gauge interactions. The MSSM spectrum resembles that of split SUSY scenarios, but on top of that it develops some peculiar features like heavy higgsinos and an inverted hierarchy of sfermion masses. The predictions obtained are consistent with the most recent LHC SUSY and Higgs boson searches. △ Less", "We calculate the eigenvalues of the next-to-leading kernel for the BFKL equation in the adjoint representation of the gauge group $SU(N_c)$ in the N=4 supersymmetric Yang-Mills model. These eigenvalues are used to obtain the high energy behavior of the remainder function for the 6-point scattering amplitude with the maximal helicity violation in the kinematical regions containing the Mandelstam cut contribution. The leading and next-to-leading singularities of the corresponding collinear anomalous dimension are calculated in all orders of perturbation theory. We compare our result with the known collinear limit and with the recently suggested ansatz for the remainder function in three loops and obtain the full agreement providing that the numerical parameters in this anzatz are chosen in an appropriate way. △ Less", "In this article we review the phenomenological consequences of radiative flavor-violation (RFV) in the MSSM. In the model under consideration the U(3)^3 flavor symmetry of the gauge sector is broken in a first step to U(2)^3 by the top and bottom Yukawa couplings of the superpotential (and possibly also by the bilinear SUSY-breaking terms). In a second step the remaining U(2)^3 flavor symmetry is softly broken by the trilinear A-terms in order to obtain the measured quark masses and the CKM matrix of the Standard Model (SM) at low energies. The phenomenological implications of this model depend on the actual choice of the SUSY breaking A-terms. If the CKM matrix is generated in the down sector (by A^d), Bs->mu^+mu^- receives non-decoupling contributions from Higgs penguins which become important already for moderate values of tan(beta). Also the Bs mixing amplitude can be significantly modified compared to the SM prediction including a potential induction of a new CP-violating phase (which is not possible in the MSSM with MFV). △ Less", "The first 1/fb of LHC searches have set impressive limits on new colored particles decaying to missing energy. We address the implication of these searches for naturalness in supersymmetry (SUSY). General bottom-up considerations of natural electroweak symmetry breaking show that higgsinos, stops, and the gluino should not be too far above the weak scale. The rest of the spectrum, including the squarks of the first two generations, can be heavier and beyond the current LHC reach. We have used collider simulations to determine the limits that all of the 1/fb searches pose on higgsinos, stops, and the gluino. We find that stops and the left-handed sbottom are starting to be constrained and must be heavier than about 200-300 GeV when decaying to higgsinos. The gluino must be heavier than about 600-800 GeV when it decays to stops and sbottoms. While these findings point toward scenarios with a lighter third generation split from the other squarks, we do find that moderately-tuned regions remain, where the gluino is just above 1 TeV and all the squarks are degenerate and light. Among all the searches, jets plus missing energy and same-sign dileptons often provide the most powerful probes of natural SUSY. Overall, our results indicate that natural SUSY has survived the first 1/fb of data. The LHC is now on the brink of exploring the most interesting region of SUSY parameter space. △ Less", "We develop a bottom-up approach to studying SUSY with light stops and sbottoms, but with other squarks and sleptons heavy and beyond reach of the LHC. We discuss the range of squark, gaugino and Higgsino masses for which the electroweak scale is radiatively stable over the \"little hierarchy\" below ~ 10 TeV. We review and expand on indirect constraints on this scenario, in particular from flavor and CP tests. We emphasize that in this context, R-parity violation is very well motivated. The phenomenological differences between Majorana and Dirac gauginos are also discussed. Finally, we focus on the light subsystem of stops, sbottom and neutralino with R-parity, in order to probe the current collider bounds. We find that 1/fb LHC bounds are mild and large parts of the motivated parameter space remain open, while the 10/fb data can be much more decisive. △ Less", "General formulae for the soft SUSY breaking terms, valid in any SUGRA context, were derived in the mid-nineties. Since SUSY is not expected to have quantum anomalies, they should be valid in the quantum theory and be RG invariant down to the soft SUSY breaking scale. This observation enables us to give a uniform treatment of all phenomenological models for SUSY breaking and transmission, such as AMSB, GMSB, etc. In particular we find that the much discussed RG invariant formulae for soft SUSY breaking parameters in AMSB, effectively depend on a strong assumption of factorizability of the matter Kaehler metric. We then argue that there is no necessity for having ad hoc constructions such as mAMSB to counteract the negative squared slepton mass problem, since the natural framework that emerges in a sequestered model is one in which gaugino masses are as in AMSB, and the other soft terms are generated by RG running as in gaugino mediation. △ Less", "We thoroughly investigate the current status of supersymmetry in light of the latest searches at the LHC, using General Gauge Mediation (GGM) as a well-motivated signature generator that leads to many different simplified models. We consider all possible promptly-decaying NLSPs in GGM, and by carefully reinterpreting the existing LHC searches, we derive limits on both colored and electroweak SUSY production. Overall, the coverage of GGM parameter space is quite good, but much discovery potential still remains even at 7 TeV. We identify several regions of parameter space where the current searches are the weakest, typically in models with electroweak production, third generation sfermions or squeezed spectra, and we suggest how ATLAS and CMS might modify their search strategies given the understanding of GMSB at 1/fb. In particular, we propose the use of leptonic $M_{T2}$ to suppress $t{\\bar t}$ backgrounds. Because we express our results in terms of simplified models, they have broader applicability beyond the GGM framework, and give a global view of the current LHC reach. Our results on 3rd generation squark NLSPs in particular can be viewed as setting direct limits on naturalness. △ Less", "We examine the exact relation between the superconformal symmetry breaking chiral superfield (X) and the goldstino superfield in microscopic models of an arbitrary Kahler potential (K) and in the presence of matter fields. We investigate the decoupling of the massive sgoldstino and scalar matter fields and the offshell/onshell-SUSY expressions of their superfields in terms of the fermions composites. For general K of two superfields, we study the properties of the superfield X after integrating out these scalar fields, to show that in the infrared it satisfies (offshell) the condition $X^3=0$ and $X^2\\not=0$. We then compare our results to those of the well-known method of constrained superfields discussed in the literature, based on the conjecture $X^2=0$. Our results can be used in applications, to couple offshell the (s)goldstino fields to realistic models such as the MSSM. △ Less", "We systematically compare the N=1 SUSY QED plasma to its non-supersymmetric counterpart which is QED plasma of electrons, positrons and photons. Collective excitations and collisional processes in the two systems are confronted to each other in a regime of small coupling. The collective and collisional characteristics of supersymmetric plasma are both very similar to those of QED plasma. △ Less", "Exploring hints of New Physics in the decay modes B -> pi K^* and B -> rho K can shed light on the B -> K pi puzzle. In this talk we discuss supersymmetric contributions to the direct CP asymmetries of the decays B -> pi K^* and B -> rho K within Soft Collinear Effective Theory. We consider non-minimal flavor SUSY contributions mediated by gluino exchange and apply the Mass Insertion Approximation in the analysis. We show that gluino contributions can enhance the CP asymmetries and accommodate the experimental results. △ Less", "We present a phenomenological appraisal of the results of several searches for Supersymmetry (SUSY) performed at the LHC by the CMS collaboration and interpreted in the context of the cMSSM. Part of the analysis focuses on which SUSY production processes are being probed. We observe that much of the current exclusion region is dominated by squark-squark and squark-gluino production, and explain the shape of the exclusion curves. Based on this analysis and an estimation of future reach, additional simplified models are suggested. Other phenomenological details are discussed, such as the effect of radiation on acceptance. △ Less", "We study the implications of LHC searches on SUSY particle spectra using flat scans of the 19-parameter pMSSM phase space. We apply constraints from flavour physics, g_mu-2, dark matter and earlier LEP and Tevatron searches. The sensitivity of the LHC SUSY searches with jets, leptons and missing energy is assessed by reproducing with fast simulation the recent CMS analyses after validation on benchmark points. We present results in terms of the fraction of pMSSM points compatible with all the constraints which are excluded by the LHC searches with 1 fb^{-1} and 15 fb^{-1} as a function of the mass of strongly and weakly interacting SUSY particles. We also discuss the suppression of Higgs production cross sections for the MSSM points not excluded and contrast the region of parameter space tested by the LHC data with the constraints from dark matter direct detection experiments. △ Less", "The primordial curvature perturbation ζmay be generated by some curvaton field σ, which is negligible during inflation and has more or less negligible interactions until it decays. In the current scenario, the curvaton starts to oscillate while its energy density ρ_σis negligible. We explore the opposite scenario, in which ρ_σdrives a few e-folds of inflation before the oscillation begins. In this scenario for generating ζit is exceptionally easy to solve the ηproblem; one just has to make the curvaton a string axion, with anomaly-mediated susy breaking which may soon be tested at the LHC. The observed spectral index n can be obtained with a potential V\\propto φ^p for the first inflation; p=1 or 2 is allowed by the current uncertainty in n but the improvement in accuracy promised by Planck may rule out p=1. The predictions include (i) running n'\\simeq 0.0026 (0.0013) for p=1 (2) that will probably be observed, (ii) non-gaussianity parameter f_NL \\sim -1 that may be observed, (iii) tensor fraction r is probably too small to ever observed. △ Less", "We calculate the relic abundance of mixed axion/neutralino cold dark matter which arises in R-parity conserving supersymmetric (SUSY) models wherein the strong CP problem is solved by the Peccei-Quinn (PQ) mechanism with a concommitant axion/saxion/axino supermultiplet. By numerically solving the coupled Boltzmann equations, we include the combined effects of 1. thermal axino production with cascade decays to a neutralino LSP, 2. thermal saxion production and production via coherent oscillations along with cascade decays and entropy injection, 3. thermal neutralino production and re-annihilation after both axino and saxion decays, 4. gravitino production and decay and 5. axion production both thermally and via oscillations. For SUSY models with too high a standard neutralino thermal abundance, we find the combined effect of SUSY PQ particles is not enough to lower the neutralino abundance down to its measured value, while at the same time respecting bounds on late-decaying neutral particles from BBN. However, models with a standard neutralino underabundance can now be allowed with either neutralino or axion domination of dark matter, and furthermore, these models can allow the PQ breaking scale f_a to be pushed up into the 10^{14}-10^{15} GeV range, which is where it is typically expected to be in string theory models. △ Less", "In the Minimal Supersymmetric Standard Model, the effective b quark Yukawa coupling to the lightest neutral Higgs boson is enhanced. Therefore, the associated production of the lightest Higgs boson with a b quark is an important discovery channel. We consider the SUSY QCD contributions from squarks and gluinos and discuss the decoupling properties of these effects. A comparision of our exact Order(alpha_s) results with those of a widely used effective Lagrangian approach, the Delta_b approximation, is also presented. △ Less", "We have computed the loop-induced processes of neutralino annihilation into two photons and, for the first time, into a photon and a Z boson in the framework of the NMSSM. The photons produced from these radiative modes are monochromatic and possess a clear \"smoking gun\" experimental signature. This numerical analysis has been done with the help of the SloopS code, initially developed for automatic one-loop calculation in the MSSM. We have computed the rates for different benchmark points coming from SUGRA and GMSB soft SUSY breaking scenarios and compared them with the MSSM. We comment on how this signal can be enhanced, with respect to the MSSM, especially in the low mass region of the neutralino. We also discuss the possibility of this observable to constrain the NMSSM parameter space, taking into account the latest limits from the FERMI collaboration on these two modes. △ Less", "We present a model for the triggering of Supernovae Ia (SN Ia) by a phase transition to exact supersymmetry (susy) in the core of a white dwarf star. The model, which accomodates the data on SN Ia and avoids the problems of the standard astrophysical accretion based picture, is based on string landscape ideas and assumes that the decay of the false broken susy vacuum is enhanced at high density. In a slowly expanding susy bubble, the conversion of pairs of fermions to pairs of degenerate scalars releases a significant amount of energy which induces fusion in the surrounding normal matter shell. After cooling, the absence of degeneracy pressure causes the susy bubble to collapse to a black hole of about 0.1 solar mass or to some other stable susy object. △ Less", "The soft masses due to SUSY breaking, mediated by gauge fields, are computed for generic matter in quiver gauge theories. △ Less", "If SUSY is discovered at the LHC, the task will immediately turn to determining the model of SUSY breaking. Here, we employ a Mixed Modulus-Anomaly Mediated SUSY Breaking (MMAMSB) model with very similar LHC phenomenology to the more conventionally studied Constrained Minimal SUSY Model (CMSSM) and minimal Anomaly Mediated SUSY Breaking (mAMSB) models. We then study whether the models can be distinguished and measured. If we only fit to the various mass edges and mass end-points from cascade decay chains that are normally studied, a unique determination and measurement of the model is problematic without substantial amounts of LHC data. However, if event rate information is included, we can quickly distinguish and measure the correct SUSY model and exclude alternatives. △ Less", "The pure leptonic decay B_s -> mu mu is strongly suppressed in the Standard Model (SM), but can have large enhancements in Supersymmetry, especially at large values of tanbe. New limits on this decay channel from recent LHC data have been used to claim that these limits restrict the SUSY parameter space even more than the direct searches. However, direct searches are hardly dependent on tanbe, while BR(B_s -> mu mu) is proportional to tanbe^6. The relic density constraint requires large tanbe in a large region of the parameter space, which can lead to large values of B_s -> mu mu. Nevertheless, the experimental upper limit on BR(B_s -> mu mu) is not constraining the parameter space of the CMSSM more than the direct searches and the present Higgs limits, if combined with the relic density. We also observe SUSY parameter regions with negative interferences, where the B_s -> mu mu value is up to a factor three below the SM expectation, even at large values of tanbe. △ Less", "We have analyzed the prospect of probing a non-universal gaugino mass model of mixed bino-higgsino dark matter at the current 7 TeV run of LHC. It provides cosmologically compatible dark matter relic density over two broad bands of parameters, corresponding to $m_{\\gl} < m_{\\sq}$ and $m_{\\gl} \\sim m_{\\sq}$. The SUSY spectrum of this model has two distinctive features : (i) an approximate degeneracy among the lighter chargino and neutralino masses, and (ii) an inverted mass hierarchy of squark masses. We find that these features can be exploited to obtain a viable signal upto $m_{\\gl} \\sim$ 800 GeV over both the parameter bands with an integrated luminosity 5/fb. △ Less", "We review on-shell and unitarity methods and discuss their application to precision predictions for LHC physics. Being universal and numerically robust, these methods are straight-forward to automate for next-to-leading-order computations within Standard Model and beyond. Several state-of-the-art results including studies of W/Z+3-jet and W+4-jet production have explicitly demonstrated the effectiveness of the unitarity method for describing multi-parton scattering. Here we review central ideas needed to obtain efficient numerical implementations. This includes on-shell loop-level recursions, the unitarity method, color management and further refined tricks. △ Less", "Left-right symmetric extensions of the Minimal Supersymmetric Standard Model can explain neutrino data and have potentially interesting phenomenology beyond that found in minimal SUSY seesaw models. Here we study a SUSY model in which the left-right symmetry is broken by triplets at a high scale, but significantly below the GUT scale. Sparticle spectra in this model differ from the usual constrained MSSM expectations and these changes affect the relic abundance of the lightest neutralino. We discuss changes for the standard stau (and stop) co-annihilation, the Higgs funnel and the focus point regions. The model has potentially large lepton flavour violation in both, left and right, scalar leptons and thus allows, in principle, also for flavoured co-annihilation. We also discuss lepton flavour signals due to violating decays of the second lightest neutralino at the LHC, which can be as large as 20 fb$^{-1}$ at $\\sqrt{s}=14$ TeV. △ Less", "We consider collider signatures of the exceptional supersymmetric (SUSY) standard model (E6SSM). This E6 inspired SUSY model is based on the SM gauge group together with an extra U(1) gauge symmetry under which right--handed neutrinos have zero charge. To ensure anomaly cancellation and gauge coupling unification the low energy matter content of the E6SSM involve extra exotic matter beyond the MSSM. We discuss the collider signatures associated with the production of new particles predicted by the E6SSM and consider the implications of this model for dark matter and Higgs phenomenology. Since exotic quarks in the E6SSM can be either diquarks or leptoquarks they may provide spectacular new physics signals at the LHC. △ Less", "We study the decays of the lightest Higgs boson within the exceptional supersymmetric (SUSY) standard model (E6SSM). The E6SSM predicts three families of Higgs-like doublets plus three SM singlets that carry U(1)_{N} charges. One family of Higgs-like doublets and one SM singlet develop vacuum expectation values. The fermionic partners of other Higgs-like fields and SM singlets form inert neutralino and chargino states. Two lightest inert neutralinos tend to be the lightest and next-to-lightest SUSY particles (LSP and NLSP). The considered model can account for the dark matter relic abundance if the lightest inert neutralino has mass close to half the Z mass. In this case the usual SM-like Higgs boson decays more than 95% of the time into either LSPs or NLSPs. As a result the decays of the lightest Higgs boson into l^{+} l^{-} + X might play an essential role in the Higgs searches. This scenario also predicts other light inert chargino and neutralino states below 200 GeV and large LSP direct detection cross-sections which is on the edge of observability of XENON100. △ Less", "We discuss neutrino masses from higher than d=5 effective operators in a supersymmetric framework, where we explicitly demonstrate which operators could be the leading contribution to neutrino mass in the MSSM and NMSSM. As an example, we focus on the d=7 operator L L H_u H_u H_d H_u, for which we systematically derive all tree-level decompositions. We argue that many of these lead to a linear or inverse see-saw scenario with two extra neutral fermions, where the lepton number violating term is naturally suppressed by a heavy mass scale when the extra mediators are integrated out. We choose one example, for which we discuss possible implementations of the neutrino flavor structure. In addition, we show that the heavy mediators, in this case SU(2) doublet fermions, may indeed be observable at the LHC, since they can be produced by Drell-Yan processes and lead to displaced vertices when they decay. However, the direct observation of lepton number violating processes is on the edge at LHC. △ Less", "The bulk matter Randall-Sundrum (RS) model is a setup where Standard Model (SM) matter and gauge fields reside in the bulk of 5D warped spacetime while the Higgs field is confined on the IR brane. The wavefunctions of the 1st and 2nd generation matter particles are localized towards the UV brane and those of the 3rd generation towards the IR brane, so that the hierarchical structure of the Yukawa couplings arises geometrically without hierarchy in fundamental parameters. This paper discusses an experimental test of this model in the case where the Kaluza-Klein scale is far above the collider scale, but the model is combined with 5D Minimal SUSY Standard Model (MSSM) and SUSY particles are in the reach of collider experiments. A general SUSY breaking mass spectrum consistent with the bulk matter RS model is considered: SUSY breaking sector locates on the IR brane and its effects are mediated to 5D MSSM through a hybrid of gravity mediation, gaugino mediation and gauge mediation. This paper argues that it is possible to observe the signals of the bulk matter RS model through rare decays of \"almost SU(2) singlet mass eigenstates\" that are induced by flavor-violating gravity mediation contributions to matter soft SUSY breaking terms. △ Less", "We study the stability of the neutral- and charged-current Drell-Yan process in association with a jet as a standard candle at the LHC under the inclusion of O(alpha_s) supersymmetric QCD (SQCD) corrections within the MSSM. We include the decay of the electroweak gauge boson into dileptons, i.e. we consider the production of charged lepton--anti-lepton or lepton-neutrino final states with one hard jet. We find that the SQCD corrections are negligible for the integrated cross section. Only at high lepton transverse momentum can they induce effects of the percent level. △ Less", "Pauli-Villars regularization of Yang-Mills theories and of supergravity theories is outlined, with an emphasis on BRST invariance. Applications to phenomenology and the anomaly structure of supergravity are discussed. △ Less", "The Atlas and CMS collaborations have both reported an excess of events in the WW\\star \\rightarrow \\ell+\\ell- + ETmiss search channel, which could be the first evidence for the Higgs boson. In the context of the MSSM, the lightest SUSY Higgs scalar h is expected to occur with mass mh = 135 GeV, depending on the range of SUSY parameters scanned over. Since the h \\rightarrow WW\\star branching fraction falls swiftly with decreasing mh, a signal in the WW\\star channel would favor an h at the high end of its predicted mass range. We scan over general GUT scale SUSY model parameters to find those which give rise to mh > 130 GeV. A value of m0 \\sim 10 - 20 TeV is favored, with A0 \\sim \\pm2m0, while the lower range of m1/2 < 1 TeV is also slightly favored. This gives rise to an \"effective SUSY\" type of sparticle mass spectrum. For low m1/2, gluino pair production followed by three-body gluino decay to top quarks may ultimately be accesible to LHC searches, while for higher m1/2 values, the SUSY spectra would likely be out of range of any conceivable LHC reach. Since the thermal neutralino relic abundance tends to be very high, late-time entropy dilution or neutralino decay to light axinos would be required to gain accord with the measured dark matter abundance △ Less", "Within supersymmetric SU(5) Grand Unified Theory, we present several new scenarios with anomaly free flavor symmetry U(1)_F. Within each scenario, a variety of cases offer many possibilities for phenomenologically interesting model building. We present three concrete and economical models with anomaly free U(1)_F leading to natural understanding of observed hierarchies between charged fermion masses and CKM mixing angles. △ Less", "The minimal supersymmetric standard model (MSSM) is extended by including an additional pair of constrained Higgs doublet superfields through which the electroweak symmetry is nonlinearly realized. The superpotential couplings of this constrained Higgs doublet pair to the MSSM Higgs doublet pair catalyze the later nontrivial vacuum expectation values. The mass spectrum of the Higgs scalars and Higgsino-gaugino sector is presented for several choices of supersymmetry (SUSY) breaking and Higgs superpotential mass parameters. The effect of the the additional constrained fields and multiple vacuum expectation values on the lowest mass neutral Higgs scalar production and decay is presented. △ Less", "Recently type II seesaw dominance in a supersymmetric SO(10) framework has been found useful in explaining large solar and atmospheric mixing angles as well as larger values of $theta_{13}$ while unifying quark and lepton masses. An important question in these models is whether there exists consistency between coupling unification and type II seesaw dominance. Scenarios where this consistency can be demonstrated have been given in a SUSY framework. In this paper we give examples where type II dominance occurs in SO(10) models without supersymmetry but with additional TeV scale particles and also in models with split-supersummetry. Grand unification is realized in a two-step process via breaking of SO(10) to SU(5) and then to a TeV scale standard model supplemented by extra fields and an SU(5) Higgs multiplet ${15}_H$ at a scale about $10^{12}$ GeV to give type-II seesaw. The predictions for proton lifetime in these models are in the range $τ_p^0 = 2\\times 10^{35}$ yrs. to $τ_p^0 = 6\\times 10^{35}$ yrs.. A number of recent numerical fits to GUT-scale fermion masses can be accommodated within this model. △ Less", "We consider semi-local F-theory GUTs arising from a single E_8 point of local enhancement, leading to simple GUT groups based on E_6, SO(10) and SU(5) with SU(3), SU(4) and SU(5) spectral covers, respectively. Assuming the minimal Z_2 monodromy, we determine the homology classes and the associated spectra after flux breaking for each case. Our analysis includes the GUT singlets which have hitherto been ignored but which play a crucial role in phenomenology. Using these results we construct an E_6 based model that demonstrates, for the first time, that it is possible to construct a phenomenologically viable model which leads to the MSSM at low energies. The exotics that result from flux breaking all get a large mass when singlet fields acquire vacuum expectation values driven by D- and F-flatness. Due to the underlying GUT symmetry and the U(1)s descending from E_8, bare baryon- and lepton-number violating terms are forbidden up to and including dimension 5. As a result nucleon decay is naturally suppressed below present bounds. The mu-term is forbidden by the U(1) but is generated at the SUSY breaking scale when a further singlet field acquires a TeV scale vacuum expectation value, driven by the spontaneous breaking of the electroweak symmetry. After including the effect of flux and instanton corrections acceptable quark and charged lepton masses and mixing angles can be obtained. Neutrinos get a mass from the see-saw mechanism through their coupling to singlet neutrinos that acquire large Majorana mass as a result of the monodromy. △ Less", "We study supersymmetric models with a GUT-sized extra dimension, where both the Higgs fields and the SUSY breaking hidden sector are localized on a 4D brane. Exponential wave function profiles of the matter fields give rise to hierarchical structures in the Yukawa couplings and soft terms. Such structures can naturally explain hierarchical fermion masses and mixings, while at the same time alleviating the supersymmetric flavour problem. We discuss two sources of supersymmetry breaking, radion mediation and brane fields, and perform a detailed numerical analysis, thoroughly taking into account the proliferation of unknown O(1) coefficients that occurs in this class of models. It turns out that additional assumptions on supersymmetry breaking are necessary to evade the stringent experimental bounds on lepton flavour violation. The favourable regions of parameter space are then examined with regards to their LHC phenomenology. They generically feature heavy gluinos and squarks beyond current bounds. Lepton flavour violation in SUSY cascade decays can give interesting signatures. △ Less", "In this article I review the consequences of radiative flavor violation (RFV) in the Minimal Supersymmetric Standard Model (MSSM). In this framework the trilinear supersymmetry (SUSY)-breaking terms are the only source of flavor violation. Constraints on the parameter space come from Kaon mixing and b->s+gamma and are satisfied for SUSY masses of the order of 1 TeV. In addition, neutral Higgs penguins significantly contribute to B_s->mu^+mu^- and are capable of explaining the observed CP phase in the B_s system. △ Less", "We obtain predictions for the neutrino masses, the effective Majorana mass in neutrinoless double beta decay and for the rates of the lepton flavor violating processes $μ\\rightarrow e + γ$, $τ\\rightarrow e + γ$ and $ τ\\rightarrow μ+ γ$ in a SUSY $SU(5) \\times T^{\\prime}$ Model of flavour, which gives rise to realistic masses and mixing patterns for quarks and leptons. △ Less", "We show that the supersymmetric extension of the Standard Model modifies the structure of the low lying BFKL discrete pomeron states (DPS) which give a sizable contribution to the gluon structure function in the HERA x and Q2 region. The comparison of the gluon density, determined within DPS with N=1 SUSY, with data favours a supersymmetry scale of the order of 10 TeV. The DPS method described here could open a new window to the physics beyond the Standard Model. △ Less", "We apply the 't Hooft $\\bar{MS}$-based scheme to study the scheme-dependence of the QCD generalization of Crewther relation for the product of the normalised non-singlet perturbative contributions to the $e^+e^-$-annihilation Adler function and to the Bjorken sum rule of the polarized lepton-nucleon deep-inelastic scattering process. We prove that after the transformations from the pure $\\bar{MS}$-scheme to the 't Hooft scheme the characteristic $\\bar{MS}$-scheme theoretical property of this relation, namely the factorization of the $β$-function in its conformal symmetry breaking part, disappears. Another \"non-comfortable\" theoretical consequence of the application of this prescription in $\\mathcal{N}=1$ SUSY QED model is mentioned. It is shown, that within the 't Hooft scheme the expansions of Green functions in terms of the Lambert function is simplified in high orders of perturbation theory. This may be considered as the attractive feature of the 't Hooft scheme, which manifest itself in high-order perturbative phenomenological applications. △ Less", "On the heels of the first analysis of LHC data eclipsing the inverse femtobarn integrated luminosity milestone, we undertake a detailed comparison of the most recent experimental results with Monte Carlo simulation of the full \"bare-minimally constrained\" parameter space of the class of supersymmetric models which go by the name of No-Scale FSU5. We establish the first sparticle exclusion boundaries on these models, finding that the LSP mass should be at least about 92 GeV, with a corresponding boundary gaugino mass M_1/2 above about 485 GeV. In contrast to the higher mass constraints established for the CMSSM, we find the minimum exclusion boundary on the FSU5 gluino and heavy squark masses resides in the range of 658-674 GeV and 854-1088 GeV, respectively, with a minimum light stop squark mass of about 520 GeV. Moreover, we show that elements of the surviving parameter space not only escape the onslaught of LHC data which is currently decimating the standard mSUGRA/CMSSM benchmarks, but are further able to efficiently explain certain tantalizing production excesses over the SM background which have been reported by the CMS collaboration. We also extend this study comparatively to five distinct collider energies and four specific cut methodologies, including a proposed set of selection cuts designed to reveal the natural ultra-high jet multiplicity signal associated with the stable mass hierarchy m_t < m_g < m_q of the FSU5 models. By so doing, we demonstrate that a rather stable enhancement in model visibility, conservatively of order ten, may be attained by adoption of these cuts, which is sufficient for an immediate and definitive testing of a majority of the model space using only the existing LHC data set. We stress the point that habits established in lower jet multiplicity searches do not necessarily carry over into the ultra-high jet multiplicity search regime. △ Less", "We study CP asymmetries in rare B decays within supersymmetry with a U(2)^3 flavour symmetry, motivated by the SUSY flavour and CP problems, the hierarchies in the Yukawa couplings and the absence so far of any direct evidence for SUSY. Even in the absence of flavour-blind phases, we find potentially sizable CP violating contributions to b -> s decay amplitudes. The effects in the mixing-induced CP asymmetries in B ->phi K(S) and B -> eta' K(S), angular CP asymmetries in B -> K* mu+ mu- and the direct CP asymmetry in B -> X(s) gamma can be in the region to be probed by LHCb and next generation B factories. At the same time, these effects in B decays are compatible with CP violating contributions to meson mixing, including a non-standard B(s) mixing phase hinted by current tensions in the CKM fit mostly between S(psi K(S)), epsilon(K) and Delta M(B(s))/Delta M(B(d)). △ Less", "We present a detailed investigation to establish that lepton-number (L) violating supersymmetry (SUSY) can be effectively probed at the LHC in the practically background-free same-sign trilepton (SS3l) and same-sign four-lepton (SS4l) channels. With this in view, we extend our earlier analysis of SS3l and SS4l signals by considering situations based on minimal supergravity as well as a phenomenological SUSY model. We find that the R-parity violating scenario predicts large event rates, for both the 7 and 14 TeV runs. Furthermore, we show that it is extremely unlikely to ever achieve similar rates in R-parity conserving SUSY. In addition, we show how SS3l and SS4l, in conjunction with the mixed-sign trilepton and four-lepton channels, can be used to extract dynamical information about the underlying SUSY theory, namely, the Majorana character of the decaying lightest neutralino and the nature of L-violating couplings. We define suitable variables and relationships between them which can be verified experimentally and which are largely independent of the SUSY production cross-sections and the cascade decay branching fractions. These theoretical predictions are validated by Monte Carlo simulations including detector and background effects. △ Less", "We show that the standard-model Higgs boson mass m_h is correlated with the spectral index of density perturbation n_s in the inflation scenario with the inflaton being identified with the B-L Higgs boson. The Higgs boson mass ranges from m_h ~ 120GeV to 140GeV for n_s ~ 0.95 - 0.96. In particular, as n_s approaches to 0.96, the Higgs mass is predicted to be in the range of 125GeV to 140GeV in the case of relatively light gauginos, and 120GeV to 135GeV in the case where all SUSY particle masses are of the same order. This will be tested soon by the LHC experiment and the Planck satellite. The relation is due to the PeV-scale supersymmetry required by the inflationary dynamics. We also comment on the cosmological implications of our scenario such as non-thermal leptogenesis and dark matter. △ Less", "We study models where the superpartners of the ordinary particles have continuous spectra rather than being discrete states, which can occur when the supersymmetric standard model is coupled to an approximately conformal sector. We show that when superpartners that are well into the continuum are produced at a collider they tend to have long decay chains that step their way down through the continuum, emitting many fairly soft standard model particles along the way, with a roughly spherical energy distribution in the center of mass frame. △ Less", "We discuss the implications of the excesses in LHC Higgs boson searches on the gauge mediated supersymmetric standard model, for the mass range 120-140\\,GeV. We find that a relatively heavy lightest Higgs boson mass in this range can be reconciled with light SUSY particles, $m_{\\rm gluino}<2$\\,TeV, if there are additional fields which couple directly to the Higgs boson. We also find that the mass of this extra matter can be predicted rather precisely in gauge mediation for a given Higgs boson and gluino mass. △ Less", "Recent evidence from the LHC for the Higgs boson with mass between 142 GeV < m_h < 147GeV points to PeV-scale Split Supersymmetry. This article explores the consequences of a Higgs mass in this range and possible discovery modes for Split Susy. Moderate lifetime gluinos, with decay lengths in the 25 microns to 10 years range, are its imminent smoking gun signature. The 7 TeV LHC will be sensitive to the moderately lived gluinos and trilepton signatures from direct electroweakino production. Moreover, the dark matter abundance may be obtained from annihilation through an s-channel Higgs resonance, with the LSP almost purely bino and mass m_chi = 70 GeV. The Higgs resonance region of Split Susy has visible signatures in dark matter direct and indirect detection and electric dipole moment experiments. If the anomalies go away, the majority of Split Susy parameter space will be excluded. △ Less", "We study the muon anomalous magnetic moment (muon g-2) and the Higgs boson mass in a simple extension of the minimal supersymmetric (SUSY) Standard Model with extra vector-like matters, in the frameworks of gauge mediated SUSY breaking (GMSB) models and gravity mediation (mSUGRA) models. It is shown that the deviation of the muon g-2 and a relatively heavy Higgs boson can be simultaneously explained in large tan-beta region. (i) In GMSB models, the Higgs mass can be more than 135 GeV (130 GeV) in the region where muon g-2 is consistent with the experimental value at the 2 sigma (1 sigma) level, while maintaining the perturbative coupling unification. (ii) In the case of mSUGRA models with universal soft masses, the Higgs mass can be as large as about 130 GeV when muon g-2 is consistent with the experimental value at the 2 sigma level. In both cases, the Higgs mass can be above 140 GeV if the g-2 constraint is not imposed. △ Less", "We examine the present and future XENON limits on the neutralino dark matter in split supersymmetry (split-SUSY). Through a scan over the parameter space under the current constraints from collider experiments and the WMAP measurement of the dark matter relic density, we find that in the allowed parameter space a large part has been excluded by the present XENON100 limits and a further largish part can be covered by the future exposure (6000 kg-day). In case of unobservation of dark matter with such an exposure in the future, the lightest neutralino will remain bino-like and its annihilation is mainly through exchanging the SM-like Higgs boson in order to get the required relic density. △ Less", "We consider low-energy supersymmetric model with non-anomalous discrete R-symmetry. In such a model, to make the R-symmetry non-anomalous, new particles with gauge quantum numbers should be inevitably added to the particle content of the minimal supersymmetric standard model (MSSM). Those new particles may couple to the Higgs boson, resulting in a significant enhancement of the lightest Higgs mass. We show that, in such a model, the lightest Higgs mass can be much larger than the MSSM upper bound; the lightest Higgs mass as large as 140 GeV (or larger) becomes possible. △ Less", "Collisional processes in ultrarelativistic N=1 SUSY QED plasma are studied and compared to those in an electromagnetic plasma of electrons, positrons and photons. Cross sections of all binary interactions which occur in the supersymmetric plasma at the order of e^4 are computed. Some processes, in particular the Compton scattering on selectrons, appear to be independent of momentum transfer and thus they are qualitatively different from processes in an electromagnetic plasma. It suggests that transport properties of the SUSY plasma are different than those of its non-supersymmetric counterpart. Energy loss and momentum broadening of a particle traversing the supersymmetric plasma are discussed in detail and the characteristics are shown to be surprisingly similar to those of QED plasma. △ Less", "We propose a scenario for realizing inflation in the framework of supersymmetric B-L extension of the Standard Model. We find that one of the associated right-handed sneutrinos (the superpartner of the Standard Model singlet fermion) can provide a new non-trivial inflationary trajectory at tree level (therefore breaking B-L during inflation). As soon as the inflation ends, the right-handed sneutrino falls into the supersymmetric vacuum, with a vanishing vacuum expectation value, so that B-L symmetry is restored. In this class of models, the B-L gauge symmetry will be radiatively broken at a TeV scale and light neutrino masses are generated through the inverse seesaw mechanism. △ Less", "We consider a supersymmetric (SUSY) Grand Unified Theory (GUT) based on the gauge group G_PS=SU(4)_C x SU(2)_L x SU(2)_R, which incorporates non-minimal chaotic inflation, driven by a quartic potential associated with the Higgs fields involved in the spontaneous breaking of G_PS. The inflationary model relies on renormalizable superpotetial terms and does not lead to overproduction of magnetic monopoles. It is largely independent of the one-loop radiative corrections and can become consistent with the current observational data on the inflationary observables, with the symmetry breaking scale of G_PS assuming its SUSY value. Within our model, the strong CP and the mu problems of the minimal supersymmetric standard model can be resolved via a Peccei-Quinn symmetry. Moreover baryogenesis occurs via non-thermal leptogenesis realized by the out-of-equilibrium decay of the right-handed neutrinos, which are produced by the inflaton's decay. We consider two versions of such a scenario, assuming that the inflaton can decay to the lightest or to the next-to-lightest right-handed neutrino. Both scenaria can become compatible with the constraints arising from the baryon asymmetry of the universe, the gravitino limit on the reheating temperature and the upper bound on the light neutrino masses, provided that the gravitino is somehow heavy. In the second scenario extra restrictions from the SU(4)_C symmetry on the heaviest Dirac neutrino mass and the data on the atmospheric neutrino oscillations can be also met. △ Less", "Tree-level gauge mediation (TGM) is a scenario of SUSY breaking in which the tree-level exchange of heavy (possibly GUT) vector fields generates flavor-universal sfermion masses. In this work we extend this framework to the case of E_6 that is the natural extension of the minimal case studied so far. Despite the number of possible E_6 subgroups containing G_SM is large (we list all rank 6 subgroups), there are only three different cases corresponding to the number of vector messengers. As a robust prediction we find that sfermion masses are SU(5) invariant at the GUT scale, even if the gauge group does not contain SU(5). If SUSY breaking is mediated purely by the U(1) generator that commutes with SO(10) we obtain universal sfermion masses and thus can derive the CMSSM boundary conditions in a novel scenario. △ Less", "We study the observational constraints for the axion models in string theory which can successfully act as quintessence. The evolution of the universe in this model is sensitive to the initial value of the axion field. This initial value of the axion field controls deviation of the cosmic evolution from the ΛCDM behaviour. We use the recent Union2 Supernova Type Ia dataset as well as the data from BAO measurements, the WMAP measurement of the shift parameter and the $H(z)$ measurements. Using these data, the reconstructed equation of state of the axion field has extremely small deviation from the cosmological constant ω= -1 even at 2σconfidence level. One interesting outcome of this analysis is that one can put bound on the SUSY breaking scale using cosmological measurements assuming the values of different string related parameters and vice versa. △ Less", "A comparative study of the exclusive rare $B_{c}\\rightarrow D_{s}^{\\ast}\\ell^{+}\\ell^{-}$ ($\\ell=μ, τ$) decays has been made in the minimal supersymmetric models (MSSM) and the SUSY SO(10) GUT models. In this context, various physical observables such as branching ratios $(\\mathcal{BR})$, forward-backward asymmetries $(\\mathcal{A}_{FB})$, lepton polarization asymmetries $(P_{L,N,T})$ and helicity fractions ($f_{L,T}$) of $D_{s}^{\\ast}$ meson by using the the QCD sum rules form factors have been investigated. It is found that the SUSY effects are characteristically prominent to that of the SM values for these observables. For instance, in SUSY I and SUSY II, the forward-backward asymmetry does not cross zero which is mainly due to the same sign of the $C_{7}^{eff}$ and $C_{9}^{eff}$ Wilson coefficients. Similarly in SUSY SO(10) GUT models due to the complex nature of the new Wilson coefficients -- corresponding to the new operators arising due to the contribution of neutral Higgs bosons (NHBs) -- the above mentioned observables are sizably affected. Therefore the analysis of said observables in charmed semileptonic $B$ meson decays can put some stringent constraints on the parameter space of SUSY variants and can serve as a windowpane to look beyond the SM. △ Less", "An interesting feature of the next-to-minimal supersymmetric standard model (NMSSM) is that one or more Higgs bosons may be comparably light (M_{H_i}<M_Z) without being in conflict with current experimental bounds. Due to a large singlet component, their direct production in standard channels at the Large Hadron Collider (LHC) is suppressed. We demonstrate that there are good prospects for observing such a light Higgs boson in decays of heavy neutralinos and charginos. We consider an example scenario with 20 GeV < M_{H_1} < M_Z and show that a large fraction of the cascade decays of gluinos and squarks involves the production of at least one Higgs boson. Performing a Monte Carlo analysis at the level of fast detector simulation, it is demonstrated how the Higgs signal can be separated from the main backgrounds, giving access to the Yukawa coupling of the Higgs to bottom quarks. Analyzing the resulting b\\bar{b} mass spectrum could provide an opportunity for light Higgs boson discovery already with 5 fb^{-1} of LHC data at 7 TeV. △ Less", "We have studied Electroweak Symmetry Breaking (EWSB) fine-tuning in the context of two unified Supersymmetry scenarios: the Constrained Minimal Supersymmetric Model (CMSSM) and models with Non-Universal Higgs Masses (NUHM), in light of current and upcoming direct detection dark matter experiments. We consider both those models that satisfy a one-sided bound on the relic density of neutralinos, $Ω_χ h^2 < 0.12$, and also the subset that satisfy the two-sided bound in which the relic density is within the 2 sigma best fit of WMAP7 + BAO + H0 data. We find that current direct detection searches for dark matter probe the least fine-tuned regions of parameter-space, or equivalently those of lowest Higgs mass parameter $μ$, and will tend to probe progressively more and more fine-tuned models, though the trend is more pronounced in the CMSSM than in the NUHM. Additionally, we examine several subsets of model points, categorized by common mass hierarchies; $M_{χ_0} \\sim M_{χ^\\pm}, M_{χ_0} \\sim M_{\\stau}, M_{χ_0} \\sim M_{\\stop_1}$, the light and heavy Higgs poles, and any additional models classified as \"other\"; the relevance of these mass hierarchies is their connection to the preferred neutralino annihilation channel that determines the relic abundance. For each of these subsets of models we investigated the degree of fine-tuning and discoverability in current and next generation direct detection experiments. △ Less", "We investigate the possibility of U(1)' mediation, leading to an effective SUSY where the first two family sfermions are above 100 TeV but the third family sfermions and the Higgs doublets are in the TeV region(or the light stop case). The U(1)' gaugino, Zprimino, needs not to be at a TeV scale, but needs to be somewhat lighter than the messenger scale. We consider two cases, one the mediation is only through U(1)' and the other through U(1)' and the electroweak hypercharge U(1)_Y. In the SUSY field theory framework, we calculate the superpartner mass spectra for these two cases. We also point out that the particle species needed for these mechanisms are already obtained from a Z(12-I) orbifold compactification. △ Less", "While the SUSY flavor, CP and gravitino problems seem to favor a very heavy spectrum of matter scalars, fine-tuning in the electroweak sector prefers low values of superpotential mass μ. In the limit of low μ, the two lightest neutralinos and light chargino are higgsino-like. The light charginos and neutralinos may have large production cross sections at LHC, but since they are nearly mass degenerate, there is only small energy release in three-body sparticle decays. Possible dilepton and trilepton signatures are difficult to observe after mild cuts due to the very soft p_T spectrum of the final state isolated leptons. Thus, the higgsino-world scenario can easily elude standard SUSY searches at the LHC. It should motivate experimental searches to focus on dimuon and trimuon production at the very lowest p_T(μ) values possible. If the neutralino relic abundance is enhanced via non-standard cosmological dark matter production, then there exist excellent prospects for direct or indirect detection of higgsino-like WIMPs. While the higgsino-world scenario may easily hide from LHC SUSY searches, a linear e^+e^- collider or a muon collider operating in the \\sqrt{s}\\sim 0.5-1 TeV range would be able to easily access the chargino and neutralino pair production reactions. △ Less", "We present a supersymmetric extension of the Standard Model that posseses a continuous $ U(1)_R$ symmetry, which is identified with one of three lepton numbers, and where a sneutrino vev gives mass to the down type quark and leptons. This idea allows for a smaller particle content than the minimal $R$-symmetric supersymmetry extension of the standard model (MRSSM). We explore bounds on this model coming from electroweak precision measurements, neutrino masses and gravitino decay. Bounds from electroweak precision measurements lead to a two-sided bound on $\\tan β$ while gravitino decay forces a low reheating temperature. Finally, the generation of neutrino masses from $R$-symmetry violation put an upper bound on the SUSY breaking scale. Despite all of this, we find that the allowed parameter space is still large and would lead to a distinctive phenomenology at the LHC. △ Less", "It is shown that top-bottom-tau Yukawa unification for μ<0 can be consistent with (g-2)_μand b->s γ. This happens for non-universal gaugino masses which are assumed to be generated by the F-term vev in a 54-dimensional representation of SO(10). The requirement of (g-2)_μand b->s γbeing within 2σfrom the experimental central values, together with the correct relic abundance of neutralinos, leads to rather definite predictions for sparticle spectrum. In particular, the gluino mass is predicted to be between 500 and 700 GeV or between 900 GeV and 1.6 TeV. △ Less", "The complex Clebsch-Gordon coefficients in the double tetrahedral group T' offers the possibility that CP violation can be entirely geometrical in origin, as pointed out by us recently. In this note, we investigate leptogenesis in a SUSY SU(5) x T' model, which gives rise to realistic quark masses and CKM matrix elements, a near tri-bimaximal neutrino mixing pattern, as well as CP violating measures for all quarks and leptons. In terms of 9 independent parameters in the Yukawa sector, the predicted values of the 22 observables agree with current experimental values, including the recent T2K and MINOS results. The correction to the tri-bimaximal mixing pattern is related to the Cabibbo angle, leading to interesting quark-lepton complementarity sum rules. Our predicted value for the leptonic Dirac CP phase is 227 degrees, which gives rise to sufficient amount of lepton number asymmetry, in the presence of the flavor effect. As this is the only non-vanishing CP violating phase in the lepton sector, there is a direct connection between leptogenesis and CP violation in neutrino oscillation in our model. △ Less", "The recent excess observed by CDF in $B^0_s \\to μ^{+} μ^{-}$ is interpreted in terms of a possible supersymmetric origin. An analysis is given of the parameter space of mSUGRA and non-universal SUGRA models under the combined constraints from LHC-7 with 165 pb$^{-1}$ of integrated luminosity, under the new XENON-100 limits on the neutralino-proton spin independent cross section and under the CDF $B^0_s \\to μ^{+} μ^{-}$ 90% C.L. limit reported to arise from an excess number of dimuon events. It is found that the predicted value of the branching ratio $B^0_s \\to μ^{+} μ^{-}$ consistent with all the constraints contains the following set of NLSPs: chargino, stau, stop or CP odd (even) Higgs. The lower bounds of sparticles, including those from the LHC, XENON and CDF $B^0_s\\to μ^+μ^-$ constraint, are exhibited and the shift in the allowed range of sparticle masses arising solely due to the extra constraint from the CDF result is given. It is pointed out that the two sided CDF 90% C.L. limit puts upper bounds on sparticle masses. An analysis of possible signatures for early discovery at the LHC is carried out corresponding to the signal region in $B^0_s \\to μ^{+} μ^{-}$. Implications of GUT-scale non-universalities in the gaugino and Higgs sectors are discussed. If the excess seen by the CDF Collaboration is supported by further data from LHCb or D0, this new result could be a harbinger for the discovery of supersymmetry. △ Less", "The specific shape of the squark, slepton and gaugino mass spectra, if measured with suficient accuracy, can provide invaluable information not only about the dynamics underpinning their origin at some very high scale such as the unification scale MG, but also about the intermediate scale physics encountered throughout their RGE evolution down to the energy scale accessible for the LHC. In this work, we study general features of the TeV scale soft SUSY breaking parameters stemming from a generic mSugra configuration within certain classes of SUSY SO(10) GUTs with different intermediate symmetries below MG. We show that particular combinations of soft masses show characteristic deviations from the mSugra limit in different models and thus, potentially, allow to distinguish between these, even if the new intermediate scales are outside the energy range probed at accelerators. We also compare our results to those obtained for the three minimal seesaw models with mSugra boundary conditions and discuss the main differences between those and our SO(10) based models. △ Less", "A neutrinophilic Higgs model has tiny vacuum expectation value (VEV), which can naturally explain tiny masses of neutrinos. There is a large energy scale hierarchy between a VEV of the neutrinophilic Higgs doublet and that of usual standard model-like Higgs doublet. In this paper we at first analyze vacuum structures of Higgs potential in both supersymmetry (SUSY) and non-SUSY neutrinophilic Higgs models, and next investigate a stability of this VEV hierarchy against radiative corrections. We will show that the VEV hierarchy is stable against radiative corrections in both Dirac neutrino and Majorana neutrino scenarios in both SUSY and non-SUSY neutrinophilic Higgs doublet models. △ Less", "The electroweak symmetry is nonlinearly realized in an extension of the minimal supersymmetric standard model (MSSM) through an additional pair of constrained Higgs doublet superfields. The superpotential couplings of this constrained Higgs doublet pair to the MSSM Higgs doublet pair catalyze their vacuum expectation values. The Higgs and Higgsino-gaugino mass spectrum is presented for several choices of supersymmetry (SUSY) breaking and Higgs superpotential mass parameters. The additional vacuum expectation values provided by the constrained fields can produce a phenomenology quite different than that of the MSSM . △ Less", "We describe the application of model inference based on reference priors to two concrete examples in high energy physics: the determination of the CKM matrix parameters rhobar and etabar and the determination of the parameters m_0 and m_1/2 in a simplified version of the CMSSM SUSY model. We show how a 1-dimensional reference posterior can be mapped to the n-dimensional (n-D) parameter space of the given class of models, under a minimal set of conditions on the n-D function. This reference-based function can be used as a prior for the next iteration of inference, using Bayes' theorem recursively. △ Less", "We suggest the existence of a fundamental connection between baryonic and dark matter. This is motivated by both the stability of these two types of matter as well as the observed similarity of their present-day densities. A unified genesis of baryonic and dark matter is natural in models in which the baryon number is promoted to a spontaneously broken local gauge symmetry. This is illustrated in a specific class of SUSY models using the Affleck-Dine mechanism. The dark matter candidate in these scenarios is charged under the baryon gauge symmetry and must have a mass around the GeV scale to give the correct present-day abundance. We discuss constraints from B-factories, LEP, mono-jet searches at the Tevatron, and dark matter direct detection experiments. A baryonic dark force is shown to be consistent with all data for mediators as light as the GeV scale. △ Less", "We study the fine tuning in the parameter space of the semi-constrained NMSSM, where most soft Susy breaking parameters are universal at the GUT scale. We discuss the dependence of the fine tuning on the soft Susy breaking parameters M_1/2 and m0, and on the Higgs masses in NMSSM specific scenarios involving large singlet-doublet Higgs mixing or dominant Higgs-to-Higgs decays. Whereas these latter scenarios allow a priori for considerably less fine tuning than the constrained MSSM, the early LHC results rule out a large part of the parameter space of the semi-constrained NMSSM corresponding to low values of the fine tuning. △ Less", "The $bτj \\etslash$ signal at the ongoing LHC experiments is simulated with Pythia in the mSUGRA and other models of SUSY breaking. Special attention is given on the compatibility of this signature with the low mass neutralino dark matter (LMNDM) scenario consistent with WMAP data. In the mSUGRA model the above signal as well as the LMNDM scenario are strongly disfavoured due to the constraints from the on going SUSY searches at the LHC. This tension, however, originates from the model dependent correlations among the parameters in the strong and electroweak sectors of mSUGRA. That there is no serious conflict between the LMNDM scenario and the LHC data is demonstrated by constructing generic phenomenological models such that the strong sector is unconstrained or mildly constrained by the existing LHC data and parameters in the electroweak sector, unrelated to the strong sector,yield DM relic density consistent with the WMAP data. The proposed models, fairly insensitive to the conventional SUSY searches in the jets + $\\etslash$ and other channels, yield observable signal in the suggested channel for $\\lum \\gsim 1 \\ifb$ of data. They are also consistent with the LMNDM scenario and can be tested by the direct dark matter search experiments in the near future. Some of these models can be realized by non-universal scalar and gaugino masses at the GUT scale. △ Less", "It is well known that R-symmetric models dramatically alleviate the SUSY flavor and CP problems. We study particular modifications of existing R-symmetric models which share the solution to the above problems, and have interesting consequences for electroweak baryogenesis and the Dark Matter (DM) content of the universe. In particular, we find that it is naturally possible to have a strongly first-order electroweak phase transition while simultaneously relaxing the tension with EDM experiments. The R-symmetry (and its small breaking) implies that the gauginos (and the neutralino LSP) are pseudo-Dirac fermions, which is relevant for both baryogenesis and DM. The singlet superpartner of the U(1)_Y pseudo-Dirac gaugino plays a prominent role in making the electroweak phase transition strongly first-order. The pseudo-Dirac nature of the LSP allows it to behave similarly to a Dirac particle during freeze-out, but like a Majorana particle for annihilation today and in scattering against nuclei, thus being consistent with current constraints. Assuming a standard cosmology, it is possible to simultaneously have a strongly first-order phase transition conducive to baryogenesis and have the LSP provide the full DM relic abundance, in part of the allowed parameter space. However, other possibilities for DM also exist, which are discussed. It is expected that upcoming direct DM searches as well as neutrino signals from DM annihilation in the Sun will be sensitive to this class of models. Interesting collider and Gravity-wave signals are also briefly discussed. △ Less", "After reviewing electroweak (EW) scale supersymmetry (susy) and split susy, as well as their implications in very high energy cosmic rays, I present a high scale susy model for fermion masses. An O(0.1) nu_e-nu_{tau} mixing is expected. △ Less", "In direct gauge mediation, the gaugino masses are anomalously small, giving rise to a split SUSY spectrum. Here we investigate the superpartner spectrum in a minimal version of \"direct gaugino mediation.\" We find that the sfermion masses are comparable to those of the gauginos - even in the hybrid gaugino-gauge mediation regime - if the messenger scale is sufficiently small. △ Less", "The localized fermions on the intersection curve $Σ$ of D7-branes, are connected to a N=2 supersymmetric quantum mechanics algebra. Due to this algebra the fields obey a global U(1) symmetry. This symmetry restricts the proton decay operators and the neutrino mass terms. Particularly, we find that several proton decay operators are forbidden and the Majorana mass term is the only one allowed in the theory. A special SUSY QM algebra is studied at the end of the paper. In addition we study the impact of a non-trivial holomorphic metric perturbation on the localized solutions along each matter curve. Moreover, we study the connection of the localized solutions to an N=2 supersymmetric quantum mechanics algebra when background fluxes are turned on. △ Less", "We investigate the Q-ball decay in the gauge-mediated SUSY breaking. Q balls decay mainly into nucleons, and partially into gravitinos, while they are kinematically forbidden to decay into sparticles which would be cosmologically harmful. This is achieved by the Q-ball charge small enough to be unstable for the decay, and large enough to be protected kinematically from unwanted decay channel. We can then have right amounts of the baryon asymmetry and the dark matter of the universe, evading any astrophysical and cosmological observational constraints such as the big bang nucleosynthesis, which has not been treated properly in the literatures. △ Less", "We consider intersecting brane solutions of the type IIB matrix model. It is shown that fermionic zero-modes arise on such backgrounds, localized at the brane intersections. They lead to chiral fermions in four dimensions under certain conditions. Such configurations reproduce many of the welcome features in similar string-theoretic constructions. Therefore they can be used to construct semi-realistic particle physics models in the framework of Yang-Mills matrix models. In particular, we present a brane configuration which realizes the correct chiral spectrum of the standard model in the matrix model. Furthermore, the stability of intersecting branes is discussed by analyzing the 1-loop effective action. It is shown that intersecting branes may form a bound state for certain flux configurations. The four-dimensional geometry of the branes is generic, and determined by the (emergent) gravity sector of the matrix model. △ Less", "The recent analyses of the world neutrino data, including the T2K and MINOS results, point toward a statistically significant deviation of theta13 from zero. In this paper we present a SUSY SU(5) model based on the discrete S4 group which predicts a large theta13 of order lambdaC, lambdaC being the Cabibbo angle. The other mixing angles in the neutrino sector are all compatible with current experimental data. In the quark sector, the entries of the CKM mixing matrix as well as the mass hierarchies in both up and down quark sectors are well reproduced and only a small enhancement is needed to reproduce lambdaC. △ Less", "We discuss the physics of moduli (light scalar fields with Planck-suppressed couplings to matter) in the case of low-scale supersymmetry breaking such as gauge mediation. We argue that even if the mechanism of moduli stabilization is decoupled from the mechanism of SUSY breaking, moduli masses will generically be parametrically related to the gravitino mass once the cancellation of the cosmological constant is taken into account. For low- scale SUSY breaking, this implies that moduli fields are light, long-lived relics that will generically drive the universe into a matter-dominated phase, in contradiction to standard BBN. We discuss two scenarios for evading this problem. The first is to consider very tuned supergravity potentials that can make the moduli heavy enough to decay at early times and reheat above the temperature of BBN. Viable cosmology can be achieved in this scenario, which has a population of highly relativistic light gravitinos arising from decays of moduli. Next, we consider the more natural scenario with light moduli. The saxion field associated with the solution of the strong CP problem provides the most natural candidate for driving thermal inflation, which dilutes the moduli. We construct an explicit model for this scenario, when the PQ symmetry breaking scale is larger than the messenger scale. The combination of the constraints on relic abundance and gamma-ray flux from decay of the moduli favors a particular region of SUSY breaking scale, 2 x 10^3 - 10^4 TeV. For either scenario, we find that it is generic for low-scale SUSY to be associated with late entropy production and accompanying low reheating temperatures. △ Less", "We investigate the recently proposed class of chaotic inflation models in supergravity with an arbitrary inflaton potential. These models are extended to include matter fields in the visible sector and we employ a mechanism of SUSY breaking based on a particular phenomenological version of the KKLT mechanism (the KL model). We describe specific features of reheating in this class of models and show how one can solve the cosmological moduli and gravitino problems in this context. △ Less", "We combine recent progress in measuring the branching ratio of the decay B->X_d gamma$ with the discovery that hadronic uncertainties in the CP-averaged branching ratio drop out to a large extent. Implications of these improvements on the size of possible new physics effects are investigated. We find the updated SM prediction for the CP-averaged branching ratio to be Br[B->X_d gamma]^SM_E_gamma>1.6 GeV = 1.54^+0.26-0.31*10^-5, which should be compared with the experimental value of Br[B->X_d gamma]^exp_E_gamma>1.6GeV = (1.41+-0.57) 10^-5. After performing a model independent analysis, we consider different new physics models: the MSSM with generic sources of flavor violation, the two Higgs doublet model of type III and a model with right-handed charged currents. It is found that the constraints on the SUSY parameters delta^d_13 have improved and that the absolute value of the right-handed quark mixing matrix element |V^R_td| must be smaller than 1.5*10^-4. △ Less", "One of the main channels which allows for a large rate of neutralino dark matter annihilation in the early Universe is via the pseudoscalar Higgs A-resonance. In this case, the measured dark matter abundance can be obtained in the minimal supergravity (mSUGRA) model when tan(beta)\\sim 50 and 2m_{\\tz_1}\\sim m_A. We investigate the reaction pp\\to bφ\\to bμ^+μ^- +X (where φ=A or H) at the CERN LHC where requiring the tag of a single b-jet allows for amplification of the signal-to-background ratio. The rare but observable Higgs decay to muon pairs allows for a precise measurement of the Higgs boson mass and decay width. We evaluate signal and background using CalcHEP, with muon energy smearing according to the CMS detector. We find that the Higgs width (Γ_A) can typically be determined with the accuracy up to \\sim 8% (\\sim 17%) for m_A\\sim 400 (600) GeV assuming 10^3 fb^{-1} of integrated luminosity. Therefore, the pp\\to bφ\\to bμ^+μ^- +X process provides a unique possibility for direct Γ_A measurement at the LHC. While the Higgs width is correlated with the parameter \\tanβfor a given value of m_A, extracting \\tanβis complicated by an overlap of the A and H peaks, radiative corrections to the b and τYukawa couplings, and the possibility that SUSY decay modes of the Higgs may be open. In the case where a dilepton mass edge from \\tz_2\\to\\ell^+\\ell^-\\tz_1 is visible, it should be possible to test the relation that 2m_{\\tz_1}\\sim m_A. △ Less", "A pressing problem for supersymmetry (SUSY) phenomenologists is how to incorporate Large Hadron Collider search results into parameter fits designed to measure or constrain the SUSY parameters. Owing to the computational expense of fully simulating lots of points in a generic SUSY space to aid the calculation of the likelihoods, the limits published by experimental collaborations are frequently interpreted in slices of reduced parameter spaces. For example, both ATLAS and CMS have presented results in the Constrained Minimal Supersymmetric Model (CMSSM) by fixing two of four parameters, and generating a coarse grid in the remaining two. We demonstrate that by generating a grid in the full space of the CMSSM, one can interpolate between the output of an LHC detector simulation using machine learning techniques, thus obtaining a superfast likelihood calculator for LHC-based SUSY parameter fits. We further investigate how much training data is required to obtain usable results, finding that approximately 2000 points are required in the CMSSM to get likelihood predictions to an accuracy of a few per cent. The techniques presented here provide a general approach for adding LHC event rate data to SUSY fitting algorithms, and can easily be used to explore other candidate physics models. △ Less", "We study the cross-section of heavy Higgs production at the LHC within the framework of the Constrained MSSM. It is not only enhanced by tan^2 beta but sometimes is also enhanced by the squark contribution. First, we consider the universal scenario within mSUGRA and find out that to get the desired enhancement one needs large negative values of A_0, which seems to be incompatible with the b->s gamma decay rate. To improve the situation, we release the unification requirement in the Higgs sector. Then it becomes possible to satisfy all requirements simultaneously and enhance the squark contribution. The latter can gain a factor of several units increasing the overall cross-section which, however, is still smaller than the cross-section of the associated H b bbar production. We consider also some other consequences of the chosen benchmark point. △ Less", "Flavor violating processes in the quark and lepton sectors are investigated within a realistic supersymmetric $SO(10)\\times A_4$ grand unification model. By employing exotic heavy fermion fields, this model successfully describes various features of the fermion masses and mixings including large neutrino mixings accompanied by small quark mixings. In this model the flavor violation is induced at GUT scale, at which $A_4$ flavor symmetry is broken, as a consequence of the large mixings of the light fermion fields with these exotic heavy fields. The stringent experimental constraint from $μ\\rightarrow eγ$ decay rate necessitates a high degree of degeneracy of the supersymmetry breaking soft scalar masses of the exotic heavy fields and supersymmetric scalar partners of the light fermion fields. The choice of slepton masses of order 1 TeV is found to be consistent with the constraints from branching ratio of $μ\\rightarrow eγ$ and with all other flavor changing neutral current processes being sufficiently suppressed. △ Less", "We investigate the impact of recent direct supersymmetry (SUSY) searches on a non-universal sfermion mass scenario focusing on naturalness. One of the advantages of this scenario is that the non-universality between third generation and first two generation sfermion masses can relax the tension between naturalness and constraints from flavour and CP violating observables. In the parameter region, where various phenomenological constraints are satisfied, the constraints to this scenario from ATLAS 165pb-1 \"0-lepton\" search and 35pb-1 \"b-jet\" search are much weaker than those to the constrained minimal SUSY standard model, because of differences in the main SUSY production processes and the main decay chains. Naturalness can be easily achieved in this scenario in accord with the current direct SUSY searches. An additional dedicated analysis may be needed to discover/exclude this scenario. △ Less", "In previous work, we have established that for any 2-to-2 process in MSSM, only the helicity conserving (HC) amplitudes survive asymptotically. Studying a large number of such processes, at the 1loop Electroweak (EW) order, it is now found that their high energy HC amplitudes are determined by just three forms: a log-squared function of the ratio of two of the (s,t,u) variables, to which a pi^2 is added; and two Sudakov-like ln- and ln^2-terms accompanied by respective mass-dependent constants. Apart from an additional residual constant, all high energy HC amplitudes, may be expressed as linear combinations of the above three forms, with coefficients being rational functions of the $(s,t,u)$ variables. We call this fact supersimplicity. Applying to the $ug\\to dW$ amplitudes, for which the complete 1loop expressions are available, we find that supersimplicity may be a very good approximation at LHC energies, provided the SUSY scale is not too high. SM processes are also discussed, and their differences are explored. △ Less", "If supersymmetry (SUSY) exists in nature and is a solution to the hierarchy problem then it should be detectable at the TeV energy scale which the large hadron collider (LHC) is now exploring. One of the main goals of the LHC is the discovery or exclusion of the R-parity conserving minimal supersymmetric standard model (MSSM). So far, the SUSY search results are presented in the context of the constrained MSSM and other specific simplified SUSY models. A model-independent analysis necessarily relies on the trigger-system of the LHC detectors. By using the posterior samples of a 20-parameter MSSM, the phenomenological MSSM, from a fit to indirect collider and cosmological data we find that there is a significant volume in the MSSM parameter space that would escape the standard trigger-systems of the detectors. As such, in the absence of discovery in the current and future LHC runs, it would be difficult if not impossible to exclude the MSSM unless some dedicated and special triggers are commissioned or a Higgs boson with mass as predicted by the supersymmetric models is not found. △ Less", "In the context of the Supersymmetric (SUSY) B-L (Baryon minus Lepton number) model with an inverse seesaw mechanism, we calculate the one-loop radiative corrections due to right-handed (s)neutrinos to the mass of the lightest Higgs boson when the latter is Standard Model (SM)-like. We show that such effects can be as large as O(100) GeV, thereby giving an absolute upper limit on such a mass around 200 GeV. The importance of this result from a phenomenological point of view is twofold. On the one hand, this enhancement greatly reconciles theory and experiment, by alleviating the so-called `little hierarchy problem' of the minimal SUSY realization, whereby the current experimental limit on the SM-like Higgs mass is very near its absolute upper limit predicted theoretically, of 130 GeV. On the other hand, a SM-like Higgs boson with mass below 200 GeV is still well within the reach of the Large Hadron Collider (LHC), so that the SUSY realization discussed here is just as testable as the minimal version. △ Less", "In this article I review the origin and the effects of chirally enhanced loop-corrections in the MSSM based on Refs. [1-3]. Chiral enhancement is related to fermion-Higgs couplings (or self-energies when the Higgs field is replaced by its vev). I describe the resummation of these chirally-enhanced corrections to all orders in perturbation theory and the calculation of the effective fermion-Higgs and gaugino(higgsino)-fermion vertices. As an application a model with radiative flavor-violation is discussed which can solve the SUSY-CP and the SUSY-flavor problem while it is still capable of explaining the observed deviation from the SM in the Bs mixing phase. △ Less", "Flat directions charged under an R-symmetry are a generic feature of O'Raifeartaigh models. Non-topological solitons associated with this symmetry, R-balls, are likely to form through the fragmentation of a condensate, itself created by soft terms induced during inflation. In gravity mediated SUSY breaking R-balls decay to gravitinos, reheating the universe. For gauge mediation R-balls can provide a good dark matter candidate. Alternatively they can decay, either reheating or cooling the universe. Conserved R-symmetry permits decay to gravitinos or gauginos, whereas spontaneously broken R-symmetry results in decay to visible sector gauge bosons. △ Less", "Low energy descriptions of metastable supersymmetry breaking models often possess an accidental R-symmetry. Viable phenomenological applications of this class of models require R-symmetry to be broken in the ground state. This can be achieved in O'Raifeartaigh-like models where some of the chiral superfields carry negative R-charges. In this paper we consider UV completions of this class of models and formulate necessary conditions that they must satisfy. We show that the R-symmetry of the IR description can be traced to an anomalous or anomaly-free R-symmetry of the UV theory and discuss several representative examples. △ Less", "In 5D SUSY GUTs, wave-function localization permits to reproduce flavour hierarchy. As this mechanism also acts on SUSY breaking parameters, it can potentially solve the SUSY flavour problem. We carry out an analysis of the Holographic Grand Unification framework, where we take properly into account effects of matrix anarchy. In this contribution, we focus on brane-localized SUSY breaking and its consequences. △ Less", "We search for phenomenologically viable vacua of IIB string flux compactifications on Calabi-Yau orientifolds with a single Kaehler modulus. We perform both analytic studies and numerical searches in order to find models with de Sitter vacua and TeV-scale SUSY particle phenomenology. △ Less", "The ATLAS Collaboration has reported the first results of the search for SUSY particles in 1-lepton + 3 jets + MET final states. An essential ingredient for these results is a reliable background estimation in the signal region, in particular of the ttbar, W+jets and QCD backgrounds. The estimation of these three backgrounds is explained in this paper. The ttbar and W+jets backgrounds are obtained from a background dominated control region and extrapolated to the signal region, whereas for the estimation of the QCD background a matrix method is used. △ Less", "We report on a study of CP Violation in D0-D0bar mixing and Electric Dipole Moments in the framework of supersymmetric alignment models. Both classes of observables are strongly suppressed in the Standard Model and highly sensitive to new sources of flavor and CP violation that can be present in models of New Physics. Supersymmetric alignment models generically predict large non-standard effects in D0-D0bar mixing and we show that visible CP violation in D0-D0bar mixing implies lower bounds for the EDMs of hadronic systems, like the neutron EDM and the mercury EDM, in the reach of future experimental sensitivities. We also give updated constraints on the mass insertions of the Minimal Supersymmetric Standard Model using the current data on D0-D0bar mixing. △ Less", "We revisit four generations within the context of supersymmetry. We compute the perturbativity limits for the fourth generation Yukawa couplings and show that if the masses of the fourth generation lie within reasonable limits of their present experimental lower bounds, it is possible to have perturbativity only up to scales around 1000 TeV, i.e. the current experimental bounds and perturbative unification are mutually exclusive. Such low scales are ideally suited to incorporate gauge mediated supersymmetry breaking, where the mediation scale can be as low as 10-20 TeV. The minimal messenger model, however, is highly constrained. Lack of electroweak symmetry breaking rules out a large part of the parameter space, and in the remaining part, the fourth generation stau is tachyonic. △ Less", "Both ATLAS and CMS have published results of SUSY searches putting limits on SUSY parameters and masses. A non-discovery of SUSY in the next two years would push these limits further. On the other hand, precision data of low energy measurements and the dark matter relic density favor a light scale of supersymmetry. Therefore we investigate if supersymmetry -- more specifically the highly constraint model mSUGRA -- does at all agree with precision data and LHC exclusions at the same time, and whether the first two years of LHC will be capable of excluding models of supersymmetry. We consider the current non observation of supersymmetry with 35 pb-1 as well as the possible non observation with 1,2 and 7 fb-1 in a global fit using the framework Fittino. △ Less", "We reconsider the lambda-SUSY model, in which the mass of the Higgs boson is raised already at tree level up to about 200 GeV via an additional interaction in the superpotential between the Higgs bosons and a Singlet, focusing on a scale invariant superpotential. After a detailed analysis of the allowed region in parameter space, which includes constraints coming from the absence of spontaneous CP violation and of unrealistic minima, we study the scalar mass spectrum, the production rate and the decay modes of the lightest scalar, finding that in general both the production rate and the Branching Ratio into gauge bosons can be reduced with respect of those of the standard Higgs, causing it to be hardly detected in the first run of the LHC. △ Less", "We consider the lambda-SUSY model, a version of the NMSSM with large lambda H_1 H_2 S coupling, relaxing the approximation of large singlet mass and negligible mixing of the scalar singlet with the scalar doublets. We show that there are regions of the parameter space in which the lightest pseudoscalar can be relatively light, with unusual consequences on the decay pattern of the CP-even Higgs bosons and thus on the LHC phenomenology. △ Less", "We present recent results aiming at assessing the coverage properties of Bayesian and frequentist inference methods, as applied to the reconstruction of supersymmetric parameters from simulated LHC data. We discuss the statistical challenges of the reconstruction procedure, and highlight the algorithmic difficulties of obtaining accurate profile likelihood estimates. △ Less", "We present a broad class of supersymmetric models that preserve R-parity but lack missing energy signatures. These models have new light particles with weak-scale supersymmetric masses that feel SUSY breaking only through couplings to the MSSM. This small SUSY breaking leads to nearly degenerate fermion/boson pairs, with small mass splittings and hence small phase space for decays carrying away invisible energy. The simplest scenario has low-scale SUSY breaking, with missing energy only from soft gravitinos. This scenario is natural, lacks artificial tunings to produce a squeezed spectrum, and is consistent with gauge coupling unification. The resulting collider signals will be jet-rich events containing false resonances that could resemble signatures of R-parity violation. We discuss several concrete examples of the general idea, and emphasize gamma + jet + jet resonances, displaced vertices, and very large numbers of b-jets as three possible discovery modes. △ Less", "In supersymmetric (SUSY) models with Dirac neutrino masses, a weak-scale trilinear A-term that is not proportional to the small neutrino Yukawa couplings can induce a sizable mixing between left and right-handed sneutrinos. The lighter sneutrino mass eigenstate can hence become the lightest SUSY particle (LSP) and a viable dark matter candidate. In particular, it can be an excellent candidate for light dark matter with mass below ~10 GeV. Such a light mixed sneutrino LSP has a dramatic effect on SUSY signatures at the LHC, as charginos decay dominantly into the light sneutrino plus a charged lepton, and neutralinos decay invisibly to a neutrino plus a sneutrino. We perform a detailed study of the LHC potential to resolve the light sneutrino dark matter scenario by means of three representative benchmark points with different gluino and squark mass hierarchies. We study in particular the determination of the LSP (sneutrino) mass from cascade decays involving charginos, using the mT2 variable. Moreover, we address measurements of additional invisible sparticles, in our case the lightest neutralino, and the question of discrimination against the MSSM. △ Less", "SUSY CP problem in the gauge mediation supersymmetry breaking model is reconsidered. We pay particular attention to two sources of CP violating phases whose effects were not seriously studied before; one is the effect of the breaking of the GUT relation among the gaugino masses due to the field esponsible for the GUT symmetry breaking, and the other is the supergravity effect on the supersymmetry breaking parameters, in particular, on the bi-linear supersymmetry breaking Higgs mass term. We show that both of them can induce too large electric dipole moments of electron, neutron, and so on, to be consistent with the experimental bounds. △ Less", "The decay rates of metastable SQCD vacua in ISS-type models, both towards supersymmetric vacua as well as towards other nonsupersymmetric configurations arising in theories with elementary spectators, are estimated numerically in the semiclassical approximation by computing the corresponding multifield bounce configurations. The scaling of the bounce action with respect to the most relevant dimensionless couplings and ratios of scales is analyzed. In the case of the decays towards the susy vacua generated by nonperturbative effects, the results confirm previous analytical estimations of this scaling, obtained by assuming a triangular potential barrier. The decay rates towards susy vacua generated by R-symmetry breaking interactions turn out to be more than sufficiently suppressed for the phenomenologically relevant parameter range, and their behavior in this regime differs from analytic estimations valid for parametrically small scale ratios. It is also shown that in models with spectator fields, even though the decays towards vacua involving nonzero spectator VEVs don't have a strong parametric dependence on the scale ratios, the ISS vacuum can still be made long-lived in the presence of R-symmetry breaking interactions. △ Less", "We carry out a model-independent EFT method study on the vacuum statistics of general F-term SUSY breaking models. Assuming a smooth distribution of Lagrangian parameters, SUSY breaking vacua are rare in global SUSY models with a canonical Kähler potential, and have a peaked distribution near the cut-off of the SUSY breaking scale in both global SUSY and SUGRA models with a general Kähler potential. After including different mass scales in the Lagrangian, we compare the total number of SUSY and non-SUSY vacua and estimate quantitatively the rareness of SUSY breaking. The EFT method provides a general view to the amount of parameter tuning needed for a metastable SUSY breaking vacuum. The tuning also indicates the importance of R-symmetries in SUSY breaking even for metastable SUSY breaking. △ Less", "In this article we investigate the consequences of radiative flavor violation (RFV) in the Minimal Supersymmetric Standard Model (MSSM). In this framework the small off-diagonal elements of the Cabibbo-Kobayashi-Maskawa (CKM) matrix and the small quark masses of the first two generations are generated from the trilinear supersymmetry-breaking terms. The impact of RFV on flavor-physics observables is studied in detail. We focus on the limiting cases in which the CKM matrix is either generated in the down-sector, i.e. by the soft SUSY-breaking mass insertions delta^dLR_i3 (i=1,2), or in the up-quark sector, i.e. by the mass insertions delta^uLR_i3. In the first case we find an enhancement of b->s gamma, which constrains the allowed range of sparticle masses (Fig. 3). In addition, neutral Higgs penguins significantly contribute to B_s,d->mu^+mu^- and, if also delta^dLR_32 is different from zero, these Higgs effects are capable of explaining the observed CP phase in the B_s system. If, on the other hand, the CKM generation takes place in the up-sector, |epsilon_K| receives additional positive contributions enforcing large squark and gluino masses (see Fig. 8). In this case also the rare decay K->pi nu nu receives sizable contributions. In conclusion we find that for SUSY masses around 1 TeV RFV is an interesting alternative to Minimal Flavor Violation (MFV). △ Less", "We construct flux-stabilised IIB compactifications whose extra dimensions (EDs) have very different sizes, and use these to describe several vacua with a TeV string scale. Because we can access regimes where 2 dimensions are hierarchically larger than the other 4, we find examples where 2 dimensions are micron-sized while the other 4 are at the weak scale in addition to standard examples with all 6 EDs equally large. Besides providing UV completeness, the phenomenology of these models is richer than vanilla large-dimensional models in several ways: (i) they are supersymmetric, with SUSY broken at sub-eV scales in the bulk but only nonlinearly realised in the SM sector, leading to no MSSM superpartners and many more bulk missing-energy channels, as in supersymmetric large extra dimensions (SLED); (ii) small cycles in the complicated extra-dimensional geometry allow some KK states to reside at TeV scales even if all 6 EDs are much larger; (iii) a rich spectrum of string and KK states at TeV scales; and (iv) an equally rich spectrum of light moduli having unusually small (but technically natural) masses, with potentially interesting implications for cosmology and astrophysics that nonetheless evade new-force constraints. The hierarchy problem is solved because the extra-dimensional volume is naturally stabilised at exponentially large values: the EDs are CY geometries with a 4D K3 or T^4-fibration over a 2D base, with moduli stabilised within the LARGE-Volume scenario. The new technical step is the use of poly-instanton corrections to the superpotential (which, unlike for simpler models, are likely to be present on K3 or T^4-fibered CY compactifications) to obtain a large hierarchy between the sizes of different dimensions. For several scenarios we identify the low-energy spectrum and briefly discuss some of their astrophysical, cosmological and phenomenological implications. △ Less", "MSSM Higgs bosons are the most promising way to discover Higgs physics at hadronic colliders since their cross section is enhanced compared to that of the Standard Model. We will present theoretical predictions for their production and decay in the Higgs$\\to ττ$ channel at the Tevatron and the LHC, focusing on the theoretical uncertainties that affect them. The inferred SUSY Higgs bounds on the $[\\tan β; M_A]$ plane and the impact of these uncertainties will also be discussed. △ Less", "We investigate a simple 5D extension of the Minimal Supersymmetric (SUSY) Standard Model (SM) that is combined with the bulk matter Randall-Sundrum (RS) model, which gives a natural explanation the Yukawa coupling hierarchy. In this model, matter and gauge superfields reside in the 5D bulk while a SUSY breaking sector and the Higgs doublet superfields are localized on the infrared brane. The Yukawa coupling hierarchy in SM can be naturally explained through the wavefunction localization of the matter superfields. While sparticles obtain their flavor-blind soft SUSY breaking masses dominantly from the gaugino-mediated SUSY breaking, flavor-violating soft terms arise through the gravity-mediated SUSY breaking which are controlled by the wavefunction localization of the matter superfields. This structure of the model allows us to predict the sparticle mass spectrum including flavor-violating terms. We first explicitly determine the 5D disposition of matter superfields from the low energy experimental data on SM fermion masses, CKM matrix and the neutrino oscillation parameters. Then, we calculate particle mass spectra and estimate the effects of the flavor-violating soft terms, which should be compared with the current experimental constraints. With gravitino being the lightest sparticle (LSP), the next-to-LSP, which is long-lived, is predicted most likely to be either singlet smuon-like or selectron-like. The model can be tested at collider experiments through flavor-violating processes involving sparticles. The flavor structure among sparticle, once observed, gives us a clue to deep understanding of the origin of Yukawa coupling hierarchy. △ Less", "We suggest simple models of spontaneous parity violation in supersymmetric strong gauge theory. We focus on left-right symmetric model and investigate vacuum with spontaneous parity violation. Non-perturbative effects are calculable in supersymmetric gauge theory, and we suggest two new models. The first model shows confinement, and the second model has a dual description of the theory. The left-right symmetry breaking and electroweak symmetry breaking are simultaneously occurred with the suitable energy scale hierarchy. The second model also induces spontaneous supersymmetry breaking. △ Less", "We examine some conditions which are needed to allow the Peccei-Quinn scale (f_a) as high as the SUSY GUT scale (M_{GUT} \\sim 10^{16} GeV) in the context of the PQMSSM with either an axino or a neutralino LSP. The main problem in non-SUSY models with f_a\\sim M_{GUT} is the generation of an overabundance of axion dark matter (\\sim f_a^{7/6}) due to vacuum misalignment. We show that once all the components of the axion supermultiplet are included, the upper limit on f_a can be evaded due to large entropy injection from saxion decays. This large entropy injection also dilutes all other quasi-stable relic densities, naturally evading the BBN constraints and solving the gravitino problem. We find that f_a\\sim M_{GUT} can be allowed by relic density/BBN constraints provided that the saxion mass m_s> 50 TeV, the initial saxion field value is of order of the PQ scale and the initial axion mis-alignment angle θ_i\\alt 0.05 . These restrictions can be considerably loosened for f_a\\sim 10^{15} GeV. The allowed range for the re-heat temperature (T_R) is strongly dependent on the nature of the LSP. For the axino LSP, T_R \\gtrsim 10^8 GeV, while for neutralino LSP any value is allowed. In the latter case, f_a\\sim M_{GUT} can be more easily accommodated than in the axino LSP scenario. For f_a\\sim M_{GUT} in SUSY models, the dark matter abundance should be dominated by axions, albeit with mass m_a\\sim 10^{-10} eV, far below the region currently probed by experiment. △ Less", "We use supersymmetry to address the little hierarchy problem in Randall-Sundrum models by naturally generating a hierarchy between the IR scale and the electroweak scale. Supersymmetry is broken on the UV brane which triggers the stabilization of the warped extra dimension at an IR scale of order 10 TeV. The Higgs and top quark live near the IR brane whereas light fermion generations are localized towards the UV brane. Supersymmetry breaking causes the first two sparticle generations to decouple, thereby avoiding the supersymmetric flavour and CP problems, while an accidental R-symmetry protects the gaugino mass. The resulting low-energy sparticle spectrum consists of stops, gauginos and Higgsinos which are sufficient to stabilize the little hierarchy between the IR scale and the electroweak scale. Finally, the supersymmetric little hierarchy problem is ameliorated by introducing a singlet Higgs field on the IR brane. △ Less", "If supersymmetry (SUSY) will be discovered, successful models of flavour not only have to provide an explanation of the flavour structure of the Standard Model fermions, but also of the flavour structure of their scalar superpartners. We discuss aspects of such \"SUSY flavour\" models, towards predicting both flavour structures, in the context of supergravity (SUGRA). We point out the importance of carefully taking into account SUSY-specific effects, such as 1-loop SUSY threshold corrections and canonical normalization, when fitting the model to the data for fermion masses and mixings. This entangles the flavour model with the SUSY parameters and leads to interesting predictions for the sparticle spectrum. We demonstrate these effects by analyzing an example class of flavour models in the framework of an SU(5) Grand Unified Theory with a family symmetry with real triplet representations. For flavour violation through the SUSY soft breaking terms, the class of models realizes a scheme we refer to as \"Trilinear Dominance\", where flavour violation effects are dominantly induced by the trilinear terms. △ Less", "The standard model (SM) of particle physics is for the last three decades a very successful description of the properties and interactions of all known elementary particles. Currently, it is again probed with the first collisions at the Large Hadron Collider (LHC). It is widely expected that new physics will be detected at the LHC and the SM has to be extended. The most exhaustive analyzed extension of the SM is supersymmetry (SUSY). SUSY can not only solve intrinsic problems of the SM like the hierarchy problem, but it also postulates new particles which might explain the nature of dark matter in the universe. The majority of all studies about dark matter in the framework of SUSY has focused on the minimal supersymmetric standard model (MSSM). The aim of this work is to consider scenarios beyond that scope. We consider two models which explain not only dark matter but also neutrino masses: the gravitino as dark matter in gauge mediated SUSY breaking (GMSB) with bilinear broken R-parity as well as different seesaw scenarios with the neutralino as dark matter candidate. Furthermore, we also study the next-to-minimal supersymmetric standard model (NMSSM) which solves the (μ)-problem of the MSSM and discuss the properties of the neutralino as dark matter candidate. △ Less", "SFOLD (Sfermion Full One Loop Decays) is a Fortran program package for calculating all sfermion two-body decay widths and the corresponding branching ratios at full one-loop level within the MSSM. The package adopts the SUSY Parameter Analysis convention and supports the SUSY Les Houches Accord input and output format. With the SFOLD package we found non-negligible electroweak corrections in bosonic decays of sbottom, stop and stau. △ Less", "We generalize to string theory a construction, originally proposed in field theory, that generates a hierarchy in the splittings between members of super-multiplets in various sectors of the theory. △ Less", "In this paper, we study non-decoupling $μ$ - $e$ transition effects by Higgs-mediated contribution in the MSSM, when some SUSY mass parameters are much greater than TeV. In order to treat CP-odd Higgs mass $m_{A^{0}}$ as a free parameter, we consider the non-universal Higgs mass model (NUHM), and assume the only left- or right-handed sleptons had flavor-mixing mass terms. If both Higgs-mediated and ordinary SUSY contribution are significant, the ratio of branching ratios $\\BR(\\meg) / \\BR(\\maleal)$ becomes sensitive to SUSY mass parameters. We investigated these mass-sensitive regions and the behavior of the ratio $\\BR(\\meg) / \\BR(\\maleal)$ in some mass spectrum of the NUHM, and found that this ratio drastically depends on the mass spectrum structure and chirality of flavor violation. Log factor from two split mass scale influences the way of interference between gaugino- and Higgs-mediated contributions significantly. △ Less", "Recent MEG results of a search for the lepton flavor violating (LFV) muon decay, $μ\\to e γ$, show 3 events as the best value for the number of signals in the maximally likelihood fit. Although this result is still far from the evidence/discovery in statistical point of view, it might be a sign of a certain new physics beyond the Standard Model. As has been well-known, supersymmetric (SUSY) models can generate the $μ\\to e γ$ decay rate within the search reach of the MEG experiment. A certain class of SUSY grand unified theory (GUT) models such as the minimal SUSY SO(10) model (we call this class of models \"predictive SO(10) models\") can unambiguously determine fermion Yukawa coupling matrices, in particular, the neutrino Dirac Yukawa matrix. Based on the universal boundary conditions for soft SUSY breaking parameters at the GUT scale, we calculate the rate of the $μ\\to e γ$ process by using the completely determined Dirac Yukawa matrix in two examples of predictive SO(10) models. If we interpret the 3 events in MEG experiment as a positive signal and combine it with other experimental constraints such as the relic density of the neutralino dark matter and recent results on muon $g-2$, we can pin down a parameter set of the universal boundary conditions. Then, we propose benchmark sparticle mass spectra for each predictive SO(10) model, which will be tested at the Large Hadronic Collider. △ Less", "The associated production of a Higgs boson with a b quark is a discovery channel for the lightest MSSM neutral Higgs boson. We consider the SUSY QCD contributions from squarks and gluinos and discuss the decoupling properties of these effects. A detailed comparison of our exact order(alpha_s) results with those of a widely used effective Lagrangian approach, the Δ_b approximation, is presented. The Δ_b approximation is shown to accurately reproduce the exact one-loop SQCD result to within a few percent over a wide range of parameter space. △ Less", "We describe recent extensions of the program SPheno including flavour aspects, CP-phases, R-parity violation and low energy observables. In case of flavour mixing all masses of supersymmetric particles are calculated including the complete flavour structure and all possible CP-phases at the 1-loop level. We give details on implemented seesaw models, low energy observables and the corresponding extension of the SUSY Les Houches Accord. Moreover, we comment on the possiblities to include MSSM extensions in SPheno. △ Less", "Besides Standard Model measurements and other Beyond Standard Model studies, the ATLAS and CMS experiments at the LHC will search for Supersymmetry, one of the most attractive explanation for dark matter. The SUSY discovery potential with early data is presented here together with some first results obtained with 2010 collision data at 7 TeV. Emphasis is placed on measurements and parameter determination that can be performed to disentangle the possible SUSY models and SUSY look-alike and the interpretation of a possible positive supersymmetric signal as an explanation of dark matter. △ Less", "The first results from the LHC on jets plus missing energy provide powerful new data to test SUSY models. Initial theoretical interpretations of these data have concentrated on gravity mediation, usually the CMSSM and its variations. In this paper we confront a large class of gauge mediation models with these new data. More precisely we consider models of pure general gauge mediation (pure GGM) and confront them with the recent experimental results of the ATLAS collaboration. We use Herwig++ and RIVET, incorporating the full set of experimental cuts, to calculate the signal rates and compare them to the data. Although based on only 35pb^{-1} of integrated luminosity, we show that these new data probe and exclude a portion of previously allowed parameter space of GGM. In addition we investigate the viability of standard SUSY benchmark points, including the Snowmass, CMS and ATLAS sets which encompass other mediation scenarios such as gravity, anomaly and gaugino mediation. △ Less", "We propose the signal $1b+1l+N_j+\\etslash$ along with appropriate selection criteria for the LHC 7 TeV run, where the number of jets $(N_j)$ is $\\ge$ 2 or 4. These signals can complement the canonical $Jets + \\etslash$ signature since they are sensitive to the trilinear soft breaking parameter $(A_0)$ and low values of the parameter tan$β$ in the minimal supergravity (mSUGRA) model. A large region of this mSUGRA parameter space within the reach of the ongoing experiments at the LHC is disfavoured by the bound on the lightest Higgs boson mass ($m_h \\ge 114.4 $ GeV) unless $A_0$ has moderate to large negative values. Interestingly this parameter space with $A_0 \\ne 0$ is also consistent with the observed dark matter relic density. A natural consequence of large $A_0$ is the existence of a light top squark ($\\lstop$). The proposed signals primarily stem from direct $\\lstop \\lstop^*$ production and/or $\\tilde g \\ra \\tilde t_{1} t $, if all squark-gluino events are considered. A thorough analysis of the signals and the corresponding backgrounds are presented using the event generator Pythia. We finally compare the signal size for $A_0 = 0$ and $A_0 \\ne 0$. △ Less", "We propose new classes of models which predict both tri-bimaximal lepton mixing and a right-angled Cabibbo-Kobayashi-Maskawa (CKM) unitarity triangle, alpha approximately 90 degrees. The ingredients of the models include a supersymmetric (SUSY) unified gauge group such as SU(5), a discrete family symmetry such as A4 or S4, a shaping symmetry including products of Z2 and Z4 groups as well as spontaneous CP violation. We show how the vacuum alignment in such models allows a simple explanation of alpha approximately 90 degrees by a combination of purely real or purely imaginary vacuum expectation values (vevs) of the flavons responsible for family symmetry breaking. This leads to quark mass matrices with 1-3 texture zeros that satisfy the phase sum rule and lepton mass matrices that satisfy the lepton mixing sum rule together with a new prediction that the leptonic CP violating oscillation phase is close to either 0, 90, 180, or 270 degrees depending on the model, with neutrino masses being purely real (no complex Majorana phases). This leads to the possibility of having right-angled unitarity triangles in both the quark and lepton sectors. △ Less", "The like-sign dimuon charge asymmetry of the $B$ meson, which was reported in the D$Ø$ Collaboration, is studied in the SU(5) SUSY GUT model with $S_4$ flavor symmetry. Additional CP violating effects from the squark sector are discussed in $B_s-\\bar B_s$ mixing process. The predicted like-sign charge asymmetry is in the 2$σ$ range of the combined result of D$Ø$ and CDF measurements. Since the SUSY contributions in the quark sector affect to the lepton sector because of the SU(5) GUT relation, two predictions are given in the leptonic processes: (i) both ${\\rm BR}(μ\\to e γ)$ and the electron EDM are close to the present upper bound, (ii) the decay ratios of $τ$ decays, $τ\\to μγ$ and $τ\\to e γ$, are related to each other via the Cabibbo angle $λ_c$: ${\\rm BR}(τ\\to eγ)/{\\rm BR}(τ\\to μγ)\\sime λ_c^2$. These are testable at future experiments. △ Less", "We consider supersymmetric (SUSY) models wherein the strong CP problem is solved by the Peccei-Quinn (PQ) mechanism with a concommitant axion/axino supermultiplet. We examine R-parity conserving models where the neutralino is the lightest SUSY particle, so that a mixture of neutralinos and axions serve as cold dark matter. The mixed axion/neutralino CDM scenario can match the measured dark matter abundance for SUSY models which typically give too low a value of the usual thermal neutralino abundance, such as models with wino-like or higgsino-like dark matter. The usual thermal neutralino abundance can be greatly enhanced by the decay of thermally-produced axinos to neutralinos, followed by neutralino re-annihilation at temperatures much lower than freeze-out. In this case, the relic density is usually neutralino dominated, and goes as \\sim (f_a/N)/m_{axino}^{3/2}. If axino decay occurs before neutralino freeze-out, then instead the neutralino abundance can be augmented by relic axions to match the measured abundance. Entropy production from late-time axino decays can diminish the axion abundance, but ultimately not the neutralino abundance. In mixed axion/neutralino CDM models, it may be possible to detect both a WIMP and an axion as dark matter relics. We also discuss possible modifications of our results due to production and decay of saxions. In the appendices, we present expressions for the Hubble expansion rate and the axion and neutralino relic densities in radiation, matter and decaying-particle dominated universes. △ Less", "Constraints on dark matter from the first CMS and ATLAS SUSY searches are investigated. It is shown that within the minimal supergravity model, the early search for supersymmetry at the LHC has depleted a large portion of the signature space in dark matter direct detection experiments. In particular, the prospects for detecting signals of dark matter in the XENON and CDMS experiments are significantly affected in the low neutralino mass region. Here the relic density of dark matter typically arises from slepton coannihilations in the early universe. In contrast, it is found that the CMS and ATLAS analyses leave untouched the Higgs pole and the Hyperbolic Branch/Focus Point regions, which are now being probed by the most recent XENON results. Analysis is also done for supergravity models with non-universal soft breaking where one finds that a part of the dark matter signature space depleted by the CMS and ATLAS cuts in the minimal SUGRA case is repopulated. Thus, observation of dark matter in the LHC depleted region of minimal supergravity may indicate non-universalities in soft breaking. △ Less", "We analyze neutral Higgs boson decays into squark pairs in the minimal supersymmetric extension of the Standard Model and improve previous analyses. In particular the treatment of potentially large higher-order corrections due to the soft SUSY breaking parameters A_b, the trilinear Higgs coupling to sbottoms, and mu, the Higgsino mass parameter, is investigated. The remaining theoretical uncertainties including the SUSY-QCD corrections are analyzed quantitatively. △ Less", "The Minimal Supersymmetric Extension of the Standard Model (MSSM) is a well motivated theoretical framework, which contains an extended Higgs sector, including a light Higgs with Standard Model-like properties in most of the parameter space. Due to the large QCD background, searches for such a Higgs, decaying into a pair of bottom quarks, is very challenging at the LHC. It has been long realized that the situation may be ameliorated by searching for Higgs bosons in supersymmetric decay chains. Moreover, it has been recently suggested that the bobber decay channel may be observed in standard production channels by selecting boosted Higgs bosons, which may be easily identified from the QCD background. Such boosted Higgs bosons are frequent in the MSSM, since they are produced from decays of heavy colored supersymmetric particles. Previous works have emphasized the possibility of observing boosted Higgs bosons in the light higgsino region. In this work, we study the same question in the regions of parameter space consistent with a neutralino dark matter relic density, analyzing its dependence on the non-standard Higgs boson, slepton and squark masses, as well as on the condition of gaugino mass unification. In general, we conclude that, provided sleptons are heavier than the second lightest neutralinos, the presence of boosted Higgs is a common MSSM feature, implying excellent prospects for observation of the light MSSM Higgs boson in the near future. △ Less", "The lightest supersymmetric particle (LSP) is a natural candidate for the cold dark matter of the universe. In this Letter we discuss how to test the mechanism responsible for the LSP stability at the LHC. We note that if R-parity is conserved dynamically one should expect a Higgs boson which decays mainly into two right-handed neutrinos (a \"leptonic\" Higgs) or into two sfermions. The first case could exhibit spectacular lepton number violating signals with four secondary vertices due to the long-lived nature of right-handed neutrinos. These signals, together with the standard channels for the discovery of SUSY, could help to establish the underlying theory at the TeV scale. △ Less", "Our model \\cite{ownmMPP}\\cite{SIMPP} with complex action in a functional integral formulation with path integrals extending over all times, past and future, is reviewed. Several numerical relations between coupling constants are presented as supporting evidence. The new evidence is that some more unexplained coincidences are explained in our model: 1) The \"scale problem\" is solved because the Higgs field expectation value is predicted to be very small compared to say some fundamental scale, that might be the Planck scale. 2) The Higgs VEV need not, however, to be just zero, but rather is predicted to be so that the running top-Yukawa coupling just is about to be unity at this scale; in this way the (weak) scale easily becomes \"exponentially small\". Instead of the top-Yukawa we should rather say the highest flavour Yukawa coupling here. These predictions are only achieved by allowing the principle of minimization of the imaginary part of the action SI(history) to to a certain extent adjust some coupling constants in addition to the initial conditions. If Susy-partners are not found in LHC, it would strengthen the need for \"solution\" of the hierarchy or rather scale problem along the lines of the present article. △ Less", "We consider a scenario where supersymmetry (SUSY) is broken at a relatively low scale by modular fields of extra compact spacelike dimensions. The effect of both soft and hard SUSY breaking terms on the mass of the lightest neutral Higgs boson are investigated. An important conclusion is that the lightest neutral Higgs can be considerably more massive than what is expected in the MSSM, if the overseeing theory breaks SUSY at a scale not too far above a TeV. An explicit model that implements this has been shown for illustration. △ Less", "After a brief review of the motivations for grand unification, I discuss the main challenges facing realistic SUSY GUT model building. Achieving doublet-triplet splitting without fine--tuning is chief among them. Symmetry breaking should occur consistently without unwanted Goldston bosons, μ-term of order TeV for the MSSM Higgs fileds should emerge naturally, and realistic fermion masses with small quark mixing angles and large lepton mixing angles should be generated with some predictivity. Significant progress has been made over the years towards achieving these goals in the context of supersymmetric SO(10) GUT. A complete SO(10) model is presented along this line wherein, somewhat surprisingly, the GUT scale threshold corrections to the gauge couplings are found to be small. This results in a predictive scenario for proton lifetime. An interesting correlation between the d=6 (p\\to e^+π^0) and d=5 (p\\to ν-bar K^+) decay amplitudes is observed. This class of models predicts that both proton decay modes should be observable with an improvement in the current sensitivity by about a factor of five to ten. △ Less", "Anomaly mediation is a popular and well motivated supersymmetry breaking scenario. Different possible detailed realisations of this set-up are studied and actively searched for at colliders. Apart from limits coming from flavour, low energy physics and direct collider searches, these models are usually constrained by the requirement of reproducing the observations on dark matter density in the universe. We reanalyse these bounds and in particular we focus on the dark matter bounds both considering the standard cosmological model and alternative cosmological scenarios. These scenarios do not change the observable cosmology but relic dark matter density bounds strongly depend on them. We consider few benchmark points excluded by standard cosmology dark matter bounds and suggest that loosening the dark matter constraints is necessary in order to avoid a too strong (cosmological) model dependence in the limits that are obtained for these models. We also discuss briefly the implications for phenomenology and in particular at the Large Hadron Collider. △ Less", "We consider the possibility of several different mechanisms contributing to the $\\betabeta$-decay amplitude in the general case of CP nonconservation: light Majorana neutrino exchange, heavy left-handed (LH) and heavy right-handed (RH) Majorana neutrino exchanges, lepton charge non-conserving couplings in SUSY theories with R-parity breaking. If the $\\betabeta$-decay is induced by, e.g., two \"non-interfering\" mechanisms, one can determine $|η_i|^2$ and $|η_j|^2$, $η_i$ and $η_j$ being the two fundamental parameters characterising these mechanisms, from data on the half-lives of two nuclear isotopes. In the case when two \"interfering\" mechanisms are responsible for the $\\betabeta$-decay, $|η_i|^2$ and $|η_j|^2$ and the interference term can be uniquely determined, in principle, from data on the half-lives of three nuclei. Given the half-life of one isotope, the \"positivity conditions\" $|η_i|^2\\geq 0$ and $|η_j|^2\\geq 0$ lead to stringent constraints on the half-lives of the other $\\betabeta$-decaying isotopes. These conditions, as well as the conditions for constructive (destructive) interference are derived and their implications are analysed in two specific cases. The method considered by us can be generalised to the case of more than two $\\betabeta$-decay mechanisms. It allows to treat the cases of CP conserving and CP nonconserving couplings generating the $\\betabeta$-decay in a unique way. △ Less", "In N=1 supergravity supersymmetric (SUSY) and non-supersymmetric Minkowski vacua originating in the hidden sector can be degenerate. In the supersymmetric phase in flat Minkowski space non-perturbative supersymmetry breakdown may take place in the observable sector, inducing a non-zero and positive vacuum energy density. Assuming that such a supersymmetric phase and the phase in which we live are degenerate, we estimate the value of the cosmological constant. We argue that the observed value of the dark energy density can be reproduced in the Split-SUSY scenario of the supersymmetry breaking if the SUSY breaking scale is of order of 10^{10} GeV. △ Less", "The electroweak (EW) symmetry breaking in the simplest supersymmetric (SUSY) extensions of the standard model (SM), i.e. minimal and next-to-minimal supersymmetric standard models (MSSM and NMSSM), is considered. The spectrum of the Higgs particles, upper bound on the mass of the lightest Higgs boson and little hierarchy problem are discussed. The breakdown of gauge symmetry and Higgs phenomenology within the E6 inspired SUSY models with extra U(1)' factor are briefly reviewed. △ Less", "Lepton flavour violation and neutrino masses are a signal for new Physics beyond the Standard Model and are deeply related. The minimal extension of the Standard Model to make it include neutrino masses is not satisfactory from a conceptual point of view, since it requires a severe fine-tuning of Yukawa couplings. See-saw models provide a consistent and natural mechanism to generate neutrino masses and require Physics beyond the Standard Model. In this thesis, the connections between models for neutrino masses and processes that violate lepton flavour are explored. The reconstruction of high energy parameters from neutrino data is partially possible within the framework of these see-saw models and it is enhanced by the knowledge of phenomena outside the neutrino sector, as it is the case of lepton number violation processes. Grand Unification SUSY models offer a consistent theoretical framework for Type I, Type II and Type III see-saw models. On the other hand, Type II see-saw has the attractive feature of producing a lepton asymmetry through triplet decays which can be converted into a baryon asymmetry with leptogenesis. Thus being, we studied a model to explain the baryonic density of the Universe constrained by the phenomenological neutrino data. △ Less", "The kink signature of charged tracks is predicted in some SUSY models, and it is very characteristic signal at collider experiments. We study the kink signature at LHC using two models, SUSY models with a gravitino LSP and a stau NLSP, and R-parity violating SUSY models with a stau (N)LSP. We find that a large number of kink events can be discovered in a wide range of the SUSY parameters, when the decay length is O(10-10^5)mm. Model discrimination by identifying the daughter particles of the kink tracks is also discussed. △ Less", "We investigate the model independent nature of the Supersymmetry search strategies at the 7 TeV LHC. To this end, we study the missing-transverse-energy-based searches developed by the ATLAS Collaboration that were essentially designed for mSUGRA. We simulate the signals for ~71k models in the 19-dimensional parameter space of the pMSSM. These models have been found to satisfy existing experimental and theoretical constraints and provide insight into general features of the MSSM without reference to a particular SUSY breaking scenario or any other assumptions at the GUT scale. Using backgrounds generated by ATLAS, we find that imprecise knowledge of these estimated backgrounds is a limiting factor in the potential discovery of these models and that some channels become systematics-limited at larger luminosities. As this systematic error is varied between 20-100%, roughly half to 90% of this model sample is observable with significance S>5 for 1 fb^{-1} of integrated luminosity. We then examine the model characteristics for the cases which cannot be discovered and find several contributing factors. We find that a blanket statement that squarks and gluinos are excluded with masses below a specific value cannot be made. We next explore possible modifications to the kinematic cuts in these analyses that may improve the pMSSM model coverage. Lastly, we examine the implications of a null search at the 7 TeV LHC in terms of the degree of fine-tuning that would be present in this model set and for sparticle production at the 500 GeV and 1 TeV Linear Collider. △ Less", "We observe that a recently proposed supersymmetric model with Q6 flavor symmetry admits a new CP violating ground state. A new sum rule for the quark mixing parameters emerges, which is found to be consistent with data. Simple extensions of the model to the neutrino sector suggest an inverted hierarchical mass spectrum with nearly maximal CP violation (|delta_{MNS}| simeq pi/2). Besides reducing the number of parameters in the fermion sector, these models also provide solutions to the SUSY flavor problem and the SUSY CP problem. We construct a renormalizable scalar potential that leads to the spontaneous breaking of CP symmetry and the family symmetry. △ Less", "Supersymmetric collider phenomenology depends crucially on whether the lightest observable-sector supersymmetric particle (LOSP) decays, and if so, what the LOSP decay products are. For instance, in SUSY models where the gravitino is lighter than the LOSP, the LOSP decays to its superpartner and a longitudinal gravitino via supercurrent couplings. In this paper, we show that LOSP decays can be substantially modified when there are multiple sectors that break supersymmetry, where in addition to the gravitino there are light uneaten goldstini. As a particularly striking example, a bino-like LOSP can have a near 100% branching fraction to a higgs boson and an uneaten goldstino, even if the LOSP has negligible higgsino fraction. This occurs because the uneaten goldstino is unconstrained by the supercurrent, allowing additional operators to mediate LOSP decay. These operators can be enhanced in the presence of an R symmetry, leading to copious boosted higgs production in SUSY cascade decays. △ Less", "The CMS and the ATLAS Collaborations have recently reported on the search for supersymmetry with 35 pb$^{-1}$ of data and have put independent limits on the parameter space of the supergravity unified model with universal boundary conditions at the GUT scale for soft breaking, i.e., the mSUGRA model. We extend this study by examining other regions of the mSUGRA parameter space in $A_0$ and $\\tanβ$. Further, we contrast the reach of CMS and ATLAS with 35 pb$^{-1}$ of data with the indirect constraints, i.e., the constraints from the Higgs boson mass limits, from flavor physics and from the dark matter limits from WMAP. Specifically it is found that a significant part of the parameter space excluded by CMS and ATLAS is essentially already excluded by the indirect constraints and the fertile region of parameter space has yet to be explored. We also emphasize that gluino masses as low as 400 GeV but for squark masses much larger than the gluino mass remain unconstrained and further that much of the hyperbolic branch of radiative electroweak symmetry breaking, with low values of the Higgs mixing parameter $μ$, is essentially untouched by the recent LHC analysis. △ Less", "On the basis of frequentist analyses of experimental constraints from electroweak precision data, (g-2)_mu, B-physics and cosmological data, we predict the masses of Higgs bosons and SUSY particles of the CMSSM, NUHM1, VCMSSM and mSUGRA. In the CMSSM, NUHM1 and VCMSSM we find preferences for sparticle masses that are relatively light, leading to good prospects for the LHC and the ILC. Including first data from SUSY searches at the LHC leads to an increase of the preferred sparticle mass scales, but improves the consistency of the model predictions for M_h with the LEP exclusion bounds. △ Less", "In the GmSUGRA scenario with the high-dimensional operators containing the GUT Higgs fields, we systematically studied the supersymmetry breaking scalar masses, SM fermion Yukawa coupling terms, and trilinear soft terms in the E_6 SUSY GUT model where the gauge symmetry is broken down to the SO(10)\\tm U(1) gauge symmetry, SU(3)_C\\times SU(3)_L \\times SU(3)_R gauge symmetry, SU(6)\\times SU(2)_a (a={\\rm L,R,X}) gauge symmetry, flipped SU(5) gauge symmetry etc. In addition, we considered the scalar and gaugino mass relations, which can be preserved from the GUT scale to the electroweak scale under one-loop RGE running, in the SU(3)_C\\times SU(3)_L \\times SU(3)_R model arising from the E_6 model. With such relations, we may distinguish the mSUGRA and GmSUGRA scenarios if we can measure the supersymmetric particle spectrum at the LHC and ILC. △ Less", "We propose a new way to determine the squark mass based on the shape of di-jet invariant mass distribution of supersymmetry (SUSY) di-jet events at the Large Hadron Collider (LHC). Our algorithm, which is based on event kinematics, requires that the branching ratio $B(\\tilde{q} \\rightarrow q \\tilde{z}_1)$ is substantial for at least some types of squarks, and that $m_{\\tilde{z}_1}^2/m_{\\tilde{q}}^2 \\ll 1$. We select di-jet events with no isolated leptons, and impose cuts on the total jet transverse energy, $E_T^{tot}=E_T(j_1)+E_T(j_2)$, on $α= E_T(j_2)/m_{jj}$, and on the azimuthal angle between the two jets to reduce SM backgrounds. The shape of the resulting di-jet mass distribution depends sensitively on the squark mass, especially if the integrated luminosity is sufficient to allow a hard enough cut on $E_T^{tot}$ and yet leave a large enough signal to obtain the $m_{jj}$ distribution. We simulate the signal and Standard Model (SM) backgrounds for 100 fb$^{-1}$ integrated luminosity at 14 TeV requiring $E_T^{tot}> 700$ GeV. We show that it should be possible to extract $m_{\\tilde{q}}$ to within about 3% at 95% CL --- similar to the precision obtained using $m_{T2}$ --- from the di-jet mass distribution if $m_{\\tilde{q}} \\sim 650$ GeV, or to within $\\sim 5$% if $m_{\\tilde{q}}\\sim 1$ TeV. △ Less", "In this talk we briefly review the current CDMS/XENON constraints on the neutralino dark matter in three popular supersymmetric models: the minimal (MSSM), the next-to-minimal (NMSSM) and the nearly minimal (nMSSM). The constraints from the dark matter relic density and various collider experiments are also taken into account. The conclusion is that for each model the current CDMS/XENON limits can readily exclude a large part of the parameter space allowed by other constraints and the future SuperCDMS or XENON100 can cover most of the allowed parameter space. The implication for the Higgs search at the LHC is also discussed. It is found that in the currently allowed parameter space the MSSM charged Higgs boson is quite unlikely to be discovered at the LHC while the neutral Higgs bosons $H$ and $A$ may be accessible at the LHC in the parameter space with a large $μ$ parameter. △ Less", "We present an on-shell formalism for superamplitudes of pure N<4 super Yang-Mills theory. Two superfields, Phi and Phi^+, are required to describe the two CPT conjugate supermultiplets. Simple truncation prescriptions allow us to derive explicit tree-level MHV and NMHV superamplitudes with N-fold SUSY. Any N=0,1,2 tree superamplitudes have large-z falloffs under super-BCFW shifts, except under [Phi,Phi^+>-shifts. We show that this `bad' shift is responsible for the bubble contributions to 1-loop amplitudes in N=0,1,2 SYM. We evaluate the MHV bubble coefficients in a manifestly supersymmetric form and demonstrate for the case of four external particles that the sum of bubble coefficients is equal to minus the tree superamplitude times the 1-loop beta-function coefficient. The connection to the beta-function is expected since only bubble integrals capture UV divergences; we discuss briefly how the minus sign arises from UV and IR divergences in dimensional regularization. Other applications of the on-shell formalism include a solution to the N^{K}MHV N=1 SUSY Ward identities and a clear description of the connection between 6d superamplitudes and the 4d ones for both N=4 and N=2 SYM. We outline extensions to N<8 supergravity. △ Less", "In the model of gauge mediation of SUSY breaking in the presence of tree-level mediation, the Froggatt-Nielsen mechanism provides a different hierarchy of sparticle masses. We study the spectra and show the results to be like those in an effective supersymmetric model. △ Less", "We suggest new setup where SUSY breaking spurion F-term possesses lepton number. This setup not only modifies sparticle mass spectra but also realizes several new models, where neutrino mass is naturally induced through radiative corrections. We here suggest two new models; the first one is (i): pseudo-Dirac/Schizophrenic neutrino model, and the second one is (ii): pure Majorana neutrino model. We will also show this setup can naturally apply to the supersymmetric Zee-Babu model. △ Less", "We consider two SUSY-breaking hidden sectors which decouple when their respective couplings to the visible particles are switched off. In such a scenario one expects to find two light fermions: the Goldstino and the pseudo-Goldstino. While the former remains massless in the rigid limit, the latter becomes massive due to radiative effects which we analyze from several different points of view. This analysis is greatly facilitated by a version of the Goldberger-Treiman relation, which allows us to write a universal non-perturbative formula for the mass. We carry out the analysis in detail in the context of gauge mediation, where we find that the pseudo-Goldstino mass is at least around the GeV scale and can be easily at the electroweak range, even in low scale models. This leads to interesting and unconventional possibilities in collider physics and it also has potential applications in cosmology. △ Less", "We design a supersymmetric SU (5) GUT model using Δ(54), a finite non-abelian subgroup of SU (3)f . Heavy right handed neutrinos are introduced which transform as three-dimensional repre-sentation of our chosen family group. The model successfully reproduces the mass hierarchical mass structures of the Standard Model, and the CKM mixing matrix. It then provides predictions for the light neutrino with a normal hierarchy and masses such that mν,1 \\approx 5\\times10-3 eV, mν, 2 \\approx 1\\times 10-2 eV, and mν,3 \\approx 5 \\times 10-2 eV. We also provide predictions for masses of the heavy neutrinos, and correc- tions to the tri-bimaximal matrix that fit within experimental limits, e.g. a reactor angle of -7.31o. A simple modification to our model is introduced at the end and is shown to also produce predictions that fall well within those limits. △ Less", "We analyze CP violation in supersymmetry with Effective Minimal Flavour Violation, as recently proposed in arXiv:1011.0730. Unlike the case of standard Minimal Flavour Violation, we show that all the phases allowed by the flavour symmetry can be sizable without violating existing Electric Dipole Moment constraints, thus solving the SUSY CP problem. The EDMs at one and two loops are precisely analyzed as well as their correlations with the expected CP asymmetries in B physics. △ Less", "The LHC, with its seven-fold increase in energy over the Tevatron, is capable of probing regions of SUSY parameter space exhibiting qualitatively new collider phenomenology. Here we investigate one such region in which first generation squarks are very heavy compared to the other superpartners. We find that the production of these squarks, which is dominantly associative, only becomes rate-limited at mSquark > 4(5) TeV for L~10(100) fb-1. However, discovery of this scenario is complicated because heavy squarks decay primarily into a jet and boosted gluino, yielding a dijet-like topology with missing energy (MET) pointing along the direction of the second hardest jet. The result is that many signal events are removed by standard jet/MET anti-alignment cuts designed to guard against jet mismeasurement errors. We suggest replacing these anti-alignment cuts with a measurement of jet substructure that can significantly extend the reach of this channel while still removing much of the background. We study a selection of benchmark points in detail, demonstrating that mSquark= 4(5) TeV first generation squarks can be discovered at the LHC with L~10(100)fb-1. △ Less", "We study the conditions for successful Affleck-Dine baryogenesis and the origin of gravitino dark matter in GMSB models. AD baryogenesis in GMSB models is ruled out by neutron star stability unless Q-balls are unstable and decay before nucleosynthesis. Unstable Q-balls can form if the messenger mass scale is larger than the flat-direction field Phi when the condensate fragments. We provide an example based on AD baryogenesis along a d = 6 flat direction for the case where m_{3/2} \\approx 2 GeV, as predicted by gravitino dark matter from Q-ball decay. Using a phenomenological GMSB potential which models the Phi dependence of the SUSY breaking terms, we numerically solve for the evolution of Phi and show that the messenger mass can be sufficiently close to the flat-direction field when the condensate fragments. We compute the corresponding reheating temperature and the baryonic charge of the condensate fragments and show that the charge is large enough to produce late-decaying Q-balls which can be the origin of gravitino dark matter. △ Less", "In this article we investigate the influence of nuclear effects in the production of gluinos in nuclear collisions at the LHC, and estimate the transverse momentum dependence of the nuclear ratios $R_{pA} = {\\frac{dσ(pA)}{dy d^2 p_T}} / A {\\frac{dσ(pp)}{dy d^2 p_T}}$ and $R_{AA} = {\\frac{dσ(AA)}{dy d^2 p_T}} / A^2 {\\frac{dσ(pp)}{dy d^2 p_T}}$. We demonstrate that depending on the magnitude of the nuclear effects, the production of gluinos could be enhanced, compared to proton-proton collisions. The study of these observables can be useful to determine the magnitude of the shadowing and antishadowing effects in the nuclear gluon distribution. Moreover, we test different SPS scenarios, corresponding to different soft SUSY breaking mechanisms, and find that the nuclear ratios are strongly dependent on that choice. △ Less", "The requirement that SUSY should solve the hierarchy problem without undue fine-tuning imposes severe constraints on the new supersymmetric states. With the MSSM spectrum and soft SUSY breaking originating from universal scalar and gaugino masses at the Grand Unification scale, we show that the low-fine-tuned regions fall into two classes that will require complementary collider and dark matter searches to explore in the near future. The first class has relatively light gluinos or squarks which should be found by the LHC in its first run. We identify the multijet plus E_T^miss signal as the optimal channel and determine the discovery potential in the first run. The second class has heavier gluinos and squarks but the LSP has a significant Higgsino component and should be seen by the next generation of direct dark matter detection experiments. The combined information from the 7 TeV LHC run and the next generation of direct detection experiments can test almost all of the CMSSM parameter space consistent with dark matter and EW constraints, corresponding to a fine-tuning not worse than 1:100. To cover the complete low-fine-tuned region by SUSY searches at the LHC will require running at the full 14 TeV CM energy; in addition it may be tested indirectly by Higgs searches covering the mass range below 120 GeV. △ Less", "We study a supersymmetric SU(5) model with the extra Higgs multiplets of 45+\\bar 45. The unification of the gauge couplings, the fermion masses and the proton lifetime are discussed in details. The dimension-five operators mediated by different colored Higgs sector can be destructive with each other. This effect serves a way of solving the longevity of proton. We analytically analyze this destructive effect in a special limit where the mixing between the 5- and 45-plets is small. Although the theory does not hold in this special limit, it is a revelatory starting point. We can relax this limit and retain the destructive effect. In a generalized parameter space, this model is in accord with experimental results. △ Less", "Given that it will take quite some time for the Large Hadron Collider (LHC) to reach its desired luminosity, it is important to investigate the most favorable scenario in which supersymmetry (SUSY) may be discovered at the early runs at the LHC. Our aim in this work is to find such a scenario within the gravity mediated SUSY breaking (SUGRA) framework and select a class of final states that warrant a discovery at the very early runs of the LHC. It turns out that such a situation can be associated with a scenario where gluinos are sufficiently light and so are the third generation scalars while the first two family scalars are heavy. We find that this can be achieved from a high-scale set-up with scalar mass non-universality in the third family and gaugino mass non-universality with $M_3 < M_1, M_2$. We show that the final state channels which are most favorable in such a region of parameter space are $4b+{E_{T}}\\!\\!\\!\\!/$, $4b+\\ell+{E_{T}}\\!\\!\\!\\!/$ and $2b+2\\ell+{E_{T}}\\!\\!\\!\\!/$. We also justify our claim by comparing the results with a minimal supergravity (mSUGRA) scenario with similar gluino mass. △ Less", "Statistical inference of the fundamental parameters of supersymmetric theories is a challenging and active endeavor. Several sophisticated algorithms have been employed to this end. While Markov-Chain Monte Carlo (MCMC) and nested sampling techniques are geared towards Bayesian inference, they have also been used to estimate frequentist confidence intervals based on the profile likelihood ratio. We investigate the performance and appropriate configuration of MultiNest, a nested sampling based algorithm, when used for profile likelihood-based analyses both on toy models and on the parameter space of the Constrained MSSM. We find that while the standard configuration is appropriate for an accurate reconstruction of the Bayesian posterior, the profile likelihood is poorly approximated. We identify a more appropriate MultiNest configuration for profile likelihood analyses, which gives an excellent exploration of the profile likelihood (albeit at a larger computational cost), including the identification of the global maximum likelihood value. We conclude that with the appropriate configuration MultiNest is a suitable tool for profile likelihood studies, indicating previous claims to the contrary are not well founded. △ Less", "We analyze the supersymmetric contributions to the direct CP asymmetries of the decays $B \\to πK^*$ and $B\\toρK$ within Soft Collinear Effective Theory. We extend the Standard Model analysis of these asymmetries to include the next leading order QCD corrections. We find that, even with QCD correction, the Standard Model predictions can not accommodate the direct CP asymmetries in these decay modes. Using Mass Insertion Approach, we show that non-minimal flavor SUSY contributions mediated by gluino exchange can enhance the CP asymmetries significantly and thus can accommodate the experimental results. △ Less", "The goal of the present review article is to describe the ingredients necessary to find the Standard Model in the string landscape. △ Less", "Supersymmetric mass spectra within two variants of the seesaw mechanism, commonly known as type-II and type-III seesaw, are calculated using full 2-loop RGEs and minimal Supergravity boundary conditions. The type-II seesaw is realized using one pair of 15 and $\\bar{15}$ superfields, while the type-III is realized using three copies of $24_M$ superfields. Using published, estimated errors on SUSY mass observables attainable at the LHC and in a combined LHC+ILC analysis, we calculate expected errors for the parameters of the models, most notably the seesaw scale. If SUSY particles are within the reach of the ILC, pure mSugra can be distinguished from mSugra plus type-II or type-III seesaw for nearly all relevant values of the seesaw scale. Even in the case when only the much less accurate LHC measurements are used, we find that indications for the seesaw can be found in favourable parts of the parameter space. Since our conclusions crucially depend on the reliability of the theoretically forecasted error bars, we discuss in some detail the accuracies which need to be achieved for the most important LHC and ILC observables before an analysis, such as the one presented here, can find any hints for type-II or type-III seesaw in SUSY spectra. △ Less", "We calculate the weak scale MSSM spectrum starting from a heterotic string theory compactified on an anisotropic orbifold. Supersymmetry breaking is mediated by vector-like exotics that arise naturally in heterotic string theories. The messengers that mediate SUSY breaking come in incomplete GUT multiplets and give rise to non-universal gaugino masses at the GUT scale. Models with non-universal gaugino masses at the GUT scale have the attractive feature of allowing for precision gauge coupling unification at the GUT scale with negligible contributions from threshold corrections near the unification scale. The unique features of the MSSM spectrum are light gluinos and also large mass differences between the lightest and the next-to-lightest neutralinos and charginos which could lead to interesting signatures at the colliders. △ Less", "In recent years many models of supersymmetry have implied a large production rate for events including a high multiplicity of third generation quarks, such as four top quarks. It is arguably the best-motivated channel for early LHC discovery. A particular example is generic string theories compactified to four dimensions with stabilized moduli which typically have multi-TeV squarks and lighter gluinos (below a TeV) with a large pair production rate and large branching ratios to four tops. We update and sharpen the analysis 4-top signals and background to 7 TeV LHC energy. For 1 fb-1 integrated luminosity, gluinos up to about 650 GeV in mass can be detected, with larger masses accessible for higher luminosities or at higher energies. More than one signature is likely to be accessible, with one charged lepton plus two or more b-jets, and/or same-sign dileptons plus b-jets being the best channels. A non-Standard Model signal from counting is robust, and provides information on the gluino mass, cross section, and spin. △ Less", "If low-energy supersymmetry is the solution to the hierarchy problem, it is a puzzle why supersymmetric particles have not been observed experimentally to date. We show that supersymmetric particles in the TeV region can be explained if the fundamental cut-off scale of the theory is smaller than the 4-dimensional Planck scale and if thermal leptogenesis is the source of the observed baryon asymmetry. The supersymmetric particles such as sfermions and gauginos are predicted to be in the TeV region, while the gravitino is the LSP with mass of O(100)GeV and is a good candidate for dark matter. Interestingly, the cosmological moduli problem can be solved in the theory with the low cut-off scale. △ Less", "The production of new particles at a hadron collider like the LHC is always accompanied by QCD radiation attributable to the initial state (i.e. ISR). This tends to complicate analyses, so ISR is normally regarded as a nuisance. Nevertheless, we show that ISR can also be valuable, yielding information that can help in the discovery and interpretation of physics beyond the Standard Model. To access this information we will introduce new techniques designed to identify ISR jets on an event-by-event basis, a process we term ISR tagging. As a demonstration of their utility, we will apply these techniques to SUSY di-squark (di-gluino) production to show that they can be used to identify ISR jets in roughly 40% (15%) of the events, with a mistag rate of around 10% (15%). We then show that, through the application of a new method which we will introduce, knowledge of an ISR jet allows us to infer the squark (gluino) mass to within roughly 20% of its true value. △ Less", "In the scenario where only superpartners were produced at the Large Hadron Collider, how one could determine whether the supersymmetric model pointed out is 4-dimensional or higher-dimensional ? We propose and develop a series of tests for discriminating between a pure supersymmetry (SUSY) and a SUSY realized within the well-motivated warped geometry a la Randall-Sundrum (RS). Two of these tests make use of some different patterns arising in the squark/slepton mass spectrum. The other distinctive RS SUSY feature is the possibly larger (even dominant) Higgs boson decay branching ratios into sleptons, compared to pure SUSY. Techniques for pinning up the presence of soft SUSY breaking terms on the TeV-brane are also suggested, based on the analysis of stop pair production at the International Linear Collider. For all these phenomenological studies, we had first to derive the 4-dimensional (4D) effective couplings and mass matrices of the sfermions and Higgs bosons in RS SUSY. The localization of Higgs bosons, characteristic of RS, leads to singularities in their couplings which are regularized by the exchange contribution of infinite towers of Kaluza-Klein (KK) scalar modes with Dirichlet-Dirichlet boundary conditions. A general method is provided for this regularization, based on the completeness relation. The sfermion masses are obtained either from integrating out those specific KK towers or by treating their mixing effects. Finally, we show at the one-loop level how all quadratic divergences in the Higgs mass cancel out for any cut-off, due to 5D SUSY and to 5D anomaly cancellation; the analytical way followed here also allows a justification of the infinite KK summation required for the so-called KK regularization in 5D SUSY, which has motivated a rich literature. △ Less", "The Exceptional Supersymmetric (SUSY) Standard Model predicts three families of Higgs doublets plus three Higgs singlets, where one family develops vacuum expectation values (VEVs), while the remaining two which do not are called Inert. The model can account for the dark matter relic abundance if the two lightest Inert neutralinos, identified as the (next-to) lightest SUSY particles ((N)LSPs), have masses close to half the Z mass. In this case we find that the usual SM-like Higgs boson decays more than 95% of the time into either LSPs or NLSPs. The latter case produces a final state containing two leptons l^{+}l^{-} with an invariant mass less than or about 10 GeV. We illustrate this scenario with a set of benchmark points satisfying phenomenological constraints and the WMAP dark matter relic abundance. This scenario also predicts other light Inert chargino and neutralino states below 200 GeV, and large LSP direct detection cross-sections close to current limits and observable soon at XENON100. △ Less", "HFOLD (Higgs Full One Loop Decays) is a Fortran program package for calculating all MSSM Higgs two-body decay widths and the corresponding branching ratios at full one-loop level. The package is done in the SUSY Parameter Analysis convention and supports the SUSY Les Houches Accord input and output format. △ Less", "We propose semi-direct Gauge-Yukawa mediation of supersymmetry (SUSY) breaking. The messenger fields mediating SUSY breaking to the visible sector do not directly couple with the goldstino field, and instead they have gauge and Yukawa interactions with some primary messenger fields which couple directly with the goldstino fields. From the explicit Feynman diagram calculations for the SUSY breaking soft masses, we find that the SUSY particle spectra can be realistic. Especially, this generalization of semi-direct gauge mediation solves the massless gaugino mass problem since the holomorphic soft mass terms of the messenger fields can be generated by Yukawa couplings. We also provide some arguments that this scenario can be realized naturally in some dynamical SUSY-breaking models such as the ISS-like model. △ Less", "A successful implementation of thermal leptogenesis requires the re-heat temperature after inflation T_R to exceed ~2\\times 10^9 GeV. Such a high T_R value typically leads to an overproduction of gravitinos in the early universe, which will cause conflicts, mainly with BBN constraints. Asaka and Yanagida (AY) have proposed that these two issues can be reconciled in the context of the Peccei-Quinn augmented MSSM (PQMSSM) if one adopts a mass hierarchy m(sparticle)>m(gravitino)>m(axino), with m(axino) keV. We calculate the relic abundance of mixed axion/axino dark matter in the AY scenario, and investigate under what conditions a value of T_R sufficient for thermal leptogenesis can be generated. A high value of PQ breaking scale f_a is needed to suppress overproduction of axinos, while a small vacuum misalignment angle θ_i is needed to suppress overproduction of axions. The large value of f_a results in late decaying neutralinos. To avoid BBN constraints, the AY scenario requires a low thermal abundance of neutralinos and high values of neutralino mass. We include entropy production from late decaying saxions, and find the saxion needs to be typically at least several times heavier than the gravitino. A viable AY scenario suggests that LHC should discover a spectrum of SUSY particles consistent with weak scale supergravity; that the apparent neutralino abundance is low; that a possible axion detection signal (probably with m_axion in the sub-micro-eV range) should occur, but no direct or indirect signals for WIMP dark matter should be observed. △ Less", "We study a modified version of a $U(1)_{B-L}$ gauged MSSM that was recently shown to produce a new source of leptogenesis through the CP asymmetry of sneutrinos and antisneutrinos (K.S. Babu, Y. Meng, Z. Tavartkiladze, Phys Lett B681:37 (2009)). By taking all superpotential terms and couplings between the MSSM Higgs and $B-L$ scalar sectors into account we find that the model allows a large enough CP violation to explain the observed baryon number to entropy ratio. Monte Carlo analysis shows that a large amount of CP violation can be produced in the decays of the $B-L$ Higgs bosons and that there are two dominating channels that drive CP violation. △ Less", "We discuss the thermal evolution of the spurion and messenger fields of ordinary gauge mediation models taking into account the Standard Model degrees of freedom. It is shown that for thermalized messengers the metastable susy breaking vacuum becomes thermally selected provided that the susy breaking sector is sufficiently weakly coupled to messengers or to any other observable field. △ Less", "We have explored the question of whether the renormalization group running of the neutrino mixing parameters in the Minimal Supersymmetric Standard Model is detectable with ultra-high energy neutrinos from active galactic nuclei (AGN). We use as observables the ratios of neutrino fluxes produced at the AGN, focusing on four different neutrino production models: $(Φ_{ν_e+\\barν_e}^0 : Φ_{ν_μ+\\barν_μ}^0 : Φ_{ν_τ+\\barν_τ}^0)$ = (1:2:0), (0:1:0), (1:0:0), and (1:1:0). The prospects for observing deviations experimentally are taken into consideration, and we find out that it is necessary to impose a cut-off on the transferred momentum of $Q^2 \\geq 10^7$ GeV$^2$. However, this condition, together with the expected low value of the diffuse AGN neutrino flux, yields a negligible event rate at a km-scale Cherenkov detector such as IceCube. △ Less", "We discuss slepton mass matrices in the $S_4$ flavor model with SUSY SU(5) GUT. By considering the gravity mediation within the framework of supergravity theory, we estimate the SUSY breaking terms in the slepton mass matrices, which contribute to the $μ\\rightarrow e + γ$ decay. We obtain a lower bound for the ratio of $μ\\rightarrow eγ$ as $10^{-13}$ if $m_{\\text{SUSY}}$ and $m_{1/2}$ are below 500GeV. The off diagonal terms of slepton mass matrices also contribute to EDM of leptons. The predicted electron EDM is around $10^{-29}-10^{-28}$cm. Our predictions are expected to be tested in the near future experiment. △ Less"]