["In this paper, we investigate how a sizeable width-to-mass ratio for a gluino, as is for example realized in GMSB scenarios, could affect the discovery potential of gluinos at the LHC. More importantly, the influence of the gluino being \"fat\" on the standard mass and spin determination methods at the LHC are investigated. For this purpose, we focus on gluino production at the LHC, where we do not factorize the first step in the gluino decay cascade, but treat the following decay cascades step in factorization, including full spin correlations. The effects of sizeable width-to-mass ratios from a few up to 15-20 per cent on the endpoint of several mass determination methods as well as on means for discrimination between BSM spin paradigms like SUSY and UED are studied. △ Less", "In supersymmetric models, a correlation exists between the structure of the Higgs sector quartic potential and the coupling of the lightest CP-even Higgs to fermions and gauge bosons. We exploit this connection to relate the observed value of the Higgs mass ~ 125 GeV to the magnitude of its couplings. We analyze different scenarios ranging from the MSSM with heavy stops to more natural models with additional non-decoupling D-term/F-term contributions. A comparison with the most recent LHC data, allows to extract bounds on the heavy Higgs boson masses, competitive with bounds from direct searches. △ Less", "We present the NLO Susy-QCD corrections to the production of a pair of the lightest neutralinos plus one jet at the LHC, appearing as a monojet signature in combination with missing energy. We fully include all non-resonant diagrams, i.e. we do not assume that production and decay factorise. We derive a parameter point based on the p19MSSM which is compatible with current experimental bounds and show distributions based on missing transverse energy and jet observables. Our results are produced with the program GOSAM for automated one-loop calculations in combination with MadDipole/MadGraph for the real radiation part. △ Less", "Hidden sectors with light extra U(1) gauge bosons, so-called hidden photons, recently received much interest as natural feature of beyond standard model scenarios like string theory and SUSY and because of their possible connection to dark matter. This paper presents limits on hidden photons from past electron beam dump experiments including two new limits from experiments at KEK and Orsay. Additionally, various hidden sector models containing both a hidden photon and a dark matter candidate are discussed with respect to their viability and potential signatures in direct detection. △ Less", "Gauge mediation model with vectorlike matters (V-GMSB) is one of the few viable SUSY models that explains the 126 GeV Higgs boson mass and the muon anomalous magnetic moment simultaneously. We explore exclusion bounds on V-GMSB model from latest LHC SUSY searches. △ Less", "We review SO(10) grand unified theories (GUTs) in four and five dimensions (4D and 5D). The renormalizable minimal SO(10) SUSY GUT is the central theme of this review. It is very predictive and makes it possible to construct all mass matrices including those of the Dirac and heavy right-handed Majorana neutrinos. So it is not only able to reproduce all the low energy data, except for too larger $θ_{13}$ in the lepton mixing angles (which can be evaded without spoiling the basic ingredients), but also predicts almost all new physics beyond the standard model (SM) like neutrinoless double beta decay, the electric and magnetic dipole moments of the quark-lepton, lepton flavour violation, leptogenesis etc. To be very predictive, on the other hand, implies that predictions are unambiguous and they are always exposed to severe compatibilities with observations as well as to a conceptual consistency check. The explicit construction of the Higgs superpotential and the explicit display of a symmetry breaking pattern from GUT to the SM show that the naive desert from the SM to GUT in the minimal supersymmetric standard model (MSSM) is a too simplified concept and we have many definitely determined intermediate energy scales in general. (The details should be referred to pdf.) △ Less", "We propose a robust, unified framework, in which the similar baryon and dark matter cosmic abundances both arise from the physics of weakly interacting massive particles (WIMPs), with the rough quantitative success of the so-called \"WIMP miracle\". In particular the baryon asymmetry arises from the decay of a meta-stable WIMP after its thermal freezeout at or below the weak scale. A minimal model and its embedding in R-parity violating (RPV) SUSY are studied as examples. The new mechanism saves RPV SUSY from the potential crisis of washing out primordial baryon asymmetry. Phenomenological implications for the LHC and precision tests are discussed. △ Less", "Supersymmetry, a new symmetry that relates bosons and fermions in particle physics, still escapes observation. Search for supersymmetry is one of the main aims of the Large Hadron Collider. The other possible manifestation of supersymmetry is the Dark Matter in the Universe. The present lectures contain a brief introduction to supersymmetry in particle physics. The main notions of supersymmetry are introduced. The supersymmetric extension of the Standard Model -- the Minimal Supersymmetric Standard Model -- is considered in more detail. Phenomenological features of the Minimal Supersymmetric Standard Model as well as possible experimental signatures of supersymmetry at the Large Hadron Collider are described. The present limits on supersymmetric particles are presented and the allowed region of parameter space of the MSSM is shown. △ Less", "New SUSY thought is presented. Maximal stop mixing needed for 125 GeV Higgs is linked to the tachyonic stop at the UV boundary. Large $μ$ does not mean the severe fine tuning if Higgs comes out as a pseudo-Goldstone boson. The small mass of the pseudo-Goldstone Higgs is overcome with extra vector-like fermions needed to explain the Higgs to di-photon rates. △ Less", "The current searches at the LHC have set strong bounds on the masses of gluinos and the squarks of the first and second generation. At the same time, the hints of a Higgs boson at 125 GeV imply some degree of fine-tuning from radiative corrections to the lightest Higgs mass. Moreover, the rate into photons seems to be enhanced with respect to the SM, while the ZZ channel is reduced (albeit the SM is still compatible at the 2-sigma level). In this talk I will review how the previous issues can be addressed. If the stop is about a couple-hundred GeV, the SUSY still remains as a natural solution to the hierarchy problem. I will also show how the MSSM can accommodate a 125 GeV Higgs and also how extensions of the MSSM can alleviate the fine-tuning on the Higgs mass. I will also discuss recent literature, showing how both in the MSSM and its extensions one can find suitable ways to accommodate the measured Higgs rates into photons and Z bosons. △ Less", "We present a fit to the 2012 LHC Higgs data in different supersymmetric frameworks using naturalness as a guiding principle. We consider the MSSM and its D-term and F-term extensions that can raise the tree-level Higgs mass. When adding an extra chiral superfield to the MSSM, three parameters are needed determine the tree-level couplings of the lightest Higgs. Two more parameters cover the most relevant loop corrections, that affect the hγγand hgg vertexes. Motivated by this consideration, we present the results of a five parameters fit encompassing a vast class of complete supersymmetric theories. We find meaningful bounds on singlet mixing and on the mass of the pseudoscalar Higgs mA as a function of tanβ in the MSSM. We show that in the (mA, tanβ) plane, Higgs couplings measurements are probing areas of parameter space currently inaccessible to direct searches. We also consider separately the two cases in which only loop effects or only tree-level effects are sizeable. In the former case we study in detail stops' and charginos' contributions to Higgs couplings, while in the latter we show that the data point to the decoupling limit of the Higgs sector. In a particular realization of the decoupling limit, with an approximate PQ symmetry, we obtain constraints on the heavy scalar Higgs mass in a general type-II Two Higgs Doublet Model. △ Less", "In this talk, prospects for the charged Higgs in non-SUSY models are reviewed, in view of LHC results (as of October, 2012). The four models (Type I, Type II, lepton-specific and flipped) without tree level flavor-changing neutral currents are discussed. Updates for the case in which the charged Higgs is lighter than the top, leading to production in top decays, are presented along with expectations for the future. If the charged Higgs is heavier than the top quark, detection may be possible through the tau-nu decay mode. In addition, it is pointed out that the decay of the charged Higgs into W h, where h is the 125 GeV state, may be dominant. Charged Higgs phenomenology in models which do contain tree level flavor-changing neutral currents, as well as the inert doublet model and others, are also briefly reviewed. △ Less", "We start a systematic investigation of the possibility to have supersymmetry (SUSY) to be an asymptotic state of the gauge theory in the high energy (UV) limit, due to the renormalization group running of coupling constants of the theory. The answer on whether this situation takes place or not, can be resolved by dealing with the running of the ratios between Yukawa and scalar couplings to the gauge coupling. The behavior of these ratios does not depend too much on whether gauge coupling is asymptotically free (AF) or not. It can be shown that the UV stable fixed point for the Yukawa coupling is not supersymmetric. Taking this into account, one can break down SUSY only in the scalar coupling sector. We consider two simplest examples of such breaking, namely N=1 supersymmetric QED and QCD. In one of the cases one can construct an example of SUSY being restored in the UV regime. △ Less", "We have examined the capability of the LHC, running at both 7 and 8 TeV, to explore the 19(20)-dimensional parameter space of the pMSSM with neutralino(gravitino) LSPs and soft masses up to 4 TeV employing the ATLAS SUSY analysis suite. Here we present some preliminary results for the gravitino model set, following the ATLAS analyses whose data were publically available as of mid-September 2012. We find that the impact of the reduced MET, resulting from models with gravitino LSPs on sparticle searches is more than off-set by the detectability of the many possible long-lived NLSPs. △ Less", "We study the possible LHC collider signatures in the next-to-minimal supersymmetric Standard Model (NMSSM). The general NMSSM consists of 29 supersymmetric (SUSY) particles which can be mass ordered in $29! \\simeq 9 \\cdot 10^{30}$ ways. To reduce the number of hierarchies to a more manageable amount we assume a degeneracy of the sfermions of the first two generations with the same quantum numbers. Further assumptions about the neutralino and chargino masses leave 15 unrelated parameters. We check all $15! \\approx 10^{12}$ relevant mass orderings for the dominant decay chains and the corresponding collider signatures at the LHC. As preferred signatures, we consider charged leptons, missing transverse momentum, jets, and W, Z or Higgs bosons. We present the results for three different choices of the singlet to Higgs coupling $λ$: (a) small: $O(λ)< O(Y_τ)$, (b) large: $O(λ)\\simeq O(Y_{top},Y_b, Y_τ)$ and (c) dominant: $O(λ)>O(Y_{top})$. We compare these three scenarios with the MSSM expectations as well as among each other. We also mention a possible mass hierarchy leading to 7 jets plus 1 lepton signatures at the LHC and comment briefly on the consequence of possible R-parity violation. △ Less", "This review is based on the talk presented at the SUSY 2012 (Beijing). The new particle around 125 GeV observed at the Large Hadron Collider (LHC) is almost consistent with the standard model Higgs boson, except that the diphoton decay mode may be excessive. We summarize a number of possibilities. While at the LHC the dominant production mechanism for the Higgs boson of the standard model and some other extensions is via the gluon fusion process, the alternative vector-boson fusion is more sensitive to electroweak symmetry breaking. Using the well known dijet-tagging technique to single out the vector-boson fusion mechanism, we investigate potential of vector-boson fusion to discriminate a number of models suggested to give an enhanced inclusive diphoton production rate. △ Less", "Results of searches for SUSY production at CMS in events with third-generation signatures are presented. Along with missing energy, the final states may include hadronic jets with or without b-quark tag, light leptons, and tau leptons. These features serve both to distinguish standard-model components, and sensitivity to those SUSY models that lead to final states rich of heavy-flavored particles. △ Less", "We study the most general extension of the MSSM Lagrangian that includes scenarios in which supersymmetry is spontaneously broken at a low scale f. The spurion that parametrizes supersymmetry breaking in the MSSM is promoted to a dynamical superfield involving the goldstino, with (and without) its scalar superpartner, the sgoldstino. The low energy effective Lagrangian is written as an expansion in terms of m_{SUSY}/sqrt{f}, where m_{SUSY} is the induced supersymmetry breaking scale, and contains, in addition to the usual MSSM Lagrangian with the soft terms, couplings involving the component fields of the goldstino superfield and the MSSM fields. This Lagrangian can provide significant corrections to the usual couplings in the Standard Model and the MSSM. We study how these new corrections affect the Higgs couplings to gauge bosons and fermions, and how LHC bounds can be used in order to constrain f. We also discuss that, from the effective field theory point of view, the couplings of the goldstino interactions are not determined by any symmetry, and their usual simple relation to the soft terms is corrected by higher-dimensional operators. △ Less", "Recently there has been much interest in hidden sectors, especially in the context of dark matter and dark forces, since they are a common feature of beyond standard model scenarios like string theory and SUSY and additionally exhibit interesting phenomenological aspects. Various laboratory experiments place limits on the so-called hidden photon and continuously further probe and constrain the parameter space; an updated overview is presented here. Furthermore, for several hidden sector models with light dark matter we study the viability with respect to the relic abundance and direct detection experiments. △ Less", "If Supersymmetry (SUSY) has a compressed spectrum the current limits from the LHC can be drastically reduced. We take possible `worst case' scenarios where combinations of the stop, squark and gluino masses are degenerate with the mass of the lightest SUSY particle. To accurately derive limits in the model, care must be taken when describing QCD radiation and we examine this in detail. Lower mass bounds are then produced by considering all the 7 TeV hadronic SUSY and monojet searches. The evolution of the limits as the mass splitting is varied is also presented. △ Less", "We consider a SUSY breaking scenario without the Polonyi problem. To solve the problem, the enhanced couplings of the Polonyi field to an inflaton, gauge kinetic functions and itself are assumed. As a result, a gaugino mediated SUSY breaking occurs. In this scenario, the Higgs boson mass becomes consistent with the recently observed value of the Higgs-like boson (i.e., m_h ~= 125 GeV) for the gluino mass about 4TeV, which is, however, out of the reach of the LHC experiment. We show that the trilinear coupling of the scalar top is automatically enhanced by the presence of the extra matters. With such extra matters, the Higgs mass as large as 125 GeV can be realized with the gluino mass of 1-2 TeV which is within the reach of the LHC experiment. In our scenario, the gravitino is the lightest SUSY particle and the candidate for dark matter, and the Wino, Bino, and sleptons are in a range from 200 GeV to 700 GeV. △ Less", "An improved measurement of the electron electric dipole moment (EDM) appears feasible using ground-state alkali atoms in an atomic fountain in which a strong electric field, which couples to a conceivable electron dipole moment (EDM), is applied perpendicular to the fountain axis. In a practical fountain, the ratio of the atomic tensor Stark shift to the Zeeman shift is a facto mu~100. We expand the complete time evolution operator in inverse powers of this ratio; complete results are presented for atoms of total spin F=3, 4, and 5. For a specific set of entangled hyperfine sublevels (coherent states), potential systematic errors enter only as even powers of 1/mu, making the expansion rapidly convergent. The remaining EDM mimicking effects are further suppressed in a proposed double-differential setup, where the final state is interrogated in a differential laser configuration, and the direction of the strong electric field also is inverted. Estimates of the signal available at existing accelerator facilities indicate that the proposed apparatus offers the potential for a drastic improvement in EDM limits over existing measurements, and for constraining the parameter space of supersymmetric (SUSY) extensions of the Standard Model. △ Less", "It is well known that there are different global (i.e. $M_{P}\\rightarrow\\infty$) limits of N=1 supergravity. We distinguish between these limits and their relevance to low energy phenomenology. We discuss a) fermion mass matrices and recently proved theorems in global SUSY b) stability issues and SUSY breaking d) R-symmetry and a recently derived bound on the superpotential and e) FI terms in global and local SUSY. △ Less", "We discuss the SUSY dark matter phenomenology in some simple and predictive models of nonuniversal gaugino masses at the GUT scale. Assuming the gaugino masses to transform as a sum of singlet and a nonsinglet representation of the GUT group SU(5), one can evade the LEP constraints to access the bulk annihilation region of the bino dark matter relic density. Besides, with this assumption one can also have a mixed gaugino-higgsino dark matter, giving the right relic density over large parts of the parameter space. We consider the model predictions for LHC and dark matter experiments in both the cases. Finally we consider the AMSB model prediction of wino dark matter giving the right relic density for TeV scale wino mass. Assuming this wino dark matter mass to be at the first Sommerfeld resonance of about 4 TeV one can simultaneously reproduce the right relic density as well as the hard positron spectrum observed by the PAMELA experiment. △ Less", "The implications of the LHC SUSY searches as well as the discovery of a new bosonic state compatible with the lightest Higgs boson will be discussed in the context of constrained and general MSSM scenarios. Exploring the MSSM through the Higgs sector is an alternative and complementary path to direct searches, and tight constraints on the MSSM parameter space can be obtained. △ Less", "We study the minimal supersymmetric standard model (MSSM) with minimal flavor violation (MFV), imposing constraints from flavor physics observables and MSSM Higgs searches, in light of the recent discovery of a 125 GeV Higgs boson by ATLAS and CMS. We analyze the electroweak vacuum stability conditions to further restrict the MSSM parameter space. In addition, a connection to ultraviolet physics is shown via an implementation of renormalization group running, which determines the TeV-scale spectrum from a small set of minimal supergravity parameters. Finally, we investigate the impact from dark matter direct detection searches. Our work highlights the complementarity of collider, flavor and dark matter probes in exploring the MSSM, and shows that even in a MFV framework, flavor observables constrain the MSSM parameter space well beyond the current reach of direct SUSY particle searches. △ Less", "We point out that the extra neutralinos and charginos generically appearing in a large class of $E_6$ inspired models lead to distinctive signatures from gluino cascade decays in comparison to those from the Minimal Supersymmetric Standard Model (MSSM). These signatures involve longer decay chains, more visible transverse energy, higher multiplicities of jets and leptons, and less missing transverse energy than in the MSSM. These features make the gluino harder to discover for certain types of conventional analyses, for example in the 6 jet channel we show that a 1 TeV MSSM gluino may resemble an 800 GeV $E_6$ gluino. However, the enriched lepton multiplicity provides enhanced 3- and 4-lepton signatures, which are much more suppressed in the case of the MSSM. As an example we analyse various scenarios in the E$_6$SSM, demonstrating the utility of a \\texttt{CalcHEP} model that we have now made publicly available on HEPMDB (High Energy Physics Models DataBase). After extensive scans over the parameter space, we focus on representative benchmark points. We perform detailed Monte Carlo analyses, concentrating on the 3-lepton channel at the 7, 8, and 14 TeV Large Hadron Collider (LHC), and demonstrate that $E_6$ inspired models are clearly distinguishable from the MSSM in gluino cascade decays. We emphasise to the LHC experimental groups that the distinctive features present in gluino cascade decays, such as those discussed here, not only represents a unique footprint of a particular model but also may provide the key to an earlier discovery of supersymmetry. △ Less", "We show that late Q-ball decay in the MSSM with gauge-mediated SUSY breaking can provide a natural source of non-thermal NLSPs which subsequently decay to gravitino dark matter without violating nucleosynthesis constraints. To show this, we perform a global analysis of Q-ball formation and decay in Affleck-Dine baryogenesis for a d = 6 (u^{c}d^{c}d^{c})^2 flat direction of the gauge-mediated MSSM. A general phenomenological potential for the flat-direction is studied and the Q-ball decay properties are obtained as a function of its parameters. The corresponding gravitino mass necessary to account for dark matter is then determined for the case of stau NLSPs. The decay temperature depends on the charge of the Q-balls, which is determined by the fragmentation of the AD condensate. Different fragmentation scenarios are considered, and the final non-thermal NLSP density from Q-ball decay and NLSP annihilation is determined. Particular care is taken to establish that NLSPs from Q-ball decay become homogeneous and non-relativistic prior to annihilation. The gravitino mass necessary for dark matter is naturally consistent with the theoretical gravitino mass in the gauge-mediation model. △ Less", "The recently observed mass ~ 125 GeV for the Higgs boson suggests a high-energy scale SUSY breaking, above O(10) TeV. It is, however, very puzzling why nature chooses such a high energy scale for the SUSY breaking, if the SUSY is a solution to the hierarchy problem. We show that the pure gravity mediation provides us with a possible solution to this puzzle if the topological inflation is the last inflation in the early universe. We briefly discuss a chaotic inflation model in which a similar solution can be obtained. △ Less", "An explicit SUSY SU(12) unification model with three light chiral families is presented which avoids any external flavor symmetries. The hierarchy of quark and lepton masses and mixings is explained by higher dimensional Yukawa interactions involving Higgs bosons containing SU(5) singlet fields with VEVs appearing at or below the SUSY GUT scale of 2 \\times 10^{16} GeV, approximately 50 times smaller than the SU(12) unification scale. The model has been found to be in good agreement with the observed quark and lepton masses and mixings, with nearly all prefactors of O(1) in the four Dirac and one Majorana fermion mass matrices. △ Less", "I will talk on my recent works. Axino, related to the SUSY transformation of axion, can mix with Goldstino in principle. In this short talk, I would like to explain what is the axino mass and its plausible mass range. The axino mass is known to have a hierarchical mass structure depending on accidental symmetries. With only one axino, if G_A=0 where G=K+ 2ln|W|, we obtain axino mass= gravitino mass. For G_A nonzero, the axino mass depends on the details of the Kaehler potential. I also comment on the usefulness of a new parametrization of the CKM matrix. △ Less", "We review the No-Scale F-SU(5) model with extra TeV-scale vector-like flippon multiplets and its associated collider phenomenology in the search for supersymmetry at the LHC. The model framework possesses the rather unique capacity to provide a light CP-even Higgs boson mass in the favored 124-126 GeV window while simultaneously retaining a testably light SUSY spectrum that is consistent with emerging low-statistics excesses beyond the Standard Model expectation in the ATLAS and CMS multijet data. △ Less", "We discuss the impact on the stau masses of the additional D-terms in U(1)-extended MSSM models. We show, explicitly for the B-L-SSM, that these contributions can play a crucial role in the explanation of the enhanced diphoton decay rate of a SM-like Higgs particle around 125 GeV. Even in the most constrained scenario with universal scalar and gaugino masses, it is possible to obtain a sizable enhancement and, in addition, the correct relic density for the LSP. Furthermore, a lighter CP-even scalar that could fit the LEP excess at 98 GeV is viable. △ Less", "Models of natural supersymmetry seek to solve the little hierarchy problem by positing a spectrum of light higgsinos \\lesssim 200 GeV and light top squarks \\lesssim 500 GeV along with very heavy squarks and TeV-scale gluinos. Such models have low electroweak finetuning and are safe from LHC searches. However, in the context of the MSSM, they predict too low a value of m(h) and the relic density of thermally produced higgsino-like WIMPs falls well below dark matter (DM) measurements. Allowing for high scale soft SUSY breaking Higgs mass m_{H_u}> m_0 leads to natural cancellations during RG running, and to radiatively induced low finetuning at the electroweak scale. This model of radiative natural SUSY (RNS), with large mixing in the top squark sector, allows for finetuning at the 5-10% level with TeV-scale top squarks and a 125 GeV light Higgs scalar h. If the strong CP problem is solved via the PQ mechanism, then we expect an axion-higgsino admixture of dark matter, where either or both the DM particles might be directly detected. △ Less", "The relationship between the degree of fine-tuning in Electroweak Symmetry Breaking (EWSB) and the discoverability of dark matter in current and next generation direct detection experiments is investigated in the context of two unified Supersymmetry scenarios: the constrained Minimal Supersymmetric Standard Model (CMSSM) and models with non-universal Higgs masses (NUHM). Attention is drawn to the mechanism(s) by which the relic abundance of neutralino dark matter is suppressed to cosmologically viable values. After a summary of Amsel, Freese, and Sandick (2011), results are updated to reflect current constraints, including the discovery of a new particle consistent with a Standard Model-like Higgs boson. We find that a Higgs mass of ~125 GeV excludes the least fine-tuned CMSSM points in our parameter space and that remaining viable models may be difficult to probe with next generation direct dark matter searches. Relatively low fine-tuning and good direct detection prospects are still possible in NUHM scenarios. △ Less", "We present a non-linear MSSM with non-standard Higgs sector and goldstino field. Non-linear supersymmetry for the goldstino couplings is described by the constrained chiral superfield and, as usual, the Standard Model sector is encompassed in suitable chiral and vector supermultiplets. Two models are presented. In the first model (non-linear MSSM$3 1/2$), the second Higgs is replaced by a new supermultiplet of half-family with only a new generation of leptons (or quarks). In the second model, for anomaly cancellation purposes, the second Higgs is retained as a spectator superfield by imposing a discrete symmetry. Both models do not have a $μ$-problem as a $μ$-term is forbidden by the discrete symmetry in the case of a spectator second Higgs or not existing at all in the case of a single Higgs. Moreover, the tree level relation between the Higgs mass and the hidden sector SUSY breaking scale $\\sqrt{f}$ is derived. Finally, we point out a relative suppression by $m_{soft}/Λ$ of the bottom and tau Yukawa couplings with respect to those of the top quark. △ Less", "Introducing an R-symmetry to models of high scale supersymmetry (SUSY) can have interesting consequences, and we focus on two aspects. If Majorana masses are forbidden by an R-symmetry and the main source of electroweak gaugino masses are Dirac terms, then the Higgs quartic coupling vanishing at the SUSY scale and the Higgs boson mass will be near 125 GeV. Moreover, using an R-symmetry, models with only one Higgs doublet in the UV can be constructed and we argue that, since we desire only a single Higgs at the weak scale, this scenario is more aesthetic than existing models. We subsequently present a model which draws on both of these features. We comment on neutrino masses and dark matter in these scenarios and discuss how the models presented can be discerned from alternative constructions with high scale SUSY, including Split SUSY. △ Less", "In this note we briefly review our recent studies on a 125 GeV Higgs and its di-photon signal rate in different low energy supersymmetric models, namely the minimal supersymmetric standard model (MSSM), the next-to-minimal supersymmetric standard model (NMSSM), the nearly minimal supersymmetric standard model (nMSSM) and the constrained MSSM. Our conclusion is: (i) In the allowed parameter space the SM-like Higgs boson can easily be 125 GeV in the MSSM, NMSSM and nMSSM, while it is hard to realize in the constrained MSSM; (ii) The di-photon Higgs signal rate in the nMSSM and constrained MSSM is suppressed relative to the prediction of the SM, while the signal rate can be enhanced in the MSSM and NMSSM; (iii) The NMSSM may allow for a lighter top-squark than the MSSM, which can thus ameliorate the fine-tuning problem. △ Less", "We examine the first ATLAS Collaboration 8 TeV 5.8/fb supersymmetry (SUSY) multijet data observations in the context of No-Scale Flipped SU(5) with extra TeV-Scale vector-like flippon multiplets, dubbed F-SU(5), finding that the recent 8 TeV collider data is statistically consistent with our prior 7 TeV results. Furthermore, we synthesize all currently ongoing experiments searching for beyond the Standard Model (BSM) physics with this fit to the 8 TeV data, establishing a suggestive global coherence within a No-Scale F-SU(5) high-energy framework. The SUSY mass scale consistent with all BSM data consists of the region of the F-SU(5) model space within 660 ~< M_{1/2} ~< 760 GeV, which corresponds to sparticle masses of 133 ~< M(chi_1^0) ~< 160 GeV, 725 ~< M(t_1) ~< 845 GeV, and 890 ~< M(g) ~< 1025 GeV. We suggest that the tight non-trivial correspondence between the SUSY multijets, direct and indirect searches for dark matter, proton decay, rare-decay processes, the observed Higgs boson mass, and the measured dark matter relic density, is strongly indicative of a deeper fundamental relationship. We additionally suggest a simple mechanism for enhancing the capture efficiency of F-SU(5) SUSY multijets, which results in a 93% suppression in ATLAS reported background events, but only a 27% decrease in Monte Carlo simulated F-SU(5) multijet events. △ Less", "We show that Supersymmetric models with Type I seesaw neutrino masses support slow roll inflection point inflation. The inflaton is the D-flat direction labelled by the chiral invariant HLN composed of the Higgs(H), slepton(L) and conjugate sneutrino(N) superfields. The scale of inflation and fine tuning is set by the conjugate neutrino Majorana mass $M_{ν^c} \\sim 10^6-10^{12}$ GeV. The cubic term in the (quartic) inflaton potential is dominantly from superpotential (not soft Susy breaking) couplings. The tuning conditions are thus insensitive to soft supersymmetry breaking parameters and are generically much less stringent than for previous `A-term' inflation scenarios controlled by mass scales $\\sim TeV$. WMAP limits on the ratio of tensor to scalar perturbations limit the scale $M$ controlling inflection point inflation: $M <7.9 \\times 10^{13}$ GeV. `Instant preheating' is operative and dumps the inflaton energy into MSSM modes giving a high reheat temperature : $T_{rh} \\approx M_{ν^c}^{3/4}\\, 10^{6}$ GeV $\\sim 10^{11}- 10^{15} $ GeV. A large gravitino mass $> 50 $ TeV is therefore required to avoid over closure by reheat produced gravitinos. `Instant preheating' and NLH inflaton facilitate production of right handed neutrinos during inflaton decay and thus non-thermal leptogenesis in addition to thermal leptogenesis. We show that the embedding in the fully realistic New Minimal Supersymmetric SO(10) GUT requires use of the heaviest righthanded neutrino mass as the controlling scale but the possibility of a measurable tensor scalar perturbation ratio seems marginal. We examine the parametric difficulties remaining. △ Less", "The lack of evidence for new physics beyond the standard model at the LHC points to a paucity of new particles near the weak scale. This suggests that the weak scale is tuned and that supersymmetry, if present at all, is realized at higher energies. The measured Higgs mass constrains the scalar sparticles to be below 10^5 TeV, while gauge coupling unification favors Higgsinos below 100 TeV. Nevertheless, in many models gaugino masses are suppressed and remain within reach of the LHC. Tuning the weak scale and the renormalization group evolution of the scalar masses constrain Split model building. Due to the small gaugino masses, either the squarks or the up-higgs often run tachyonic; in the latter case, successful electroweak breaking requires heavy higgsinos near the scalar sparticles. We discuss the consequences of tuning the weak scale and the phenomenology of several models of Split supersymmetry including anomaly mediation, U(1)_(B-L) mediation, and Split gauge mediation. △ Less", "This article is the PhD thesis of the author. It is focused on Type II compactifications because of the potential for the construction of realistic MSSM-like compactifications. In particular we concentrate in Type IIB Calabi-Yau orientifolds and its non-perturbative realization: F-theory. These sort of models, have attracted a lot of attention during recent years due to their phenomenological interest. The first part is devoted to an introductory survey of some concepts and aspects of Type II vacua like e.g. the low energy effective action or soft terms. It is also included a brief presentation of F-theory stressing the phenomenological interest of local models. In the second part we present an analysis of the theoretical and phenomenological issues of modulus dominated SUSY breaking. In addition it is examined its status in comparison with recent LHC data. Finally, the third part is devoted to the analysis of flux and instanton effects on local F-theory models. Yukawas and matter fields wave functions corresponding to these models are calculated. The results may allow for an understanding of the problem of fermion hierarchies in the Standard Model. △ Less", "R-parity violating supersymmetry in a Minimal Flavor Violation paradigm can produce same-sign dilepton signals via direct sbottom-LSP pair production. Such signals arise when the sbottom hadronizes and the resulting mesino oscillates into an anti-mesino. The first bounds on the sbottom mass are placed in this scenario using current LHC results. △ Less", "This year, LHC provided a very stringent bound on Br(Bs->mu+mu-), bringing it closer to the value predicted by the Standard Model (SM). Bs->mu+mu- was believed to be the golden mode at LHCb to find SUSY because a large enhancement was expected in the regime of moderate and large values of tanb. Other scenarios are still possible and a correlation with other decay channels is needed. We show that a complementary information on New Physics (NP) can be obtained model-indepedently from the B-> K l+l- decay mode. We provide a prediction Br(B-> K l+l-) based on the first lattice QCD results for all three relevant form factors, f0(q^2), f+(q^2) and fT(q^2). We were then able to provide the model-independent bounds on the complex couplings to scalar and pseudoscalr operators in the b->s sector. △ Less", "The discovery of a SM-like Higgs boson near 125 GeV and the flavor texture of the Standard Model motivate the investigation of supersymmetric quiver-like BSM extensions. We study the properties of such a minimal class of models which deals naturally with the SM parameters. Considering experimental bounds as well as constraints from flavor physics and Electro-Weak Precision Data, we find the following. In a self-contained minimal model - including the full dynamics of the Higgs sector - top squarks below a TeV are in tension with b->sγ constraints. Relaxing the assumption concerning the mass generation of the heavy Higgses, we find that a stop not far from half a TeV is allowed. The models have some unique properties, e.g. an enhancement of the h-> b\\bar{b},τ\\bar{τ} decays relative to the h->γγ one, a gluino about 3 times heavier than the stop, an inverted hierarchy of about 3-20 between the squarks of the first two generations and the stop, relatively light Higgsino neutralino or stau NLSP, as well as heavy Higgses and a W' which may be within reach of the LHC. △ Less", "Models with an approximate U(2)^3 flavour symmetry represent simple non-MFV extensions of the SM. We compare correlations of Delta F = 2 observables in CMFV and in a minimal version of U(2)^3 models, MU(2)^3, where only the minimal set of spurions for breaking the symmetry is used and where only SM operators are relevant. Due to the different treatment of the third generation MU(2)^3 models avoid the Delta M_{s,d}-|epsilon_K| correlation of CMFV which precludes to solve the S_{psi K_S}- |epsilon_K| tension present in the flavour data. While the flavour structure in K meson system is the same for CMFV and MU(2)^3 models, CP violation in B_{d,s} system can deviate in MU(2)^3 models from CMFV. We point out a triple correlation between S_{psi phi}, S_{psi K_S} and |V_{ub}| that can provide a distinction between different MU(2)^3 models. GUTs open the possibility to transfer the neutrino mixing matrix U_{PMNS} to the quark sector which leads to correlations between leptonic and hadronic observables. This is accomplished in a controlled way in an SO(10) SUSY GUT model proposed by Chang, Masiero and Murayama (CMM model) whose flavour structure differ significantly from the constrained MSSM. We present a summary of a global analysis of several flavour processes containing B_s-overline{B}_s mixing, b -> s gamma and tau -> mu gamma. Furthermore we comment on the implications on the model due to the latest data of S_{psi phi}, theta_{13} and the Higgs mass. △ Less", "Effective supersymmetry(SUSY) where stop is the lightest squark may run into a two-loop tachyonic problem in some Z' mediation models. In addition, a large A term or/and a large stop mass are needed to have about a 126 GeV Higgs boson with three families of quarks and leptons. Thus, we suggest an inverted effective SUSY(IeffSUSY) where stop mass is larger compared to those of the first two families. In this case, it is possible to have a significant correction to the anomalous magnetic moment of muon. A three family IeffSUSY in a Z' mediation scenario is explicitly studied with the Z' quantum number related to B-L. Here, we adopt both the Z' mediation and gravity mediation where the Z' mediation is the dominant one for stop, while the gravity mediation is the dominant one for the muonic leptons and Higgs multiplets. We present a numerical study based on a specific anomaly free model, and show the existence of the parameter region where all the phenomenological conditions are satisfied. △ Less", "Scalar decay into gravitinos is studied in the presence of D-term supersymmetry (SUSY) breaking. The gravitinos produced by the decay of coherent oscillations of scalar fields, such as moduli and inflatons, cause cosmological problems. We show the general formula for the partial decay rate of the scalar into two gravitinos. Applying it to a concrete model of D-term SUSY breaking, we find that D-term SUSY breaking can suppress gravitino production. △ Less", "Previous work on t-b-τYukawa-unified supersymmetry, as expected from SUSY GUT theories based on the gauge group SO(10), tended to have exceedingly large electroweak fine-tuning (EWFT). Here, we examine supersymmetric models where we simultaneously require low EWFT (\"natural SUSY\") and a high degree of Yukawa coupling unification, along with a light Higgs scalar with m_h\\sim125 GeV. As Yukawa unification requires large tanβ\\sim50, while EWFT requires rather light third generation squarks and low μ\\sim100-250 GeV, B-physics constraints from BR(B\\to X_sγ) and BR(B_s\\to μ+μ-) can be severe. We are able to find models with EWFT Δ\\lesssim 50-100 (better than 1-2% EWFT) and with Yukawa unification as low as R_yuk\\sim1.3 (30% unification) if B-physics constraints are imposed. This may be improved to R_yuk\\sim1.2 if additional small flavor violating terms conspire to improve accord with B-constraints. We present several Yukawa-unified natural SUSY (YUNS) benchmark points. LHC searches will be able to access gluinos in the lower 1-2 TeV portion of their predicted mass range although much of YUNS parameter space may lie beyond LHC14 reach. If heavy Higgs bosons can be accessed at a high rate, then the rare H, A\\to μ+μ- decay might allow a determination of tanβ\\sim50 as predicted by YUNS models. Finally, the predicted light higgsinos should be accessible to a linear e+e- collider with \\sqrt{s}\\sim0.5 TeV. △ Less", "We present an implementation for slepton pair production at hadron colliders in the POWHEG BOX, a framework for combining next-to-leading order QCD calculations with parton-shower Monte-Carlo programs. Our code provides a SUSY Les Houches Accord interface for setting the supersymmetric input parameters. Decays of the sleptons and parton-shower effects are simulated with PYTHIA. Focussing on a representative point in the supersymmetric parameter space we show results for kinematic distributions that can be observed experimentally. While next-to-leading order QCD corrections are sizable for all distributions, the parton shower affects the color-neutral particles only marginally. Pronounced parton-shower effects are found for jet distributions. △ Less", "We work out the semileptonic $Λ_b\\rightarrow Λ\\ell^+ \\ell^-$ transition in standard as well as different supersymmetric models. In particular, considering the parametrization of the matrix elements entered the low energy effective Hamiltonian in terms of form factors in full QCD, we calculate the amplitude and differential decay rate responsible for this decay channel in supersymmetric models. We then use the form factors calculated via light cone QCD sum rules in full theory to analyze the differential branching ratio and lepton forward-backward asymmetry of this decay channel in different supersymmetric models and compare the obtained results with those of the standard model. We also discuss how the results of different supersymmetric models deviate from the standard model predictions and which SUSY scenarios are favored. △ Less", "We establish that the light Higgs boson mass in the context of the No-Scale Flipped SU(5) GUT with TeV scale vector-like matter multiplets (flippons) is consistent with m_h = 125.5+-0.5 GeV in the region of the best supersymmetry (SUSY) spectrum fit to low statistics data excesses observed by ATLAS in multijet and light stop 5/fb SUSY searches at the LHC7. Simultaneous satisfaction of these disparate goals is achieved by employing a minor decrease in the SU(5) partial unification scale M_{32} to lower the flippon mass, inducing a larger Higgs boson mass shift from the flippon loops. The reduction in M_{32}, which is facilitated by a phenomenologically favorable reduction of the low-energy strong coupling constant, moreover suggests an imminently observable (e|mu)^+ pi^0 proton decay with a central value time scale of 1.7x10^34 years. At the same point in the model space, we find a lightest neutralino mass of m_χ = 145 GeV, which is suitable for the production of 130 GeV monochromatic gamma-rays through annihilations yielding associated Z-bosons; a signal with this energy signature has been identified within observations of the galactic center by the FERMI-LAT Space Telescope. In conjunction with direct correlations to the fate of the ATLAS multijet and light stop production channels presently being tested at the LHC8, we suggest that the reality of a 125.5 GeV Higgs boson affords a particularly rich company of specific and imminently testable associated observables. △ Less", "The ATLAS and CMS experiments have recently claimed discovery of a Higgs boson-like particle at ~5 sigma confidence and are beginning to test the Standard Model predictions for its production and decay. In a variety of supersymmetric models, a neutralino NLSP can decay dominantly to the Higgs and the LSP. In natural SUSY models, a light third generation squark decaying through this chain can lead to large excess Higgs production while evading existing BSM searches. Such models can be observed at the 8 TeV LHC in channels exploiting the rare diphoton decays of the Higgs produced in the cascade decay. Identifying a diphoton resonance in association with missing energy, a lepton, or b-tagged jets is a promising search strategy for discovery of these models, and would immediately signal new physics involving production of a Higgs boson. We also discuss the possibility that excess Higgs production in these SUSY decays can be responsible for enhancements of up to 50% over the SM prediction for the observed rate in the existing inclusive diphoton searches, a scenario which would likely by the end of the 8 TeV run be accompanied by excesses in the diphoton + lepton/MET and SUSY multi-lepton/b searches and a potential discovery in a diphoton + 2b search. △ Less", "The most natural region of cosmologically compatible dark matter relic density in terms of low fine-tuning in a minimal supersymmetric standard model with nonuniversal gaugino masses is the so called bulk annihilation region. We study this region in a simple and predictive SUSY-GUT model of nonuniversal gaugino masses, where the latter transform as a combination of singlet plus a nonsinglet representation of the GUT group SU(5). The model prediction for the direct dark matter detection rates is well below the present CDMS and XENON100 limits, but within the reach of a future 1Ton XENON experiment. The most interesting and robust model prediction is an indirect detection signal of hard positron events, which resembles closely the shape of the observed positron spectrum from the PAMELA experiment. △ Less", "In SUSY models, the fine tuning of the electroweak (EW) scale with respect to their parameters gamma_i={m_0, m_{1/2}, mu_0, A_0, B_0,...} and the maximal likelihood L to fit the experimental data are usually regarded as two different problems. We show that, if one regards the EW minimum conditions as constraints that fix the EW scale, this commonly held view is not correct and that the likelihood contains all the information about fine-tuning. In this case we show that the corrected likelihood is equal to the ratio L/Delta of the usual likelihood L and the traditional fine tuning measure Delta of the EW scale. A similar result is obtained for the integrated likelihood over the set {gamma_i}, that can be written as a surface integral of the ratio L/Delta, with the surface in gamma_i space determined by the EW minimum constraints. As a result, a large likelihood actually demands a large ratio L/Delta or equivalently, a small chi^2_{new}=chi^2_{old}+2*ln(Delta). This shows the fine-tuning cost to the likelihood (chi^2_{new}) of the EW scale stability enforced by SUSY, that is ignored in data fits. A good chi^2_{new}/d.o.f.\\approx 1 thus demands SUSY models have a fine tuning amount Delta<<exp(d.o.f./2), which provides a model-independent criterion for acceptable fine-tuning. If this criterion is not met, one can thus rule out SUSY models without a further chi^2/d.o.f. analysis. Numerical methods to fit the data can easily be adapted to account for this effect. △ Less", "Lattice results are available for Delta S=2 matrix elements for the first time in full QCD, which improve considerably the status of hadronic uncertainties in K-Kbar mixing with respect to earlier phenomenological studies. Using an average of the ETMC and RBC results, we analyze epsilonK in Natural SUSY. This scenario arises as a consistent BSM framework after the latest results from the LHC. The analysis is improved with respect to previous studies including next-to-leading order matching conditions of order (alpha_s)^3. We derive new bounds for SUSY mass insertions in the scenario with a light third generation and study the implications for squark and gluino masses, compared with direct searches at the LHC. Assuming natural values for the flavor violating SUSY couplings of both chiralities, we find that the sbottom must be heavier than 3 TeV for a gluino mass up to 10 TeV. In this scenario no natural values for squark and gluino masses can satisfy the flavor bounds. △ Less", "We perform a global fit to Higgs signal-strength data in the context of light stops in Natural SUSY. In this case, the Wilson coefficients of the higher dimensional operators mediating g g -> h and h -> γγ, given by c_g, c_γ, are related by c_g = 3 (1 + 3 α_s/(2 π)) c_γ/8. We examine this predictive scenario in detail, combining Higgs signal-strength constraints with recent precision measurements of m_W, b-> s γconstraints and direct collider bounds on weak scale SUSY, finding regions of parameter space that are consistent with all of these constraints. However it is challenging for the allowed parameter space to reproduce the observed Higgs mass value with sub-TeV stops. We discuss some of the direct stop discovery prospects and show how global Higgs fits can be used to exclude light stop parameter space difficult to probe by direct collider searches. We determine the current status of such indirect exclusions and estimate their reach by the end of the 8 TeV LHC run. △ Less", "We consider an N=1 supersymmetric U(N) gauge theory with an adjoint chiral multiplet. By developing a self-consistent Hartree-Fock approximation to the leading order which is reminiscent of that of the BCS/NJL in the superconductivity/chiral symmetry, we show that the N=1 supersymmetry is spontaneously broken, giving a mixed Majorana-Dirac mass term for gaugino due to the nonvanishing D-term VEV and F-term one induced by D-term. △ Less", "We consider a supersymmetric model where the neutrino mass matrix arises from bilinear and trilinear R-parity violation, both restricted by a $Z_3$ flavor symmetry. Assuming flavor blind soft supersymmetry (SUSY) breaking conditions, corrected at low energies due to running effects, we obtain a neutrino mass matrix in agreement with oscillation data. In particular, a large $θ_{13}$ angle can be easily accommodated. We also find a correlation between the reactor and atmospheric mixing angles. This leads in some scenarios to a clear deviation from $θ_{23} = π/4$. The Lightest Supersymmetric Particle (LSP) decay, dominated by the trilinear couplings, provides a direct way to test the model at colliders. △ Less", "Motivated by the ATLAS and CMS discovery of a Higgs-like boson with a mass around 125 GeV, and by the need of explaining neutrino masses, we analyse the three canonical SUSY versions of the seesaw mechanism (type I, II and III) with CMSSM boundary conditions. In type II and III cases, SUSY particles are lighter than in the CMSSM (or the constrained type I seesaw), for the same set of input parameters at the universality scale. Thus, to explain $m_{h^0} \\simeq 125 GeV$ at low energies, one is forced into regions of parameter space with very large values of $m_0$, $M_{1/2}$ or $A_0$. We compare the squark and gluino masses allowed by the ATLAS and CMS ranges for $m_{h^0}$ (extracted from the 2011-2012 data), and discuss the possibility of distinguishing seesaw models in view of future results on SUSY searches. In particular, we briefly comment on the discovery potential of LHC upgrades, for squark/gluino mass ranges required by present Higgs mass constraints. A discrimination between different seesaw models cannot rely on the Higgs mass data alone, therefore we also take into account the MEG upper limit on BR$(μ\\to e γ)$ and show that, in some cases, this may help to restrict the SUSY parameter space, as well as to set complementary limits on the seesaw scale. △ Less", "We show that by adding a vector-like 5+5bar pair of matter fields to the spectrum of the minimal renormalizable SUSY SU(5) theory the wrong relations for fermion masses can be corrected, while being predictive and consistent with proton lifetime limits. Threshold correction from the vector-like fields improves unification of gauge couplings compared to the minimal model. It is found that for supersymmetric spectra lighter than 3 TeV, which would be testable at the LHC, at least some of the nucleon decay modes should have partial lifetimes shorter than about 2.10^34 yrs., which is within reach of ongoing and proposed experiments. △ Less", "ATLAS and CMS collaborations have searched for the supersymmetry (SUSY) in different channels with 7 TeV center-of-mass energy and their search strategies are optimized for the SUSY scenarios with fairly large mass splittings among the sparticles. In absence of any significant deviation of the data from the Standard Model (SM) prediction, stringent bounds are imposed on the squarks and gluino masses in the context of different SUSY scenarios. Since the exact SUSY breaking mechanism is not known, some part of the SUSY spectrum may be degenerate. In this paper, we consider two particular cases of degenerate SUSY spectrum and discuss the impact of ATLAS and CMS SUSY searches on these scenarios. We found that present SUSY search strategies of the ATLAS and CMS collaborations are not optimized for the degenerate SUSY scenarios. Even the LHC with 8 TeV center-of-mass energy can not probe large part of the parameter space of degenerate SUSY scenarios with the present search strategies. △ Less", "Supersymmetric theories with an R-parity generally yield a striking missing energy signature, with cascade decays concluding in a neutralino that escapes the detector. In theories where R-parity is broken the missing energy is replaced with additional jets or leptons, often making traditional search strategies ineffective. Such R-parity violation is very constrained, however, by resulting B and L violating signals, requiring couplings so small that LSPs will decay outside the detector in all but a few scenarios. In theories with additional matter fields, R-parity can be broken collectively, such that R-parity is not broken by any single coupling, but only by an ensemble of couplings. Cascade decays can proceed normally, with each step only sensitive to one or two couplings at a time, but B and L violation requires the full set, yielding a highly suppressed constraint. s-channel production of new scalar states, typically small for standard RPV, can be large when RPV is broken collectively. While missing energy is absent, making these models difficult to discover by traditional SUSY searches, they produce complicated many object resonances (MORes), with many different possible numbers of jets and leptons. We outline a simple model and discuss its discoverability at the LHC. △ Less", "Supersymmetric theories which can allow for a 125 GeV Higgs mass and also solve the naturalness and susy flavor problems now require a fair degree of complexity. Here we consider the simplest possibility for supersymmetry near the weak scale, but with the requirement of naturalness dropped. In \"pure gravity mediation\", all supersymmetric particles except for the gauginos lie at tens to thousands of TeV, with the gauginos obtaining loop suppressed masses automatically by anomaly mediation and higgsino threshold corrections. The gauginos are the lightest superpartners, and we investigate the current collider constraints on their masses, as well as the future reach of the LHC. We consider gluino pair production with a jets + missing energy signature, as well as events with disappearing charged tracks caused by charged winos decaying into their neutral partners. We show that presently, gluino masses less than about 1 TeV and wino masses less than about 300 GeV are excluded, and that the 14 TeV LHC can probe gluino masses up to about 2 TeV and wino masses up to 1 TeV. △ Less", "After completion of the LHC8 run in 2012, the plan is to upgrade the LHC for operation close to its design energy sqrt{s}=14 TeV, with a goal of collecting hundreds of fb^{-1} of integrated luminosity. The time is propitious to begin thinking of what is gained by even further LHC upgrades. In this report, we compute an LHC14 reach for SUSY in the mSUGRA/CMSSM model with an anticipated high luminosity upgrade. We find that LHC14 with 300 (3000) fb^{-1} has a reach for SUSY via gluino/squark searches of m(gluino)\\sim3.2 TeV (3.6 TeV) for m(squark)\\sim m)gluino), and a reach of m(gluino)\\sim1.8 TeV (2.3 TeV) for m(squark)>> m(gluino). In the case where m(squark)>> m(gluino), then the LHC14 reach for chargino-neutralino production with decay into the Wh+MET final state reaches to m(gluino)\\sim2.6 TeV for 3000 fb^{-1}. △ Less", "A large enhancement of a factor of 1.5 - 2 in Higgs production and decay in the diphoton channel, with little deviation in the ZZ channel, can only plausibly arise from a loop of new charged particles with large couplings to the Higgs. We show that, allowing only new fermions with marginal interactions at the weak scale, the required Yukawa couplings for a factor of 2 enhancement are so large that the Higgs quartic coupling is pushed to large negative values in the UV, triggering an unacceptable vacuum instability far beneath the 10 TeV scale. An enhancement by a factor of 1.5 can be accommodated if the charged fermions are lighter than 150 GeV, within reach of discovery in almost all cases in the 8 TeV run at the LHC, and in even the most difficult cases at 14 TeV. Thus if the diphoton enhancement survives further scrutiny, and no charged fermions beneath 150 GeV are found, there must be new bosons far beneath the 10 TeV scale. This would unambiguously rule out a large class of fine-tuned theories for physics beyond the Standard Model, including split SUSY and many of its variants, and provide strong circumstantial evidence for a natural theory of electroweak symmetry breaking at the TeV scale. Alternately, theories with only a single fine-tuned Higgs and new fermions at the weak scale, with no additional scalars or gauge bosons up to a cutoff much larger than the 10 TeV scale, unambiguously predict that the hints for a large diphoton enhancement in the current data will disappear. △ Less", "We implement the mechanism of non-thermal leptogenesis in the framework of an inflationary model based on a supersymmetric (SUSY) Pati-Salam Grand Unified Theory (GUT). In particular, we show that inflation is driven by a quartic potential associated with the Higgs fields involved in the spontaneous GUT symmetry breaking, in the presence of a non-minimal coupling of the inflaton field to gravity. The inflationary model relies on renormalizable superpotential terms and does not lead to overproduction of magnetic monopoles. It is largely independent of one-loop radiative corrections, and it can be consistent with current observational data on the inflationary observables, with the GUT symmetry breaking scale assuming its SUSY value. Non-thermal leptogenesis is realized by the out-of-equilibrium decay of the two lightest right-handed (RH) neutrinos, which are produced by the inflaton decay. Confronting our scenario with the current observational data on light neutrinos, the GUT prediction for the heaviest Dirac neutrino mass, the baryon asymmetry of the universe and the gravitino limit on the reheating temperature, we constrain the masses of the RH neutrinos in the range (10^10-10^15) GeV and the Dirac neutrino masses of the two first generations to values between 0.1 and 20 GeV. △ Less", "Confronted with the LHC data of a Higgs boson around 125 GeV, different models of low energy SUSY show different behaviors: some are favored, some are marginally survived and some are strongly disfavored or excluded. In this note we update our previous scan over the parameter space of various low energy SUSY models by considering the latest experimental limits like the LHCb data for B_s->μ^+μ^- and the XENON 100(2012) data for dark matter-neucleon scattering. Then we confront the predicted properties of the SM-like Higgs boson in each model with the combined 7 TeV and 8 TeV Higgs search data of the LHC. For a SM-like Higgs boson around 125 GeV, we have the following observations: (i) The most favored model is the NMSSM, whose predictions about the Higgs boson can naturally (without any fine tuning) agree with the experimental data at 1-sigma level, better than the SM; (ii) The MSSM can fit the LHC data quite well but suffer from some extent of fine tuning; (iii) The nMSSM is excluded at 3-sigma level after considering all the available Higgs data; (iv) The CMSSM is quite disfavored since it is hard to give a 125 GeV Higgs boson mass and at the same time cannot enhance the di-photon signal rate. △ Less", "It has been argued that requiring low electroweak fine-tuning (EWFT) along with a (partial) decoupling solution to the SUSY flavor and CP problems leads to a sparticle mass spectra characterized by light Higgsinos at 100-300 GeV, sub-TeV third generation scalars, gluinos at a few TeV and multi-TeV first/second generation scalars (natural SUSY). We show that by starting with multi-TeV first/second and third generation scalars and trilinear soft breaking terms, the natural SUSY spectrum can be generated radiatively via renormalization group running effects. Using the complete 1-loop effective potential to calculate EWFT, significantly heavier third generation squarks can be allowed even with low EWFT. The large negative trilinear term and heavier top squarks allow for a light Higgs scalar in the ~125 GeV regime. △ Less", "The ATLAS and CMS experiments did not find evidence for Supersymmetry using close to 5/fb of published LHC data at a center-of-mass energy of 7 TeV. We combine these LHC data with data on B_s -> mu mu (LHCb experiment), the relic density (WMAP and other cosmological data) and upper limits on the dark matter scattering cross sections on nuclei (XENON100 data). The excluded regions in the constrained Minimal Supersymmetric SM (CMSSM) lead to gluinos excluded below 1270 GeV and dark matter candidates below 220 GeV for values of the scalar masses (m_0) below 1500 GeV. For large m_0 values the limits of the gluinos and the dark matter candidate are reduced to 970 GeV and 130 GeV, respectively. If a Higgs mass of 125 GeV is imposed in the fit, the preferred SUSY region is above this excluded region, but the size of the preferred region is strongly dependent on the assumed theoretical error. △ Less", "The problems of renormalizable minimal SUSY SO(10) GUT in 4D are discussed. Its highly predictivity has been charged with many observations, which urges further progresses. We show why and how broad data fittings and conceptual problems drive us to 5D and how it improves the model. △ Less", "A model that gives family gauge bosons with an inverted mass hierarchy is proposed, stimulated by Sumino's cancellation mechanism for the QED radiative correction to the charged lepton masses. The Sumino mechanism cannot straightforwardly be applied to SUSY models because of the non-renormalization theorem. In this talk, an alternative model which is applicable to a SUSY model is proposed. It is essential that family gauge boson masses $m(A_i^j)$ in this model is given by an inverted mass hierarchy $m(A_i^i) \\propto 1/\\sqrt{m_{ei}}$, in contrast to $m(A_i^i) \\propto \\sqrt{m_{ei}}$ in the original Sumino model. Phenomenological meaning of the model is also investigated. In particular, we notice a deviation from the $e$-$μ$ universality in the tau decays. △ Less", "We discuss an attempt to understand confinement and dynamical symmetry breaking in a 4-dimensional non-supersymmetric gauge theory using S-duality in type IIB string theory. The electric theory is a USp(2n) gauge theory and its magnetic dual is argued to be an SO(2n) or SO(2n-1) gauge theory. These theories are obtained as the low-energy effective theory of O3-D3bar systems in type IIB string theory, which are related by S-duality. Confinement and dynamical symmetry breaking in the USp(2n) gauge theory are caused by the condensation of scalar fields in the magnetic dual description, which is consistent with the scenario of the dual Meissner mechanism for the confinement. △ Less", "The similarity of the observed baryon and dark matter densities suggests that they are physically related, either via a particle physics mechanism or anthropic selection. A pre-requisite for anthropic selection is the generation of superhorizon-sized domains of different Omega_{B}/Omega_{DM}. Here we consider generation of domains of different baryon density via random variations of the phase or magnitude of a complex field Phi during inflation. Baryon isocurvature perturbations are a natural consequence of any such mechanism. We derive baryon isocurvature bounds on the expansion rate during inflation H_{I} and on the mass parameter mu which breaks the global U(1) symmetry of the Phi potential. We show that when mu < H_{I} (as expected in SUSY models) the baryon isocurvature constraints can be satisfied only if H_{I} is unusually small, H_{I} < 10^{7} GeV, or if non-renormalizable Planck-suppressed corrections to the Phi potential are excluded to a high order. Alternatively, an unsuppressed Phi potential is possible if mu is sufficiently large, mu > 10^{16} GeV. We show that the baryon isocurvature constraints can be naturally satisfied in Affleck-Dine baryogenesis, as a result of the high-order suppression of non-renormalizable terms along MSSM flat directions. △ Less", "If supersymmetry (SUSY) has a compressed spectrum then the current mass limits from the LHC can be drastically reduced. We consider a possible 'worst case' scenario where the gluino and/or squarks are degenerate with the lightest SUSY particle (LSP). The most sensitive searches for these compressed spectra are via the final state LSPs recoiling against initial state radiation (ISR). Therefore it is vital that the ISR is understood and possible uncertainties in the predictions are evaluated. We use both MLM (with Pythia 6) and CKKW- L (with Pythia 8) matching and vary matching scales and parton shower properties to accurately determine the theoretical uncertainties in the kinematic distributions. All current LHC SUSY and monojet analyses are employed and we find the most constraining limits come from the CMS Razor and CMS monojet searches. For a scenario of squarks degenerate with the LSP and decoupled gluinos we find $M_{\\tilde{q}}>340$ GeV. For gluinos degenerate with the LSP and decoupled squarks, $M_{\\tilde{g}}>500$ GeV. For equal mass squarks and gluinos degenerate with the LSP, $M_{\\tilde{q},\\tilde{g}}>650$ GeV. △ Less", "It is challenging to explain the tentative 125 GeV Higgs signal in the Minimal Supersymmetric Standard Model (MSSM) without introducing excessive fine-tuning, and this motivates the study of non-minimal implementations of low energy supersymmetry (SUSY). A term λSH_uH_d involving a Standard Model (SM) singlet state S leads to an additional source for the quartic interaction raising the mass of the lightest SM-like Higgs. However, in order to achieve m_h \\approx 125 GeV with light stops and small stop mixing, it is necessary for λ\\gtrsim 0.7 and consequently λmay become non-perturbative before the unification scale. Moreover, as argued by Barbieri, Hall, et al. low fine-tuning prefers the region λ~1-2, leading to new or non-perturbative physics involving S below the GUT scale (`λSUSY' models). This raises the concern that precision gauge coupling unification, the prime piece of indirect experimental evidence for low energy SUSY, may be upset. Using the NSVZ exact β-function along with well motivated assumptions on the strong coupling dynamics we show that this is not necessarily the case, but rather there exist classes of UV completions where the strong-coupling effects can naturally correct for the present ~3% discrepancy in the two-loop MSSM unification prediction for α_s. Moreover, we argue that in certain scenarios a period of strong coupling can also be beneficial for t-b unification, while maintaining the small to moderate values of tanβpreferred by the Higgs mass. △ Less", "Axions might play a crucial role for the solution of the strong CP-problem and explanation of cold dark matter in the universe. In addition they may find applications in the formulation of inflationary models for the early universe and can serve as candidates for quintessence. We show that all these phenomena can be described within a single framework exhibiting a specific pattern of mass scales: the axionic see-saw. We also discuss the role of supersymmetry (susy) in this axionic system in two specific examples: weak scale susy in the (multi) TeV range and tele-susy with a breakdown scale coinciding with the decay constant of the QCD axion: $f_a\\sim 10^{11}-10^{12}$ GeV. △ Less", "We celebrate the recent Higgs discovery announcement with our experimental colleagues at the LHC and look forward to the implications that this success will bring to bear upon the continuing search for supersymmetry (SUSY). The model framework named No-Scale F-SU(5) possesses the rather unique capacity to provide a light CP-even Higgs boson mass in the favored 124-126 GeV window while simultaneously retaining a testably light SUSY spectrum that is consistent with emerging low-statistics excesses beyond the Standard Model expectation in the ATLAS and CMS multijet data. In this letter we review the distinctive F-SU(5) mechanism that forges the physical 125 GeV Higgs boson and make a specific assessment of the ATLAS multijet SUSY search observables that may be expected for a 15/fb delivery of 8 TeV data in this model context. Based on our Monte Carlo study, we anticipate that the enticing hints of a SUSY signal observed in the 7 TeV data could be amplified in the 8 TeV results. Moreover, if the existing signal is indeed legitimate, we project that the rendered gains in significance will be sufficient to conclusively rule out an alternative attribution to statistical fluctuation at that juncture. △ Less", "We investigate the effects of messenger-matter mixing on the lightest CP-even Higgs boson mass m_h in gauge-mediated supersymmetry breaking models. It is shown that with such mixings m_h can be raised to about 125 GeV, even when the superparticles have sub-TeV masses, and when the gravitino has a cosmologically preferred sub-keV mass. In minimal gauge mediation without messenger-matter mixing, realizing m_h = 125 GeV would require multi-TeV SUSY spectrum. The increase in $m_h$ due to messenger-matter mixing is maximal in the case of messengers belonging to 10+\\bar{10} of SU(5) unification, while it is still significant when they belong to $5+\\bar{5}$ of SU(5). Our results are compatible with gauge coupling unification, perturbativity, and the unification of messenger Yukawa couplings. We embed these models into a grand unification framework with a U(1) flavor symmetry that addresses the fermion mass hierarchy and generates naturally large neutrino mixing angles. While SUSY mediated flavor changing processes are sufficiently suppressed in such an embedding, small new contributions to K^0-\\bar{K^0} mixing can resolve the apparent discrepancy in the CP asymmetry parameters \\sin2βand ε_K. △ Less", "Motivated by the observed excess of the di-photon signal in Higgs searches, $σ_{γγ}/σ_{\\rm SM}\\simeq 1.5$, we argue that models with enhanced $Γ(h\\to γγ)$ alone are the most favorable scenarios when the latest LHC/Tevatron results are all taken into account. We study the phenomenology of a supersymmetric scenario of light stau first proposed by \\textit{Carena et. al. \\cite{carlos}} that predicts a 125 GeV SM-like Higgs boson with enhanced diphoton decay through light stau loops. Since it is extremely challenging to search the Drell-Yan stau pair at the LHC due to the small production rate, we focus on the parameter space with enhanced production of inclusive stau pairs, in particular, via $b\\bar{b}$ fusion or gaugino pairs. We study its phenomenology in both pure leptonic tau $τ^\\pm_\\ell$ channels and hadronic tau tagged $τ_h$ channels. We find the same-sign dilepton from $\\tildeχ^\\pm_1 \\tildeχ^0_2 \\to τ^\\pm_\\ell τ^\\pm_\\ell+X$ may significantly improve the discovery potential with even 7--8 TeV LHC of ${\\cal O}(30 \\text{fb}^{-1})$ data. In the case of hadronic tau pair, we use the final state $j+τ_h τ_h +\\cancel{E}_T$ to search and find that even with the most optimistic region of $M_2\\sim 200-300$ GeV, it requires at least 50 fb$^{-1}$ data of 14 TeV LHC to reach a significance of 3.5 $σ$. Therefore, we conclude it is difficult to claim discovery only through hadronic tau based on the data by the 2012 shut-down. 5 $σ$ reach for our most optimistic region then requires 100 fb$^{-1}$ data with 14 TeV running. △ Less", "We compute the effective Kahler potential for matter fields in warped compactifications, starting from five dimensional gauged supergravity, as a function of the matter fields localization. We show that truncation to zero modes is inconsistent and the tree-level exchange of the massive gravitational multiplet is needed for consistency of the four-dimensional theory. In addition to the standard Kahler coming from dimensional reduction, we find the quartic correction coming from integrating out the gravity multiplet. We apply our result to the computation of scalar masses, by assuming that the SUSY breaking field is a bulk hypermultiplet. In the limit of extreme opposite localization of the matter and the spurion fields, we find zero scalar masses, consistent with sequestering arguments. Surprisingly enough, for all the other cases the scalar masses are tachyonic. This suggests the holographic interpretation that a CFT sector always generates operators contributing in a tachyonic way to scalar masses. Viability of warped su- persymmetric compactifications necessarily asks then for additional contributions. We discuss the case of additional bulk vector multiplets with mixed boundary conditions, which is a partic- ularly simple and attractive way to generate large positive scalar masses. We show that in this case successful fermion mass matrices implies highly degenerate scalar masses for the first two generations of squarks and sleptons. △ Less", "We show that an enhanced two-photon signal of the Higgs boson, h, observed with 125 GeV mass by the ATLAS and CMS collaborations, can be obtained if it is identified principally with the neutral $H_u^0$ of the two Higgs doublets of minimal Supersymmetry. We focus on sparticles and the pseudoscalar Higgs $A$ at the TeV scale. The off-diagonal element of the (Hu0,Hd0) mass matrix in the flavor basis must be suppressed, and this requires both a large Higgsino mass parameter, mu \\sim TeV, and large tan beta. A MSSM sum rule is derived that relates gamma gamma and bb rates, and the gamma gamma enhancement predicts the bb reduction. On the contrary, Natural SUSY requires | mu | < 0.5 TeV, for which gamma gamma is reduced and $b\\bar b$ is enhanced. This conclusion is independent of the mA-value and the SUSY quantum correction Deltab. Relative tau tau to bb rates are sensitive to Deltab. △ Less", "We perform a study of the dark matter candidates of a constrained version of the minimal R-parity-conserving supersymmetric model with a gauged $U(1)_{B-L}$. It turns out that there are four additional candidates for dark matter in comparison to the MSSM: two kinds of neutralino, which either correspond to the gaugino of the $U(1)_{B-L}$ or to a fermionic bilepton, as well as \"right-handed\" CP-even and -odd sneutrinos. The correct dark matter relic density of the neutralinos can be obtained due to different mechanisms including new co-annihilation regions and resonances. The large additional Yukawa couplings required to break the $U(1)_{B-L}$ radiatively often lead to large annihilation cross sections for the sneutrinos. The correct treatment of gauge kinetic mixing is crucial to the success of some scenarios. All candidates are consistent with the exclusion limits of Xenon100. △ Less", "A handy and extensively used kinematic variable in LHC analyses, especially for golden SUSY signals of multijets plus missing energy, is the Effective Mass, M_eff = sum_j |p_T^j|+ |p_T^miss|. Empirically, the value of M_eff at which the histogram of events has a maximum is correlated with the SUSY spectrum, M_eff|_max ~ 80% M_susy, where M_susy is essentially the sum of the masses of the SUSY particles initially created. In this paper we explain the reason for such strong correlation, pointing out the cases where the correlation is not good. Besides, we propose a new variable, the Effective Transverse Energy, E_T^eff, which shows an even better and more direct correlation E_T^eff|_max ~ M_susy, and is independent of the procedure followed to identify the jets. E_T^eff and M_eff are complementary variables, rather than competitors; and plotting histograms in both can be useful to cross-check the results, allowing a better and more robust identification of M_susy. The extension of this procedure to other scenarios of new physics (not necessarily SUSY) is straightforward. △ Less", "I review the status of supersymmetry after the 2011 LHC search results. I concentrate in particular on interpretations beyond the conventional CMSSM, including i) natural SUSY with light stops, and ii) the so-called phenomenological MSSM, which is a general parametrization of the MSSM at the weak scale, without boundary conditions imposed by specific SUSY breaking schemes. We will see that the current searches are not yet sensitive to some of the theoretically most interesting scenarios. △ Less", "We consider low scale gauge mediation models with a very light gravitino m_{3/2}~16 eV, in the light of recent experimental hints on the Higgs boson mass. The light gravitino is very interesting since there is no gravitino over-production problem, but it seems difficult to explain the Higgs boson mass of ~125 GeV. This is because of the conflict between the light gravitino mass and heavy SUSY particle masses needed for producing the relatively heavy Higgs boson mass. We consider two possible extensions in this paper: a singlet extension of the Higgs sector, and strongly coupled gauge mediation. We show that there is a large parameter space, in both scenarios, where the Higgs boson mass of ~125 GeV is explained without any conflict with such a very light gravitino. △ Less", "Threshold contributions to light scalar soft masses due to heavy sparticles (possibly including a heavy Higgs mostly aligned with H_d) in Effective SUSY scenarios are dominated by two-loop diagrams involving gauge couplings. This is due to the fact that in the limit in which the heavy states are degenerate, their one-loop contributions to the light soft masses only depend on small Yukawas and the hypercharge coupling. The two-loop threshold corrections involving only gauge couplings are calculated accounting for nonzero gaugino and light squark masses and shown to be negative, and rather large (δm^2_{t,L}\\sim-480^2 GeV^2 for heavy sparticles with masses around 10 TeV). The effect on tachyon bounds is revisited with calculations implementing decoupling. It is pointed out that models yielding Effective SUSY spectra using gaugino mediation require in general very heavy gluinos or a very low SUSY breaking scale in order to avoid tachyons (e.g. for heavy squarks at 10 TeV and a SUSY breaking scale of 125 TeV, minimal scenarios require \\tilde m_3 >=2 TeV at 500 GeV, while nonminimal ones demand \\tilde m_3 >= 8 TeV). △ Less", "Some supersymmetric models after the recent LHC reports are discussed. Especially, the light Higgs boson around 125GeV is attempted to be accommodated. An extra Z' from GUTs, and the scalar and pseudoscalar Higgs bosons in supersymmetric extension of the standard model are also discussed. △ Less", "We have revisited the prospects of Supersymmetry(SUSY) searches at the LHC with 7 TeV energy along with the prediction of the discovery potential at 8 TeV energy assuming an integrated luminosity 5 $fb ^{-1}$ and 20 $\\invfb$ with mSUGRA/CMSSM as a model framework. We discuss further optimization of our selection strategy which is based on the hadronic event shape variables. Evaluating the standard model backgrounds and signal rates in detail we predict the discovery reach in the $m_0 - m_{1/2}$ plane for 7 TeV with 5$\\invfb$ luminosity. We also present the discovery reach for 8 TeV energy with an integrated luminosity 5$\\invfb$ and 20 $\\invfb$. A comparison is made between our results and the exclusion plots obtained by CMS and ATLAS. Finally, discovery reach in the gluino and squark mass plane at the 7 TeV and 8 TeV energy is also presented. △ Less", "We study Higgs production and decays in the context of natural SUSY, allowing for an extended Higgs sector to account for a 125 GeV lightest Higgs boson. Under broad assumptions, Higgs observables at the LHC depend on at most four free parameters with restricted numerical ranges. Two parameters suffice to describe MSSM particle loops. The MSSM loop contribution to the diphoton rate is constrained from above by direct stop and chargino searches and by electroweak precision tests. Naturalness, in particular in demanding that rare B decays remain consistent with experiment without fine-tuned cancellations, provides a lower (upper) bound to the stop contribution to the Higgs-gluon coupling (Higgs mass). Two parameters suffice to describe Higgs mixing, even in the presence of loop induced non-holomorphic Yukawa couplings. Generic classes of MSSM extensions, that address the fine-tuning problem, predict sizable modifications to the effective bottom Yukawa, yb. Non-decoupling gauge extensions enhance yb, while a heavy SM singlet reduces yb. A factor of 4-6 enhancement in the diphoton rate at the LHC, compared to the SM prediction, can be accommodated. The ratio of the enhancements in the diphoton vs. the WW and ZZ channels cannot exceed 1.4. The h to bbbar rate in associated production cannot exceed the SM rate by more than 50%. △ Less", "Naturalness in supersymmetry (SUSY) is under siege by increasingly stringent LHC constraints, but natural electroweak symmetry breaking still remains the most powerful motivation for superpartner masses within experimental reach. If naturalness is the wrong criterion then what determines the mass scale of the superpartners? We motivate supersymmetry by (1) gauge coupling unification, (2) dark matter, and (3) precision b-tau Yukawa unification. We show that for an LSP that is a bino-Higgsino admixture, these three requirements lead to an upper-bound on the stop and sbottom masses in the several TeV regime because the threshold correction to the bottom mass at the superpartner scale is required to have a particular size. For tan beta about 50, which is needed for t-b-tau unification, the stops must be lighter than 2.8 TeV when A_t has the opposite sign of the gluino mass, as is favored by renormalization group scaling. For lower values of tan beta, the top and bottom squarks must be even lighter. Yukawa unification plus dark matter implies that superpartners are likely in reach of the LHC, after the upgrade to 14 (or 13) TeV, independent of any considerations of naturalness. We present a model-independent, bottom-up analysis of the SUSY parameter space that is simultaneously consistent with Yukawa unification and the hint for m_h = 125 GeV. We study the flavor and dark matter phenomenology that accompanies this Yukawa unification. A large portion of the parameter space predicts that the branching fraction for B_s to mu^+ mu^- will be observed to be significantly lower than the SM value. △ Less", "We consider SUSY extensions of the standard model where the gravitino is the dark-matter particle and the stau is long lived. If there is a significant mass gap with squarks and gluinos, the staus produced at hadron colliders tend to be fast (beta>0.8), and the searches based on their delay in the time of flight or their anomalous ionization become less effective. Such staus would be identified as regular muons with the same linear momentum and a slightly reduced energy. Compared to the usual SUSY models where a neutralino is the LSP, this scenario implies (i) more leptons (the two staus at the end of the decay chains), (ii) a strong e-mu asymmetry, and (iii) less missing E_T (just from neutrinos, as the lightest neutralino decays into stau). We study the bounds on this SUSY from current LHC analyses (same-sign dileptons and multilepton events) and discuss the best strategy for its observation. △ Less", "The {\\it gauge hierarchy problem} found in perturbation theory is one of the main attractions for supersymmetry. Yet the quantum mechanical coupling of a low energy system to a high energy one invariably leads to {\\it perturbative instability}, which is not a valid signal of dynamical inconsistency. We show by examples how perturbation theory with widely separated scales gives false results. We also identify the flaw in perturbative fine-tuning arguments. Non-perturbative features of random subsystems maintain and preserve the hierarchy in which they are embedded. After reviewing the likelihood the hierarchy problem is a perturbative fiction, we suggest a new interpretation of $susy$ as practical auxiliary fields. Their function is much like Feynman's gauge ghosts, developed in perturbation theory to repair illnesses of perturbation theory. $susy$ will be found useful when it is considered a tool of applied mathematics and data-fitting. We propose that $susy$ data fits should be customized to the particular experimental situations they are suited to improve, without dilution from the needless assumption that $susy$ must describe universal new physics. It is likely that $susy$ will soon be discovered a useful part of data analysis and diagnostics towards improving the understanding of the Standard Model, and possibly towards discovering what may constitute new physics after all. △ Less", "The SUSY Les Houches Accord (SLHA) 2 extended the first SLHA to include various generalisations of the Minimal Supersymmetric Standard Model (MSSM) as well as its simplest next-to-minimal version. Here, we propose further extensions to it, to include the most general and well-established see-saw descriptions (types I/II/III, inverse, and linear) in both an effective and a simple gauged extension of the MSSM framework. In addition, we generalise the PDG numbering scheme to reflect the properties of the particles. △ Less", "The pMSSM provides a broad perspective on SUSY phenomenology. In this paper we generate two new, very large, sets of pMSSM models with sparticle masses extending up to 4 TeV, where the lightest supersymmetric particle (LSP) is either a neutralino or gravitino. The existence of a gravitino LSP necessitates a detailed study of its cosmological effects and we find that Big Bang Nucleosynthesis places strong constraints on this scenario. Both sets are subjected to a global set of theoretical, observational and experimental constraints resulting in a sample of \\sim 225k viable models for each LSP type. The characteristics of these two model sets are briefly compared. We confront the neutralino LSP model set with searches for SUSY at the 7 TeV LHC using both the missing (MET) and non-missing ET ATLAS analyses. In the MET case, we employ Monte Carlo estimates of the ratios of the SM backgrounds at 7 and 8 TeV to rescale the 7 TeV data-driven ATLAS backgrounds to 8 TeV. This allows us to determine the pMSSM parameter space coverage for this collision energy. We find that an integrated luminosity of \\sim 5-20 fb^{-1} at 8 TeV would yield a substantial increase in this coverage compared to that at 7 TeV and can probe roughly half of the model set. If the pMSSM is not discovered during the 8 TeV run, then our model set will be essentially void of gluinos and lightest first and second generation squarks that are \\lesssim 700-800 GeV, which is much less than the analogous mSUGRA bound. Finally, we demonstrate that non-MET SUSY searches continue to play an important role in exploring the pMSSM parameter space. These two pMSSM model sets can be used as the basis for investigations for years to come. △ Less", "We work out the strongly interacting sector of a non-minimal Universal Extra Dimension (nmUED) scenario with one flat extra spatial dimension orbifolded on S^1/Z_2 in the presence of brane-localized kinetic and Yukawa terms. On compactification, these terms are known to have significant, nontrivial impact on the masses and the couplings of the Kaluza-Klein (KK) excitations. We study the masses of the level `1' KK gluon and the quarks and find the modified strong interaction vertices involving these particles. The scenario conserves KK parity. Possibility of significant level-mixing among the quarks from different KK-levels is pointed out with particular reference to the top quark sector. Cross sections for various generic final states involving level `1' KK-gluon and KK-quarks from first two generations are estimated at the Large Hadron Collider (LHC) via an implementation of the scenario in MadGraph-5 with the help of FeynRules. The decay branching fractions of both strong and weakly interacting KK excitations are studied to estimate yields in various different final states involving jets, leptons and missing energy. These are used to put some conservative constraints on the nmUED parameter space using the latest LHC data. Nuances of the scenario are elucidated with reference to the minimal Universal Extra Dimension (mUED) and Supersymmetry (SUSY) and their implications for the LHC are discussed. △ Less", "We consider the natural supersymmetry scenario in the framework of the R-parity conserving minimal supersymmetric standard model (called natural MSSM) and examine the observability of stop pair production at the LHC. We first scan the parameters of this scenario under various experimental constraints, including the SM-like Higgs boson mass, the indirect limits from precision electroweak data and B-decays. Then in the allowed parameter space we study the stop pair production at the LHC followed by the stop decay into a top quark plus a lightest neutralino or into a bottom quark plus a chargino. From detailed Monte Carlo simulations of the signals and backgrounds, we find the two decay modes are complementary to each other in probing the stop pair production, and the LHC with $\\sqrt{s}= 14$ TeV and 100 $fb^{-1}$ luminosity is capable of discovering the stop predicted in natural MSSM up to 450 GeV. If no excess events were observed at the LHC, the 95% C.L. exclusion limits of the stop masses can reach around 537 GeV. △ Less", "We discuss the minimal supersymmetric $U(1)_{B-L}\\times U(1)_R$ extension of the standard model. Gauge couplings unify as in the MSSM, even if the scale of $U(1)_{B-L}\\times U(1)_R$ breaking is as low as order TeV and the model can be embedded into an SO(10) grand unified theory. The phenomenology of the model differs in some important aspects from the MSSM, leading potentially to rich phenomenology at the LHC. It predicts more light Higgs states and the mostly left CP-even Higgs has a mass reaching easily 125 GeV, with no constraints on the SUSY spectrum. Right sneutrinos can be the lightest supersymmetric particle, changing all dark matter constraints on SUSY parameter space. The model has seven neutralinos and squark/gluino decay chains involve more complicated cascades than in the MSSM. We also discuss briefly low-energy and accelerator constraints on the model, where the most important limits come from recent $Z'$ searches at the LHC and upper limits on lepton flavour violation. △ Less", "We consider a supersymmetric version of the standard model extended by an additional U(1)_{B-L}. This model can be embedded in an mSUGRA-inspired model where the mass parameters of the scalars and gauginos unify at the scale of grand unification. In this class of models the renormalization group equation evolution of gauge couplings as well as of the soft SUSY-breaking parameters require the proper treatment of gauge kinetic mixing. We first show that this has a profound impact on the phenomenolgy of the Z' and as a consequence the current LHC bounds on its mass are reduced significantly from about 1920 GeV to 1725 GeV. They are even further reduced if the Z' can decay into supersymmetric particles. Secondly, we show that in this way sleptons can be produced at the LHC in the 14 TeV phase with masses of several hundred GeV. In the case of squark and gluino masses in the multi-TeV range, this might become an important discovery channel for sleptons up to 650 GeV (800 GeV) for an integrated luminosity of 100 fb^{-1} (300 fb^{-1}). △ Less", "We study the solution of the BFKL equation in the adjoint representation for the N=4 SUSY theory at NLO accuracy. Consistency with the large momentum transfer solution obtained by Fadin and Lipatov is found. We investigate, for large and small values of the momentum transfer, the growth with energy of the Green function, its collinear behaviour and the expansion in azimuthal angle Fourier components. △ Less", "This document emerged from work that started in January 2012 as a joint effort by the ATLAS, CMS and LPCC supersymmetry (SUSY) working groups to compile state-of-the-art cross section predictions for SUSY particle production at the LHC. We present cross sections for various SUSY processes in pp collisions at $\\sqrt{s} =7$ TeV, including an estimate of the theoretical uncertainty due to scale variation and the parton distribution functions. Further results for higher LHC centre-of-mass energies will be collected at https://twiki.cern.ch/twiki/bin/view/LHCPhysics/SUSYCrossSections. For squark and gluino production, which dominate the inclusive SUSY cross section, we employ calculations which include the resummation of soft gluon emission at next-to-leading logarithmic accuracy, matched to next-to-leading order (NLO) SUSY-QCD. In all other cases we rely on NLO SUSY-QCD predictions. △ Less", "We show that the No-Scale Flipped SU(5) construction is transparently consistent with recent LHCb results for B_s^0 to μ^+ μ^- decays, due primarily to suppression from the rather small value of tanβ~ 20 that is globally enforced across the model space. This fact should be interpreted in conjunction with the demonstrated evasion of mass limits from the ATLAS and CMS SUSY searches and the more important potential explanation of small observed excesses in the multijet data. The No-Scale Flipped SU(5) benchmark model that best fits these excesses has a gaugino mass scale of M_{1/2} = 708 GeV, which drives masses for the bino-dominated LSP m_χ_1^0 = 143.4 GeV, light stop m_t1 = 786 GeV, gluino m_g = 952 GeV, and heavy squark m_uL = 1490 GeV. The corresponding total prediction for the rare B-decay of Br(B_s^0 to μ^+ μ^-) = 3.5 x 10^-9 suggests that the SUSY contribution may indeed be much smaller than that expected from the Standard Model in this framework, fitting quite comfortably within the very tightly constrained region remaining viable after the most recent LHCb measurements. △ Less", "We discuss collider signatures of the \"natural supersymmetry\" scenario with baryon-number violating R-parity violation. We argue that this is one of the few remaining viable incarnations of weak scale supersymmetry consistent with full electroweak naturalness. We show that this intriguing and challenging scenario contains distinctive LHC signals, resonances of hard jets in conjunction with relatively soft leptons and missing energy, which are easily overlooked by existing LHC searches. We propose novel strategies for distinguishing these signals above background, and estimate their potential reach at the 8 TeV LHC. We show that other multi-lepton signals of this scenario can be seen by currently existing searches with increased statistics, but these opportunities are more spectrum-dependent. △ Less", "In this paper we study the gluino dijet mass edge measurement at the LHC in a realistic situation including both SUSY and combinatorical backgrounds together with effects of initial and final state radiation as well as a finite detector resolution. Three benchmark scenarios are examined in which the dominant SUSY production process and also the decay modes are different. Several new kinematical variables are proposed to minimize the impact of SUSY and combinatorial backgrounds in the measurement. By selecting events with a particular number of jets and leptons, we attempt to measure two distinct gluino dijet mass edges originating from wino $\\tilde g \\to jj \\tilde W$ and bino $\\tilde g \\to jj \\tilde B$ decay modes, separately. We determine the endpoints of distributions of proposed and existing variables and show that those two edges can be disentangled and measured within good accuracy, irrespective of the presence of ISR, FSR, and detector effects. △ Less", "The three-gluon vertex is a basic object of interest in nonabelian gauge theory. It contains important structural information, in particular on infrared divergences, and also figures prominently in the Schwinger-Dyson equations. At the one-loop level, it has been calculated and analyzed by a number of authors. Here we use the worldline formalism to unify the calculations of the scalar, spinor and gluon loop contributions to the one-loop vertex, leading to an extremely compact representation. The SUSY - related sum rule found by Binger and Brodsky follows from an off-shell extension of the Bern-Kosower replacement rules. We explain the relation of the structure of our representation to the low-energy effective action. △ Less", "A U(2)^3 flavour symmetry acting on the first two generations of quarks partially explains the hierarchies of the yukawa couplings, and provides a natural embedding for Supersymmetry with heavier first two generations, where collider constraints are not in conflict with the requirement of naturalness and the SUSY CP problem is solved. Within this context a specific pattern of flavour symmetry breaking is considered. The K, B_d and B_s mixing amplitudes show a definite correlation that can resolve existing tensions in the CKM fit, pointing in this way to sbottom and gluino masses below about 1.5 TeV. Potentially sizeable contributions to both indirect and direct CP violation in B decays are allowed, even in the absence of flavour-blind phases. In case some effects are observed, the peculiar pattern in Delta(F) = 2 and Delta(B) = 1 observables may allow to distinguish between this and other models. △ Less", "We constrain the masses of scalar-tops (stop) by analyzing the new precision Tevatron measurement of the W-boson mass and the LHC/Tevatron indications of a Higgs boson of mass 125.5+-1 GeV. Our study adopts Natural SUSY with low fine-tuning, which has multi-TeV first and second generation squarks and a light Higgsino mixing parameter mu=150 GeV. An effective Lagrangian calculation is made of mh to 3-loops using the H3m program with weak scale SUSY parameters obtained from RGE evolution from the GUT scale in the Natural SUSY scenario. The SUSY radiative corrections to the Higgs mass imply maximal off-diagonal elements of the stop mass-matrix and a mass splitting of the two stops larger than 400 GeV. △ Less", "In the context of supersymmetric models in which small Dirac neutrino masses are generated by supersymmetry breaking, a mainly right-handed (RH) mixed sneutrino can be an excellent cold dark matter (DM) candidate. We perform a global analysis of the Minimal Supersymmetric Standard Model (MSSM)+RH neutrino parameter space by means of Markov Chain Monte Carlo scans. We include all relevant constraints from collider and dark matter searches, paying particular attention to nuclear and astrophysical uncertainties. Two distinct cases can satisfy all constraints: heavy sneutrino DM with mass of order 100 GeV, as well as light sneutrino DM with mass of about 3-6 GeV. We discuss the implications for direct and indirect dark matter searches, as well as for SUSY and Higgs searches at the LHC for both, the light and the heavy sneutrino dark matter case. The light sneutrino case is excluded by the 125-126 GeV Higgs signal. △ Less", "We present a short review of the LHC results at 7 TeV and their implications on the Standard Model (SM) and on its Supersymmetric (SUSY) extension. In particular we discuss the exclusion range for the SM Higgs mass, the tantalizing hint of an excess at $m_H \\sim 125$ GeV, the negative results of searches for SUSY particles (as well as for any other new physics) and the present outlook. △ Less", "Additional neutral gauge fermions -- \"photini\" -- arise in string compactifications as superpartners of U(1) gauge fields. Unlike their vector counterparts, the photini can acquire weak-scale masses from soft SUSY breaking and lead to observable signatures at the LHC through mass mixing with the bino. In this work we investigate the collider consequences of adding photini to the neutralino sector of the MSSM. Relatively large mixing of one or more photini with the bino can lead to prompt decays of the lightest ordinary supersymmetric particle; these extra cascades transfer most of the energy of SUSY decay chains into Standard Model particles, diminishing the power of missing energy as an experimental handle for signal discrimination. We demonstrate that the missing energy in SUSY events with photini is reduced dramatically for supersymmetric spectra with MSSM neutralinos near the weak scale, and study the effects on limits set by the leading hadronic SUSY searches at ATLAS and CMS. We find that in the presence of even one light photino the limits on squark masses from hadronic searches can be reduced by 400 GeV, with comparable (though more modest) reduction of gluino mass limits. We also consider potential discovery channels such as dilepton and multilepton searches, which remain sensitive to SUSY spectra with photini and can provide an unexpected route to the discovery of supersymmetry. Although presented in the context of photini, our results apply in general to theories in which additional light neutral fermions mix with MSSM gauginos. △ Less", "We study the realisation of supersymmetric discrete flavour symmetry models to the thermal history of our universe. We focus on the evolution of the pseudo moduli field among the flavons by taking into account finite temperature corrections. We show that the pseudo moduli flavon dominates the energy density of our universe and this domination makes crucially difficult to realise the flavour symmetry models in our universe. We also discuss possible extensions of the supersymmetric discrete flavour symmetry models which can ensure the consistency of the models with the thermal history of our universe. Finally, we show an extension to realise the thermal inflation by the flavon domination. △ Less", "We present definite correlations between the CMS 5 \\fb all-hadronic search employing the stransverse mass variable $M_{T2}$ and the ATLAS 5 \\fb all-hadronic and multijet supersymmetry (SUSY) searches, suggesting the possibility that both the ATLAS and CMS experiments are already registering a faint but legitimate SUSY signal at the LHC. We isolate this prospective mutual productivity beyond the Standard Model in the framework of the supersymmetric No-Scale Flipped $SU$(5) grand unified theory, supplemented with extra vector-like matter (flippons). Evident overproduction is observed in three CMS \\mt2 and four ATLAS hadronic and multijet signal regions, where a \\x2 fitting procedure of the CMS 5 \\fb \\mt2 search establishes a best fit SUSY mass in sharp agreement with corresponding ATLAS searches of equivalently heightened signal significance. We believe this correlated behavior across two distinct experiments at precisely the same SUSY mass scale to be highly non-trivial, and potentially indicative of an existing 5 \\fb LHC reach into a pervasive physical supersymmetry framework. △ Less", "The presence of fields at an intermediate scale between the Electroweak and the Grand Unification scale modifies the evolution of the gauge couplings and consequently the running of other parameters of the Minimal Supersymmetric Standard Model, such as gauginos and scalar masses. The net effect is a modification of the low energy spectrum which affects both the collider phenomenology and the dark matter relic density. △ Less", "Direct searches and the hints for the Higgs at ~125 GeV put increasing pressure on simple models of SUSY breaking, in particular (but not exclusively) on those that automatically solve the flavour problem, such as gauge mediation. SUSY-breaking parameters are pushed to higher and higher values, increasing the fine-tuning required to achieve electroweak symmetry breaking at the observed scale. In this note we consider the situation for models which do not attempt to solve the flavour problem. To treat them on equal footing, we consider the combined fine-tuning arising from electroweak symmetry breaking as well as from fulfilling flavour constraints. We also consider CP. We find that for an anarchic flavour (and CP) structure of the soft SUSY breaking terms, the minimum in the fine-tuning occurs at a scale of a few TeV. This is consistent with the current experimental situation and leads to motivating conclusions for direct searches as well as future flavour and CP measurements. △ Less", "We re-evaluate prospects for supersymmetry at the proposed International Linear $e^+e^-$ Collider (ILC) in light of the first year of serious data taking at LHC with $\\sqrt{s}=7$ TeV and $\\sim 5$ fb$^{-1}$ of $pp$ collisions (LHC7). Strong new limits from LHC SUSY searches, along with a hint of a Higgs boson signal around $m_h\\sim 125$ GeV, suggest a paradigm shift from previously popular models to ones with new and compelling signatures. We present a variety of new ILC benchmark models, including: natural SUSY, hidden SUSY, NUHM2 with low $m_A$, non-universal gaugino mass (NUGM) model, pMSSM, Kallosh-Linde model, Brümmer-Buchmüller model, normal scalar mass hierarchy (NMH) plus one surviving case from mSUGRA/CMSSM in the far focus point region. While all these models at present elude the latest LHC limits, they do offer intriguing case study possibilities for ILC operating at $\\sqrt{s}\\sim 0.25-1$ TeV, and present a view of some of the diverse SUSY phenomena which might be expected at both LHC and ILC in the post LHC7 era. △ Less", "The presence of new matter fields charged under the Standard Model gauge group at intermediate scales below the Grand Unification scale modifies the renormalization group evolution of the gauge couplings. This can in turn significantly change the running of the Minimal Supersymmetric Standard Model parameters, in particular the gaugino and the scalar masses. In the absence of new large Yukawa couplings we can parameterise all the intermediate scale models in terms of only two parameters controlling the size of the unified gauge coupling. As a consequence of the modified running, the low energy spectrum can be strongly affected with interesting phenomenological consequences. In particular, we show that scalar over gaugino mass ratios tend to increase and the regions of the parameter space with neutralino Dark Matter compatible with cosmological observations get drastically modified. Moreover, we discuss some observables that can be used to test the intermediate scale physics at the LHC in a wide class of models. △ Less", "The status of top-bottom-tau Yukawa coupling unification in supersymmetric SO(10) models is reviewed with a particular emphasis on the implications of the Higgs boson mass in the vicinity of 125 GeV, as suggested by the LHC Higgs data. In addition, the recently proposed model with negative μ, D-term splitting of the soft scalar masses and non-universal gaugino masses generated by a non-zero F-term in a 24-dimensional representation of SU(5) \\subset SO(10) is re-analysed in the context of the 125 GeV Higgs. The condition of top-bottom-tau Yukawa unification together with the Higgs mass of about 125 GeV impose strong lower mass limits on SUSY particles. Nevertheless, some of the MSSM particles may be within the reach of the LHC. In the case of models with positive μthis is the gluino. While in the case of negative μthese are the pseudoscalar Higgs, the lighter sbottom (sometimes strongly degenerate with the LSP leading to sbottom coannihilations), the right-handed down squark and the gluino. △ Less", "The LHC inverse problem refers to the difficulties in determining the parameters of an underlying theory from data (to be) taken by the LHC experiments: if they find signals of new physics, and an underlying theory is assumed, could its parameters be determined uniquely, or do different parameter choices give indistinguishable experimental signatures? This inverse problem was studied before for a supersymmetric Standard Model with 15 free parameters. This earlier study found 283 indistinguishable pairs of parameter choices, called degenerate pairs, even if backgrounds are ignored. We can resolve all but 23 of those pairs by constructing a true χ^2 distribution using mostly counting observables. The elimination of systematic errors would even allow separating the residual degeneracies. Taking the Standard Model background into account we still can resolve 237 of the 283 \"degenerate\" pairs. This indicates that (some of) our observables should also be useful for the purpose of determining the values of SUSY parameters. △ Less", "The breakdown of E_6 gauge symmetry at high energies may lead to supersymmetric (SUSY) models based on the Standard Model (SM) gauge group together with extra U(1)_ψ and U(1)_χ gauge symmetries. To ensure anomaly cancellation the particle content of these E_6 inspired models involves extra exotic states that generically give rise to non-diagonal flavour transitions and rapid proton decay. We argue that a single discrete \\tilde{Z}^{H}_2 symmetry can be used to forbid tree-level flavor-changing transitions, as well as the most dangerous baryon and lepton number violating operators. We present 5D and 6D orbifold GUT constructions that lead to the E_6 inspired SUSY models of this type. The breakdown of U(1)_ψ and U(1)_χ gauge symmetries that preserves E_6 matter parity assignment guarantees that ordinary quarks and leptons and their superpartners, as well as the exotic states which originate from 27 representations of E_6 survive to low energies. These E_6 inspired models contain two dark-matter candidates and must also include additional TeV scale vectorlike lepton or vectorlike down type quark states to render the lightest exotic quark unstable. We examine gauge coupling unification in these models and discuss their implications for collider phenomenology and cosmology. △ Less", "Recently, both the ATLAS and CMS experiments have observed an excess of events that could be the first evidence for a 125 GeV Higgs boson. We investigate an implication of the CP-even Higgs boson with mass around 125 GeV in the context of the minimal gauge mediated supersymmetry breaking (mGMSB). In mGMSB, gravitino is the lightest sparticle (LSP) and hence the dark matter candidate. We consider the so-called superWIMP scenario where the dark matter gravitino is non-thermally produced by the decay of the next-to-LSP (NLSP) bino-like neutralino after its freeze-out. For a given $\\tan β$ and the number of the messengers ($N_m$) fixed, we find that the rest of the mGMSB parameters, the SUSY breaking parameter and the messenger scale, are completely fixed by the conditions of simultaneously realizing the observed dark matter abundance and the 125 GeV Higgs boson mass, leading to the NLSP neutralino mass around 1.5-2 TeV and the gravitino mass around 3-7 GeV, depending on the values of $\\tan β$ and $N_m$. The lifetime of the NLSP is found to be shorter than 1 sec, so that the success of the big bang nucleosynthesis remains intact. The non-thermally produced gravitino behaves as the warm dark matter with the free-streaming scale found to be $λ_{\\rm FS} \\simeq 0.1$ Mpc, whose value is reasonable for observations of the power spectrum on both large and sub-galactic scales in the Universe. △ Less", "Flat directions in supersymmetric models can get large vacuum expectation values in the early Universe which leads to a large mass for gauge bosons and gauginos. We point out that this can then result in enhanced gravitino production because the cross-section for the production of the +/- 1/2 helicity states of the gravitino is proportional to the square of the gaugino masses. We consider gravitino production after inflation in such a scenario and find that the abundance in some cases can be much larger than the upper bound on the gravtino abundance from cosmological constraints unless the flat direction field has a very small vacuum expectation value when it commences oscillating. △ Less", "We present a SUSY SU(5)xT' unified flavour model with type I see-saw mechanism of neutrino mass generation, which predicts the reactor neutrino angle to be θ_{13} = 0.14 close to the recent results from the Daya Bay and RENO experiments. The model predicts also values of the solar and atmospheric neutrino mixing angles, which are compatible with the existing data. The T' breaking leads to tri-bimaximal mixing in the neutrino sector, which is perturbed by sizeable corrections from the charged lepton sector. The model exhibits geometrical CP violation, where all complex phases have their origin from the complex Clebsch-Gordan coefficients of T'. The values of the Dirac and Majorana CP violating phases are predicted. For the Dirac phase in the standard parametrisation of the neutrino mixing matrix we get a value close to 90 degrees δ= π/2 - 0.45 θ^c = 84.3 degrees, θ^c being the Cabibbo angle. The neutrino mass spectrum can be with normal ordering (2 cases) or inverted ordering. In each case the values of the three light neutrino masses are predicted with relatively small uncertainties, which allows to get also unambiguous predictions for the neutrino-less double beta decay effective Majorana mass. △ Less", "It is shown that, in supergravity models of inflation where the gauge kinetic function of a gauge field is modulated by the inflaton, we can obtain a new inflationary attractor solution, in which the roll-over of the inflaton suffers additional impedance due to the vector field backreaction. As a result, directions of the scalar potential which, due to strong Kaehler corrections, become too steep and curved to normally support slow-roll inflation can now naturally do so. This solves the infamous eta-problem of inflation in supergravity and also keeps the spectral index of the curvature perturbation mildly red despite eta of order unity. This mechanism is applied to a model of hybrid inflation in supergravity with a generic Kaehler potential. The spectral index of the curvature perturbation is found to be 0.97 - 0.98, in excellent agreement with data. The gauge field can act as vector curvaton generating statistical anisotropy in the curvature perturbation. However, this anisotropy could be possibly observable only if the gauge coupling constant is unnaturally small. △ Less", "The recent measurement of the reactor angle as $\\sin^2 2θ_{13} = 0.092 \\pm 0.016(stat) \\pm 0.005(syst)$ come from the Daya Bay collaboration. Evidence of nonzero θ_{13} was also there at T2K, MINOS and Double Chooz experiments. We study the implication of these recent data on neutrino mass matrix and consequently on leptogenesis in a supersymmetric SO(10) model. To explain the smallness of neutrino mass, in general, we require a heavy Majorana neutrino which is a natural candidate in SO(10) model. In minimal SO(10) model, the symmetry breaking scale or the right-handed neutrino mass scale is close to the GUT scale. It is not only beyond the reach of any present or future collider search but the lepton asymmetry generated from its decay is in conflict with the gravitino constraint as well as unable to fit the neutrino data. We show that addition of an extra fermion singlet can accommodate the observed recent neutrino data in a supersymmetric SO(10) model. This model can generate the desired lepton asymmetry and provide TeV scale doubly-charged Higgs scalars to be detected at LHC. △ Less", "According to supersimplicity in MSSM, a renormalization scheme (SRS) may be defined for any high energy 2-to-2 process, to the 1loop EW order; where the helicity conserving (HC) amplitudes, are expressed as a linear combination of just three universal logarithm-involving forms. All other helicity amplitudes vanish asymptotically. Including to these SRS amplitudes the corresponding counter terms, the \"supersimple\" expressions for the high energy HC amplitudes, renormalized on-shell, are obtained. Previously, this property was noted for a large number of processes that do not involve Yukawa interactions or renormalization group corrections. Here we extend it to $e^-e^+\\to t \\bar t$, which does involve large Yukawa and renormalization group contributions. We show that the resulting \"supersimple\" expressions may provide an accurate description, even at energies comparable to the SUSY scale. Such descriptions clearly identify the origin of the important SUSY effects, and they may be used for quickly constraining physics contributions, beyond MSSM. △ Less", "We propose a mechanism that the soft supersymmetry breaking masses can be induced from the dynamical rearrangement of local U(1) symmetry in a five-dimensional model. The U(1) symmetry possesses several extraordinary features. The eigenstates of U(1) do not equal to those of boundary conditions. The U(1) charge of standard model particles does not equal to that of superpartners. A large U(1) charge hierarchy among superpartners and a standard model gauge singlet is necessary in order to obtain the masses of O(1)TeV. △ Less", "Following the recent results from Daya Bay and RENO, which measure the lepton mixing angle theta^l_13 ~ 0.15, we revisit a supersymmetric S4 x SU(5) model, which predicts tri-bimaximal (TB) mixing in the neutrino sector with theta^l_13 being too small in its original version. We show that introducing one additional S4 singlet flavon into the model gives rise to a sizable theta^l_13 via an operator which leads to the breaking of one of the two Z2 symmetries preserved in the neutrino sector at leading order. The results of the original model for fermion masses, quark mixing and the solar mixing angle are maintained to good precision. The atmospheric and solar mixing angle deviations from TB mixing are subject to simple sum rule bounds. △ Less", "An excess of events at a mass of ~ 125 GeV has been reported by both ATLAS and CMS collaborations using 5/fb of data. If this excess of events is confirmed by further searches with more data, it will have extremely important consequences in the context of supersymmetric extensions of the Standard Model. We show that for a Standard Model like Higgs boson with a mass 122.5 < Mh < 127.5 GeV, several unconstrained or constrained MSSM scenarios would be excluded, while the parameters of some other scenarios would be severely restricted. △ Less", "We present compounding evidence of supersymmetry (SUSY) production at the LHC, in the form of correlations between the nominal 5\\fb ATLAS and CMS results for the 7 TeV 2011 run and detailed Monte Carlo collider-detector simulation of a concrete supersymmetric model named No-Scale F-SU(5). Restricting analysis to those event selections which yield a signal significance S/sqrt(B+1) greater than 2, we find by application of the χ^2 statistic that strong correlations exist among the individual search strategies and also between the current best fit to the SUSY mass scale and that achieved using historical 1\\fb data sets. Coupled with an appropriately large increase in the \"depth\" of the χ^2 well with increasing luminosity, we suggest that these features indicate the presence of a non-random structure to the data - a light fragrance perhaps evocative of some fuller coming fruition. Those searches having signal significances below 2 are assembled into a lower exclusion bound on the gaugino mass, which is shown to be consistent with the prior best fit. Assuming the forthcoming delivery of an additional tranche of integrated luminosity at 8 TeV during 2012 that measures on the order 15\\fb, we project a sufficiency of actionable data to conclusively judge the merits of our proposal. △ Less", "We investigate the viability of light neutralino scenarios as promoted by dark matter direct detection experiments. Using high statistics scans in the pMSSM we have identified several scenarios which give rise to very light neutralinos with large direct detection scattering cross sections. Our results are challenged with constraints from dark matter relic density, direct detection, indirect detection, as well as flavour physics, electroweak precision tests, LEP and Tevatron limits, LHC limits on SUSY, Higgs and monojet searches. In particular we study the effect of a Higgs boson in the range 122.5 < Mh < 127.5 GeV. We show that several scenarios emerge in agreement with all the constraints, and we study their characteristics and the LHC sensitivity. △ Less", "We study the implications of the recent LHCb limit and results on Bs -> mu+mu- and B -> K* mu+mu- observables in the constrained SUSY scenarios. After discussing the Standard Model predictions and carefully estimating the theoretical errors, we show the constraining power of these observables in CMSSM and NUHM. The latest limit on BR(Bs -> mu+mu-), being very close to the SM prediction, constrains strongly the large tan(beta) regime and we show that the various angular observables from B -> K* mu+mu- decay can provide complementary information in particular for moderate tan(beta) values. △ Less", "In the Minimal Supersymmetric Standard Model, the higgsinos can have masses around the electroweak scale, while the other supersymmetric particles have TeV-scale masses. This happens in models of gauge-mediated SUSY breaking with a high messenger scale, which are motivated from string theory. For particular choices of the messenger field content, multi-TeV squark and gluino masses naturally lead to a much lower electroweak scale, somewhat similar to focus point supersymmetry. They also induce Higgs masses of 124-126 GeV, while making the discovery of supersymmetry at the LHC unlikely. The light higgsinos will be difficult to see at the LHC but may eventually be discovered at a linear collider. △ Less", "This dissertation focuses on phenomenological studies for possible signals for supersymmetric events at the Large Hadron Collider (LHC). We have divided our endeavours into three separate projects. First, we consider SUSY models where the gluino production at the LHC should be rich in top and bottom quark jets. Requiring $b$-jets in addition to missing energy $\\eslt$ should, therefore, enhance the supersymmetry signal relative to Standard Model backgrounds. We quantify the increase in the supersymmetry reach of the LHC from $b$-tagging in a variety of well-motivated models of supersymmetry. We also explore $top$-tagging at the LHC. Second, we explore the prospects for detecting the direct production of third generation squarks in models with an inverted squark mass hierarchy. This is signalled by $b$-jets + $\\eslt$ events harder than in the Standard Model, but softer than those from the production of gluinos and heavier squarks. We find that these events can be readily separated from SM background (for third generation squark masses in the 200-400 GeV range), and the contamination from the much heavier gluinos and squarks although formidable can effectively be suppressed. Third, we attempt to extract model-independent information about neutralino properties from LHC data. assuming only the particle content of the MSSM and that all two-body neutralino decays are kinematically suppressed, with the neutralino inclusive production yielding a sufficient cross section. We show that the Lorentz invariant dilepton mass distribution encodes clear information about the relative sign of the mass eigenvalues of the parent and daughter neutralinos. We show that we can extract most neutralino mass matrix parameters if there is a double mass edge. △ Less", "We consider a 6-dimensional supersymmetric SU(6) gauge theory and compactify two extra-dimensions on a multiply-connected manifold with non-trivial topology. The SU(6) is broken down to the Standard Model gauge groups in two steps by an orbifold projection (or Wilson line), followed by a Wilson line. The Higgs doublets of the low energy electroweak theory come from a chiral adjoint of SU(6). We thus have gauge-Higgs unification. The three families of the Standard Model can either be located in the 6D bulk or at 4D N=1 supersymmetric fixed points. We calculate the Kaluza-Klein spectrum of states arising as a result of the orbifolding. We also calculate the threshold corrections to the coupling constants due to this tower of states at the lowest compactification scale. We study the regions of parameter space of this model where the threshold corrections are consistent with low energy physics. We find that the couplings receive only logarithmic corrections at all scales. This feature can be attributed to the large N=2 6D SUSY of the underlying model. △ Less", "Neutrinoless double beta decay, which is a very old and yet elusive process, is reviewed. Its observation will signal that lepton number is not conserved and the neutrinos are Majorana particles. More importantly it is our best hope for determining the absolute neutrino mass scale at the level of a few tens of meV. To achieve the last goal certain hurdles have to be overcome involving particle, nuclear and experimental physics. Nuclear physics is important for extracting the useful information from the data. One must accurately evaluate the relevant nuclear matrix elements, a formidable task. To this end, we review the sophisticated nuclear structure approaches recently been developed, which give confidence that the needed nuclear matrix elements can be reliably calculated. From an experimental point of view it is challenging, since the life times are long and one has to fight against formidable backgrounds. If a signal is found, it will be a tremendous accomplishment. Then, of course, the real task is going to be the extraction of the neutrino mass from the observations. This is not trivial, since current particle models predict the presence of many mechanisms other than the neutrino mass, which may contribute or even dominate this process. We will, in particular, consider the following processes: (i)The neutrino induced, but neutrino mass independent contribution. (ii)Heavy left and/or right handed neutrino mass contributions. (iii)Intermediate scalars (doubly charged etc). (iv)Supersymmetric (SUSY) contributions. We will show that it is possible to disentangle the various mechanisms and unambiguously extract the important neutrino mass scale, if all the signatures of the reaction are searched in a sufficient number of nuclear isotopes. △ Less", "We present the possible signatures appearing in general realizations of the MSSM based on 14 unrelated mass parameters at the SUSY scale. The parameters of the general MSSM are reduced by assuming a degeneracy of the sfermions of the first two generations with the same quantum numbers. We also assume no mass-splitting between neutral and charged Higgsinos. We do allow for separate soft breaking terms for the third generation sfermons. We consider all possible resulting $14! \\approx 9 \\cdot10^{10}$ relevant mass orderings and check for the dominant decay cascades and the corresponding collider signatures. In determining the dominant decay modes we assume that mixing between sparticles is sub-dominant. As preferred signatures, we consider charged leptons, missing transverse momentum, jets, and $W, Z$ or Higgs bosons. We include also the cases of bi- and trilinear R-parity violation and show that specific signatures can be used to distinguish the different scenarios. △ Less", "In the supersymmetric grand unified theories (SUSY GUTs), gauge bosons associated with the unified gauge group induce proton decay. We investigate the proton decay rate via the gauge bosons in the SUSY GUTs under the two situations; one is with extra vector-like multiplets, and the other is with heavy sfermions. It is found that the proton lifetime is significantly reduced in the former case, while in the latter case it is slightly prolonged. Determination of the particle contents and their mass spectrum below the GUT scale is important to predict the proton lifetime. The proton decay searches have started to access to the 10^16 GeV scale. △ Less", "The simplest gauge theories for the conservation of R-parity in supersymmetry are discussed. We show how the minimal theory based on the B-L gauge symmetry predicts that R-parity must be spontaneously broken at the TeV scale. The most striking signals of these theories at the Large Hadron Collider are discussed. We present a realistic theory where the local baryon and lepton numbers are spontaneously broken at the supersymmetry breaking scale. The possibility to understand the conservation of R-parity in grand unified theories defined in four dimensions is mentioned. △ Less", "We study non-spinning Q-balls and boson stars in 4-dimensional Anti-de Sitter (AdS) space-time. We use an exponential scalar field potential that appears in gauge-mediated supersymmetry (SUSY) breaking in the minimal supersymmetric extension of the Standard Model (MSSM). We investigate the dependence of the charge and mass of these non-topological solitons on the negative cosmological constant, the frequency that appears in the periodic time-dependence as well as on the ratio between the SUSY breaking scale and the Planck mass. Next to fundamental solutions without nodes in the scalar field function we also construct radially excited solutions. In the second part of the paper we put the emphasis on the holographic interpretation of these solutions in terms of Bose-Einstein condensates of scalar glueballs that are described by a strongly coupled Quantum Field Theory (QFT) on the boundary of global AdS. △ Less", "A Standard Model-like Higgs near 125 GeV in the MSSM requires multi-TeV stop masses, or a near-maximal contribution to its mass from stop mixing. We investigate the maximal mixing scenario, and in particular its prospects for being realized it in potentially realistic GUT models. We work out constraints on the possible GUT-scale soft terms, which we compare with what can be obtained from some well-known mechanisms of SUSY breaking mediation. Finally, we analyze two promising scenarios in detail, namely gaugino mediation and gravity mediation with non-universal Higgs masses. △ Less", "Axino, related to the SUSY transformation of axion, can mix with goldstino in principle. This case is realized when some superfields carrying nonvanishing Peccei-Quinn charges develop both scalar VEVs and F-terms. In this case, we present a proper definition of axion and axino. With this definition, we present the QCD axino mass in the most general framework, including non-minimal Kähler potential. The axino mass is known to have a hierarchical mass structure depending on accidental symmetries. With only one axino, if $G_A=0$ where $G=K+\\ln|W|^2$, we obtain $m_{\\tilde a}=m_{3/2}$. For $G_A\\ne 0$, the axino mass depends on the details of the Kähler potential. In the gauge mediation scenario, the gaugino mass is the dominant axino mass parameter. Therefore, we can take the theoretical QCD axino mass as a free parameter in the study of its cosmological effects, ranging from eV to multi-TeV scales, without a present knowledge on its ultraviolet completion. △ Less", "We construct a gauge-mediated SUSY breaking model with vector-like matters combined with the Peccei-Quinn mechanism to solve the strong CP problem. The Peccei-Quinn symmetry plays an essential role for generating sizable masses for the vector-like matters and the $μ$-term without introducing dangerous CP angle. The model naturally explains both the 125GeV Higgs mass and the muon anomalous magnetic moment. The stabilization of the Peccei-Quinn scalar and the cosmology of the saxion and axino are also discussed. △ Less", "Baryon number violating interactions could modify the signatures of supersymmetric models at the Large Hadron Collider. In this article we investigate the predictions for the Higgs mass and the Higgs decays in a simple extension of the minimal supersymmetric standard model where the local baryon and lepton numbers are spontaneously broken at the TeV scale. This theory predicts baryon number violation at the low scale which can change the current LHC bounds on the supersymmetric spectrum. Using the ATLAS and CMS bounds on the Higgs mass we show the constraints on the sfermion masses, and show the subsequent predictions for the radiative Higgs decays. We found that the Higgs decay into two photons is suppressed due to the existence of new light leptons. In this theory the stops can be very light in agreement with all experimental bounds and we make a brief discussion of the possible signals at the LHC. △ Less", "Among three typical energy scales, a neutrino mass scale ($m_ν\\sim$ 0.1 eV), a GUT scale ($M_{GUT}\\sim 10^{16}$ GeV), and a TeV-scale ($M_{NP}\\sim$ 1 TeV), there is a fascinating relation of $M_{NP}\\simeq \\sqrt{m_ν\\cdot M_{GUT}}$.The TeV-scale, $M_{NP}$, is a new physics scale beyond the standard model which is regarded as \"supersymmetry\" (SUSY) in this letter. We investigate phenomenology of SUSY SU(5) GUT with neutrinophilic Higgs, which realizes the above relation dynamically as well as the suitable magnitude of Dirac mass, $m_ν$, through a tiny vacuum expectation value of neutrinophilic Higgs. As a remarkable feature of this model, accurate gauge coupling unification can be achieved as keeping with a proton stability. We also evaluate flavor changing processes in quark/lepton sectors. △ Less", "We perform global fits to the parameters of the Constrained Minimal Supersymmetric Standard Model (CMSSM) and to a variant with non-universal Higgs masses (NUHM1). In addition to constraints from low-energy precision observables and the cosmological dark matter density, we take into account the LHC exclusions from searches in jets plus missing transverse energy signatures with about 5\\,fb$^{-1}$ of integrated luminosity. We also include the most recent upper bound on the branching ratio $B_s\\toμμ$ from LHCb. Furthermore, constraints from and implications for direct and indirect dark matter searches are discussed. The best fit of the CMSSM prefers a light Higgs boson just above the experimentally excluded mass. We find that the description of the low-energy observables, $(g-2)_μ$ in particular, and the non-observation of SUSY at the LHC become more and more incompatible within the CMSSM. A potential SM-like Higgs boson with mass around 126 GeV can barely be accommodated. Values for ${\\cal B}(B_s\\toμμ)$ just around the Standard Model prediction are naturally expected in the best fit region. The most-preferred region is not yet affected by limits on direct WIMP searches, but the next generation of experiments will probe this region. Finally, we discuss implications from fine-tuning for the best fit regions. △ Less", "Process of preheating for supersymmetric hybrid model of inflation is generally analyzed in two different ways known as parametric resonance and tachyonic preheating. In a common frame-work, we study both the processes from the decay or growth of homogeneous inflaton field and inhomogeneous waterfall field. We find that these two processes in SUSY hybrid F-term inflation are not parameter independent; rather one process will be more preferable than the other depending on the values of parameters and Fourier mode of the waterfall field. Parameters of the inflationary potential are constrained from the observed CMB data and these constrains help us to identify the process of preheating responsible for this model. △ Less", "It has recently been pointed out that a substantial amount of e-folds can occur during the waterfall regime of hybrid inflation. Moreover, Kodama et.al. have derived analytic approximations for the trajectories of the inflaton and of the waterfall fields. Based on these, we derive here the consequences for F- and D-term SUSY hybrid inflation: A substantial amount of e-folds may occur in the waterfall regime, provided kappa << M^2/M_P^2, where kappa is the superpotential coupling, M the scale of symmetry breaking and M_P the reduced Planck mass. When this condition is amply fulfilled, a number of e-folds much larger than N_e\\approx60 can occur in the waterfall regime and the scalar spectral index is then given by the expression found by Kodama et.al. n_s=1-4/N_e. This value may be increased up to unity, if only about N_e e-folds occur during the waterfall regime, such that the largest observable scale leaves the horizon close to the critical point of hybrid inflation, what can be achieved for kappa\\approx10^(-13) and M\\approx5x10^(12) GeV in F-term inflation. Imposing the normalization of the power spectrum leads to a lower bound on the scale of symmetry breaking. △ Less", "We investigate Lepton-Flavor Violating (LFV) decays of Higgs to muon-tau in the supersymmetric economical 3-3-1 (SUSYE331) model. In the presence of flavor mixing in sleptons {mu,tau} and large values of v/v', the ratio of Br(H -->tau^+mu^-)/Br(H -->tau^+tau^-) can reach to non-negligible values O(10^{-3}), as in many known SUSY models. We predict that for the Standard Model Higgs boson, the LHC may detect its decay to muon and tauon. We also investigate the asymmetry between left and right LFV values of corrections and prove that the LFV effects are dominated by the left FLV term, which is O(10^3) times larger than the right LFV term in the limit of small values of |μ_ρ|/m_SUSY. The contributions of Higgs-mediated effects to the decay tau --> mu mu mu are also discussed. △ Less", "Using two-loop renormalization group equations implementing the decoupling of heavy scalars, Effective SUSY scenarios are studied in the limit in which there is a single low energy Higgs field. Gauge coupling unification is shown to hold with similar or better precision than in standard MSSM scenarios. b-tau unification is examined, and Higgs masses are computed using the effective potential, including two-loop contributions from scalars. A 125 GeV Higgs is compatible with stops/sbottoms at around 300 GeV with non-universal boundary conditions at the scale of the heavy sparticles if some of the trilinear couplings at this scale take values of the order of 1-2 TeV; if more constrained boundary conditions inspired by msugra or gauge mediation are set at a higher scale, heavier colored sparticles are required in general. Finally, since the decoupled RG flow for third-generation scalar masses departs very significantly from the MSSM DR-bar one, tachyon bounds for light scalars are revisited and shown to be relaxed by up to a TeV or more. △ Less", "We interpret reported hints of a Standard Model Higgs boson at ~ 125 GeV in terms of high-scale supersymmetry breaking with a shift symmetry in the Higgs sector. More specifically, the Higgs mass range suggested by recent LHC data extrapolates, within the (non-supersymmetric) Standard Model, to a vanishing quartic Higgs coupling at a UV scale between 10^6 and 10^18 GeV. Such a small value of lambda can be understood in terms of models with high-scale SUSY breaking if the Kahler potential possesses a shift symmetry, i.e., if it depends on H_u and H_d only in the combination (H_u+\\bar{H}_d). This symmetry is known to arise rather naturally in certain heterotic compactifications. We suggest that such a structure of the Higgs Kahler potential is common in a wider class of string constructions, including intersecting D7- and D6-brane models and their extensions to F-theory or M-theory. The latest LHC data may thus be interpreted as hinting to a particular class of compactifications which possess this shift symmetry. △ Less", "Non-supersymmetric grand unified theories based on SU(5) have had a revival during the past years. This is mainly due to their ability to connect neutrino masses with unification and proton decay. In that way they provide a framework for testable models at coming experiments. We study the mass spectrum of such models and determine naturally light multiplets within the LHC reach. △ Less", "There is experimental evidence for a direct CP asymmetry in singly Cabibbo suppressed D decays, ΔA_{CP} \\sim 0.006. Naive expectations are that the Standard Model contribution to ΔA_{CP} is an order of magnitude smaller. We explore the possibility that a major part of the symmetry comes from supersymmetric contributions. The leading candidates are models where the flavor structure of the trilinear scalar couplings is related to the structure of the Yukawa couplings via approximate flavor symmetries, particularly U(1), [U(1)]^2 and U(2). The recent hints for a lightest neutral Higgs boson with mass around 125 GeV support the requisite order one trilinear terms. The typical value of the supersymmetric contribution to the asymmetry is ΔA_{CP}^{SUSY}\\sim 0.001, but it could be accidentally enhanced by order one coefficients. △ Less", "We compare the experimental prospects of direct stop and sbottom pair production searches at the LHC. Such searches for stops are of great interest as they directly probe for states that are motivated by the SUSY solution to the hierarchy problem of the Higgs mass parameter - leading to a \"Natural\" SUSY spectrum. Noting that sbottom searches are less experimentally challenging and scale up in reach directly with the improvement on b-tagging algorithms, we discuss the interplay of small TeV scale custodial symmetry violation with sbottom direct pair production searches as a path to obtaining strong sub-TeV constraints on stops in a natural SUSY scenario. We argue that if a weak scale natural SUSY spectrum does not exist within the reach of LHC, then hopes for such a spectrum for large regions of parameter space should sbottom out. Conversely, the same arguments make clear that a discovery of such a spectrum is likely to proceed in a sbottom up manner. △ Less", "We present a new (supersymmetric) framework for obtaining an excellent description of quark, charged lepton and neutrino masses and mixings from a Delta(6n^2) family symmetry with multiplet assignments consistent with an underlying SO(10) Grand Unification. It employs a Higgs mediator sector in place of the usual Froggatt-Nielsen messengers, with quark and lepton messengers, and provides significant improvements over existing models of this type having unsuppressed Yukawa couplings to the third generation and a simplified vacuum alignment mechanism. The neutrino mass differences are naturally less hierarchical than those of the quarks and charged leptons. Similarly the lepton mixing angles are much larger than those in the quark sector and have an approximate tri-bi-maximal (TB) mixing form for theta_{12} and theta_{23}. However the mixing angle theta_{13} is naturally much larger than in pure TB mixing and can be consistent with the value found in recent experiments. The magnitude of theta_{13} is correlated with a the predicted deviation of theta_{23} from bi-maximal mixing. The model has light familon fields that can significantly modify the associated SUSY phenomenology. △ Less", "We show that grand unified theories based on SO(10) generate naturally the next-to-leading baryon number violating operators of dimension seven. These operators, which violate B-L, lead to unconventional decays of the nucleon such as n -> e^-K^+, e^- π^+ and p -> νπ^+. In two-step breaking schemes of non-supersymmetric SO(10), nucleon lifetime for decays into these modes is found to be within reach of experiments. We also identify supersymmetric scenarios where these decays may be accessible, consistent with gauge coupling unification. Further, we show that the (B-L)-asymmetry generated in the decays of GUT scale scalar bosons and/or gauge bosons can explain consistently the observed baryon asymmetry of the universe. The induced (B-L)-asymmetry is sphaleron-proof, and survives down to the weak scale without being erased by the electroweak interactions. This mechanism works efficiently in a large class of non-SUSY and SUSY SO(10) models, with either a 126 or a 16 Higgs field employed for rank reduction. In minimal models the induced baryon asymmetry is tightly connected to the masses of quarks, leptons and neutrinos and is found to be compatible with observations. △ Less", "Particle physics models with Natural Supersymmetry are characterized by a superpotential parameter μ\\sim m_h \\sim125$ GeV, while third generation squarks have mass <0.5-1.5 TeV. Gluinos should be lighter than several TeV so as not to destabilize the lighter squarks. First and second generation sfermions can be at the tens-of-TeV level which yields a decoupling solution to the SUSY flavor and CP problems. Adopting a top-down approach, we delineate the range of GUT scale SUSY model parameters which leads to a Natural SUSY mass spectrum. We find natural SUSY models to be tightly constrained by the b-> sγbranching fraction measurement while it is also difficult but not impossible to accommodate a light Higgs scalar of mass ~125 GeV. We present several benchmark points which are expandable to slopes and planes. Natural SUSY is difficult to see at LHC unless some third generation squarks are very light. The top- and bottom- squarks cascade decay mainly to higgsino-like charginos and neutralinos via numerous possibilities, leading to a rather complex set of signatures. Meanwhile, a linear e^+e^- collider operating at \\sqrt{s}\\sim 0.25-0.5 TeV would be a higgsino factory and is essentially guaranteed a SUSY discovery of the low-lying charged and neutral higgsino states. Since thermal neutralino cold dark matter is underproduced, we conjecture that the incorporation of a Peccei-Quinn sector or light moduli into the theory will augment higgsino dark matter production, possibly together with an admixture of axions. We present rates for direct and indirect higgsino dark matter detection for the case where light higgsinos dominate the dark matter abundance. △ Less", "We study the NMSSM with universal Susy breaking terms (besides the Higgs sector) at the GUT scale. Within this constrained parameter space, it is not difficult to find a Higgs boson with a mass of about 125 GeV and an enhanced cross section in the diphoton channel. An additional lighter Higgs boson with reduced couplings and a mass <123 GeV is potentially observable at the LHC. The NMSSM-specific Yukawa couplings lambda and kappa are relatively large and tan(beta) is small, such that lambda, kappa and the top Yukawa coupling are of order 1 at the GUT scale. The lightest stop can be as light as 105 GeV, and the fine-tuning is modest. WMAP constraints can be satisfied by a dominantly higgsino-like LSP with substantial bino, wino and singlino admixtures and a mass of ~60-90 GeV, which would potentially be detectable by XENON100. △ Less", "We investigate the generation of the baryon asymmetry of the Universe within a SUSY SU(5) x T' model of flavour, which gives rise to realistic masses and mixing patterns for quarks and leptons. The model employs the see-saw mechanism for generation of the light neutrino masses and the baryon asymmetry is produced via leptogenesis. We perform detailed calculations of both the CP violating lepton asymmetries, originating from the decays of the heavy Majorana neutrinos operative in the see-saw mechanism, and of the efficiency factors which account for the lepton asymmetry wash-out processes in the Early Universe. The latter are calculated by solving numerically the system of Boltzmann equations describing the generation and the evolution of the lepton asymmetries. The baryon asymmetry in the model considered is proportional to the J_{CP} factor, which determines the magnitude of CP violation effects in the oscillations of flavour neutrinos. The leptogenesis scale can be sufficiently low, allowing to avoid the potential gravitino problem. △ Less", "Accepting the existence of a SM-like Higgs boson in the range 123GeV-127GeV as indicated by the observed ga,ga events, there are two distinct regions left in the Minimal Supersymmetric (SUSY) Standard Model (MSSM) Higgs sector: (a) the lighter CP-even Higgs boson SM-like and the non-SM-like Higgs bosons all heavy and nearly degenerate above 300GeV; (b) the heavier CP-even Higgs boson being SM-like and the neutral non-SM-like Higgs bosons all nearly degenerate around 100GeV (a non-decoupling region). Due to the strong correlation between the Higgs decays to W+W- and to ga,ga predicted in the MSSM, the deficit of a W+W- final state signal would be in direct conflict with the ga,ga peak. If we consider W+W- on its own, the absence of the W+W- signal would imply that the SM-like Higgs boson has reduced coupling to W+-, and that the other non-SM-like Higgs bosons should not be too heavy and do not decouple. If both the ga,ga excess and the absence of W+W- continue, new physics beyond the MSSM will be required. A similar correlation exists between the W+W- and tau+tau- channels: a reduced W+W- channel would force the tau+tau- channel to be larger. Future searches for the SM-like Higgs boson at the LHC will provide critical tests for the MSSM prediction. We emphasize the potential importance of the electroweak processes pp->H+H-, H+-A0, which are independent of the SUSY parameters except for their masses. In addition, there may be sizable contributions from pp->H+-h0, A0h0 and W+-H0, ZH0 in the non-decoupling region, which may serve to discriminate the model parameters. We vary the relevant SUSY parameters in a broad range and demonstrate the correlations and constraints on these parameters and associated SUSY particles. △ Less", "In this article, we review briefly recent progress made in realizing local(ized around a mobile space-time filling D3-brane in) D3/D7 mu-Split Supersymmetry in (the large volume limit of Type IIB) String Theory (compactified on Swiss-Cheese Calabi-Yau orientifolds) as well as obtaining a 125 GeV (light) Higgs in the same set up. We also discuss obtaining the geometric Kaehler potential (and hence the Ricci-Flat metric) for the Swiss-Cheese Calabi-Yau in the large volume limit using the Donaldson's algorithm and intuition from GLSM-based calculations - we present new results for Swiss-Cheese Calabi-Yau (used in the set up) metrics at points finitely away from the \"big\" divisor. △ Less", "Recent indications of the 125GeV Higgs at the LHC can be explained in a relatively high-scale SUSY scenario where the sparticle masses are multi-TeV as is realized in the focus-point region. However, it suffers from the notorious cosmological Polonyi problem. We argue that the Polonyi problem is solved and thermal or non-thermal leptogenesis scenario works successfully, if a certain Polonyi coupling to the inflaton is enhanced by a factor of 10-100. △ Less", "A model that gives family gauge bosons with an inverted mass hierarchy is proposed, stimulated by Sumino's cancellation mechanism for the QED radiative correction to the charged lepton masses. The Sumino mechanism cannot straightforwardly be applied to SUSY models because of the non-renormalization theorem. In this paper, an alternative model which is applicable to a SUSY model is proposed. It is essential that family gauge boson masses $m(A_i^j)$ in this model is given by an inverted mass hierarchy $m(A_i^i) \\propto 1/\\sqrt{m_{ei}}$, in contrast to $m(A_i^i) \\propto \\sqrt{m_{ei}}$ in the original Sumino model. Phenomenological meaning of the model is also nvestigated. In particular, we notice a deviation from the $e$-$μ$ universality in the tau decays. △ Less", "In Profumo di SUSY, we presented evidence that CMS&ATLAS may have already registered a handful of deftly camouflaged supersymmetry events at the LHC in the multijet channels. Here, we explore the prospect for corroboration of this suggestion from 5 additional CMS&ATLAS search strategies targeting the production of light stops & gluinos at lower jet counts, which variously depend on heavy flavor tagging and the inclusion or exclusion of associated leptons. The current operating phase of the 7TeV LHC is highly conducive to the production of gluinos & light stops, given the supersymmetric particle mass hierarchy M_t_1<M_g<M_q that naturally evolves from the dynamics of the model named No-Scale FSU5 that we presently study. Moreover, some tension persists against the SM data-driven and MC generated background predictions in certain LHC searches of this variety. We demonstrate that the 1-sigma overlap of the allowed supersymmetric event production for these seven search methodologies roundly envelops the most favorable phenomenological subspace of FSU5, while handily generating a 125GeV Higgs boson mass. In order to test the statistical significance of any correlations across the simulated FSU5 collider response in these seven search strategies, we implement a multi-axis chi^2 fitting procedure, yielding a best overall match in the vicinity of M1/2=610GeV, corresponding to light stop & gluino masses of approximately 665GeV and 830GeV. Consequently, we suggest that FSU5 is a better global fit to the studied LHC data than the SM alone, and moreover that its predictions appear to be meaningfully correlated with observed low-statistics excesses across a wide variety of specialized search strategies. We suspect the already collected 5/fb will be sufficient to either condense or disperse the delicate aroma of stops and gluinos that suffuses the early search. △ Less", "If supersymmetry (SUSY) solves the hierarchy problem, then naturalness considerations coupled with recent LHC bounds require non-trivial superpartner flavor structures. Such \"Natural SUSY\" models exhibit a large mass hierarchy between scalars of the third and first two generations as well as degeneracy (or alignment) among the first two generations. In this work, we show how this specific beyond the standard model (SM) flavor structure can be tied directly to SM flavor via \"Flavor Mediation\". The SM contains an anomaly-free SU(3) flavor symmetry, broken only by Yukawa couplings. By gauging this flavor symmetry in addition to SM gauge symmetries, we can mediate SUSY breaking via (Higgsed) gauge mediation. This automatically delivers a natural SUSY spectrum. Third-generation scalar masses are suppressed due to the dominant breaking of the flavor gauge symmetry in the top direction. More subtly, the first-two-generation scalars remain highly degenerate due to a custodial U(2) symmetry, where the SU(2) factor arises because SU(3) is rank two. This custodial symmetry is broken only at order (m_c/m_t)^2. SUSY gauge coupling unification predictions are preserved, since no new charged matter is introduced, the SM gauge structure is unaltered, and the flavor symmetry treats all matter multiplets equally. Moreover, the uniqueness of the anomaly-free SU(3) flavor group makes possible a number of concrete predictions for the superpartner spectrum. △ Less", "We study the phenomenology of a supersymmetric scenario where the next-to-lightest superparticle is the lighter stau and long-lived due to a very weakly coupled lightest superparticle, such as the gravitino. We investigate the LHC sensitivity and its dependence on the superparticle spectrum with an emphasis on strong production and decay. We do not assume any high-scale model for SUSY breaking but work along the lines of simplified models. Devising cuts that yield a large detection efficiency in the whole parameter space, we determine the LHC's discovery and exclusion potential. This allows us to derive robust limits on m_stau, m_gluino, a common m_squark, and m_stop1. We briefly discuss the prospects for observing stopped staus. △ Less", "The flavour messenger sectors and their impact on the soft SUSY breaking terms are investigated in SUSY flavour models. In the case when the flavour scale M is below the SUSY breaking mediation scale M_S, the universality of soft terms, even if assumed at M_S, is radiatively broken. We estimate this effect in a broad class of models. In the CKM basis that effect gives flavour off-diagonal soft masses comparable to the tree-level estimate based on the flavour symmetry. △ Less", "Recent T2K, MINOS and Double CHOOZ results, together with global fits of mixing parameters, indicate a sizeable reactor angle theta13 ~ 8 deg which, if confirmed, would rule out tri-bimaximal (TB) lepton mixing. Recently two of us studied the vacuum alignment of the Altarelli-Feruglio A4 family symmetry model including additional flavons in the 1' and 1\" representations, leading to so-called \"trimaximal\" neutrino mixing and allowing a potentially large reactor angle. Here we show how such a model may arise from a Supersymmetric (SUSY) Grand Unified Theory (GUT) based on SU(5), leading to sum rule bounds |s| < thetaC/3, |a| < (r + thetaC/3)|cos delta|/2, where s,a,r parameterise the solar, atmospheric and reactor angle deviations from their TB mixing values, delta is the CP violating oscillation phase, and thetaC is the Cabibbo angle. △ Less", "New Physics searches at the LHC have increased significantly lower bounds on unknown particle masses. This increases quite dramatically the tension in the interpretation of the data: low energy precision data which are predicted accurately by the SM (LEP observables like M_W or loop induced rare processes like B --> X_s gamma or B_s --> mu+mu-) and quantities exhibiting an observed discrepancy between SM theory and experiment, most significantly found for the muon g-2, seem to be in conflict now. (g-2)_mu appears to be the most precisely understood observable which at the same time reveals a 3-4 sigma deviation between theory and experiment and thus requires a significant new physics contribution. The hints for a Higgs of mass about 125 GeV, which is precisely what SUSY extensions of the SM predict, seem to provide a strong indication for SUSY. At the same time it brings into serious trouble the interpretation of the (g-2)_mu deviation as a SUSY contribution. △ Less", "Due to the limited statistics so far accumulated in the Higgs boson search at the LHC, the Higgs boson property has not yet been tightly constrained and it is still allowed for the Higgs boson to decay invisibly to dark matter with a sizable branching ratio. In this work, we examine the Higgs decay to neutralino dark matter in low energy SUSY by considering three different models: the minimal supersymmetric standard model (MSSM), the next-to-minimal supersymmetric standard models (NMSSM) and the nearly minimal supersymmetric standard model (nMSSM). Under current experimental constraints at 2-sigma level (including the muon g-2 and the dark matter relic density), we scan over the parameter space of each model. Then in the allowed parameter space we calculate the branching ratio of the SM-like Higgs decay to neutralino dark matter and examine its observability at the LHC by considering three production channels: the weak boson fusion VV->h, the associated production with a Z-boson pp->hZ+X or a pair of top quarks pp->htt_bar+X. We find that in the MSSM such a decay is far below the detectable level; while in both the NMSSM and nMSSM the decay branching ratio can be large enough to be observable at the LHC. △ Less", "We provide a comparative study of the fine tuning amount (Delta) at the two-loop leading log level in supersymmetric models commonly used in SUSY searches at the LHC. These are the constrained MSSM (CMSSM), non-universal Higgs masses models (NUHM1, NUHM2), non-universal gaugino masses model (NUGM) and GUT related gaugino masses models (NUGMd). Two definitions of the fine tuning are used, the first (Delta_{max}) measures maximal fine-tuning wrt individual parameters while the second (Delta_q) adds their contribution in \"quadrature\". As a direct result of two theoretical constraints (the EW minimum conditions), fine tuning (Delta_q) emerges as a suppressing factor (effective prior) of the averaged likelihood (under the priors), under the integral of the global probability of measuring the data (Bayesian evidence p(D)). For each model, there is little difference between Delta_q, Delta_{max} in the region allowed by the data, with similar behaviour as functions of the Higgs, gluino, stop mass or SUSY scale (m_{susy}=(m_{\\tilde t_1} m_{\\tilde t_2})^{1/2}) or dark matter and g-2 constraints. The analysis has the advantage that by replacing any of these mass scales or constraints by their latest bounds one easily infers for each model the value of Delta_q, Delta_{max} or vice versa. For all models, minimal fine tuning is achieved for M_{higgs} near 115 GeV with a Delta_q\\approx Delta_{max}\\approx 10 to 100 depending on the model, and in the CMSSM this is actually a global minimum. Due to a strong ($\\approx$ exponential) dependence of Delta on M_{higgs}, for a Higgs mass near 125 GeV, the above values of Delta_q\\approx Delta_{max} increase to between 500 and 1000. Possible corrections to these values are briefly discussed. △ Less", "One-loop contributions to the Higgs potential at finite temperatures are discussed in the supersymmetric standard model with four Higgs doublet chiral superfields as well as a pair of charged singlet chiral superfields. The mass of the lightest Higgs boson $h$ is determined only by the D-term at the tree-level in this model, while the triple Higgs boson coupling for $hhh$ can receive a significant radiative correction. The same nondecoupling effect can also contribute to realize the sufficient first order electroweak phase transition, which is required for a successful scenario of electroweak baryogenesis. This model can be a new candidate for a model in which the baryon asymmetry of the Universe is explained at the electroweak scale. We also discuss the implication for the measurement of the triple Higgs boson coupling at the ILC. △ Less", "We discuss the implications for cosmic microwave background (CMB) observables, of a class of pre-inflationary dynamics suggested by string models where SUSY is broken due to the presence of D-branes and orientifolds preserving incompatible portions of it. In these models the would-be inflaton is forced to emerge from the initial singularity climbing up a mild exponential potential, until it bounces against a steep exponential potential of \"brane SUSY breaking\" scenarios, and as a result the ensuing descent gives rise to an inflationary epoch that begins when the system is still well off its eventual attractor. If a pre-inflationary climbing phase of this type had occurred within 6-7 e-folds of the horizon exit for the largest observable wavelengths, displacement off the attractor and initial-state effects would conspire to suppress power in the primordial scalar spectrum, enhancing it in the tensor spectrum and typically superposing oscillations on both. We investigate these imprints on CMB observables over a range of parameters, examine their statistical significance, and provide a semi-analytic rationale for our results. It is tempting to ascribe at least part of the large-angle anomalies in the CMB to pre-inflationary dynamics of this type. △ Less", "In this short note, we describe the preparation of updated templates for the interpretation of SUSY results from the LHC in the context of mSUGRA. The standard (m_0,m_{1/2}) plane is shown for fixed mu > 0 and m_t = 173.2 GeV. Two scenarios are considered: (1) A_0 = 0 GeV and tan(beta)=10 and (2) A_0 = -500 GeV and tan(beta)=40. In each case, the universal scalar mass parameter m_0 varies in the range [40,3000] GeV, while the universal gaugino mass parameter m_{1/2} varies in the range [100,1000] GeV. We delineate notable regions in parameter space, including the region with a charged LSP (stau), the LEP2 reach, and the cosmologically preferred region with 100% neutralino dark matter. The templates also show mass contours for a few key particles (gluino, squark and Higgs boson). The mass spectrum is calculated with the SoftSusy-3.2.4 package, while the neutralino relic density is obtained with MicrOMEGAs version 2.4. △ Less", "Comprehensive analysis on the light Higgs scenario of the minimal supersymmetric standard model is performed in the framework of the non-universal Higgs mass model (NUHM). The NUHM is known to be the simplest framework realizing the light Higgs scenario with the unifications of gaugino and sfermion masses at the scale of grand unified theory being consistent. All important constraints from collider experiments, flavor-changing processes, and cosmological observations are considered in order to clarify the allowed region of the model parameter space, where the Markov Chain Monte Carlo method is used to obtain the region. We show that the region is excluded by current LHC results for the SUSY particle searches. We discuss possible extensions to save the LHS. Even with such extensions, the measurement of B_s to mu^+ mu^- would enable us to test the LHS in the near future. △ Less", "We have been developing a program package called GRACE/SUSY-loop which automatically calculates the MSSM amplitudes in one-loop order. We present numerical results of calculations for pair-production and three-body decay of the lighter stop ($\\widetilde{t}_1$) at the International Linear Collider (ILC) using GRACE/SUSY-loop. Since the distributions of missing transverse energy (MET) depend on mass spectrum of SUSY particles, we consider two scenarios on three-body decay of $\\widetilde{t}_1$. In these scenarios, both QCD and EW corrections have positive sign for decay widths and cross sections. △ Less", "We study the impact of the jets and missing transverse momentum SUSY analyses of the ATLAS experiment on the phenomenological MSSM (pMSSM). We investigate sets of SUSY models with a flat and logarithmic prior in the SUSY mass scale and a mass range up to 1 and 3 TeV, respectively. These models were found previously in the study 'Supersymmetry without Prejudice'. Removing models with long-lived SUSY particles, we show that 99% of 20000 randomly generated pMSSM model points with a flat prior and 87% for a logarithmic prior are excluded by the ATLAS results. For models with squarks and gluinos below 600 GeV all models of the pMSSM grid are excluded. We identify SUSY spectra where the current ATLAS search strategy is less sensitive and propose extensions to the inclusive jets search channel. △ Less", "Motivated by the recent LHC hints of a Higgs boson around 125 GeV, we assume a SM-like Higgs with the mass 123-127 GeV and study its implication in low energy SUSY by comparing the MSSM and NMSSM. We consider various experimental constraints at 2-sigma level (including the muon g-2 and the dark matter relic density) and perform a comprehensive scan over the parameter space of each model. Then in the parameter space which is allowed by current experimental constraints and also predicts a SM-like Higgs in 123-127 GeV, we examine the properties of the sensitive parameters (like the top squark mass and the trilinear coupling A_t) and calculate the rates of the di-photon signal and the VV^* (V=W,Z) signals at the LHC. Our typical findings are: (i) In the MSSM the top squark and A_t must be large and thus incur some fine-tuning, which can be much ameliorated in the NMSSM; (ii) In the MSSM a light stau is needed to enhance the di-photon rate of the SM-like Higgs to exceed its SM prediction, while in the NMSSM the di-photon rate can be readily enhanced in several ways; (iii) In the MSSM the signal rates of pp -> h -> VV^* at the LHC are never enhanced compared with their SM predictions, while in the NMSSM they may get enhanced significantly; (iv) A large part of the parameter space so far survived will be soon covered by the expected XENON100(2012) sensitivity (especially for the NMSSM). △ Less", "We examined the neutrino sector in E6 x SU(2)F SUSY GUT with spontaneous CP violation. At a glance, the discrete symmetry, which is introduced in order to solve the SUSY CP problem, constrains the allowed operators too strongly for the neutrino sector to be consistent with the experimental data, i.e., the mu neutrino becomes massless as commented in the previous paper. We showed that this issue can be solved if some operators are taken into account. And we saw that such operators do not play an important role in studying quark and charged lepton sectors. The predictions on the neutrino masses and mixings are the same as the E6 models, which are consistent with various experiments on the neutrino oscillations. △ Less", "We examine generalized O'Raifeartaigh models that feature multiple tree-level flat directions and only contain fields with R-charges 0 or 2. We show that spontaneous R-breaking at up to one-loop order is impossible in such theories. Specifically, we prove that the R-symmetric origin of field space is always a local minimum of the one-loop Coleman-Weinberg potential, generalizing an earlier result for the case of a single flat direction. This result has consequences for phenomenology and helps elucidate the behavior of various models of dynamical SUSY breaking. △ Less", "So far, no supersymmetric particles have been detected at the Large Hadron Collider (LHC). However, the recent Higgs results have interesting implications for the SUSY parameter space. In this paper, we study the consequences of an LHC Higgs signal for a model with non-universal gaugino masses in the context of SU(5) unification. The gaugino mass ratios associated with the higher representations produce viable spectra that are largely inaccessible to the current LHC and direct dark matter detection experiments. Thus, in light of the Higgs results, the non-observation of SUSY is no surprise. △ Less", "We have analyzed the prospect of detecting a higgs signal in mSUGRA/CMSSM based Supersymmetric(SUSY) model via chargino-neutralino($\\CH_1\\N0_2$) production at 8 TeV and 14 TeV LHC energy. The signal is studied in the channel with $\\ell + b \\bar b + \\PMET$ following the decays, $\\CH_1 \\to W^\\pm \\N0_1$, $\\N0_2 \\to \\N0_1 h$ and $h \\to b \\bar b$. In this analysis reconstruction of the higgs mass out of two b-jets plays a very crucial role in determining the signal to background ratio. We follow two techniques to reconstruct higgs mass: (A) using two identified b-jets, (B) using jet substructure technique. In addition, imposing a certain set of selection cuts we observe the significance is better for the latter method. We find that a viable signal can be obtained for the higgs mass $\\sim$ 125 GeV with an integrated luminosity 100 $\\lumi$ for both 8 and 14 TeV LHC energy. △ Less", "The minimal supergravity (mSUGRA or CMSSM) model is an oft-used framework for exhibiting the properties of neutralino (WIMP) cold dark matter (CDM). However, the recent evidence from Atlas and CMS on a light Higgs scalar with mass m_h\\simeq 125 GeV highly constrains the superparticle mass spectrum, which in turn constrains the neutralino annihilation mechanisms in the early universe. We find that stau and stop co-annihilation mechanisms -- already highly stressed by the latest Atlas/CMS results on SUSY searches -- are nearly eliminated if indeed the light Higgs scalar has mass m_h\\simeq 125 GeV. Furthermore, neutralino annihilation via the A-resonance is essentially ruled out in mSUGRA so that it is exceedingly difficult to generate thermally-produced neutralino-only dark matter at the measured abundance. The remaining possibility lies in the focus-point region which now moves out to m_0\\sim 10-20 TeV range due to the required large trilinear soft SUSY breaking term A_0. The remaining HB/FP region is more fine-tuned than before owing to the typically large top squark masses. We present updated direct and indirect detection rates for neutralino dark matter, and show that ton scale noble liquid detectors will either discover mixed higgsino CDM or essentially rule out thermally-produced neutralino-only CDM in the mSUGRA model. △ Less", "In a recent paper, a minimal supersymmetric (SUSY) SO(10)xS_4 based unified model of flavor for quarks and leptons was proposed with two 10 and one 126 contributing to fermion masses. An important aspect of this model is that Yukawa couplings emerge dynamically from minimization of the flavon potential, thereby reducing the number of parameters considerably. We make a detailed numerical analysis of this model for fermion mixings including SUSY threshold effects at the TeV scale and type-I corrections to a type-II dominant seesaw for neutrino masses. This is a single-step breaking model with SUSY SO(10) broken at the Grand Unified Theory (GUT)-scale of 2x10^16 GeV to the Minimal Supersymmetric Standard Model (MSSM). The minimal model has only 11 parameters, and therefore, the charged fermion fits predict the masses (up to an overall scale) and mixings in the neutrino sector. We present correlations for the different predictions in the neutrino mixing parameters. The recent experimental \"large\" θ_{13} value of \\sim 9 degrees can be obtained by a simple extension of the minimal model. We also find that proton decay mode p -> K^+\\barν_μhas a partial lifetime of \\sim10^34 yrs, which is within reach of the next round of planned proton decay searches. The successful fit for fermion masses requires the Higgs mass to be below 129 GeV in this model. If the Higgs mass lies between 120-128 GeV, as suggested by the recent LHC data, we find a lower limit on the light stop mass of 755 (211) GeV for μ>0 (<0). △ Less", "Changes in the values of the fundamental constants mu, the proton to electron mass ratio, and alpha, the fine structure constant due to rolling scalar fields have been discussed both in the context of cosmology and in new physics such as Super Symmetry (SUSY) models. This article examines the changes in these fundamental constants in a particular example of such fields, freezing and thawing slow roll quintessence. Constraints are placed on the product of a cosmological quantity, w, the equation of state parameter, and the square of the coupling constants for mu and alpha with the field, zeta_x, x = mu,alpha, using the existing observational limits on the values of Delta x/x. Various examples of slow rolling quintessence models are used to further quantify the constraints. Some of the examples appear to be rejected by the existing data which strongly suggests that conformation to the values of the fundamental constants in the early universe is a standard test that should be applied to any cosmological model or suggested new physics. △ Less", "Among various supersymmetric (SUSY) standard models, the gravity mediation model with a neutralino LSP and the gauge mediation model with a very light gravitino are attractive from the cosmological view point. These models have different scales of SUSY breaking and their underlying physics in high energy is quite different. However, if the sparticles' decay into the gravitino is prompt in the latter case, their collider signatures can be similar: multiple jets and missing transverse momentum. In this paper, we study the discrimination between these models in minimal cases at the LHC based on the method using the significance variables in several different modes and show the discrimination is possible at a very early stage after the discovery. △ Less", "The direct searches for Superymmetry at colliders can be complemented by direct searches for dark matter (DM) in underground experiments, if one assumes the Lightest Supersymmetric Particle (LSP) provides the dark matter of the universe. It will be shown that within the Constrained minimal Supersymmetric Model (CMSSM) the direct searches for DM are complementary to direct LHC searches for SUSY and Higgs particles using analytical formulae. A combined excluded region from LHC, WMAP and XENON100 will be provided, showing that within the CMSSM gluinos below 1 TeV and LSP masses below 160 GeV are excluded (m_{1/2} > 400 GeV) independent of the squark masses. △ Less", "We calculate the Chern-Simons diffusion rate in a strongly coupled N=4 SUSY Yang-Mills plasma in the presence of a constant external $U(1)_R$ magnetic flux via the holographic correspondence. Due to the strong interactions between the charged fields and non-Abelian gauge fields, the external Abelian magnetic field affects the thermal Yang-Mills dynamics and increases the diffusion rate, regardless of its strength. We obtain the analytic results for the Chern-Simons diffusion rate both in the weak and strong magnetic field limits. In the latter limit, we show that the diffusion rate scales as $B\\times T^2$ and this can be understood as a result of a dynamical dimensional reduction. △ Less", "Global frequentist fits to the CMSSM and NUHM1 using the MasterCode framework are updated to include the public results of searches for supersymmetric signals using \\sim 1/fb of LHC data recorded by ATLAS and CMS and \\sim 0.3/fb of data recorded by LHCb. We also include the constraints imposed by the electroweak precision and B-physics observables, the cosmological dark matter density and the XENON100 search for spin-independent dark matter scattering. Finally we also investigate the impact of a possible Higgs signal around 125 GeV. The various constraints set new bounds on the parameter space of the CMSSM and the NUHM1. We discuss the impact of the new results from SUSY and Higgs searches for these bounds and analyze the impact for a future liner e^+e^- collider. △ Less", "Anomaly mediation is a ubiquitous source of supersymmetry (SUSY) breaking which appears in almost every theory of supergravity. In this paper, we show that anomaly mediation really consists of two physically distinct phenomena, which we dub \"gravitino mediation\" and \"Kahler mediation\". Gravitino mediation arises from minimally uplifting SUSY anti-de Sitter (AdS) space to Minkowski space, generating soft masses proportional to the gravitino mass. Kahler mediation arises when visible sector fields have linear couplings to SUSY breaking in the Kahler potential, generating soft masses proportional to beta function coefficients. In the literature, these two phenomena are lumped together under the name \"anomaly mediation\", but here we demonstrate that they can be physically disentangled by measuring associated couplings to the goldstino. In particular, we use the example of gaugino soft masses to show that gravitino mediation generates soft masses without corresponding goldstino couplings. This result naively violates the goldstino equivalence theorem but is in fact necessary for supercurrent conservation in AdS space. Since gravitino mediation persists even when the visible sector is sequestered from SUSY breaking, we can use the absence of goldstino couplings as an unambiguous definition of sequestering. △ Less", "The recent experimental hints for a relatively heavy Higgs with a mass in the range 119-125 GeV favour supersymmetric scenarios with a large mixing in the stop mass matrix. It has been shown that this is possible in the constrained Minimal Supersymmetric Standard Model (CMSSM), but only for a very specific relation between the trilinear parameter and the soft scalar mass, favouring A ~ -2m for a relatively light spectrum, and sizable values of tan(beta). We describe here a string-derived scheme in which the first condition is automatic and the second arises as a consequence of imposing radiative EW symmetry breaking and viable neutralino dark matter in agreement with WMAP constraints. More specifically, we consider modulus dominated SUSY-breaking in Type II string compactifications and show that it leads to a very predictive CMSSM-like scheme, with small departures due to background fluxes. Imposing the above constraints leaves only one free parameter, which corresponds to an overall scale. We show that in this construction $A=-3\\sqrt{2}m\\approx -2m$ and in the allowed parameter space tan(beta)=38-41, leading to 119 GeV < m_h < 125 GeV. We determine the detectability of this model and show that it could start being probed by the LHC at 7(8) TeV with a luminosity of 5(2) fb^-1, and the whole parameter space would be accessible for 14 TeV and 25 fb^-1. Furthermore, this scenario can host a long-lived stau with the right properties to lead to catalyzed BBN. We finally argue that anthropic arguments could favour the highest value for the Higgs mass that is compatible with neutralino dark matter, i.e., m_h~125 GeV. △ Less", "We study light gravitino productions in association with a neutralino at future linear colliders in a scenario in which the lightest SUSY particle is a gravitino and the produced neutralino promptly decays into a photon and a gravitino. Comparing with the multiple goldstino scenario, we show that energy and angular distributions of the photon provide valuable information on the SUSY masses as well as the SUSY breaking. △ Less", "The Higgs bosons of the MSSM can be produced from the decay of SUSY particles. We review the evalulation of two decay modes in the MSSM with complex parameters (cMSSM). The first type is the decay of the heavy scalar top quark to a lighter scalar quark and a Higgs boson. The second type is the decay of the heavy chargino to a lighter chargino/neutralino and a Higgs boson. The evaluation is based on a full one-loop calculation including hard QED and QCD radiation. We find sizable contributions to many partial decay widths and branching ratios. They are roughly of O(10%) of the tree-level results, but can go up to 30% or higher. These contributions are important for the correct interpretation of scalar top quark decays at a future linear e+e- collider. △ Less", "This work consists of two parts. In the first part we construct the complete extension of the Minimal Supersymmetric Standard Model by higher dimensional effective operators and study its phenomenology. These operators encapsulate the effects on LHC physics of possible new degrees of freedom at the multiTeV scale. The effective analysis includes the case where the multiTeV physics is the supersymmetry breaking sector itself. Beyond the new effective couplings, the analysis suggests an interpretation of the 'little hierarchy problem' as an indication of new physics at multiTeV scale. In the second part we explore the power of constrained superfields in extended supersymmetry. It is known that in N = 2 supersymmetry the gauge kinetic function cannot depend on hypermultiplet scalars. However, it is also known that the low energy effective action of a D-brane in an N = 2 supersymmetric bulk includes the DBI action, where the gauge kinetic function does depend on the dilaton. We show how the nonlinearization of the second SUSY (imposed by the presence of the D-brane) opens this possibility, by constructing the global N = 1 linear + 1 nonlinear invariant coupling of a hypermultiplet with a gauge multiplet. The constructed theory enjoys interesting features, including a novel super-Higgs mechanism without gravity. △ Less", "In this talk, we discuss the SUSY-Yukawa sum rule, a relation among masses and mixing angles of the third-generation squarks which follows directly from the coupling relation responsible for canceling the quadratic divergence in the Higgs mass. Radiative corrections modify the sum rule, introducing dependence on a variety of SUSY parameters beyond the third-generation squark sector. If some of those parameters are measured experimentally, a sharp prediction for the sum rule is possible. We demonstrate this point with a quantitative study. We also discuss the prospects for measuring the ingredients of the sum rule at the LHC, and argue that a high-energy electron-positron collider such as the ILC would be necessary to test the sum rule. △ Less", "Supersymmetric models with t-b-tau Yukawa coupling unification and unified gaugino masses at the GUT scale with mu >0 show a mild preference for light gluino masses \\lesssim 500 GeV. This range of gluino mass is now essentially ruled out by LHC searches. We show that a heavier gluino mass ~ 0.5-3 TeV can also be compatible with excellent t-b-tau Yukawa coupling unification in supersymmetric models with non-universal Higgs masses (NUHM2). The gluino in such models is the lightest colored sparticle, while the squark sector displays an inverted mass hierarchy with m_{\\tilde q} ~ 5-20 TeV. We present some LHC testable benchmark points for which the lightest Higgs boson mass ~ 125 GeV. We also discuss LHC signatures of Yukawa-unified models with heavier gluinos. We expect gluino pair production followed by decay to final states containing four b-jets plus four W-bosons plus missing E_T to occur at possibly observable rates at LHC. △ Less", "LHC searches for supersymmetry currently focus on strongly produced sparticles, which are copiously produced if gluinos and squarks have masses of a few hundred GeV. However, in supersymmetric models with heavy scalars, as favored by the decoupling solution to the SUSY flavor and CP problems, and m_{\\tg}> 500 GeV as indicated by recent LHC results, chargino--neutralino (\\tw_1^\\pm\\tz_2) production is the dominant cross section for m_{\\tw_1} \\sim m_{\\tz_2} < m_{\\tg}/3 at LHC with \\sqrt{s}=7 TeV (LHC7). Furthermore, if m_{\\tz_1}+m_Z \\lesssim m_{\\tz_2}\\lesssim m_{\\tz_1}+m_h, then \\tz_2 dominantly decays via \\tz_2\\to\\tz_1 Z, while \\tw_1 decays via \\tw_1\\to \\tz_1 W. We investigate the LHC7 reach in the WZ + MET channel (for both leptonic and hadronic decays of the W boson) in models with and without the assumption of gaugino mass universality. In the case of the mSUGRA/CMSSM model with heavy squark masses, the LHC7 discovery reach in the WZ+MET channel becomes competetive with the reach in the canonical MET + jets channel for integrated luminosities \\sim 30 fb^-1. We also present the LHC7 reach for a simplified model with arbitrary m_{\\tz_1} and m_{\\tw_1} \\sim m_{\\tz_2}. Here, we find a reach of up to m_{\\tw_1}\\sim 200 (250) GeV for 10 (30) fb^-1. △ Less", "The E6SSM is a promising model based on the group E6, assumed to be broken at the GUT scale, leading to the group SU(3)\\times SU(2)\\times U(1)\\times U(1)' at the TeV scale. It gives a solution to the MSSM μ-problem without introducing massless axions, gauge anomalies or cosmological domain walls. The model contains three families of complete 27s of E6, giving a richer phenomenology than the MSSM. The E6SSM generically predicts gluino cascade decay chains which are about 2 steps longer than the MSSM's due to the presence of several light neutralino states. This implies less missing (and more visible) transverse momentum in collider experiments and kinematical distributions such as M_eff are different. Scans of parameter space and MC analysis suggest that current SUSY search strategies and exclusion limits have to be reconsidered. △ Less", "We introduce a model independent parametrization for a subclass of gauge mediated theories, which we refer to as Yukawa-gauge mediation. Within this formalism we study the resulting soft masses in the visible spectrum. We find general expressions for the gaugino and scalar masses. Under generic conditions, the gaugino mass is screened, vanishing at first order in the SUSY breaking scale. △ Less", "We study the effects of heavy Majorana neutrinos on the Higgs sector of the MSSM via radiative corrections. We work within the SUSY context where the MSSM particle content is enlarged with right handed neutrinos and their corresponding SUSY partners, the sneutrinos, and where compatibility with neutrino data is required. We compute the one-loop corrections to the mass of the lightest MSSM CP-even neutral Higgs boson from Majorana neutrinos and their SUSY partners and assume a seesaw mechanism of type I for neutrino mass generation. A negative and sizeable Higgs mass correction of up to -5 GeV is found for a heavy Majorana mass of up to 10^{15} GeV. This negative correction can grow up to several tens of GeV if the soft SUSY breaking mass associated to their sneutrino partners is simmilarly heavy as the Majorana mass. △ Less", "Supersymmetric grand unified models based on the gauge group SU(5) often require in addition to gauge coupling unification, the unification of b-quark and $τ$-lepton Yukawa couplings. We examine SU(5) SUSY GUT parameter space under the condition of $b-τ$ Yukawa coupling unification using 2-loop MSSM RGEs including full 1-loop threshold effects. The Yukawa-unified solutions break down into two classes. Solutions with low tanβ~3-11 are characterized by gluino mass ~1-4 TeV and squark mass ~1-5 TeV. Many of these solutions would be beyond LHC reach, although they contain a light Higgs scalar with mass <123 GeV and so may be excluded should the LHC Higgs hint persist. The second class of solutions occurs at large tanβ~35-60, and are a subset of $t-b-τ$ unified solutions. Constraining only $b-τ$ unification to ~5% favors a rather light gluino with mass ~0.5-2 TeV, which should ultimately be accessible to LHC searches. While our $b-τ$ unified solutions can be consistent with a picture of neutralino-only cold dark matter, invoking additional moduli or Peccei-Quinn superfields can allow for all of our Yukawa-unified solutions to be consistent with the measured dark matter abundance. △ Less"]