["Searches for supersymmetry (SUSY) often rely on a combination of hard physics objects (jets, leptons) along with large missing transverse energy to separate New Physics from Standard Model hard processes. We consider a class of ``double-invisible'' SUSY scenarios: where squarks, stops and sbottoms have a three-body decay into two (rather than one) invisible final-state particles. This occurs naturally when the LSP carries an additional conserved quantum number under which other superpartners are not charged. In these topologies, the available energy is diluted into invisible particles, reducing the observed missing energy and visible energy. This can lead to sizable changes in the sensitivity of existing searches, dramatically changing the qualitative constraints on superpartners. In particular, for m_LSP>160 GeV, we find no robust constraints from the LHC at any squark mass for any generation, while for lighter LSPs we find significant reductions in constraints. If confirmed by a full reanalysis from the collaborations, such scenarios allow for the possibility of significantly more natural SUSY models. While not realized in the MSSM, such phenomenology occurs naturally in models with mixed sneutrinos, Dirac gauginos and NMSSM-like models. △ Less", "We study the phenomenological implications of sfermion flavour mixing in supersymmetry in the context of Non-Minimal Flavour Violation (NMFV). We study the general flavour mixing hypothesis, parametrizing the squark and slepton mass matrices by a complete set of delta^XY_ij (X,Y=L,R; i,j= t,c,u or b,s,d for squarks/1,2,3 for sleptons). With respect to the squark sector, we study the behaviour of the B-physics observables BR(B -> Xs gamma), BR(Bs -> mu+ mu-) and delta M_B_s and update the constraints to the delta parameters coming from them. We present one-loop corrections to the Higgs boson masses in the MSSM with NMFV in the squark sector, and taking into account the previous constraints we evaluate them, finding sizable corrections, exceeding sometimes tens of GeV for the light Higgs boson. These corrections might be used to set further constraints on the delta parameters from the Higgs boson mass measurement. With respect to the slepton sector, we explore the implications on charged lepton flavour violating (LFV) processes. The present upper bounds on the most relevant LFV processes and the recent LHC and (g-2)_mu data lead to updated constraints on all slepton flavour mixing parameters. We also study the LFV Higgs decays h,H, A -> tau mu considering the relevant types of slepton mixing (LL23, LR23, RL23, RR23) in the context of a heavy SUSY with a scale into the multi-TeV range. These observables present a non-decoupling behaviour with mSUSY, and are shown here to remain constant as mSUSY grows, for large mSUSY> 2 TeV values and for all the mixings considered. We show that all the three channels could be measurable at the LHC even in these heavy SUSY scenarios, being h -> tau mu the most promising one, with up to about hundred of events expected with the current LHC centre-of-mass energy and luminosity. The most promising predictions for the future LHC stage are also included. △ Less", "We review the No-Scale F-SU(5) model with extra TeV-scale vector-like flippon multiplets and associated collider phenomenology relating to the search for supersymmetry at the LHC. The model framework possesses the rather unique capacity to provide a light CP-even Higgs boson mass in the favored 124-126 GeV window while simultaneously retaining a testably light Supersymmetry (SUSY) spectrum. We further elucidate the emerging empirical connection between recent Planck satellite data and No-Scale Supergravity cosmological models that mimic the Starobinsky model of inflation, drawing upon work conducted by the conference presenter (DVN) with John Ellis (King's College London/CERN) and Keith Olive (Minnesota). △ Less", "We present the program package NMSSMCALC for the calculation of the loop-corrected NMSSM Higgs boson masses and decay widths in the CP-conserving and CP-violating NMSSM. The full one-loop corrections to the Higgs boson masses are evaluated in a mixed renormalisation scheme of on-shell and $\\overline{\\mbox{DR}}$ conditions. The Higgs decay widths include the dominant higher order QCD corrections, and the decays into bottom quarks, strange quarks and tau leptons are supplemented by higher order SUSY corrections through effective couplings. All relevant off-shell decays into two massive gauge bosons, gauge and Higgs boson and Higgs pair final states as well as into heavy quark pairs are computed. The input and output files feature the SUSY Les Houches Accord so that the program can easily be linked with existing computer tools. △ Less", "We analyze the dynamics and observational predictions of supersymmetric hybrid inflation in the warm regime, where dissipative effects are mediated by the waterfall fields and their subsequent decay into light degrees of freedom. This produces a quasi-thermal radiation bath with a slowly-varying temperature during inflation and further damps the inflaton's motion, thus prolonging inflation. As in the standard supercooled scenario, inflation ends when the waterfall fields become tachyonic and can no longer sustain a nearly constant vacuum energy, but the interaction with the radiation bath makes the waterfall fields effectively heavier and delays the phase transition to the supersymmetric minimum. In this work, we analyze for the first time the effects of finite temperature corrections and SUSY mass splittings on the quantum effective potential and the resulting dissipation coefficient. We show, in particular, that dissipation can significantly delay the onset of the tachyonic instability to yield 50-60 e-folds of inflation and an observationally consistent primordial spectrum, which is not possible in the standard supercooled regime when inflation is driven by radiative corrections. △ Less", "The current searches of supersymmetry (SUSY) are based on the neutralino lightest sparticle (LSP). In this article we instead focus on SUSY with sneutrino LSP. It is well motivated in many contexts, especially in which sneutrino services as a dark matter candidate. We first develop a simplified model, which contains the stop, chagino/neutralino and sneutrino, to describe the LHC phenomenologies of a large class of models with sneutrino LSP. Then we investigate bounds on the model using the SUSY searches at the 8 TeV LHC. Strong exclusion limits are derived, e.g., masses of stop and chargino can be excluded up to about 900 GeV and 550 GeV, respectively. We also propose optimizations for some searches without turning to higher energy and luminosity. △ Less", "On-shell effective theory approach has been widely used in search of various supersymmetric signals, in particular, gluino/squark pairs with long cascade decay chains in which complete matrix element calculations may encounter over-20 dimensional integrations. On the other hand, leptons from polarized chargino decays may show significant boost or anti-boost effect in some scenarios and simulation without polarization information may underestimate or overestimate the lepton $p_{T}$ cut efficiencies in the first place. We study the polarization effects in supersymmetry searches of multi-jets plus leptons final states. We find it justifiable for first two generations to only use on-shell effective theories. While for measurements related to third generation squarks, for instance, polarization effect of charginos from stop may reduce the lepton $p_{T}$ cut efficiencies in cross section measurements by $25\\%$ when slepton contributions dominate in chargino decay or $W$ are on-shell. The signal is then underestimated if only on-shell effective theory approach is taken in simulation of signal and the real bound on squark/gluino should be more stringent. △ Less", "The minimal supersymmetric standard model with a low scale see-saw mechanism is presented. Within this framework, the lepton flavour violation in the charged lepton sector is thoroughly studied. Special attention is paid to the individual loop contributions due to the heavy neutrinos $N_{1,2,3}$, sneutrinos $\\tilde{N}_{1,2,3}$ and soft SUSY-breaking terms. For the first time, the complete set of box diagrams is included, in addition to the photon and $Z$-boson mediated interactions. The complete set of chiral amplitudes and their associate form-factors related to the neutrinoless three-body charged lepton flavor violating decays of the muon and tau, such as $μ\\to eee$, $τ\\to μμμ$, $τ\\to eμμ$ and $τ\\to eeμ$, as well as the coherent $μ\\to e$ conversion in nuclei, were derived. The obtained analytical results are general and can be applied to most of the New Physics models with charged lepton flavor violation. This systematic analysis has revealed the existence of two new box form factors, which have not been considered before in the existing literature in this area of physics. In the same model, the systematic study of one-loop contributions to the muon anomalous magnetic dipole moment $a_μ$ and the electron electric dipole moment $d_e$ is performed. Special attention is paid to the effect of the sneutrino soft SUSY-breaking parameters, $B_ν$ and $A_ν$, and their universal CP phases ($θ$ and $φ$) on $a_μ$ and $d_e$. △ Less", "We study a scenario for baryogenesis in modular cosmology and discuss its implications for the moduli stabilization mechanism and the supersymmetry (SUSY) breaking scale. If moduli fields dominate the Universe and decay into the standard model particles through diatonic couplings, the right amount of baryon asymmetry can be generated through CP violating decay of gluino into quark and squark followed by baryon-number violating squark decay. We find that, in the KKLT-type moduli stabilization, at least two non-perturbative terms are required to obtain a sizable CP phase, and that the successful baryogenesis is possible for the soft SUSY breaking mass heavier than O(1) TeV. A part of the parameter space for successful baryogenesis can be probed at the collider experiments, dinucleon decay search experiment, and the measurements of electric dipole moments of neutron and electron. It is also shown that similar baryogenesis works in the case of the gravitino- or the saxion-dominated Universe. △ Less", "This letter presents new results on the combined sensitivity of the LHC and underground dark matter search experiments to the lightest neutralino as WIMP candidate in the minimal Supersymmetric extension of the Standard Model. We show that monojet searches significantly extend the sensitivity to the neutralino mass in scenarios where scalar quarks are nearly degenerate in mass with it. The inclusion of the latest bound by the LUX experiment on the neutralino-nucleon spin-independent scattering cross section expands this sensitivity further, highlighting the remarkable complementarity of jets/$\\ell$s+MET and monojet at LHC and dark matter searches in probing models of new physics with a dark matter candidate. The qualitative results of our study remain valid after accounting for theoretical uncertainties. △ Less", "We present a new scenario of gravitino dark matter which is compatible with the thermal leptogenesis. We confirm by an explicit calculation in supergravity that the relic abundance of thermally produced gravitino becomes insensitive to the reheating temperature once the temperature of the Universe exceeds the mass scale of the messenger fields. In such a situation, the correct baryon to dark matter ratio can be obtained by thermal leptogenesis when the reheating temperature after inflation is high enough. We demonstrate in a concrete model of gauge mediation that the correct abundance of gravitino and baryon asymmetry can be reproduced by considering the late-time entropy production from the decay of the SUSY-breaking pseudo-moduli field. The scenario is realized when the gravitino mass is 100 MeV lesssim m_{3/2} lesssim 1 GeV, and the messenger mass scale is 10^6 GeV lesssim M_{mess} lesssim 10^9 GeV. △ Less", "Recent progress on the (g-2)_μprediction is presented. In the SM, the Higgs-boson mass dependent contributions have been evaluated exactly up to the two-loop level and consistently combined with leading three-loop effects. Thus, the currently most accurate value including a detailed error analysis for the SM electroweak contributions has been obtained. The SUSY two-loop corrections from fermion/sfermion-loop insertions have been computed; they are generally large and logarithmically enhanced for heavy squarks. △ Less", "Using Z3 asymmetric orbifolds in heterotic string theory, we construct N=1 SUSY three-generation models with the standard model gauge group SU(3)_C \\times SU(2)_L \\times U(1)_Y and the left-right symmetric group SU(3)_C \\times SU(2)_L \\times SU(2)_R \\times U(1)_{B-L}. One of the models possesses a gauge flavor symmetry for the Z3 twisted matter. △ Less", "We identify the underlying symmetry mechanism that suppresses the low-energy effective 4D cosmological constant within 6D supergravity models, leading to results suppressed by powers of the KK scale relative to the much larger masses associated with particles localized on codimension-2 branes. In these models the conditions for unbroken supersymmetry can be satisfied locally everywhere within the extra dimensions, but are obstructed by global conditions like flux quantization or the mutual inconsistency of boundary conditions at the various branes. Consequently quantities forbidden by supersymmetry cannot be nonzero until wavelengths of order the KK scale are integrated out, since only such long wavelength modes see the entire space and so know that supersymmetry breaks. We verify these arguments by extending earlier rugby-ball calculations of one-loop vacuum energies to more general pairs of branes within two warped extra dimensions. The predicted effective 4D vacuum energy density can be of order C (m Mg/4 pi Mp)^4, where Mg (Mp) is the rationalized 6D (4D) Planck scale and m is the heaviest brane-localized particle. Numerically this is C (5.6 x 10^{-5} eV)^4 if we take m = 173 GeV and take Mg as small as possible (10 TeV corresponding to KK size r < 1 micron), consistent with supernova bounds. C is a constant depending on details of the bulk spectrum, which could be ~ 500 for each of hundreds of fields. The value C ~ 6 x 10^6 gives the observed Dark Energy density. △ Less", "We study phenomenological aspects of the bino-wino co-annihilation scenario in high-scale supersymmetry breaking models. High-scale SUSY breaking scenarios are considered to be promising possibility after the discovery of the Higgs boson with a mass around 126 GeV. In this paper, we discuss the bino lightest supersymmetric particle (LSP) accompanied by the at most around 30 GeV heavier wino. With the suitable mass splitting between the bino and the wino, the bino LSP has the correct relic abundance of dark matter. For the smaller mass splitting, the late-time decay of the gravitino can provide the correct abundance of the bino dark matter. It is extremely challenging to find signals from the bino dark matter in direct and indirect detections. By utilizing multi-jets plus missing transverse momentum events at the LHC, we can constraint the gluino mass and thus probe the bino-wino co-annihilation scenario indirectly. The collider experiment, however, can not search the bino dark matter directly. In this paper, we suggest the direct probe of the bino dark matter. We show that the bino dark matter leaves imprints on the small-scale matter power spectrum when the bino dark matter is produced by the decay of the gravitino. The non-thermal bino dark matter behaves as mixed (cold+warm) dark matter. △ Less", "We present the currently most precise W boson mass (M_W) prediction in the Minimal Supersymmetric Standard Model (MSSM) and discuss how it is affected by recent results from the LHC. The evaluation includes the full one-loop result and all known higher order corrections of SM and SUSY type. We show the MSSM prediction in the M_W-m_t plane, taking into account constraints from Higgs and SUSY searches. We point out that even if stops and sbottoms are heavy, relatively large SUSY contributions to M_W are possible if either charginos, neutralinos or sleptons are light. In particular we analyze the effect on the M_W prediction of the Higgs signal at about 125.6 GeV, which within the MSSM can in principle be interpreted as the light or the heavy CP-even Higgs boson. For both interpretations the predicted MSSM region for M_W is in good agreement with the experimental measurement. We furthermore discuss the impact of possible future LHC results in the stop sector on the M_W prediction, considering both the cases of improved limits and of the detection of a scalar top quark. △ Less", "We study lower bounds on the minimal distance in theory space between four-dimensional superconformal field theories (SCFTs) connected via broad classes of renormalization group (RG) flows preserving various amounts of supersymmetry (SUSY). For N=1 RG flows, the ultraviolet (UV) and infrared (IR) endpoints of the flow can be parametrically close. On the other hand, for RG flows emanating from a maximally supersymmetric SCFT, the distance to the IR theory cannot be arbitrarily small regardless of the amount of (non-trivial) SUSY preserved along the flow. The case of RG flows from N=2 UV SCFTs is more subtle. We argue that for RG flows preserving the full N=2 SUSY, there are various obstructions to finding examples with parametrically close UV and IR endpoints. Under reasonable assumptions, these obstructions include: unitarity, known bounds on the c central charge derived from associativity of the operator product expansion, and the central charge bounds of Hofman and Maldacena. On the other hand, for RG flows that break N=2 to N=1, it is possible to find IR fixed points that are parametrically close to the UV ones. In this case, we argue that if the UV SCFT possesses a single stress tensor, then such RG flows excite of order all the degrees of freedom of the UV theory. Furthermore, if the UV theory has some flavor symmetry, we argue that the UV central charges should not be too large relative to certain parameters in the theory. △ Less", "We adopt in this thesis a new approach by assuming a set of $H$-charges that give rise to a self-consistent model of $R$-parity breaking and baryon-number violation. As a consequence of our $H$-charge assignments, it is not possible to generate a Majorana mass term for left-handed neutrinos. However, a neutrino Dirac matrix can be built after the introduction of right-handed neutrinos with proper $H$-charges. We also show that by adding a second flavon field with fractional charge, it is possible to build a Majorana neutrino mass matrix. In both cases an anarchical matrix. The consequences for collider physics are mentioned. We will generalize the mechanism of obtain $R$--parity from an horizontal symmetry to the context of $SU(5)$ SUSY $+ \\widehat{N}$, and computable group theoretical coefficients that, at leading order, determine the structure of the neutrino mass matrix in a parameter independent way. △ Less", "In a scenario with heavy supersymmetric sfermions and decoupled supersymmetric Higgs sector, a well tempered neutralino is the remaining candidate for thermal single-component sub-TeV dark matter. Well tempered neutralinos are studied in the context of supersymmetric grand unified theories with third family Yukawa coupling unification. A global chi^2 analysis is performed, including the observables MW, MZ, GF, alpha_em, alpha_s(MZ), Mt, mb(mb), Mtau, b -> s gamma, BR(Bs -> mu^+ mu^-), Mh and Omegah^2. Tensions in simultaneously fitting the Higgs and bottom quark masses while also avoiding gluino mass bounds from the LHC disfavors light Higgsinos with mass < 500 GeV, ruling out light Bino/Higgsino dark matter candidates. Bino/Wino/Higgsino and Bino/Wino candidates fare somewhat better although they are fine-tuned and require departure from GUT scale gaugino mass universality (the example chosen here is the mixed modulus-anomaly pattern). Implications for dark matter direct detection of these models as well as collider signatures are briefly discussed. Independent of the thermal dark matter viability, these models will be severely constrained by the absence of a gluino at the next run of LHC. △ Less", "We present a simple theory where baryon and lepton numbers are spontaneously broken at the supersymmetry scale. In this context R-parity must be spontaneously broken but the theory still contains a stable field which can play the role of the cold dark matter of the Universe. We discuss the spectrum of the theory, the properties of the dark matter candidate and the predictions for direct detection experiments. This theory provides a concrete example of exotic supersymmetric signatures associated with having the simultaneous presence of R-parity violating and missing energy signals at the Large Hadron Collider. △ Less", "We review here the status of different dark matter candidates in the context of supersymmetric models, in particular the neutralino as a realization of the WIMP-mechanism and the gravitino. We give a summary of the recent bounds in direct and indirect detection and also of the LHC searches relevant for the dark matter question. We discuss also the implications of the Higgs discovery for the supersymmetric dark matter models and give the prospects for the future years. △ Less", "We study the possibility to determine the supersymmetric (SUSY) contribution to the muon anomalous magnetic dipole moment by using ILC measurements of the properties of superparticles. Assuming that the contribution is as large as the current discrepancy between the result of the Brookhaven E821 experiment and the standard-model prediction, we discuss how and how accurately the SUSY contribution can be reconstructed. We will show that, in a sample point, the reconstruction can be performed with the accuracy of ~ 13 % with the center-of-mass energy 500 GeV and the integrated luminosity ~ 500-1000 fb-1. △ Less", "We briefly review flavour violation in the lepton sector: starting from neutrino oscillations and their implications, we consider several charged lepton flavour violating observables at high and low energies. We present new physics models and discuss the rôle of the latter in disentangling them. In particular, we show how the interplay of different observables allows to derive important information on the underlying mechanism of lepton flavour violation. As an example, we discuss the impact of a type-I SUSY seesaw concerning lepton flavour violation at low energies and at colliders (LHC and a future Linear Collider). △ Less", "We consider flavor constraints on, and collider signatures of, Asymmetric Dark Matter (ADM) via higher dimension operators. In the supersymmetric models we consider, R-parity violating (RPV) operators carrying B-L interact with n dark matter (DM) particles X through an interaction of the form W = X^n O_{B-L}, where O_{B-L} = q l d^c, u^c d^c d^c, l l e^c. This interaction ensures that the lightest ordinary supersymmetric particle (LOSP) is unstable to decay into the X sector, leading to a higher multiplicity of final state particles and reduced missing energy at a collider. Flavor-violating processes place constraints on the scale of the higher dimension operator, impacting whether the LOSP decays promptly. While the strongest limitations on RPV from n-\\bar{n} oscillations and proton decay do not apply to ADM, we analyze the constraints from meson mixing, mu-e conversion, mu -> 3 e and b -> s l^+ l^-. We show that these flavor constraints, even in the absence of flavor symmetries, allow parameter space for prompt decay to the X sector, with additional jets and leptons in exotic flavor combinations. We study the constraints from existing 8 TeV LHC SUSY searches with (i) 2-6 jets plus missing energy, and (ii) 1-2 leptons, 3-6 jets plus missing energy, comparing the constraints on ADM-extended supersymmetry with the usual supersymmetric simplified models. △ Less", "In the post-LHC8 era, it is perceived that what is left of SUSY model parameter space is highly finetuned in the EW sector (EWFT). We discuss how conventional measures overestimate EWFT in SUSY theory. Radiatively-driven natural SUSY (RNS) models maintain the SUSY GUT paradigm with low EWFT at 10% level, but are characterized by light higgsinos ~100-300 GeV and a thermal underabundance of WIMP dark matter. Implementing the SUSY DFSZ solution to the strong CP problem explains the small μparameter but indicates dark matter should be comprised mainly of axions with a small admixture of higgsino-like WIMPs. While RNS might escape LHC14 searches, we would expect ultimately direct detection of both WIMPs and axions. An e^+e^- collider with \\sqrt{s} ~ 500-600 GeV should provide a thorough search for the predicted light higgsinos. △ Less", "The existence of multiple non-equivalent minima of the scalar potential in SUSY models both raises technical challenges and introduces interesting physics. The technical challenges are now that one has to find several minima and evaluate which is the deepest, as well as calculate the tunneling time from a false vacuum to the true vacuum. We present here studies on the vacuum stability and color/charge breaking minima in the CMSSM and R parity violating minima in a B-L extended MSSM. △ Less", "We take a closer look at the gaugino masses in the context of pure gravity mediation models/minimal split SUSY models. We see that the gaugino mass spectrum has a richer structure in the presence of vector-like matter fields even when they couple to the supersymmetry breaking sector only through Planck suppressed operators. For example, the gluino mass can be much lighter than in anomaly mediation, enhancing the detectability of the gluino at the LHC experiments. The rich gaugino spectrum also allows new possibilities for dark matter scenarios such as the bino-wino co-annihilation, bino-gluino co-annihilation, or even wino-gluino co-annihilation scenarios, which affects future collider experiments as well as dark matter search experiments. △ Less", "We study Higgs boson couplings in the large-$λ$ version of the Next-to-Minimal Supersymmetric Standard Model, known as $λ$-SUSY. We find that the predicted deviations from the Standard Model (SM) in these couplings are inversely correlated with the amount of fine-tuning needed to accommodate a 126 GeV Higgs. In the most natural regions of parameter space, the 126 GeV Higgs has large admixtures of both the SM-singlet and the non-SM Higgs doublet scalars, and such regions are already ruled out by the LHC. Future improvements in the Higgs coupling measurements will either discover deviations from the SM, or put further stress on naturalness in $λ$-SUSY. △ Less", "We present a summary of results for SUSY Simplified Model searches at future proton colliders: the 14 TeV LHC as well as a 33 TeV proton collider and a 100 TeV proton collider. Upper limits and discovery significances are provided for the gluino-neutralino (for both light and heavy flavor decays), squark-neutralino, and gluino-squark Simplified Model planes. Events are processed with the Snowmass combined detector and Standard Model backgrounds are computed using the Snowmass samples. We place emphasis on comparisons between different collider scenarios, along with the lessons learned regarding the impact of systematic errors and pileup. More details are provided in a companion paper. △ Less", "We estimate the sensitivity of the 14 TeV LHC run to an R-parity violating supersymmetric model, via the same-sign dilepton (SSDL) signature. We consider the simplified model with light gluinos and stops, motivated by naturalness. We find that gluinos up to 1.4 TeV can be discovered with an integrated luminosity of 300 fb-1. If a high-luminosity option is implemented and a 3000 fb-1 dataset becomes available, the gluino mass reach can be increased to 1.6-1.75 TeV. △ Less", "In this talk, I will present the general structure of RPV couplings when a Froggatt-Nielsen horizontal symmetry is responsible for the flavor structure of both the SM and the MSSM. For sub-TeV ({\\it natural}) SUSY, lepton number must be an accidental symmetry, while low-energy SUSY is still allowed by baryonic RPV, which lowers the MET signature of superparticles decays. The largest RPV coupling involves the stop, and it is constrained between $10^{-3}$ (from FCNCs) and $10^{-9}$ (from LHC searches). △ Less", "The decoupling limit in the MSSM Higgs sector is the most likely scenario in light of the Higgs discovery. This scenario is further constrained by MSSM Higgs search bounds and flavor observables. We perform a comprehensive scan of MSSM parameters and update the constraints on the decoupling MSSM Higgs sector in terms of 8 TeV LHC data. We highlight the effect of light SUSY spectrum in the heavy neutral Higgs decay in the decoupling limit. We find that the chargino and neutralino decay mode can reach at most 40% and 20% branching ratio, respectively. In particular, the invisible decay mode BR(H^0(A^0) -> \\tildeχ^0_1\\tildeχ^0_1) increases with increasing Bino LSP mass and is between 10%-15% (20%) for 30<m_{\\tildeχ^0_1}<100 GeV. The leading branching fraction of heavy Higgses decay into sfermions can be as large as 80% for H^0 -> \\tilde{t}_1\\tilde{t}_1^\\ast and 60% for H^0/A^0 -> \\tildeτ_1\\tildeτ_2^\\ast+\\tildeτ_1^\\ast\\tildeτ_2. The branching fractions are less than 10% for H^0 -> h^0h^0 and 1% for A^0 -> h^0Z for m_A>400 GeV. The charged Higgs decays to neutralino plus chargino and sfermions with branching ratio as large as 40% and 60%, respectively. Moreover, the exclusion limit of leading MSSM Higgs search channel, namely gg,b\\bar{b} -> H^0, A^0 -> tau^+ tau^-, is extrapolated to 14 TeV LHC with high luminosities. It turns out that the tau tau mode can essentially exclude regime with tanβ>20 for L=300 fb^{-1} and tanβ>15 for L=3000 fb^{-1}. △ Less", "If the lighter stop eigenstate decays directly to two jets via baryonic R-parity violation, it could have escaped existing LHC and Tevatron searches in four-jet events, even for masses as small as 100 GeV. In order to recover sensitivity in the face of increasingly harsh trigger requirements at the LHC, we propose a search for stop pairs in the highly-boosted regime, using the approaches of jet substructure. We demonstrate that the four-jet triggers can be completely bypassed by using inclusive jet-H_T triggers, and that the resulting QCD continuum background can be processed by substructure methods into a featureless spectrum suitable for a data-driven bump-hunt down to 100 GeV. We estimate that the LHC 8 TeV run is sensitive to 100 GeV stops with decays of any flavor at better than 5-sigma level, and could place exclusions up to 300 GeV or higher. Assuming Minimal Flavor Violation and running a b-tagged analysis, exclusion reach may extend up to nearly 400 GeV. Longer-term, the 14 TeV LHC at 300/fb could extend these mass limits by a factor of two, while continuing to improve sensitivity in the 100 GeV region. △ Less", "Given the increasingly more stringent bounds on Supersymmetry (SUSY) from the LHC searches, we are motivated to explore the situation in which the only accessible SUSY states are the electroweakinos (charginos and neutralinos). In the minimal SUSY framework, we systematically study the three general scenarios classified by the relative size of the gaugino mass parameters M_1, M_2 and the Higgsino mass parameter μ, with six distinctive cases, four of which would naturally result in a compressed spectrum of nearly degenerate LSPs. We present the relevant decay branching fractions and provide insightful understanding about the decay modes in connection with the Goldstone-boson Equivalence Theorem. We show the cross sections for electroweakino pair production at the LHC and ILC, and emphasize the unique signals involving the Standard Model-like Higgs boson as a new search reference. The electroweakino signal from pair production and subsequent decay to Wh/Zh (h to b\\bar{b}) final state may yield a sensitivity of 95% C.L. exclusion (5sigma discovery) to the mass scale M_2, μ~ 350-400 GeV (220-270 GeV) at the 14 TeV LHC with an luminosity of 300 fb^{-1}. Combining with all the other decay channels, the 95% C.L. exclusion (5sigma discovery) may be extended to M_2, μ~ 480-700 GeV (320-500 GeV). At the ILC, the electroweakinos could be readily discovered once the kinematical threshold is crossed, and their properties could be thoroughly studied. △ Less", "We present a new paradigm for supersymmetric theories with R-parity violation (RPV). At high scale, R-parity is conserved in the visible sector but spontaneously broken in the SUSY-breaking sector. The breaking is then dynamically mediated to the visible sector and is manifested via non-renormalizable operators at low energy. Consequently, RPV operators originate from the Kahler potential rather than the superpotential, and are naturally suppressed by the SUSY-breaking scale, explaining their small magnitudes. A new set of non-holomorphic RPV operators are identified and found to often dominate over the standard RPV ones. We study the relevant low-energy constraints arising from baryon-number violating processes, proton decay and flavor changing neutral currents, which may all be satisfied if a solution to the Standard Model flavor puzzle is incorporated. The chiral structure of the RPV operators imply new and distinct collider signatures, indicating the need to alter current techniques in searching for RPV at the LHC. △ Less", "We propose a novel mechanism of SUSY breaking by coupling a Lorentz-invariant supersymmetric matter sector to non-supersymmetric gravitational interactions with Lifshitz scaling. The improved UV properties of Lifshitz propagators moderate the otherwise uncontrollable ultraviolet divergences induced by gravitational loops. This ensures that both the amount of induced Lorentz violation and SUSY breaking in the matter sector are controlled by Lambda_HL^2/M_P^2, the ratio of the Horava-Lifshitz cross-over scale Lambda_HL to the Planck scale M_P. This ratio can be kept very small, providing a novel way of explicitly breaking supersymmetry without reintroducing fine-tuning. We illustrate our idea by considering a model of scalar gravity with Horava-Lifshitz scaling coupled to a supersymmetric Wess-Zumino matter sector, in which we compute the two-loop SUSY breaking corrections to the masses of the light scalars due to the gravitational interactions and the heavy fields. △ Less", "Minimal Flavor Violation offers an alternative symmetry rationale to R-parity conservation for the suppression of proton decay in supersymmetric extensions of the Standard Model. The naturalness of such theories is generically under less tension from LHC searches than R-parity conserving models. The flavor symmetry can also guarantee the stability of dark matter if it carries flavor quantum numbers. We outline general features of supersymmetric flavored dark matter (SFDM) models within the framework of MFV SUSY. A simple model of top flavored dark matter is presented. If the dark matter is a thermal relic, then nearly the entire parameter space of the model is testable by upcoming direct detection and LHC searches. △ Less", "Despite strong experimental evidences for their conservation at low energies, the baryon $B$ and lepton $L$ numbers are not expected to be absolute symmetries. Already violated in the Standard Model (SM) by non-perturbative effects (tiny at low temperatures and energies) and not justified by any fundamental principle, $B$ and $L$ appear naturally violated in beyond the Standard Model (BSM) scenarios, e.g. in supersymmetry (SUSY). The fact that any violation remained unobserved at low energies can nonetheless be explained, without pushing the associated characteristic sale beyond the TeV, by using SM flavour symmetries implemented BSM thanks to the Minimal Flavour Violation (MFV) prescription. Violation effects could therefore be observable at the LHC. Same-sign (anti-)tops, sometimes leading to a distinctive predominance of negatively charged lepton pairs over positively charged ones, is a clean signature that is for instance generically present in R-parity violating supersymmetry. △ Less", "In this talk we discuss SO(10) Yukawa unification and its ramifications for phenomenology. The initial constraints come from fitting the top, bottom and tau masses, requiring large $\\tanβ\\sim 50$ and particular values for soft SUSY breaking parameters. We perform a global $χ^2$ analysis, fitting the recently observed `Higgs' with mass of order 125 GeV in addition to fermion masses and mixing angles and several flavor violating observables. We discuss two distinct GUT scale boundary conditions for soft SUSY breaking masses. In both cases we have a universal cubic scalar parameter, $A_0$. In the first case we consider universal gaugino masses, and universal scalar masses, $m_{16}$, for squarks and sleptons; while in the latter case we have non-universal gaugino masses and either universal scalar masses, $m_{16}$, for squarks and sleptons or D-term splitting of scalar masses. We discuss the spectrum of SUSY particle masses and consequences for the LHC. △ Less", "In a class of supersymmetric gauge theories with asymptotic freedom, the low energy effective theory below the confinement scale is described by the composite superfields of the fundamental representation fields. Based on the supersymmetric gauge theory with N_c=2 and N_f=3 with an additional unbroken Z_2 symmetry, we propose a new model where neutrino masses, dark matter, and baryon asymmetry of the Universe can be simultaneously explained by physics below the confinement scale. This is an example for the ultraviolet complete supersymmetric extension of so-called radiative seesaw scenarios with first-order phase transition required for successful electroweak baryogenesis. We show that there are benchmark points where all the neutrino data, the lepton flavor violation data, and the LHC data are satisfied. We also briefly discuss Higgs phenomenology in this model. △ Less", "We analyze the minimal supersymmetric Higgs self-couplings at O(alpha_t alpha_s) within the effective potential approach. The two-loop corrections turn out to be of moderate size in the DRbar scheme if the central scale is chosen as half the SUSY scale. The inclusion of the two-loop corrections reduces the renormalization scale dependence to the per-cent level. These results have a significant impact on measurements of the trilinear Higgs self-couplings at the LHC and a future e^+e^- collider. △ Less", "We study SUSY models in which Bino contributions solve the muon g-2 anomaly. The contributions are enhanced by large left-right mixing of the smuons. However, it is constrained by the vacuum stability condition of the slepton--Higgs potential. Therefore, there are upper bounds on masses of sleptons and Bino. When the slepton soft masses are universal, the upper bound on the smuon mass becomes 330 (460)GeV in order to solve the g-2 anomaly at the 1 sigma (2 sigma) level. It is within the reach of LHC and ILC. If the stau is heavier than the smuon, the bound can be as large as 1.4 (1.9)TeV. Such non-universal slepton mass spectrum generically predicts too large LFV/CPV. We show that the models are expected to be probed by LHC/ILC and LFV/CPV complementarily in future. △ Less", "The lack of evidence for superparticles at the CERN LHC, along with the rather high value of the Higgs mass, has sharpened the perception that supersymmetric model parameter space is highly electroweak fine-tuned (EWFT). We compare three measures of fine-tuning in SUSY models. 1. \\Del_HS measures a terms containing large log contributions to m_Z that are inevitable in models defined at scales much higher than the electroweak scale. 2. \\Del_BG measures variation in m_Z against variation of model parameters and allows for correlations among high scale parameters which are not included in \\Del_HS. 3. The model-independent \\Del_EW measures how naturally a model can generate the measured value of m_Z=91.2 GeV in terms of weak scale parameters alone. We hypothesize an overarching Ultimate Theory (UTH) wherein the high scale soft terms are all correlated. The UTH might be contained within the more general effective SUSY theories popular in the literature. For \\Del_HS, EWFT can be overestimated by neglecting additional non-independent terms which lead to large cancellations. For \\Del_BG, EWFT can be overestimated by applying the measure to the effective theories instead of to the UTH. The measure \\Del_EW allows for the possibility of parameter correlations which should be present in the UTH and, since it is model-independent, provides the same value of EWFT for the effective theories as should occur for the UTH. We find that the well-known mSUGRA/CMSSM model is fine-tuned under all three measures so that it is unlikely to contain the UTH. The non-universal Higgs model NUHM2 appears fine-tuned with \\Del_HS,BG > 10^3. But since \\Del_EW can be as small as 7 (corresponding to 14% fine-tuning), it may contain the UTH for parameter ranges which allow for low true EWFT. △ Less", "We demonstrate here that the mini-split version of the Minimal Supersymmetric Standard Model (MSSM) including R-parity violating couplings naturally provides all the necessary ingredients for a novel baryogenesis mechanism. The baryogenesis is triggered by the late decay of a TeV scale bino after its thermal freezeout. A μ-term larger than the sfermion masses is necessary for obtaining sufficient baryon asymmetry. Two example models of direct baryogenesis and leptogenesis are proposed, with viable parameter spaces presented. The cosmological conditions for the models--in particular, the requirements of a long lifetime of bino and sufficient baryon asymmetry--point towards the mini-split scale of $\\sim$ 100-1000 TeV for the sfermion masses. This provides an independent motivation for mini-split SUSY, along with the constraints from flavor physics and Higgs mass measurement. We also discuss the potential multi-pronged search for the signatures of such models, including those at the Large Hadron Collider (LHC) and the low energy experiments at the intensity frontier. △ Less", "We explore the coannihilation region of the constrained minimal supersymmetric standard model (CMSSM) being consistent with current experimental/observational results. The requirements from the experimental/observational results are the 125GeV Higgs mass and the relic abundances of both the dark matter and light elements, especially the lithium-7. We put these requirements on the caluculated values, and thus we obtain allowed region. Then we give predictions to the mass spectra of the SUSY particles, the anomalous magnetic moment of muon, branching fractions of the B-meson rare decays, the direct detection of the neutralino dark matter, and the number of SUSY particles produced in 14TeV run at the LHC experiment. Comparing these predictions with current bounds, we show the feasibility of the test for this scenario in near future experiment. △ Less", "We explore here a new mechanism by which the out of equilibrium decay of heavy gravitinos, followed by possible R-parity violating decays in the Minimal Supersymmetric Standard Model (MSSM) can generate the baryon asymmetry of the universe. In this mechanism, gravitino decay produces a CP-asymmetry that is carried by squarks or sleptons. These particles then decay through R-parity violating operators generating a lepton asymmetry. The lepton asymmetry is converted into a baryon asymmetry by weak sphalerons, as in the familiar case of leptogenesis by Majorana neutrino decays. To ensure that the gravitino decays while the sphaleron is still in equilibrium, we obtain a lower bound on the gravitino mass, $m_{3/2} \\gtrsim 10^{8} \\GeV$, and therefore our mechanism requires a high scale of SUSY breaking, as well as minimum reheating temperature after inflation of $T\\gtrsim 10^{12} \\GeV$ in order to for the gravitino density to be sufficiently large to generate the baryon asymmetry today. We consider each of the MSSM's relevant R-parity violating operators in turn, and derive constraints on parameters in order to give rise to a baryon asymmetry comparable to that observed today, consistent with low energy phenomenological bounds on SUSY models. △ Less", "We explore supersymmetry (SUSY) parameter space with non-universal high scale parameters in gravity mediated SUSY breaking (SUGRA) scenario that accommodates a Higgs mass of (125$\\pm$2) GeV while satisfying cold dark matter relic density and other low energy constraints. We indicate a few benchmark points consistent with different dark matter annihilation processes where third family squarks are lighter than the first two as a requirement to keep the Higgs mass within the limit. We show that bottom rich and leptonic final states have better reach in such parameter space points and is the most likely scenario to discover SUSY at the upcoming run of LHC with center-of-mass energy 14 TeV. △ Less", "SUSY_FLAVOUR 2.0 is a FORTRAN code calculating over 30 low-energy flavour- and CP-related observables in the R-parity conserving MSSM. The code admits for the most general flavour structure of the SUSY breaking terms and complex flavour-diagonal couplings. It includes the numerically important resummation of chirally enhanced effects and it is fast enough for scanning over a large SUSY-parameter space. The program can be obtained from http://www.fuw.edu.pl/susy_flavor. △ Less", "After the discovery of SM-like Higgs with $m_{h}=125$ GeV, it is increasingly urgent to explore a solution to the hierarchy problem. In the context of MSSM from gauge-mediated SUSY breaking, the lower bound on gluino mass suggests that the messenger scale $M$ is probably large if the magnitude of $Λ\\sim 100$ TeV. In this paper, we study $\\overline{\\mathbf{5}}+ \\mathbf{5}$ model with $M\\sim 10^{8}-10^{12}$ GeV and $Λ\\simeq 100$ TeV. For moderate Higgs-messenger coupling, it will be shown a viable model with moderate fine tuning. In this model, $μ\\sim 800$ GeV and $B_μ$ nearly vanishes at input scale, which can be constructed in microscopic model. △ Less", "Motivated by the recent progress of direct search for the productions of stop pair and sbottom pair at the LHC, we examine the constraints of the search results on the stop ($\\tilde{t}_1$) mass in natural SUSY. We first scan the parameter space of natural SUSY in the framework of MSSM, considering the constraints from the Higgs mass, B-physics and electroweak precision measurements. Then in the allowed parameter space we perform a Monte Carlo simulation for stop pair production followed by $\\tilde{t}_{1} \\to t \\tildeχ_{1}^{0}$ or $\\tilde{t}_{1} \\to b \\tildeχ_{1}^{+}$ and sbottom pair production followed by $\\tilde{b}_{1} \\to b \\tildeχ_{1}^{0}$ or $\\tilde{b}_{1} \\to t \\tildeχ_{1}^{-}$. Using the combined results of ATLAS with 20.1 fb$^{-1}$ from the search of $\\ell+{\\rm jets}+\\slashed E_{T}$, hadronic $t\\bar{t}+\\slashed E_{T}$ and $2b+\\slashed E_{T}$, we find that a stop lighter than 600 GeV can be excluded at 95% CL in this scenario. △ Less", "For the case of the MSSM and the most general form of the NMSSM (GNMSSM) we determine the reduction in the fine tuning that follows from allowing gaugino masses to be non-degenerate at the unification scale, taking account of the LHC8 bounds on SUSY masses, the Higgs mass bound, gauge coupling unification and the requirement of an acceptable dark matter density. We show that low-fine tuned points fall in the region of gaugino mass ratios predicted by specific unified and string models. For the case of the MSSM the minimum fine tuning is still large, approximately 1:60 allowing for a 3 GeV uncertainty in the Higgs mass (1:500 for the central value), but for the GNMSSM it is below 1:20. We find that the spectrum of SUSY states corresponding to the low-fine tuned points in the GNMSSM is often compressed, weakening the LHC bounds on coloured states. The prospect for testing the remaining low-fine-tuned regions at LHC14 is discussed. △ Less", "We study the anomalous magnetic and electric dipole moments of charged leptons in supersymmetric low-scale seesaw models with right-handed neutrino superfields. We consider a minimally extended framework of minimal supergravity, by assuming that CP violation originates from complex soft SUSY-breaking bilinear and trilinear couplings associated with the right-handed sneutrino sector. We present numerical estimates of the muon anomalous magnetic moment and the electron electric dipole moment (EDM), as functions of key model parameters, such as the Majorana mass scale mN and tan(β). In particular, we find that the contributions of the singlet heavy neutrinos and sneutrinos to the electron EDM are naturally small in this model, of order 10^{-27} - 10^{-28} e cm, and can be probed in the present and future experiments. △ Less", "We propose an extension of the SUSY SU(5) which predicts LHC testable type-III seesaw. The supersymmetric SU(5) GUT model is extended by adding a 24-plet matter superfield along with a pair of $10_H$-plet and $\\bar{10}_H$-plet Higgs superfields. The 24-plet carries a triplet and a singlet fermion multiplet of SU(2)$_L$, which leads to type I+III seesaw. The additional $10_H$ (and $\\bar{10}_H$) multiplets help in achieving gauge coupling unification while keeping the triplet fermion mass in the TeV range, making them accessible at LHC. We study the phenomenology of this model in detail. Large lepton flavor violation predicted in this model puts severe constraints on the Yukawa couplings of the triplet fermion. We show that this smothers the possibility of observing the contribution of the heavy fermions in neutrinoless double beta decay experiments. The presence of the additional $10_H$ and $\\bar{10}_H$ in this model not only gives gauge coupling unification, it also leads to very large lepton flavor violation. △ Less", "At the ILC, one has the possibility to search for SUSY in an model-independent way: The corner-stone of SUSY is that sparticles couple as particles. This is independent of the mechanism responsible for SUSY breaking. Any model will have one Lightest SUSY Particle (LSP), and one Next to Lightest SUSY Particle (NLSP). In models with conserved R-parity, the NLSP must decay solely to the LSP and the SM partner of the NLSP. Therefore, studying NLSP production and decay can be regarded as a \"simplified model without simplification\": Any SUSY model will have such a process. The NLSP could be any sparticle: a slepton, an electroweak-ino, or even a squark. However, since there are only a finite number of sparticles, one can systematically search for signals of all possible NLSP:s. This way, the entire space of models that have a kinematicall y reachable NLSP can be covered. For any NLSP, the \"worst case\" can be determined, since the SUSY principle allows to calculate the cross-section once the NLSP nature and mass are given. The region in the LSP-NLSP mass-plane where the \"worst case\" could be discovered or excluded experimentally can be found by estimating background and efficiency at each point in the plane. From experience at LEP, it is expected that the lower signal-to background ratio will indeed be found for models with conserved R-parity. In this document, we show that at the ILC, such a program is possible, as it was at LEP. No loop-holes are left, even for difficult or non-standard cases: whatever the NLSP is it will be detectable. △ Less", "We study the decays of the SM-like Higgs state within the E6 inspired supersymmetric (SUSY) models with exact custodial symmetry that forbids tree-level flavor-changing transitions and the most dangerous baryon and lepton number violating operators. In these models there are two states which are absolutely stable and can contribute to the dark matter density. One of them is the lightest SUSY particle (LSP) which is expected to be lighter than 1 eV forming hot dark matter in the Universe. The presence of another stable neutral state allows to account for the observed cold dark matter density. In the considered SUSY models next-to-lightest SUSY particle (NLSP) also tend to be light. We argue that the NLSP with GeV scale mass can result in the substantial branching ratio of the nonstadard decays of the lightest Higgs boson. △ Less", "A supersymmetric version of the recently proposed reduced minimal 3-3-1 model is considered and its Higgs sector is investigated. We focus on the mass spectrum of the lightest scalars of the model. We show that Higgs mass of 125 GeV requires substantial radiative corrections. However, stops may develop small mixing and must have mass around TeV. Moreover, some soft SUSY breaking terms may lie at the electroweak scale, which alleviates some tension concerning fine tuning of the related parameters. The lightest doubly charged scalar may have mass around few hundreds of GeV, which can be probed at the LHC, while the remaining scalars of the model have masses at TeV scale. △ Less", "Direct searches for superpartners and precision measurements of the properties of the $\\sim 126$ GeV Higgs boson lead to important inter-dependent constraints on the underlying parameter space of the MSSM. The 19/20-parameter p(henomenological)MSSM offers a flexible framework for the study of a wide variety of both Higgs and SUSY phenomena at the LHC and elsewhere. Within this scenario we address the following questions: `What will potentially null searches for SUSY at the LHC tell us about the possible properties of the Higgs boson?' and, conversely, `What do precision measurements of the properties of the Higgs tell us about the possible properties of the various superpartners?' Clearly the answers to such questions will be functions of both the collision energy of the LHC as well as the accumulated integrated luminosity. We address these questions employing several sets of pMSSM models having either neutralino or gravitino LSPs, making use of the ATLAS SUSY analyses at the 7/8 TeV LHC as well as planned SUSY and Higgs analyses at the 14 TeV LHC and the ILC. Except for theoretical uncertainties that remain to be accounted for in the ratios of SUSY and SM couplings, we demonstrate that Higgs coupling measurements at the 14 TeV LHC, and particularly at the 500 GeV ILC, will be sensitive to regions of the pMSSM model space that are not accessible to direct SUSY searches. △ Less", "The 19/20-parameter p(henomenological)MSSM with either a neutralino or gravitino LSP offers a flexible framework for the study of a wide variety of R-parity conserving MSSM SUSY phenomena at the 7, 8 and 14 TeV LHC. Here we present the results of a study of SUSY signatures at these facilities obtained via a fast Monte Carlo 'replication' of the ATLAS SUSY analysis suite. In particular, we show the ranges of the sparticle masses that are either disfavored or remain viable after all of the various searches at the 7 and 8 TeV runs are combined. We then extrapolate to 14 TeV with both 300 fb^-1 and 3 ab^-1 of integrated luminosity and determine the sensitivity of a jets + MET search to the pMSSM parameter space. We find that the high-luminosity LHC performs extremely well in probing natural SUSY models. △ Less", "Simplified models have become a widely used and important tool to cover the more diverse phenomenology beyond constrained SUSY models. However, they come with a substantial number of caveats themselves, and great care needs to be taken when drawing conclusions from limits based on the simplified approach. To illustrate this issue with a concrete example, we examine the applicability of simplified model results to a series of full SUSY model points which all feature a small stau-LSP mass difference, and are compatible with electroweak and flavor precision observables as well as current LHC results. Various channels have been studied using the Snowmass Combined LHC detector implementation in the Delphes simulation package, as well as the Letter of Intent or Technical Design Report simulations of the ILD detector concept at the ILC. We investigated both the LHC and ILC capabilities for discovery, separation and identification of all parts of the spectrum. While parts of the spectrum would be discovered at the LHC, there is substantial room for further discoveries and property determination at the ILC. △ Less", "It is shown that substantially enhanced Higgs to diphoton rate induced by light staus with large left-right mixing in MSSM requires at the GUT scale non-universal gaugino masses with bino and/or wino lighter than gluino. The possibility of such enhancement is investigated in MSSM models with arbitrary gaugino masses at the GUT scale with additional restriction of top-bottom-tau Yukawa unification, as predicted by minimal SO(10) GUTs. Many patterns of gaugino masses leading to enhanced Higgs to diphoton rate and the Yukawa unification are identified. Some of these patterns can be accommodated in a well-motivated scenarios such as mirage mediation or SUSY breaking F-terms being a non-singlet of SO(10). Phenomenological implications of a scenario with non-universal gaugino masses generated by a mixture of the singlet F-term and the F-term in a 24-dimensional representation of SU(5) $\\subset$ SO(10) are studied in detail. Possible non-universalities of other soft terms generated by such F-terms are discussed. The enhancement of Higgs to diphoton rate up to 30% can be obtained in agreement with all phenomenological constraints, including vacuum metastability bounds. The lightest sbottom and pseudoscalar Higgs are within easy reach of the 14 TeV LHC. The LSP can be either bino-like or wino-like. The thermal relic abundance in the former case may be in agreement with the cosmological data thanks to efficient stau coannihilation. △ Less", "We discuss the solution to the BFKL equation in the adjoint representation at LO and NLO accuracy for the N = 4 SUSY theory. We use Monte Carlo techniques to study numerically the Gluon Green's function at LO and NLO directly written in the transverse momentum space which allows for the factorization of its infrared divergencies. Finally, we discuss the applicability of our approach to phenomenological searches for the BKP Odderon at the LHC. △ Less", "In this paper we study an SO(10) SUSY GUT with Yukawa unification for the third generation. We perform a global chi^2 analysis given to obtain the GUT boundary conditions consistent with 11 low energy observables, including the top, bottom and tau masses. We assume a universal mass, m_{16}, for squarks and sleptons and a universal gaugino mass, M_{1/2}. We then analyze the phenomenological consequences for the LHC for 15 benchmark models with fixed m_{16} = 20 TeV and with varying values of the gluino mass. The goal of the present work is to (i) evaluate the lower bound on the gluino mass in our model coming from the most recent published data of CMS and (ii) to compare this bound with similar bounds obtained by CMS using simplified models. The bottom line is that the bounds coming from the same sign di-lepton analysis are comparable for our model and the simplified model studied assuming BR(gluino -> t tbar neutralino) = 100%. However the bounds coming from the purely hadronic analyses for our model are 10 - 20% lower than obtained for the simplified models. This is due to the fact that for our models the branching ratio for the decay gluino -> g neutralino is significant. Thus there are significantly fewer b-jets. We find a lower bound on the gluino mass in our models with M_{gluino} > 1000 GeV. Finally, there is a theoretical upper bound on the gluino mass which increases with the value of m_{16}. For m_{16} <= 30 TeV, the gluino mass satisfies M_{gluino} <= 2.8 TeV at 90% CL. Thus, unless we further increase the amount of fine-tuning, we expect gluinos to be discovered at LHC 14. △ Less", "In the model based on SUSY SU(5) combined with the T' family symmetry, it is shown in Phys. Lett. B 652, 34 (2007) and Phys. Lett. B 681, 444 (2009) that fermion mass hierarchy and mixing angles can be naturally generated in both lepton and quark sectors compatible with various experimental measurements. But the predicted value for the non-zero lepton mixing angle of θ_13 \\simeq θ_c/3\\sqrt{2} contradicts the recent experimental results from Daya Bay and RENO. We propose to introduce one more singlet flavon field in the neutrino sector, and with its additional contribution, we are able to generate the large mixing angle θ_13 ~ 8^{\\circ}-10^{\\circ}. The analytical expressions of the mixing angles and neutrino masses with the additional flavon field are derived. Our numerical results show that a large region in the model parameter space is allowed for the normal hierarchy case, while a much smaller region is allowed for the inverted hierarchy case. In addition, the predicted value of the solar mixing angle is not affected by the additional singlet contribution. On the other hand, there exists a correlation between θ_13 value and θ_23 - π/4, as a result of the additional singlet contribution. We also make predictions for various other variables that can be potentially tested in the future neutrino experiments such as the Dirac CP phase, which is predicted to be in the range of δ~ (195^{\\circ}-200^{\\circ}), and the neutrinoless double beta decay matrix element, <m_ββ>. One numerical example with the minimal χ^2 fit is presented, and the model predictions are consistent with all experimental results. △ Less", "In this talk, the latest results from CMS on R-parity violating Supersymmetry are reviewed. We present results using up to 20/fb of data from the 8 TeV LHC run of 2012. Interpretations of the experimental results in terms of production of squarks, gluinos, charginos, neutralinos, and sleptons within R-parity violating susy models are presented. △ Less", "The discovery of the Higgs boson with a mass of about 125 GeV intimates us a possibility of a high-scale supersymmetry (SUSY) breaking model, where a sfermion mass scale is much higher than the electroweak scale. Although a general SUSY standard model can contribute to the low-energy flavor and/or CP-violating processes, the high-scale SUSY breaking model provides smaller signatures and therefore are less constrained, even in the presence of large flavor/CP violations of sfermions. However, a manner of gluino decay directly reflects the squark flavor structure and provides us a clue for the sfermion flavor structure. In this paper, we study the gluino decay in detail and discuss the interplay with the gluino decay and low-energy flavor and CP observation. △ Less", "We investigate the impact of direct LHC SUSY searches on the parameter space of three natural scenarios in the MSSM. In the first case the spectrum consists of light stops, sbottoms, and Higgsino-like neutralinos, while the other particles are assumed to be out of the experimental reach. In the second case we consider an additional light gluino. Finally we study a more complex spectrum comprising also light sleptons, a wino-like chargino, and a bino-like neutralino. We simulate in detail three LHC searches: stop production at ATLAS with 20.7/fb, CMS 11.7/fb inclusive search for squarks and gluinos with the variable α_T, and CMS 9.2/fb electroweak production with 3 leptons in the final state. For each point in our scans we calculate the exclusion likelihood due to the individual searches and to their statistical combination. We calculate the fine-tuning measure of the points allowed by the LHC and the implications for the Higgs mass and other phenomenological observables: Higgs signal rates, the relic density, BR(Bs --> μ^+μ^-), BR(B --> Xs γ), and the spin-independent neutralino-proton scattering cross section. We find that points with acceptable levels of fine-tuning are for the most part already excluded by the LHC and including the other constraints further reduces the overall naturalness of our scenarios. △ Less", "The International Linear Collider (ILC) has recently proven its technical maturity with the publication of a Technical Design Report, and there is a strong interest in Japan to host such a machine. We summarize key aspects of the Beyond the Standard Model physics case for the ILC in this contribution to the US High Energy Physics strategy process. On top of the strong guaranteed physics case in the detailed exploration of the recently discovered Higgs boson, the top quark and electroweak precision measurements, the ILC will offer unique opportunities which are complementary to the LHC program of the next decade. Many of these opportunities have connections to the Cosmic and Intensity Frontiers, which we comment on in detail. We illustrate the general picture with examples of how our world could turn out to be and what the ILC would contribute in these cases, with an emphasis on value-added beyond the LHC. These comprise examples from Supersymmetry including light Higgsinos, a comprehensive bottom-up coverage of NLSP-LSP combinations for slepton, squark, chargino and neutralino NLSP, a stau-coannihilation dark matter scenario and bilinear R-parity violation as explanation for neutrino masses and mixing, as well as generic WIMP searches and Little Higgs models as non-SUSY examples. △ Less", "We analyze the Minimal Supersymmetric extension of the Standard Model that we have after the discovery of the Higgs boson at the LHC, the hMSSM (habemus MSSM?), i.e. a model in which the lighter $h$ boson has a mass of approximately 125 GeV which, together with the non-observation of superparticles at the LHC, indicates that the SUSY-breaking scale $M_S$ is rather high, $M_S > 1$ TeV. We first demonstrate that the value $M_h \\approx 125$ GeV fixes the dominant radiative corrections that enter the MSSM Higgs boson masses, leading to a Higgs sector that can be described, to a good approximation, by only two free parameters. In a second step, we consider the direct supersymmetric radiative corrections and show that, to a good approximation, the phenomenology of the lighter Higgs state can be described by its mass and three couplings: those to massive gauge bosons and to top and bottom quarks. We perform a fit of these couplings using the latest LHC data on the production and decay rates of the light $h$ boson and combine it with the limits from the negative search of the heavier $H,A$ and $H^\\pm$ states, taking into account the current uncertainties. △ Less", "We re-assess the exclusion limits on the parameters describing the supersymmetric (SUSY) electroweak sector of the MSSM obtained from the search for direct chargino-neutralino production at the LHC. We start from published limits obtained in simplified models, where for the case of heavy sleptons the relevant branching ratio, BR(neu2->neu1 Z), is set to one. We show how the decay mode neu2->neu1 h, which cannot be neglected in any realistic model once kinematically allowed, substantially reduces the excluded parameter region. We analyze the dependence of the excluded regions on the phase of the gaugino soft SUSY-breaking mass parameter, M_1, on the mass of the light scalar tau, on tb as well as on the squark and slepton mass scales. Large reductions in the ranges of parameters excluded can be observed in all scenarios. The branching ratios of charginos and neutralinos are evaluated using a full NLO calculation for the complex MSSM. The size of the effects of the NLO calculation on the exclusion bounds is investigated. We furthermore assess the potential reach of the experimental analyses after collecting 100/fb at the LHC running at 13 TeV. △ Less", "When supergravity (SUGRA) is spontaneously broken, it is well known that anomaly mediation generates sparticle soft masses proportional to the gravitino mass. Recently, we showed that one-loop anomaly-mediated gaugino masses should be associated with unbroken supersymmetry (SUSY). This counterintuitive result arises because the underlying symmetry structure of (broken) SUGRA in flat space is in fact (unbroken) SUSY in anti-de Sitter (AdS) space. When quantum corrections are regulated in a way that preserves SUGRA, the underlying AdS curvature (proportional to the gravitino mass) necessarily appears in the regulated action, yielding soft masses without corresponding goldstino couplings. In this paper, we extend our analysis of anomaly mediation to sfermion soft masses. Already at tree-level we encounter a number of surprises, including the fact that zero soft masses correspond to broken (AdS) SUSY. At one-loop, we explain how anomaly mediation appears when regulating SUGRA in a way that preserves super-Weyl invariance. We find that recent claims in the literature about the non-existence of anomaly mediation were based on a Wilsonian effective action with residual gauge dependence, and the gauge-invariant 1PI effective action contains the expected anomaly-mediated spectrum. Finally, we calculate the sfermion spectrum to all orders, and use supertrace relations to derive the familiar two-loop soft masses from minimal anomaly mediation, as well as unfamiliar tree-level and one-loop goldstino couplings consistent with renormalization group invariance. △ Less", "We argue that in large classes of string compactifications with a MSSM-like structure substantial flavor violating SUSY-breaking soft terms are generically induced. We specify to the case of flavor dependent soft-terms in type IIB/F-theory SU(5) unified models, although our results can be easily extended to other settings. The Standard Model (SM) degrees of freedom reside in a local system of 7-branes wrapping a 4-fold S in the extra dimensions. It is known that in the presence of closed string 3-form fluxes SUSY-breaking terms are typically generated. We explore the generation dependence of these soft terms and find that non-universalities arise whenever the flux varies over the 4-fold S. These non-universalities are parametrically suppressed by (M_{GUT}/M_{Pl})^{1/3}. They also arise in the case of varying open string fluxes, in this case parametrically suppressed by α_{GUT}^{1/2}. For a standard unification scheme with M_{GUT} = 10^{16} GeV and α_{\\rm GUT} = 1/24 these suppressions are very mild. Although limits from the kaon mass difference Δm_K are easily obeyed for squark masses above the present LHC limits, constraints from the CP-violation parameter ε_K imply squark masses in the multi-TeV region. The constraints from BR(μ\\rightarrow eγ) turn out to be the strongest ones, with slepton masses of order ~10 TeV or heavier required to obey the experimental limits. These sfermion masses are consistent with the observed large value m_H ~ 126 GeV of the Higgs mass. We discuss under what conditions such strong limits may be relaxed allowing for SUSY particle production at LHC. △ Less", "After the discovery of a Higgs-like boson with a mass of m~125 GeV at the LHC, we can now attempt to draw conclusions about physics beyond the Standard Model. I argue that there are several hints towards new physics at intermediate scales > 10^8 GeV. I review a class of stringy models with intermediate scale SUSY which relate the observed Higgs mass to symmetries of the Higgs sector. I then discuss radiative corrections to m_h, unification, dark matter and the possibility of classically unstable UV completions in these models. △ Less", "In this paper we examine thoroughly the single (anti-)top quark production associated with a lightest neutralino at the possible CERN Large Hadron Electron Collider (LHeC). We calculate the full next-to-leading order (NLO) QCD corrections to the process including all the nonresonant diagrams and do not assume the production and decay factorization for the possible resonant top squarks in the R-parity violating minimal supersymmetric standard model with 19 unrelated parameters. We investigate numerically the effects of the relevant supersymmetry (SUSY) parameters on the cross section, and present the transverse momentum distributions of final (anti-)top quark at both the leading-order (LO) and the QCD NLO. We find that the NLO QCD corrections enhance the LO cross sections in most chosen parameter space, and the NLO QCD impacts on the transverse momentum distributions of the final (anti-)top quark might be resolvable in some cases. We conclude that even with recently known experimental constraints the on SUSY parameters, the production rate could still achieve notable value in the admissible parameter space. △ Less", "We re-evaluate prospects for supersymmetry at the proposed International Linear e^+e^- Collider (ILC) in light of the first two years of serious data taking at LHC: LHC7 with ~5 fb^{-1} of pp collisions at sqrt{s}=7 TeV and LHC8 with ~20 fb^{-1} at \\sqrt{s}=8 TeV. Strong new limits from LHC8 SUSY searches, along with the discovery of a Higgs boson with m_h~125 GeV, suggest a paradigm shift from previously popular models to ones with new and compelling signatures. After a review of the current status of supersymmetry, we present a variety of new ILC benchmark models, including: natural SUSY, radiatively-driven natural SUSY (RNS), NUHM2 with low m_A, a focus point case from mSUGRA/CMSSM, non-universal gaugino mass (NUGM) model, stau-coannihilation, Kallosh-Linde/spread SUSY model, mixed gauge-gravity mediation, normal scalar mass hierarchy (NMH), and one example with the recently discovered Higgs boson being the heavy CP-even state H. While all these models at present elude the latest LHC8 limits, they do offer intriguing case study possibilities for ILC operating at \\sqrt{s}~0.25-1 TeV. The benchmark points also present a view of the widely diverse SUSY phenomena which might still be expected in the post LHC8 era at both LHC and ILC. △ Less", "We show how general initial conditions for small field inflation can be obtained in multi-field models. This is provided by non-linear angular friction terms in the inflaton that provide a phase of non-slow-roll inflation before the slow-roll inflation phase. This in turn provides a natural mechanism to star small-field slow-roll at nearly zero velocity for arbitrary initial conditions. We also show that there is a relation between the scale of SUSY breaking sqrt (f) and the amount of non-gaussian fluctuations generated by the inflaton. In particular, we show that in the local non-gaussian shape there exists the relation sqrt (f) = 10^{13} GeV sqrt (f_NL). With current observational limits from Planck, and adopting the minimum amount of non-gaussian fluctuations allowed by single-field inflation, this provides a very tight constraint for the SUSY breaking energy scale sqrt (f) = 3-7 x 10^{13} GeV at 95% confidence. Further limits, or detection, from next year's Planck polarisation data will further tighten this constraint by a factor of two. We highlight that the key to our approach is to identify the inflaton with the scalar component of the goldstino superfield. This superfield is universal and implements the dynamics of SUSY breaking as well as superconformal breaking. △ Less", "With the 8 TeV LHC run now concluded, the first consequences of the experimental results on the supersymmetric parameter space can be drawn. On one hand, the negative direct searches place more and more stringent bounds on the mass of supersymmetric particles; on the other hand, the discovery of a 125 GeV Higgs boson points toward a quite heavy spectrum for the squarks of the third generation, at least in the minimal supersymmetric model. In this note I will briefly recap how this constitutes a problem for the naturalness of supersymmetric models, as well as the current experimental situation. Moreover, I will point out possible non minimal models in which the naturalness issue can be at least soften. △ Less", "We calculate the values and 1 sigma ranges of the running quark and lepton Yukawa couplings as well as of the quark mixing parameters at various energy scales, i.e. at M_Z, 1 TeV, 3 TeV, 10 TeV and at the GUT scale, to provide useful input for model building. Above TeV energies, we assume the minimal supersymmetric extension of the Standard Model, and include the tan(beta)-enhanced one-loop supersymmetric threshold corrections which arise when matching the SM to its SUSY extension. We calculate the GUT scale values of the running parameters as well as their 1 sigma ranges, with the supersymmetric threshold corrections included and with their effects parametrised in a simple way. △ Less", "The review of the SUSY phenomenology today is given with the emphasis on generic properties of SUSY models, SUSY searches at the LHC and in astrophysics. Due to the absence of any definite SUSY signal at accelerators and other experiments, we describe the allowed regions in the MSSM and NMSSM parameter space and discuss the possibilities of SUSY manifestation in the near future. △ Less", "Extensions of the Standard Model Higgs sector involving weak isotriplet scalars are not only benchmark candidates to reconcile observed anomalies of the recently discovered Higgs-like particle, but also exhibit a vast parameter space, for which the lightest Higgs' phenomenology turns out to be very similar to the Standard Model one. A generic prediction of this model class is the appearance of exotic doubly charged scalar particles. In this paper we adapt existing dilepton+missing energy+jets measurements in the context of SUSY searches to the dominant decay mode $H^{\\pm\\pm}\\to W^\\pm W^\\pm$ and find that the LHC already starts probing the model's parameter space. A simple modification towards signatures typical of weak boson fusion searches allows us to formulate even tighter constraints with the 7 TeV LHC data set. A corresponding analysis of this channel performed at 14 TeV center of mass energy will constrain the model over the entire parameter space and facilitate potential $H^{\\pm\\pm}\\to W^\\pm W^\\pm$ discoveries. △ Less", "Understanding small neutrino masses in type II seesaw models with TeV scale SM triplet Higgs bosons requires that its coupling with the standard model Higgs doublet H be dialed down to be order eV to KeV, which is a fine-tuning by a factor of $10^{-11}-10^{-8}$ with respect to the weak scale. We present a SUSY extension of the type II seesaw model where this dimensionful small coupling is radiatively induced, thus making its smallness natural. This model has an exotic vector-like quark doublet which contains a quark X with electric charge 5/3 and a top partner t'. We discuss in details the phenomenology of the model paying special attention to the consequences of the interactions of the the exotic heavy quarks and the scalars of the model. Implications for neutrinoless double beta decay and for the LHC experiments are discussed in detail. Remarkably, in this model both the seesaw triplet and the heavy quarks can manifest at colliders in a host of different signatures, including some that significantly differ from those of the minimal models. Depending on the choice of the hierarchy of couplings, the decay of the heavy quarks and of the seesaw triplet may be subject to bounds that can be tighter or looser than the bounds from standard LHC searches. Furthermore we point out a new short-distance contribution to neutrinoless double beta decay mediated by the simultaneous propagation of the type II triplet and exotic fermions. Remarkably this contribution to the neutrinoless double beta decay is parametrically quite independent from the scale of the generated neutrino mass. △ Less", "We examine the discovery reach of LHC14 for supersymmetry for integrated luminosity ranging from 0.3 to 3 ab^{-1}. In models with gaugino mass unification and M_1,\\ M_2<< |μ| (as for mSUGRA/CMSSM), we find a reach of LHC14 with 3 ab^{-1} for gluino pair production extends to m_{\\tg} 2.3 TeV while the reach via \\tw_1\\tz_2 \\to W h +ETmiss extends to m_{\\tg}\\sim 2.6 TeV. △ Less", "We describe a region of the No-Scale F-SU(5) supersymmetric model with TeV-scale vector-like matter multiplets that is potentially opaque to LHC observations based upon top quark reconstruction. Possessing a 100% on-shell branching fraction for gluino to light stop decays, the gluino-light stop mass splitting in F-SU(5) lies very close to the top quark rest mass in the region 810 (650) <~ M(gluino) (M(light stop)) <~ 1170 (975) GeV. For unboosted gluino pair-production, this could render two soft top quarks in the dominant 4-top signature, greatly reducing the likelihood for discrimination from the combinatoric background. We therefore suggest that caution is warranted when gluino exclusion bounds on models possessing a similar spectral character (gluino heavier than the light stop but lighter than all other squarks) using multijet SUSY search tactics. Alternate search methods are highlighted, including those based upon same sign dileptons and multiple heavy flavor tags, which are more sensitive to this delicate kinematic \"blind spot\" crease. △ Less", "Positron excess upto energies $\\sim$350 GeV has been observed by AMS-02 result and it is consistent with the positron excess observed by PAMELA upto 100 GeV. There is no observed excess of anti-protons over the expected CR background. We propose a leptophilic dark matter with an $U(1)_{L_μ-L_τ}$ gauge extension of MSSM. The dark matter is an admixture of the $L_μ-L_τ$ gaugino and fermionic partners of the extra $SU(2)$ singlet Higgs boson, which break the $L_μ-L_τ$ symmetry. We construct the SM$\\otimes U(1)_{ L_μ-L_τ}$ SUSY model which provides the correct relic density of dark matter and is consistent with constrain on $Z'$ from LHC. The large dark matter annihilation cross-section into $μ^{+}μ^{-}$ and $τ^{+}τ^{-}$, needed to explain PAMELA and AMS-02 is achieved by Breit-Wigner resonance. △ Less", "We perform numerical fits of Grand Unified Models based on SO(10), using various combinations of 10-, 120- and 126-dimensional Higgs representations. Both the supersymmetric and non-supersymmetric versions are fitted, as well as both possible neutrino mass orderings. In contrast to most previous works, we perform the fits at the weak scale, i.e. we use RG evolution from the GUT scale, at which the GUT-relations between the various Yukawa coupling matrices hold, down to the weak scale. In addition, the right-handed neutrinos of the seesaw mechanism are integrated out one by one in the RG running. Other new features are the inclusion of recent results on the reactor neutrino mixing angle and the Higgs mass (in the non-SUSY case). As expected from vacuum stability considerations, the low Higgs mass and the large top-quark Yukawa coupling cause some pressure on the fits. A lower top-quark mass, as sometimes argued to be the result of a more consistent extraction from experimental results, can relieve this pressure and improve the fits. We give predictions for neutrino masses, including the effective one for neutrinoless double beta decay, as well as the atmospheric neutrino mixing angle and the leptonic CP phase for neutrino oscillations. △ Less", "In this contribution we outline the correlation between intergenerational slepton mass splittings and low energy lepton flavour violation in supersymmetric type-I and type-III seesaws, and illustrate how the combination of these two sets of observables could strengthen or disfavour a high-scale seesaw as the explanation of neutrino masses and mixings. This contribution summarises part of the analysis presented in arXiv:1007.4833 and arXiv:1104.3962. △ Less", "Supersymmetric models with low electroweak fine-tuning contain light higgsinos with mass not too far from m_h\\simeq 125 GeV, while other sparticles can be much heavier. In the R-parity conserving MSSM, the lightest neutralino is then a higgsino-like WIMP (albeit with non-negligible gaugino components), with thermal relic density well below measured values. This leaves room for axions (or other, perhaps not as well motivated, stable particles) to function as co-dark matter particles. The local WIMP abundance is then expected to be below standard estimates, and direct and indirect detection rates must be accordingly rescaled. We calculate rescaled direct and indirect higgsino-like WIMP detection rates in SUSY models that fulfil the electroweak naturalness condition. In spite of the rescaling, we find that ton-scale noble liquid detectors can probe the entire higgsino-like WIMP parameter space, so that these experiments should either discover WIMPs or exclude the concept of electroweak naturalness in R-parity conserving natural SUSY models. Prospects for spin-dependent or indirect detection are more limited due in part to the rescaling effect. △ Less", "There is a possible γ-ray signal at 130 GeV coming from the Galactic Center as seen by Fermi-LAT experiment. We give a SUSY dark matter model to explain this γ-ray feature in NMSSM. We show that in NMSSM, one can have a benchmark set in which the γ-ray signal arises from final state γ's in the $χχ\\to f \\bar f γ$ annihilation of a 130 GeV bino dark matter requiring a boost factor of ~590 to fit the γ-ray signal. In addition, this benchmark set also gives the correct relic density, lightest Higgs mass of 125 GeV and is consistent with constraints on SUSY from LHC. This dark matter model evades the XENON100 constraint but is testable in a future XENON1T experiment. △ Less", "In the ``non-decoupling'' region of the Higgs sector in MSSM, the heavier CP-even Higgs boson (H^0) is Standard-Model-like and close to the charged Higgs bosons (H^\\pm) in mass, while other neutral Higgs bosons (h^0,A^0) are lighter and near the Z mass. This scenario is consistent with the current Higgs search limits, although the improved sensitivity for a light charged Higgs boson search t -> H^+ b may result in certain degree of tension. We demonstrate that it can pass the stringent flavor constraints, provided there are other light SUSY particles to contribute in the loop induced processes. In turn, the non-decoupling Higgs sector implies the existence of light (left-handed) stop, sbottom and Wino-like gauginos, with mass all below 250 GeV. These light super-partners can still escape the current SUSY searches at the LHC. Dedicated searches for soft decay products should be devised for the LHC experiments to improve the searching sensitivity. The ILC would be able to cover the full spectrum region. The solutions for the viable SUSY parameters result from subtle cancellations and are often missed by the generic multiple dimensional scans, highlighting the importance of theoretical guidance in search for such special cases. △ Less", "Imposing electroweak scale naturalness constraints (low Δ_{EW}) on SUSY models leads to mass spectra characterized by light higgsinos ~100-300 GeV, highly mixed top-squarks and gluinos at the 1-5 TeV scale and allows for m_h ~125 GeV. First and second generation squarks can easily live at the 5-20 TeV scale, thus providing at least a partial solution to the SUSY flavor/CP problems. For such models at the LHC, gluino pair production is followed by cascade decays to t- and b-quark rich final states along with multileptons. The reach of LHC14 with 300 fb^{-1} is computed to be around m_{\\tg} 1.8 TeV. However, the small magnitude of the μ-parameter-- a necessary condition for naturalness-- leads to a unique hadronically quite same-sign diboson (W^\\pm W^\\pm) signature from wino pair production. In low Δ_{EW} models with unified gaugino masses, this signature yields a somewhat higher reach up to m_{\\tg} 2.1 TeV. The smallness of |μ| implies that the ILC should be a higgsino factory in addition to a Higgs factory, and a complete search for SUSY naturalness seems possible for \\sqrt{s} 600 GeV. Since a thermal under-abundance of higgsino-like WIMP dark matter (DM) is expected, there is ample room for an axion DM contribution. A thorough search for higgsino-like WIMPs can be made by next generation WIMP detectors, such as those with ton-scale noble liquid targets. △ Less", "This doctoral thesis addresses aspects of Supersymmetry (Susy) phenomenology. In addition to previously published work, it contains introductions to the following topics: from classical mechanics to quantum field theory for the more casual reader, electroweak naturalness, the Higgs as a pseudo-Nambu-Goldstone boson, the MSSM and NMSSM, simple and less simple models of gauge-mediated Susy breaking (GMSB), collider searches for Susy and other new theories, transverse mass observables with missing energy, and Brazil-band plots. The previously published work is as follows. The optimally natural Higgs-stop sector in the MSSM in light of the 2012 discovery of a Higgs boson is derived, namely that of almost maximal mixing, with the scalar top partners almost as light as can be. The discovery is also interpreted numerically in the NMSSM, with greater emphasis placed on the visibility of the Higgs boson at the observed mass, i.e. on signal strengths. I investigate the role played by the mediation scale of GMSB: this is found to be as a control of the extent to which Yukawa couplings de-tune flavour-blind relations set by gauge couplings. Finally, issues relating to the discovery or exclusion of Susy at colliders are discussed. Bounds are derived for the masses of new particles from LHC searches for excesses of jets and missing energy without leptons, and compared to constraints arising from Higgs boson searches, for models of GMSB and the Constrained Minimal Supersymmetric Standard Model. I present a novel search strategy for new physics signatures with two neutral, stable particles, when such particles are produced by boosted decays. (Susy motivations include models with light gravitinos, pseudo-goldstinos, singlinos or new photinos.) The method is shown to produce sharp mass peaks that enhance the visibility of the signal, with mass reconstruction to 5% from O(100) events. △ Less", "If one simultaneously invokes the SUSY solution to the gauge hierarchy problem and the PQ solution to the strong CP problem, then one might expect mixed axion/neutralino dark matter (DM), i.e. two dark matter particles. In this case, dark matter production involves oscillation production of axions, thermal and non-thermal neutralino production and thermal and non-thermal production of axinos and saxions. The latter particles may feed additional neutralinos into the cosmic soup, or dilute all relics via additional entropy production, or feed dark radiation into the cosmos. Depending on the SUSY and PQ model, the PQ scale can easily exist from 10^9-10^{16} GeV. Axions may lie well beyond the range currently being probed by experiment. In the case of relic WIMPs, theoretical predictions must be rescaled for the possibility that WIMPs only comprise a fraction of the local DM abundance. △ Less", "In the framework of a gauge mediated quiver-like model, the standard model flavor texture can be naturally generated. The model - like the MSSM - has furthermore a region in parameter space where the lightest Higgs mass is fed by heavy stop loops, which in turn sets the average squark mass scale near 10-20 TeV. We perform a careful flavor analysis to check whether this type of mild-split SUSY passes all flavor constraints as easily as envisioned in the original type of split SUSY. Interestingly, it turns out to be on the border of several constraints, in particular, the branching ratio of mu -> e gamma and, if order one complex phases are assumed, also epsilon_K neutron and electron EDM. Furthermore, we consider unification as well as dark matter candidates, especially the gravitino. Finally, we provide a closed-form formula for the soft masses of matter in arbitrary representations of any of the gauge groups in a generic quiver-like model with a general messenger sector. △ Less", "We show that the electroweak fine-tuning parameter Δ_{\\rm EW} derived from the well-known electroweak symmetry breaking condition written in terms of weak scale parameters leads to {\\it a bound on fine-tuning in the MSSM} and explain its utility for phenomenological analyses. We argue that a small magnitude of the mu parameter, and the concomitant presence of light higgsinos, is the most basic consequence of naturalness in SUSY models, and list the resulting implications of this for experiments at the LHC and at future e^+e^- colliders. △ Less", "We derive the classical analog of the extended phase space quantum mechanics of the particle with odd degrees of freedom which gives rise to (N=2)-realization of supersymmetry (SUSY) algebra. By means of an iterative procedure, we find the approximate groundstate solutions to the extended Schrödinger-like equation and use these solutions further to calculate the parameters which measure the breaking of extended SUSY such as the groundstate energy. Consequently, we calculate a more practical measure for the SUSY breaking which is the expectation value of an auxiliary field. We analyze non-perturbative mechanism for extended phase space SUSY breaking in the instanton picture and show that this has resulted from tunneling between the classical vacua of the theory. Particular attention is given to the algebraic properties of shape invariance and spectrum generating algebra. △ Less", "We explore the MSSM with 9 free parameters (p9MSSM) that have been selected as a minimum set that allows an investigation of neutralino dark matter and collider signatures while maintaining consistency with several constraints. These include measurement of the dark matter relic density from PLANCK, main properties of the discovered Higgs boson, LHC direct SUSY searches, recent evidence for a Standard Model-like BR(Bs -> μ+ μ-), and the measurement of δ(g-2), plus a number of other electroweak and flavor physics constraints. We perform a simulation of two LHC direct SUSY searches at sqrt(s)=8 TeV: the CMS inclusive α_T search for squarks and gluinos and the CMS electroweak production search with 3l+E_T^miss in the final state. We use the latter to identify the regions of the parameter space, consistent at 2σ with δ(g-2), that are not excluded by the direct limits from the electroweak production. We find that they correspond to a neutralino mass in the window 200 GeV<m_χ<500 GeV. We also implement the likelihood for the XENON100 exclusion bound, in which we consider for the first time the impact of a recent determination of the Σ_{πN} term from CHAOS data, Σ_{πN}=43\\pm12 MeV. We show that in light of this measurement, the present statistical impact of the XENON100 bound is greatly reduced, although future sensitivities of the LUX and XENON1T experiments will have decisive impact on the mixed bino/higgsino composition of the neutralino. We point out some tension between the constraints from δ(g-2) and XENON100. Finally, we present prospects for various indirect searches of dark matter, namely γ-ray fluxes from dSphs and the Galactic Center at Fermi-LAT, and the positron flux at AMS02. We also show the 5-year sensitivity on the spin-dependent neutralino-proton cross section due to neutrino fluxes from the Sun at IceCube. △ Less", "We study the fine tuning associated to a `Natural Supersymmetry' spectrum with stops, after RG running, significantly lighter than the first two generation sfermions and the gluino. In particular, we emphasise that this tuning should be measured with respect to the parameters taken to be independent at the assumed UV boundary of the renormalisation group flow, and improve the accuracy of previous approximate expressions. It is found that, if running begins at $10^{16}~\\rm{GeV}$ $\\left(10^5~\\rm{GeV}\\right)$, decreasing the UV stop mass below $0.75$ $\\left(0.4\\right)$ of the weak scale Majorana gluino mass does not improve the overall fine tuning of the theory. In contrast, it is possible to raise the first two generation sfermion masses out of LHC reach without introducing additional tuning. After running, regions of parameter space favoured by naturalness and consistent with LHC bounds typically have IR stop masses of order 1.5 TeV (0.75 TeV), and fine tuning of at least 400 (50) for high (low) scale mediation. We also study the fine tuning of theories with Dirac gluinos. These allow for substantial separation of the gluino and sfermion masses and, regardless of the scale of mediation, lead to relatively low fine tuning of order 50. Hence viable models can still favour light stops, but this requires extra structure beyond the MSSM field content. △ Less", "We propose a U(1)^\\prime mediated supersymmetry (SUSY) breaking, in which U(1)^\\prime is identified with U(1)_{B_1+B_2-2L_1}. The U(1)_{B_1+B_2-2L_1} gauge symmetry, which is anomaly-free with the field contents of the minimal supersymmetric standard model, assigns \\pm 1/3 charges to the first and second generations of the quarks, and \\mp 2 to the first generation of the leptons. As a result, the first two generations of squarks acquire masses of about 7 TeV, and the first generation of the sleptons do those of 40 TeV, respectively, in the presence of one or three pairs of extra vector-like matter {{\\bf 5},\\bar{\\bf 5}}. Non-observation on extra colored particles below 1 TeV at the large hadron collider, and also the flavor violations such as μ^-\\rightarrow e^-γare explained. By virtue of such a gauge symmetry, proton stability can be protected. The other squarks and sleptons as well as the gauginos can obtain masses of order 10^{2-3} GeV through the conventional gravity or gauge mediated SUSY breaking mechanism. The relatively light smuon/sneutrino and the neutralino/chargino could be responsible for the (g-2)_μdeviated from the standard model prediction. The stop mass of \\sim 500 GeV relieves the fine-tuning problem in the Higgs sector. Two-loop effects by the relatively heavy sfermions can protect the smallness of the stop mass from the radiative correction by the heavy gluino (\\gtrsim 1 TeV). Extra vector-like matter can enhance the radiative corrections to the Higgs mass up to 126 GeV, and induce the desired mixing among the chiral fermions after U(1)_{B_1+B_2-2L_1} breaking. △ Less", "We revisit the implications of naturalness and gauge unification in the MSSM. We find that precision unification of the couplings in connection with a small mu parameter requires a highly compressed gaugino pattern as it is realized in mirage mediation. Due to the small mass difference between gluino and LSP, collider limits on the gluino mass are drastically relaxed. Without further assumptions, the relic density of the LSP is very close to the observed dark matter density due to coannihilation effects. △ Less", "Motivated by the recent discovery of the Higgs boson at m_h = 126 GeV and also by the non-observation of superparticles at the LHC, high-scale SUSY, where the superparticles are as heavy as O(10) TeV, has been recently proposed. We study lepton-flavor violations (LFVs) in the high-scale SUSY with right-handed neutrinos. Even if the slepton masses are of O(10) TeV, the renormalization group (RG) effects on the slepton mass-squared matrix may induce large enough LFVs which are within the reach of future LFV experiments. We also discuss the implication of the right-handed neutrinos on the electroweak symmetry breaking in such a model, and show that the parameter region with the successful electroweak symmetry breaking is enlarged by the RG effects due to the right-handed neutrinos. △ Less", "The fate of R-parity in supersymmetric theories is discussed in detail. We make a strong case for R-parity violation showing that the simplest theories based on the local B-L symmetry predict the spontaneous breaking of R-parity at the SUSY scale. The possible implications for the searches at the Large Hadron Collider are discussed. △ Less", "The on-shell renormalization scheme for the electroweak theory is well studied in the standard model(SM), but a consistent on-shell renormalization scheme for the minimal supersymmetric standard model(MSSM) is still unknown. In MSSM, we study the on-shell scheme for three vertexes$Z\\bar{l^I}l^I, W^+\\bar{ν^I}l^I $ and $\\tilde{L}^*_i\\bar{χ^0_α}l^I$ with virtual SUSY particles (chargino, sneutrino, neutralino and slepton) at one-loop order. Instead of amplitude of a single triangle diagram, the sum of amplitude of triangle diagrams belonging to one suit can be renormalized in the on-shell scheme. One suit points out that the internal virtual particles are consistent. Zero-momentum scheme is also used for the renormalization. The two schemes can make the renormalized results decoupled. In MSSM, some special characters of the on-shell scheme are shown here. This work is propitious to complete the on-shell renormalization scheme in MSSM. △ Less", "We present the basic features of emergent SUSY gauge theories where an emergence of gauge bosons as massless vector Nambu-Goldstone modes is triggered by the spontaneously broken supersymmetry rather than the physically manifested Lorentz violation. We start considering the supersymmetric QED model extended by an arbitrary polynomial potential of massive vector superfield that induces the spontaneous SUSY violation in the visible sector. As a consequence, a massless photon appears as a companion of a massless photino emerging as a goldstino in the tree approximation, and remains massless due to the simultaneously generated special gauge invariance. This invariance is only restricted by the supplemented vector field constraint invariant under supergauge transformations. Meanwhile, photino being mixed with another goldstino appearing from a spontaneous SUSY violation in the hidden sector largely turns into the light pseudo-goldstino. Such pseudo-goldstonic photinos considered in an extended supersymmetric Standard Model framework are of a special observational interest that, apart from some indication of the QED emergence nature, may appreciably extend the scope of SUSY breaking physics being actively studied in recent years. △ Less", "We discuss both MSSM and NMSSM scenarios in which the lightest Higgs boson with $m_h=98$~GeV is consistent with the small excess ($\\sim 2.3 σ$) observed at the LEP in $e^+ e^-\\rightarrow Zh$, with $h \\rightarrow b {\\bar b}$ process and the heavier Higgs boson of mass close to 125~GeV as the observed candidate of the SM Higgs like particle at the LHC. We show the allowed regions in the non-decoupling Higgs zone of MSSM parameter space which are consistent with several low energy constraints coming from heavy flavour physics, latest experimental data on Higgs signals and lower limit on superparticle masses from 7~TeV and 8~TeV LHC run. We also implement the constraints from the relic density of the cold dark matter as obtained from the recent PLANCK data. Additionally, we discuss the possibility of observing the light Higgs boson of mass 98~GeV at the 14~TeV LHC run via $pp \\rightarrow V h$, with $h \\rightarrow b \\bar b$ using the technique of jet substructure. Our analysis shows that at 14~TeV LHC run with 300 ${\\rm fb}^{-1}$ luminosity the signal efficiency of such a light Higgs boson is at most 2.5$σ$. Finally, we make a comment on the prospect of proposed $e^+ e^-$ ILC to discover/exclude this light Higgs boson. △ Less", "We present a non-supersymmetric theory with a naturally light dilaton. It is based on a 5D holographic description of a conformal theory perturbed by a close-to-marginal operator of dimension 4-epsilon, which develops a condensate. As long as the dimension of the perturbing operator remains very close to marginal (even for large couplings) a stable minimum at hierarchically small scales is achieved, where the dilaton mass squared is suppressed by epsilon. At the same time the cosmological constant in this sector is also suppressed by epsilon, and thus parametrically smaller than in a broken SUSY theory. As a byproduct we also present an exact solution to the scalar-gravity system that can be interpreted as a new holographic realization of spontaneously broken conformal symmetry. Even though this metric deviates substantially from AdS space in the deep IR it still describes a non-linearly realized exactly conformal theory. We also display the effective potential for the dilaton for arbitrary holographic backgrounds. △ Less", "A selection of recent searches for Supersymmetry conducted by the ATLAS and CMS collaborations is presented, summarizing the relevant results for inclusive squark and gluino production at the LHC. No indication for the existence of Supersymmetry in terms of an excess above the Standard Model background is seen by any analysis, therefore limits are reported on parameters of the various models used to interpret the findings. △ Less", "It is shown that in the next-to-leading approximation of N=4 SUSY the BFKL equation for two-gluon composite states in the adjoint representation of the gauge group can be reduced to a form which is invariant under Moebius transformation in the momentum space. The corresponding similarity transformation of its integral kernel is constructed in an explicit way. △ Less", "The supersymmetric grand unified theory with the Hosotani mechanism predicts the existence of adjoint chiral supermultiplets at the SUSY breaking scale. In particular, the SU(2) triplet and the singlet chiral superfields affect the Higgs sector. We investigate the contributions from these adjoint chiral multiplets to the masses of the Higgs sector particles and their couplings to the standard model particles. We show that the predicted values of the Higgs sector parameters deviate from the standard model and the minimal supersymmetric standard model by O(1)% - O(10)%. △ Less", "We show that the gauge mediation models with vector-like matters can explain the Higgs boson mass of 126 GeV without large soft scalar masses nor a large left-right mixing of the stops. The scenario has interesting features: the existence of the light non-colored SUSY particles accessible at the LHC and ILC, the explanation of the muon g-2 and the possibility of the enhanced di-photon decay rate of the Higgs boson. △ Less", "We take stock of the No-Scale F-SU(5) model's experimental status and prospects in the light of results from LHC, Planck, and XENON100. Given that no conclusive evidence for light Supersymmetry (SUSY) has emerged from the 7, 8 TeV collider searches, the present work is focused on exploring and clarifying the precise nature of the high-mass cutoff enforced on this model at the point where the stau and neutralino mass degeneracy becomes so tight that cold dark matter relic density observations cannot be satisfied. This hard upper boundary on the model's mass scale constitutes a top-down theoretical mandate for a comparatively light (and testable) SUSY spectrum which does not excessively stress natural resolution of the gauge hierarchy problem. The overlap between the resulting model boundaries and the expected sensitivities of the future 14 TeV LHC and XENON 1-Ton direct detection SUSY / dark matter experiments is described. △ Less", "The supersymmetric particles (sparticles) belonging exclusively to the electroweak sector of the minimal supersymmetric standard model (MSSM) may hold the key to the observed dark matter relic density in the universe even if all strongly interacting sparticles are very heavy. The importance of the light EW sparticles in DM physics and in producing spectacular collider signals is emphasized. It is shown that even the preliminary data on the direct searches of these sparticles at the LHC, significantly constrain the parameter space of the MSSM compatible with the observed relic density and provide useful hints about the future search prospects. If in addition to the electroweak sparticles the gluinos are also within the reach of the LHC experiments, then the gluino mass limits in the light slepton scenario obtained via the canonical jets + $\\met$ channel may be relaxed by as much as 25 $%$ compared to the existing limits. But the corresponding same sign dilepton (SSD) + jets + $\\met$ signal will yield enhanced limits competitive with the strongest limits currently available. This is illustrated with the help of benchmark scenarios at the generator level using PYTHIA. If the gluinos are just beyond the current reach of the LHC, then the generic n-lepton + m-jets + missing energy signal may discriminate between different DM producing mechanisms by comparing the signals corresponding to different values of n. This is illustrated by simulating the signals for n = 0 and n = 2 (the SSD signal). △ Less", "Under the minimal SUSY standard model (MSSM), the discrepancy in the muon g-2 suggests the SUSY particles are of order 100 GeV, which is also supported by discussions on the little hierarchy problem. However, the LHC experiments have found no scalar-quarks or gluinos in such mass range, and moreover, the Higgs boson mass of 126 GeV requires, within the MSSM framework, the scalar-top mass of order 1-10 TeV. This current status forces us to abandon the simplest supersymmetry-breaking frameworks of the CMSSM and the GMSB scenarios. The V-MSSM is investigated in this dissertation, which is proposed as an extension of the MSSM with a (10 + 10bar) pair of the SU(5) decuplets. In the framework the Higgs mass is increased by effect from the extra matters, and thus the 126 GeV is achieved with the scalar-top having a lighter mass. This fact resurrects the CMSSM and the GMSB scenarios. This dissertation examines the GMSB scenario under the V-MSSM; it is called V-GMSB scenario. It is shown that the V-GMSB has a potential to realize the 126 GeV mass of the Higgs boson with holding the explanation of the muon magnetic moment discrepancy, if the masses of the extra quarks are approximately less than 1.2 TeV. Constraints on the V-GMSB from the LHC experiments are discussed then; it is concluded that the gluino mass must be approximately heavier than 1.1 TeV, and that the extra quarks be heavier than 300-650 GeV depending on the decay branches of them. LHC prospects are briefly discussed. As the extra quarks are expected to be approximately less than 1.2 TeV, searches for the particles are of great interest at the 14 TeV LHC; constraints from the supersymmetry search, especially on the gluino mass, are expected to be much improved there. Therefore, it is expected that the fate of the V-GMSB is adjudicated at the court of the 14 TeV LHC. △ Less", "We prove an asymptotic structure theorem for glueball and meson propagators of any spin in large-N QCD and in n=1 SUSY QCD with massless quarks, that determines asymptotically the residues of the poles of the propagators in terms of their anomalous dimensions and of the spectral density of the masses. The asymptotic theorem follows by the severe constraints on the propagators in large-N QCD with massless quarks, or in any large-N confining asymptotically-free gauge theory massless in perturbation theory, that arise by perturbation theory in conjunction with the renormalization group and by the OPE on the ultraviolet side. The asymptotic theorem is inspired by a recently proposed Topological Field Theory (TFT) underlying large-N pure YM, that computes sums of the scalar and of the pseudoscalar correlators satisfying the asymptotic theorem and that implies for the large-N joint scalar and pseudoscalar glueball spectrum exact linearity in the masses squared. On the infrared side we test the prediction of the exact linearity in the TFT by Meyer-Teper lattice numerical computation of the masses of the low-lying glueballs in SU(8) YM, finding accurate agreement. Besides, we employ the aforementioned ultraviolet and infrared constraints in order to compare critically the scalar or pseudoscalar glueball propagators computed in the framework of the AdS String/large-N Gauge Theory correspondence with those of the TFT underlying large-N YM. We find that only the TFT satisfies the ultraviolet and infrared constraints. △ Less", "Supersymmetric (SUSY) models with R-parity generically predict sparticle decays with invisible neutralinos, which yield distinctive missing energy events at colliders. Since most LHC searches are designed with this expectation, the putative bounds on sparticle masses become considerably weaker if R-parity is violated so that squarks and gluinos decay to jets with large QCD backgrounds. Here we introduce a scenario in which baryonic R-parity violation (RPV) arises effectively from soft SUSY-breaking interactions, but leptonic RPV remains accidentally forbidden to evade constraints from proton decay and FCNCs. The model features a global R-symmetry that initially forbids RPV interactions, a hidden R-breaking sector, and a heavy mediator that communicates this breaking to the visible sector. After R-symmetry breaking, the mediator is integrated out and an effective RPV A-term arises at tree level; RPV couplings between quarks and squarks arise only at loop level and receive additional suppression. Although this mediator must be heavy compared to soft masses, the model introduces no new hierarchy since viable RPV can arise when the mediator mass is near the SUSY breaking scale. In generic regions of parameter space, a light thermally-produced gravitino is stable and can be a viable dark matter candidate. △ Less", "Recently, two measures of electroweak finetuning (EWFT) have been introduced for SUSY models: Δ_{EW} compares the Z mass to each separate weak scale contribution to m_Z while Δ_{HS} compares the Z mass to high scale input parameters and their consequent renormalizaton group evolution (1/Δis the % of fine tuning). While the paradigm mSUGRA/CMSSM model has been shown to be highly finetuned under both parameters (Δ_{EW}> 10^2 and Δ_{HS}> 10^3), the two-parameter non-universal Higgs model (NUHM2) in the context of radiatively-driven natural SUSY (RNS) enjoys Δ_{EW} as low as 10, while Δ_{HS} remains > 10^3. We investigate finetuning in the 19-free-parameter SUGRA model (SUGRA19). We find that with 19 free parameters, the lowest Δ_{EW} points are comparable to what can be achieved in NUHM2 with just 6 free parameters. However, in SUGRA19, Δ_{HS} can now also reach as low as 5-10. The conditions which lead to low Δ_{HS} include m_{H_u} m_Z at the high scale, with non-universal gaugino masses M_{1,2}>> M_3 also at m_{GUT}. The low Δ_{HS} models are severely constrained by b\\to sγbranching fraction. In both cases of low Δ_{EW} and Δ_{HS}, the superpotential μparameter should be \\sim 100-300 GeV. While SUSY models with low EWFT may or may not be discoverable at LHC, the predicted light higgsinos must show up at a linear e^+e^- collider with \\sqrt{s}> 2|μ|. △ Less", "We point out that perturbation theory in conjunction with the renormalization group (RG) puts a severe constraint on the structure of the large-N non-perturbative glueball propagators in SU(N) pure YM, in QCD and in n=1 SUSY QCD with massless quarks, or in any confining asymptotically-free gauge theory massless in perturbation theory. For the scalar and pseudoscalar glueball propagators in pure YM and QCD with massless quarks we check in detail the RG-improved estimate to the order of the leading and next-to-leading logarithms by means of a remarkable three-loop computation by Chetyrkin et al. We investigate as to whether the aforementioned constraint is satisfied by any of the scalar or pseudoscalar glueball propagators computed in the framework of the AdS String/ large-N Gauge Theory correspondence and of a recent proposal based on a Topological Field Theory underlying the large-N limit of YM. We find that none of the proposals for the scalar or the pseudoscalar glueball propagators based on the AdS String/ large-N Gauge Theory correspondence satisfies the constraint, actually as expected, since the gravity side of the correspondence is in fact strongly coupled in the ultraviolet. On the contrary, the Topological Field Theory satisfies the constraint that follows by the asymptotic freedom. △ Less", "We propose a realistic 5D orbifold GUT model that can reduce to natural (or radiative natural) supersymmetry as the low energy effective theory. Supersymmetry as well as gauge symmetry are broken by the twist boundary conditions. We find that it is non-trivial to introduce other flavor symmetry other than the $SU(2)_R$ R-symmetry. We ameliorate the tension between the small number of free parameters and the successful electroweak symmetry breaking by introducing non-minimal Kahler potentials. A large trilinear term $A_t$, which is necessary to give a 125 GeV Higgs boson, is naturally provided in our scenario. A scan under current experimental constraints shows that our model can realize natural (or radiative natural) supersymmetry. Only radiative natural supersymmetry can naturally lead to 125 GeV higgs. Additional dark matter species other than neutralino(like axion) are needed to provide enough relic density. Relatively large stop masses are necessary to give realistic higg mass in most of the parameter spaces. △ Less", "SUSY searches at the LHC as well as the 126 GeV Higgs boson indicate that superparticles, especially squarks and gluinos, are not so light as we expected. It is important to investigate SUSY searches which do not rely on the colored superparticles. As a clue for the investigation, we focus on the muon g-2 anomaly, which can be explained by the SUSY contributions if some of neutralinos, charginos, and sleptons are as light as of order 100 GeV. We propose the muon-(g-2)-motivated MSSM as a benchmark model, where squarks are decoupled but the superparticles corresponding to the muon g-2 are light enough to explain the anomaly. We also interpret the up-to-date results of LHC SUSY searches, and obtain experimental constraints on the model. We show searches for direct production of charginos and neutralinos work very well against the scenario, but several regions are not only remain uncovered but even found challenging to be searched for at the LHC. It is ascertained that, in order to draw out latent potential of the LHC, strategies to attack these regions should be developed. △ Less", "We consider an extended Higgs sector that arises as a low-energy description of a strongly-coupled SUSY gauge theory. This model predicts the presence of extra superfields that couple with the Higgs superfields through large coupling constants. Large radiative corrections involving the extra fields can realize strongly first order electroweak phase transition, which is a vital requirement for electroweak baryogenesis scenario. At the same time, the large radiative corrections lead to significant deviations in the Higgs boson triple coupling and Higgs-to-diphoton branching ratio, which are testable at the ILC. △ Less", "Some years ago the Nicolai map, viewed as a change of variables from the gauge connection in a fixed gauge to the anti-selfdual part of the curvature, has been extended by the first named author to pure YM from its original definition in N=1 SUSY YM. We study here the perturbative 1PI effective action in the anti-selfdual variables of any gauge theory, in particular pure YM, QCD and N=1 SUSY YM. We prove that the one-loop 1PI effective action of a gauge theory mapped to the anti-selfdual variables in any gauge is identical to the one of the original theory. This is due to the conspiracy between the Jacobian of the change to the anti-selfdual variables and an extra functional determinant that arises from the non-linearity of the coupling of the anti-selfdual curvature to an external source in the Legendre transform that defines the 1PI effective action. Hence we establish the one-loop perturbative equivalence of the mapped and original theories on the basis of the identity of the one-loop 1PI effective actions. Besides, we argue that the identity of the perturbative 1PI effective actions extends order by order in perturbation theory. △ Less", "We consider Randall-Sundrum set up (RS) to be a theory of flavour, as an alternative to Froggatt-Nielsen models instead of as a solution to the hierarchy problem. We consider a modified RS framework between the Planck scale and the GUT scale. This also alleviates constraints from flavour physics. Fermion masses and mixing angles are fit at the GUT scale. The ranges of the bulk mass parameters are determined using a $χ^2$ fit taking in to consideration the variation in $\\mathcal{O}(1)$ parameters. In the hadronic sector, the heavy top quark requires large bulk mass parameters localising the right handed top quark close to the IR brane. Two cases of neutrino masses are considered (a) Planck scale lepton number violation and (b) Dirac neutrino masses. Contrary to the case of weak scale RS models, both these cases give reasonable fits to the data, with the Planck scale lepton number violation fitting slightly better compared to the Dirac case. In the Supersymmetric version, the fits are not significantly different except for the variation in $\\tanβ$. If the Higgs superfield and the SUSY breaking spurion are localized on the same brane then the structure of the sfermion masses are determined by the profiles of the zero modes of the hypermultiplets in the bulk. Trilinear terms have the same structure as the Yukawa matrices. The resultant squark spectrum is around $\\sim 2-3 \\text{TeV}$ required by the light Higgs mass to be around 125 GeV and to satisfy the flavour violating constraints. △ Less", "The natural supersymmetry (SUSY) requires that stop, sbottom, and gluino be around one TeV or lighter. By using the direct SUSY search bounds from both ATLAS and CMS Collaborations, we examine the constraints on the natural SUSY in the Next to Minimal Supersymmetric Standard Model (NMSSM). We consider two cases of interpretations for the Higgs boson data: (1) the Standard Model (SM) like Higgs boson is the lightest CP-even Higgs boson; (2) the SM like Higgs boson is the second lightest CP-even Higgs boson. We find that the direct SUSY searches at the LHC impose a strong constraint on the light gluino scenarios, and in both cases the gluino can not be lighter than 1.1 TeV with sbottom mass up to 600 GeV and stop mass up to 550 GeV. △ Less", "We study the phenomenology of a light stop NLSP in the presence of large mixing with either the first or the second generation. R-symmetric models provide a prime setting for this scenario, but our discussion also applies to the MSSM when a significant amount of mixing can be accommodated. In our framework the dominant stop decay is through the flavor violating mode into a light jet and the LSP in an extended region of parameter space. There are currently no limits from ATLAS and CMS in this region. We emulate shape-based hadronic SUSY searches for this topology, and find that they have potential sensitivity. If the extension of these analyses to this region is robust, we find that these searches can set strong exclusion limits on light stops. If not, then the flavor violating decay mode is challenging and may represent a blind spot in stop searches even at 13 TeV. Thus, an experimental investigation of this scenario is well motivated. △ Less", "We perform a comprehensive analysis of the polarization of the top quarks originating from sbottom-pair production at the LHC, followed by sbottom decays to top+chargino. We study moreover the expected net polarization of top quarks produced in sbottom-to-chargino and stop-to-neutralino decays in scenarios with small chargino - neutralino mass difference, where these decays may be hard to distinguish. We show that, in contrast to top quarks produced via the Standard Model processes, the average polarization of top quarks originating from these SUSY decays can obtain any value between +1 and -1. We further study the effect of this polarization on the top quark decay kinematics. On the one hand this may be used to construct measures of this polarization, on the other hand it may be used to enhance the search reach in certain scenarios. Exploiting top polarization may also prove useful for searches for \"natural\" SUSY with light higgsinos, which is typically very difficult to detect at the LHC. △ Less", "The Higgs quartic coupling has now been indirectly measured at the electroweak scale. Assuming no new low-scale physics, its running is known and, together with gauge and Yukawa couplings, it is a crucial new piece of information constraining UV completions of the Standard Model. In particular, supersymmetry broken at an intermediate or high energy scale with tan(beta)=1 (i.e. lambda=0) is consistent with present data and has an independent theoretical appeal. We analyze the possible string-theoretic motivations for tan(beta)=1 (including both the shift-symmetry and the more economical variant of a Z_2 symmetry) in a Higgs sector realized on either 6- or 7-branes. We identify specific geometries where lambda ~ 0 may arise naturally and specify the geometrical problems which need to be solved to determine its precise value in the generic case. We then analyze the radiative corrections to lambda. Finally we show that, in contrast to naive expectations, lambda<0 at the SUSY breaking scale is also possible. Specifically, string theory may produce an MSSM plus chiral singlet at a very high scale, which immediately breaks to a non-SUSY Standard Model with lambda<0. This classically unstable theory then becomes metastable through running towards the IR. △ Less", "We perform a systematic analysis of moduli stabilisation for weakly coupled heterotic string theory compactified on manifolds which are Calabi-Yau up to alpha' effects. We review how to fix all geometric and bundle moduli in a supersymmetric way by fractional fluxes, the requirement of a holomorphic gauge bundle, D-terms, higher order perturbative contributions to W, non-perturbative and threshold effects. We then show that alpha' corrections to K lead to new stable Minkowski (or dS) vacua where the complex structure moduli Z and the dilaton are fixed supersymmetrically, while the fixing of the Kahler moduli at a lower scale leads to spontaneous SUSY breaking. The minimum lies at moderately large volumes of all geometric moduli, at a perturbative string coupling and at the right value of the GUT coupling. We also give a dynamical derivation of anisotropic compactifications which allow for gauge coupling unification around 10^16 GeV. The gravitino mass can be anywhere between the GUT and TeV scale depending on the fixing of the Z-moduli. In general, these are fixed by turning on background fluxes, leading to a gravitino mass around the GUT scale since the heterotic 3-form flux does not contain enough freedom to tune W to small values. Moreover accommodating the observed value of the cosmological constant (CC) is a challenge. Low-energy SUSY could instead be obtained in particular situations where the gauge bundle is holomorphic only at a point-like sub-locus of Z-moduli space, or where the number of Z-moduli is small (like orbifold models), since in these cases one may fix all moduli without turning on any quantised flux. However tuning the CC is even more of a challenge in these cases. Another option is to focus on non-complex manifolds since these allow for new geometric fluxes which can be used to tune W and the CC, even if their moduli space is presently only poorly understood. △ Less", "One of the main implications of the LHC discovery of a Higgs boson with a mass $M_h \\approx 126$ GeV is that the scale of supersymmetry-breaking in the Minimal Supersymmetric Standard Model (MSSM) might be rather high, $M_S \\gg M_Z$. In this paper, we consider the high $M_S$ regime and study the spectrum of the extended Higgs sector of the MSSM, including the LHC constraints on the mass and the rates of the observed light $h$ state. In particular, we show that in a simplified model that approximates the important radiative corrections, the unknown scale $M_S$ (and some other leading SUSY parameters) can be traded against the measured value of $M_h$. One would be then essentially left with only two free parameters to describe the Higgs sector, tan$β$ and the pseudoscalar Higgs mass $M_A$, even at higher orders. The main phenomenological consequence of these high $M_S$ values is to reopen the low tan$β$ region, tan$β\\lsim 3-5$, which was for a long time buried under the LEP constraint on the lightest $h$ mass when a low SUSY scale was assumed. We show that, in this case, the heavier MSSM neutral $H/A$ and charged $H^\\pm$ states can be searched for in a variety of interesting final states such as decays into gauge and lighter Higgs bosons (in pairs on in mixed states) and decays into heavy top quarks. Examples of sensitivity on the $[tanβ, M_A]$ parameter space at the LHC in these channels are given. △ Less", "The AMS-02 collaboration has recently reported an excess of cosmic-ray positron fractions, which is consistent with previous results at PAMELA and Fermi-LAT experiments. The result indicates the existence of new physics phenomena to provide the origin of the energetic cosmic-ray positron. We pursue the possibility that the enhancement of the positron fraction is due to the decay of gravitino dark matter. We discuss that such a scenario viably fits into the models in which the soft SUSY breaking parameters are dominantly from gauge-mediation mechanism with superparticle masses of around 10 TeV. Our scenario is compatible with ~126 GeV Higgs boson, negative searches for SUSY particles, and non-observation of anomalous FCNC processes. We also point out that the scenario will be tested in near future by measuring the electric dipole moment of the electron and the lepton flavor violating decay of the muon. △ Less", "We study a minimal modification of Gauge Mediation in which the messenger sector couples directly to the MSSM matter fields. These couplings are controlled by the same dynamics that explain the flavor hierarchies, and therefore are parametrically as small as the Yukawas. This setup gives rise to an interesting SUSY spectrum that is calculable in terms of a single new parameter. Due to large A-terms, the model can easily accommodate a 126 GeV Higgs with a relatively light SUSY spectrum. The flavor structure depends on the particular underlying flavor model, but flavor-violating effects arise dominantly in the up-sector and are strongly suppressed in Delta F =2 observables. This strong suppression is reminiscent of what happens in the case of wave function renormalization or Partial Compositeness, despite the underlying flavor model can be a simple U(1) flavor model (which in the context of Gravity Mediation suffers from strong Delta F =2 constraints). This structure allows to account for the recent observation of direct CP violation in D-meson decays. △ Less", "We review recent results that provide a new approach to the old problem of naturalness in supersymmetric models, without relying on subjective definitions for the fine-tuning associated with {\\it fixing} the EW scale (to its measured value) in the presence of quantum corrections. The approach can address in a model-independent way many questions related to this problem. The results show that naturalness and its measure (fine-tuning) are an intrinsic part of the likelihood to fit the data that {\\it includes} the EW scale. One important consequence is that the additional {\\it constraint} of fixing the EW scale, usually not imposed in the data fits of the models, impacts on their overall likelihood to fit the data (or chi^2/ndf, ndf: number of degrees of freedom). This has negative implications for the viability of currently popular supersymmetric extensions of the Standard Model. △ Less", "A Higgs boson mass $\\sim 126$ GeV as determined by the LHC data requires a large loop correction which in turn implies a large sfermion mass. Implication of this result for the stability of the proton in supersymmetric grand unified theories is examined including other experiments constraints along with the most recent result on cold dark matter from Planck. It is shown that over the allowed parameter space of supergravity unified models, proton lifetime is highly sensitive to the Higgs boson mass and a few GeV shift in its mass can change the proton decay lifetime for the mode $p\\to \\bar νK^+$ by as much as two orders of magnitude or more. An analysis is also given on the nature of radiative breaking of the electroweak symmetry in view of the high Higgs boson, and it is shown that most of the parameter space of universal and non-universal supergravity unified models lies on the Hyperbolic Branch of radiative breaking of the electroweak symmetry, while the Ellipsoidal Branch and the Focal Point regions are highly depleted and contain only a very small region of the allowed parameter space. Also discussed are the naturalness criteria when the proton stability constraints along with the electroweak symmetry breaking are considered together. It is shown that under the assumed naturalness criteria the overall fine tuning is improved for larger values of the scalar mass with the inclusion of the proton stability constraint. Thus the naturalness criteria including proton stability along with electroweak symmetry breaking constraints tend to favor the weak scale of SUSY in the several TeV region. Implications for the discovery of supersymmetry in view of the high Higgs mass are briefly discussed. △ Less", "The search for heavy Higgs bosons is an essential step in the exploration of the Higgs sector and in probing the Supersymmetric parameter space. This paper discusses the constraints on the M(A) and tan beta parameters derived from the bounds on the different decay channels of the neutral H and A bosons accessible at the LHC, in the framework of the phenomenological MSSM. The implications from the present LHC results and the expected sensitivity of the 14 TeV data are discussed in terms of the coverage of the [M(A) - tan beta] plane. New channels becoming important at 13 and 14 TeV for low values of tan beta are characterised in terms of their kinematics and the reconstruction strategies. The effect of QCD systematics, SUSY loop effects and decays into pairs of SUSY particles on these constraints are discussed in details. △ Less", "We study several phenomenologies of an E_6 inspired extra U(1) model with S_4 flavor symmetry. With the assignment of left-handed quarks and leptons to S_4-doublet, SUSY flavor problem is softened. As the extra Higgs bosons are neutrinophilic, baryon number asymmetry in the universe is realized by leptogenesis without causing gravitino overproduction. We find that the allowed region for the lightest chargino mass is given by 100-140 GeV, if the dark matter is a singlino dominated neutralino whose mass is about 36 GeV. △ Less", "I elaborate on a link between the string--scale breaking of supersymmetry that occurs in a class of superstring models and the onset of inflation. The link rests on spatially flat cosmologies supported by a scalar field driven by an exponential potential. If, as in String Theory, this potential is steep enough, under some assumptions that are spelled out in the text the scalar can only climb up as it emerges from an initial singularity. In the presence of another mild exponential, slow--roll inflation is thus injected during the ensuing descent and definite imprints are left in the CMB power spectrum: the quadrupole is systematically reduced and, depending on the choice of two parameters, an oscillatory behavior can also emerge for low multipoles l < 50, in qualitative agreement with WMAP9 and PLANCK data. The experimentally favored value of the spectral index, n_s ~ 0.96, points to a potentially important role for the NS fivebrane, which is unstable in this class of models, in the Early Universe. △ Less", "We present the mechanism of the dynamical supersymmetry (SUSY) breaking at the metastable vacuum in the N=1 U(N) SUSY gauge theory with adjoint superfields. The dynamical SUSY breaking is triggered by the non-vanishing D-term coupled to the observable sector, and is realized by the self-consistent Hartree-Fock approximation of the NJL type while it eventually brings us the non-vanishing F-term as well. We numerically check the local stability of our metastable vacuum. △ Less", "Relatively light electroweak superparticle masses are required to satisfy the bulk annihilation region of dark matter relic density and account for the observed excess of muon g-2, while TeV scale squark and gluino masses are required to account for the 125 GeV Higgs boson mass and the negative SUSY search results from LHC. These two sets of requirements can be reconciled in a simple nonuniversal gaugino mass model, which assumes SUSY breaking via a combination of two superfields belonging to the singlet and the 200-plet representations of the GUT group SU(5). The model can be probed via squark/gluon search with the present and future LHC data. In a more general nonuniversal gaugino mass model the squark and gluino masses can be raised to the edge of the discovery limit of LHC or beyond. This model can be probed, however, through the search for electroweak pair production of the relatively light sleptons and winos with the future LHC data. △ Less", "In this letter we analyze the consequences, for the LHC, of gauge and third family Yukawa coupling unification with a particular set of boundary conditions defined at the GUT scale, which we characterize as effective \"mirage\" mediation. We perform a global chi-squared analysis including the observables M_W, M_Z, G_F, alpha_em, alpha_s(M_Z), M_top, m_b(m_b), M_tau, BR(B -> X_s gamma), BR(B_s -> mu^+ mu^-) and M_{h}. The fit is performed in the MSSM in terms of 10 GUT scale parameters, while tanb and mu are fixed at the weak scale. We find good fits to the low energy data and a SUSY spectrum which is dramatically different than previously studied in the context of Yukawa unification. △ Less", "There is more than 3 sigma deviation between the experimental and theoretical results of the muon g-2. This suggests that some of the SUSY particles have a mass of order 100 GeV. We study searches for those particles at the LHC with particular attention to the muon g-2. In particular, the recent results on the searches for the non-colored SUSY particles are investigated in the parameter region where the muon g-2 is explained. The analysis is independent of details of the SUSY models. Future prospects of the collider searches are also discussed. △ Less", "Supersymmetric models which fulfill the conditions of electroweak naturalness generally contain light higgsinos with mass not too far from m_h ~125 GeV, while other sparticles can be much heavier. In R-parity conserving models, the lightest neutralino is then a higgsino-like WIMP (albeit with non-negligible gaugino components), with thermal relic density well below measured values. This leaves room for axions to function as co-dark matter particles. The local WIMP abundance is then expected to be below standard estimates, and direct and indirect detection rates must be accordingly rescaled. We calculate rescaled direct and indirect higgsino-like WIMP detection rates in SUSY models that fulfil the electroweak naturalness condition. In spite of the rescaling, we find that ton-scale noble liquid detectors can probe the entire higgsino-like WIMP parameter space, so that these experiments should either discover WIMPs or exclude the concept of electroweak naturalness in R-parity conserving natural SUSY models. Prospects for spin-dependent or indirect detection are more limited due in part to the rescaling effect. △ Less", "We study the potential of an e+- e- Linear Collider for charged lepton flavour violation studies in a supersymmetric framework where neutrino masses and mixings are explained by a type-I seesaw. Focusing on e-mu flavour transitions, we evaluate the background from standard model and supersymmetric charged currents to the e mu + missing E_T signal. We study the energy dependence of both signal and background, and the effect of beam polarisation in increasing the signal over background significance. Finally, we consider the mu- mu- + missing E_T final state in e- e- collisions that, despite being signal suppressed by requiring two e-mu flavour transitions, is found to be a clear signature of charged lepton flavour violation due to a very reduced standard model background. △ Less", "We explore the phenomenology of the full General Gauge Mediation parameter space in the MSSM focusing on the consequences of having a fundamental Higgs around 125 GeV. Assuming GUT-complete structure of the hidden sector, we allow for deviations from the strict definition of gauge mediated SUSY-breaking coming from mild violations of messenger-parity and from extra couplings between the Higgs multiplets and the hidden sector. Relaxing the GUT assumption, our parameter space is defined by the property of having vanishing A-terms at the messenger scale. In this extended setup we focus on the possibility of splitting the SU(3) mass parameters of GGM. In all these scenarios we investigate the possible spectra, discussing to what extent having an Higgs mass around 125 GeV is constraining the GGM parameter space and what are the possible signatures at LHC. △ Less", "We study leptonic flavor and CP violating observables in supersymmetric (SUSY) models with heavy sfermions, which is motivated by the recent results of the LHC experiments (i.e., the discovery of the Higgs-like boson with the mass of about 126 GeV and the negative searches for the superparticles). Even if the sfermion masses are of O(10-100 TeV), signals may be within the reach of future leptonic flavor- and CP-violation experiments assuming that the off-diagonal elements of the sfermion mass matrices are unsuppressed compared to the diagonal ones. We also consider the SUSY contribution to the K0-K0bar mixing paraemters; we show that the leptonic observables can become as powerful as those in K0-K0bar mixing to constrain SUSY models. △ Less", "We examine the ATLAS and CMS 7 & 8 TeV multijet supersymmetry (SUSY) searches requiring the incidence of a single lepton in the framework of the supersymmetric grand unified model No-Scale Flipped SU(5) with extra vector-like flippon multiplets derived from F-Theory, or F-SU(5) for short. Investigated are five multijet+lepton SUSY searches: 4.7/fb ATLAS 7 TeV gluino and light stop searches, as well as 13/fb ATLAS and 9.7/fb CMS 8 TeV light stop searches. Most significantly, all five leptonic SUSY searches represent statistically independent data samples. Findings show that all five orthogonal sets of leptonic LHC observations give a lower bound to the gaugino mass scale at M_{1/2} >= 680 GeV, with all the current best fits correlating within a narrow region. Furthermore, eight statistically independent LHC SUSY search regions (leptonic + all-hadronic) accessible to the No-Scale F-SU(5) model space intersect with all the currently operating beyond the Standard Model experiments within the range of M_{1/2} = 680-850 GeV, with the upper bound established by the lower experimental limit of the anomalous magnetic moment (g_{mu}-2)/2 of the muon. We emphasize that this region of the F-SU(5) model space may not be fully probed by leptonic SUSY searches at the LHC until the 13 TeV LHC energizes in 2015. Additionally, we describe an efficient technique for the effective statistical disentanglement of searches sensitive to mutually overlapping event spaces. △ Less", "These lectures from the TASI 2012 summer school outline the basics of supersymmetry (SUSY) in 3+1 dimensions. Starting from a ground-up development of superspace, we develop all of the tools necessary to construct SUSY lagrangians. While aimed at an introductory level, these lectures incorporate a number of \"super-tricks\" for SUSY aficionados, including SUSY-covariant derivatives, equations of motion in superspace, background field methods, and non-linear realizations of goldstinos. △ Less", "From the naturalness point of view, the first LHC results seem to disfavour any constrained MSSM realization with universal conditions at the SUSY-breaking scale. A more motivated scenario is given by split-family SUSY, in which the first two generations of squarks are heavy, compatible with a U(2)^3 flavour symmetry. Here, after reviewing the flavour structures obtained in this framework, we consider the flavour symmetry to be broken at a very high scale, and study the consequences at low energies through its RGE evolution. Initial conditions compatible with a split scenario are found, and the preservation of correlations from minimal U(2)^3 breaking are checked. △ Less", "We examine the prospects of using two alternative and complementary ways to explore the regions that are favored by global constraints in two simple unified supersymmetric models: the CMSSM and the NUHM. First, we consider BR(Bs->μμ), which has recently been for the first time measured by LHCb. In the CMSSM we show that ultimate, but realistic, improvement in the determination of the observable to about 5-10% around the Standard Model value would strongly disfavor the A-funnel region, while not affecting much the other favored regions. Second, we show that all the favored regions of the CMSSM will be, for the most part, sensitive to direct dark matter searches in future one-tonne detectors. A signal at low WIMP mass (<=450 GeV) and low spin-independent cross section would then strongly favor the stau coannihilation region while a signal at higher WIMP mass (~800 GeV to ~1.2 TeV) would clearly point to the region where the neutralino is higgsino-like with mass ~1 TeV. A nearly complete experimental testing of the CMSSM over multi-TeV ranges of superpartner masses, far beyond the reach of direct SUSY searches at the LHC, can therefore be achievable. In the NUHM, in contrast, similar favored regions exist but a sample study reveals that even a precise determination of BR(Bs->μμ) would have a much less constraining power on the model, including the A-funnel region. On the other hand, this could allow one to, by detecting in one-tonne detectors a signal for 500 GeV<m_χ<800 GeV, strongly disfavor the CMSSM. △ Less", "We propose that a single, spontaneously broken, U(1) gauge symmetry may be responsible for suppressing both the first two generation Yukawa couplings, and also, in a correlated manner, parameters in the dynamical supersymmetry (SUSY) breaking sector by the mechanism of retrofitting. In the dynamical SUSY breaking sector, these small parameters are typically required in order to introduce R-symmetry breaking in a controlled manner and obtain phenomenologically viable meta-stable vacua. The heavy U(1) multiplet mediates a dominant contribution to the first two generation MSSM sfermion soft masses, while gauge mediation provides a parametrically suppressed soft term contribution to the stop and most other states, so realising a natural SUSY spectrum in a fashion consistent with SUSY unification. In explicit models the spectra obtained can be such that current LHC limits are evaded, and predictions of flavour changing processes are consistent with observation. We examine both implementations with low scale mediation, and string-motivated examples where the U(1) is anomalous before the inclusion of a generalised Green-Schwarz mechanism. △ Less", "We employ a SUSY-model-independent method to examine the remaining evidence for the low mass dark matter. Using the XENON100's recent result of 224.6 live days $\\times$ 34kg exposure and PICASSO's result published in 2009, we have obtained a constrain of couplings, $\\| {a_n} \\| < 0.6$ and $\\| {a_p} \\| < 1.0$, corresponding to the spin-dependent cross section of ${σ_n} < 5.6 \\times {10^{- 38}}$cm$^{2}$ and ${σ_p} < 1.6 \\times {10^{- 37}}$cm$^{2}$. Spin-independent isospin violating dark matter model also failed to reconcile the recent result from XENON100 with the positive results from DAMA and CoGeNT. △ Less", "TeV-scale supersymmetry was originally introduced to solve the hierarchy problem and therefore fix the electroweak (EW) scale in the presence of quantum corrections. Numerical methods testing the SUSY models often report a good likelihood L (or chi^2=-2ln L) to fit the data {\\it including} the EW scale itself (m_Z^0) with a {\\it simultaneously} large fine-tuning i.e. a large variation of this scale under a small variation of the SUSY parameters. We argue that this is inconsistent and we identify the origin of this problem. Our claim is that the likelihood (or chi^2) to fit the data that is usually reported in such models does not account for the chi^2 cost of fixing the EW scale. When this constraint is implemented, the likelihood (or chi^2) receives a significant correction (delta_chi^2) that worsens the current data fits of SUSY models. We estimate this correction for the models: constrained MSSM (CMSSM), models with non-universal gaugino masses (NUGM) or higgs soft masses (NUHM1, NUHM2), the NMSSM and the general NMSSM (GNMSSM). For a higgs mass m_h\\approx 126 GeV, one finds that in these models (delta_chi^2)/ndf> 1.5 (approx 1 for GNMSSM), which violates the usual condition of a good fit (total chi^2/ndf approx 1) already before fitting observables other than the EW scale itself (ndf=number of degrees of freedom). This has (negative) implications for SUSY models and it is suggested that future data fits properly account for this effect, if one remains true to the original goal of SUSY. Since the expression of delta_chi^2 that emerges from our calculation depends on a familiar measure of fine-tuning, one concludes that EW fine-tuning is an intrinsic part of the likelihood to fit the data that includes the EW scale (m_Z^0). △ Less", "We introduce SuperLFV, a numerical tool for calculating low-energy observables that exhibit charged lepton flavor violation (LFV) in the context of the minimal supersymmetric standard model (MSSM). As the Large Hadron Collider and MEG, a dedicated mu -> e gamma experiment, are presently acquiring data, there is need for tools that provide rapid discrimination of models that exhibit LFV. SuperLFV accepts a spectrum file compliant with the SUSY Les Houches Accord (SLHA), containing the MSSM couplings and masses with complex phases at the supersymmetry breaking scale. In this manner, SuperLFV is compatible with but divorced from existing SLHA spectrum calculators that provides the low energy spectrum. Hence, input spectra are not confined to the LFV sources provided by established SLHA spectrum calculators. Input spectra may be generated by personal code or by hand, allowing for arbitrary models not supported by existing spectrum calculators. △ Less", "A survey of the mSUGRA/CMSSM parameter space is presented. The viable regions of the parameter space which satisfy all experimental constraints are identified and discussed. These constraints include a 124-127 GeV mass for the lightest CP-even Higgs and the correct relic density for cold dark matter (CDM). The superpartner spectra corresponding to these regions fall within the well-known hyperbolic branch (HB) and are found to possess sub-TeV neutralinos and charginos, with mixed Bino/Higgsino LSP's with 200-800 GeV masses. In addition, the models possess ~3-4 TeV gluino masses and heavy squarks and sleptons with masses heavier than the gluino mass. Spectra with a Higgs mass near 125 GeV and a relic density 0.109 < Ωh^2 < 0.123 are found to require EWFT at around the one-percent level, while those spectra with a much lower relic density require EWFT of only a few percent. Moreover, the SI neutralino-proton direct detection cross-sections are found to be below or within the XENON100 2-sigma limits and should be experimentally accessible now or in the near future. Finally, it is pointed-out that the supersymmetry breaking soft terms corresponding to these regions of the mSUGRA/CMSSM parameter space (m_0 proportional to m_{1/2} with m_0^2 >> m_{1/2}^2 and A_0 = -m_{1/2}) may be obtained from general flux-induced soft terms in Type IIB flux compactifications with D3 branes. △ Less", "We have calculated the full O(alpha_s) supersymmetric QCD corrections to neutralino-stop co-annihilation into electroweak vector and Higgs bosons within the Minimal Supersymmetric Standard Model (MSSM). We performed a parameter study within the phenomenological MSSM and demonstrated that the studied co-annihilation processes are phenomenologically relevant, especially in the context of a 126 GeV Higgs-like particle. By means of an example scenario we discuss the effect of the full next-to-leading order corrections on the co-annihilation cross section and show their impact on the predicted neutralino relic density. We demonstrate that the impact of these corrections on the cosmologically preferred region of parameter space is larger than the current experimental uncertainty of WMAP data. △ Less", "The lack of observation of superpartners at the Large Hadron Collider so far has led to a renewed interest in supersymmetric models with R-parity violation (RPV). In particular, imposing the Minimal Flavor Violation (MFV) hypothesis on a general RPV model leads to a realistic and predictive framework. Naturalness suggests that stops and gluinos should appear at or below the TeV mass scale. We consider a simplified model with these two particles and MFV couplings. The model predicts a significant rate of events with same-sign dileptons and b-jets. We re-analyze a recent CMS search in this channel and show that the current lower bound on the gluino mass is about 800 GeV at 95% confidence level, with only a weak dependence on the stop mass as long as the gluino can decay to an on-shell top-stop pair. We also discuss how this search can be further optimized for the RPV/MFV scenario, using the fact that MFV stop decays often result in jets with large invariant mass. With the proposed improvements, we estimate that gluino masses of up to about 1.4 TeV can be probed at the 14 TeV LHC with a 100 fb^-1 data set. △ Less", "We study the collider phenomenology of the minimal unified version of the supersymmetry breaking scheme called Tree-level Gauge Mediation. We identify a peculiar source of gaugino mass non-universality related to the necessary SU(5)-breaking in the light fermion mass ratios and a gaugino mass sum rule at the GUT scale, 3 M_2 + 2 M_3 = 5 M_1, which represents a smoking gun of this scenario, together with the known tree-level sfermion mass ratio \\tilde m_{d^c,l} = \\sqrt{2} \\tilde m_{q,u^c,e^c}. The boundary conditions of the soft SUSY breaking terms can be parameterised in terms of six relevant parameters only (plus the sign of the μ-parameter). We analyze the parameter space and define three benchmark points, corresponding to the three possible NLSPs, a bino- or wino-like neutralino or the stau. The LSP is the gravitino as in gauge mediation. For these benchmark points we show possible signatures at the LHC focusing on the Razor variable. We also comment on the Higgs mass. △ Less", "In light of the discovery of the new particle at 125GeV and the strong lower limits on the masses of superparticles from LHC, we discuss a possible picture of weak scale supersymmetry. △ Less", "We use the amplitude-based resummation of Feynman`s formulation of Einstein`s theory to arrive at a UV finite approach to quantum gravity. We show that we recover the UV fixed point recently claimed by the exact field-space renormalization group approach. We use our approach in the context of the attendant Planck scale cosmology formulation of Bonanno and Reuter to estimate the value of the cosmological constant as ρ_Λ=(0.0024 eV)^4. We show that the closeness of this estimate to experiment constrains susy GUT models. △ Less", "We present a complete model whose low energy effective theory is the R-parity violating NMSSM with a baryon number violating udd vertex of the MFV SUSY form, leading to prompt LSP decay and evading the ever stronger LHC bounds on low-scale R-parity conserving supersymmetry. MFV flavor structure is enforced by gauging an SU(3) flavor symmetry at high energies. After the flavor group is spontaneously broken, mass mixing between the standard model fields and heavy vector-like quarks and leptons induces hierarchical Yukawa couplings which depend on the mixing angles. The same mechanism generates the udd coupling, explaining its shared structure. A discrete R-symmetry is imposed which forbids all other dangerous lepton and baryon-number violating operators (including Planck-suppressed operators) and simultaneously solves the mu problem. While flavor constraints require the flavor gauge bosons to be outside of the reach of the LHC, the vector-like top partners could lie below 1 TeV. △ Less", "Recent analyses of WMAP9 data show that dark radiation-- parametrized by the apparent number of additional neutrinos ΔN_{eff} contributing to the cosmic expansion-- is consistent with the Standard Model and bounded from above by about ΔN_{eff} ~< 0.5 at 95% CL. We consider the mixed axion/neutralino cold dark matter scenario which arises in R-parity conserving supersymmetric (SUSY) models wherein the strong CP problem is solved by hadronic axions with a concommitant axion(a)/saxion(s)/axino(\\ta) supermultiplet. Our new results include improved calculations of thermal axion and saxion production and include effects of saxion decay to axinos and axions. We show that the above bound on ΔN_{eff} is easily satisfied if saxions are mainly thermally produced and m_{LSP} < m_{\\ta} \\lesssim m_s. However, if the dominant mechanism of saxion production is through coherent oscillations, the WMAP9 data provides a strong bound on saxion production followed by saxion decays to axions. Furthermore we show that scenarios with mixed neutralino/axion dark matter are highly constrained by combined WMAP9, BBN and Xe-100 constraints. In particular, supersymmetric models with a standard overabundance of neutralino dark matter are excluded for all values of the Peccei-Quinn breaking scale. Next generation WIMP direct detection experiments may be able to discover or exclude mixed axion-neutralino CDM scenarios where $s\\to aa$ is the dominant saxion decay mode. △ Less", "In light of the recent LHC Higgs search data, we investigate the pair production of a SM-like Higgs boson around 125 GeV in the MSSM and NMSSM. We first scan the parameter space of each model by considering various experimental constraints, and then calculate the Higgs pair production rate in the allowed parameter space. We find that in most cases the dominant contribution to the Higgs pair production comes from the gluon fusion process and the production rate can be greatly enhanced, maximally 10 times larger than the SM prediction (even for a TeV-scale stop the production rate can still be enhanced by a factor of 1.3). We also calculate the chi-square value with the current Higgs data and find that in the most favored parameter region the production rate is enhanced by a factor of 1.45 in the MSSM, while in the NMSSM the production rate can be enhanced or suppressed (σ_{SUSY}/σ_{SM} varies from 0.7 to 2.4). △ Less", "We construct lists of supersymmetric models with extended gauge groups at intermediate steps, all of which are based on SO(10) unification. We consider three different kinds of setups: (i) The model has exactly one additional intermediate scale with a left-right (LR) symmetric group; (ii) SO(10) is broken to the LR group via an intermediate Pati-Salam (PS) scale; and (iii) the LR group is broken into $SU(3)_{c} \\times SU(2)_{L} \\times U(1)_{R} \\times U(1)_{B-L}$, before breaking to the SM group. We use sets of conditions, which we call the \"sliding mechanism\", which yield unification with the extended gauge group(s) allowed at arbitrary intermediate energy scales. All models thus can have new gauge bosons within the reach of the LHC, in principle. We apply additional conditions, such as perturbative unification, renormalizability and anomaly cancellation and find that, despite these requirements, for the ansatz (i) with only one additional scale still around 50 different variants exist that can have an LR symmetry below 10 TeV. For the more complicated schemes (ii) and (iii) literally thousands of possible variants exist, and for scheme (ii) we have also found variants with very low PS scales. We also discuss possible experimental tests of the models from measurements of SUSY masses. Assuming mSugra boundary conditions we calculate certain combinations of soft terms, called \"invariants\", for the different classes of models. Values for all the invariants can be classified into a small number of sets, which contain information about the class of models and, in principle, the scale of beyond-MSSM physics, even in case the extended gauge group is broken at an energy beyond the reach of the LHC. △ Less", "We compute the mass of the Higgs particle in a scheme in which SUSY is broken at a large scale M_{SS} well above the electroweak scale M_{EW}. Below M_{SS} one assumes one is just left with the SM with a fine-tuned Higgs potential. Under standard unification assumptions one can compute the mass of the Higgs particle as a function of the SUSY breaking scale M_{SS}. For M_{SS} > 10^{10} GeV one obtains m_H=126 \\pm 3 GeV, consistent with CMS and ATLAS results. For lower values of M_{SS} the values of the Higgs mass tend to those of a fine-tuned MSSM with m_H < 130 GeV. These results support the idea that the measured value of the Higgs mass at LHC may be considered as indirect evidence for the existence of SUSY at some (not necessarily low) mass scale. △ Less", "In light of recent remarkable progress in Higgs search at the LHC, we study the rare decay process $h \\to Zγ$ and show its correlation with the decay $h \\to γγ$ in low energy SUSY models such as CMSSM, MSSM, NMSSM and nMSSM. Under various experimental constraints, we scan the parameter space of each model, and present in the allowed parameter space the SUSY predictions on the $Zγ$ and $γγ$ signal rates in the Higgs production at the LHC and future e+e- linear colliders. We have following observations: (i) Compared with the SM prediction, the $Zγ$ and $γγ$ signal rates in the CMSSM are both slightly suppressed; (ii) In the MSSM, both the $Zγ$ and $γγ$ rates can be either enhanced or suppressed, and in optimal case, the enhancement factors can reach 1.2 and 2 respectively; (iii) In the NMSSM, the $Zγ$ and $γγ$ signal rates normalized by their SM predictions are strongly correlated, and vary from 0.2 to 2; (iv) In the nMSSM, the $Zγ$ and $γγ$ rates are greatly reduced. Since the correlation behavior between the Zγsignal and the γγsignal is so model-dependent, it may be used to distinguish the models in future experiments. △ Less", "Models, where neutrino mass originates from physics at the TeV scale and which are potentially testable at the LHC, need additional suppression mechanisms to describe the smallness of neutrino masses. We consider models in which neutrino mass is generated from the d=7 operator $L L H_u H_u H_d H_u$ in the context of SUSY-GUTs containing an SU(5) subgroup, here the d=5 Weinberg operator can be forbidden by a discrete symmetry. That is, we identify the embeddings in GUT multiplets and their consequences for phenomenology and renormalization group evolution. We use a specific example to exemplify the challenges. In this case, additional heavy d-quarks are predicted, which are constrained by cosmology, in particular, by big bang nucleosynthesis and direct searches for heavy nuclei. We show that in the NMSSM extension of the model, the discrete symmetry needs to be broken, which can be the origin of deviations from tri-bimaximal mixings. Finally we demonstrate that our example is the only tree level decomposition which is consistent with perturbativity up to the GUT scale and neutrino mass generation by a leading d=7 contribution. △ Less", "We perform global fits to the parameters of the Constrained Minimal Supersymmetric Standard Model (CMSSM) and to a variant with non-universal Higgs masses (NUHM1). In addition to constraints from low-energy precision observables and the cosmological dark matter density, we take into account the LHC exclusions from searches in jets plus missing transverse energy signatures with about 5/fb of integrated luminosity at sqrt(s)=7TeV. We also include the most recent upper bound on the branching ratio Bs->mumu from LHCb. The best fit of the CMSSM prefers a light Higgs boson just above the experimentally excluded mass. We find that the description of the low-energy observables, (g-2)(mu) in particular, and the non-observation of SUSY at the LHC become more and more incompatible within the CMSSM. A potential SM-like Higgs boson with mass around 126 GeV can barely be accommodated. Values for BF(Bs->mumu) just around the Standard Model prediction are naturally expected in the best fit region. △ Less", "Here, we give a broad overview of the more natural spectra allowed by the LHC when UDD R-parity violation is allowed. Because R-parity violation removes the missing energy signals in colliders, the experimental constraints on the gluino, stops, sbottoms and higgsinos are relatively mild. We also show that UDD R-parity violation and lepton number conservation can be made consistent with grand unification. This feat is achieved through the product unification, SU(5) X U(3). In this model, mixing of the SM quarks with additional quark like particles charged under the U(3) generate a UDD R-parity violating operator. Furthermore, these models are also capable of generating a \"natural\" spectra. The emergence of these more natural low-scale spectra relies heavily on the fact that the gaugino masses are non-universal, a natural consequence of product unification. △ Less", "We reconsider the fine-tuning problem in SUSY models, motivated by the recent observation of the relatively heavy Higgs boson and non-observation of the SUSY particles at the LHC. Based on this thought, we demonstrate a focus point-like behavior in a gaugino mediation model, and show that the fine-tuning is indeed reduced to about 2 percent level if the ratio of the gluino mass to wino mass is about 0.4 at the GUT scale. We show that such a mass ratio may arise naturally in a product group unification model without the doublet-triplet splitting problem. This fact suggests that the fine-tuning problem crucially depends on the physics at the high energy scale. △ Less", "The new SM-like Higgs boson discovered recently at the LHC, with mass $m_h \\simeq$ 125 GeV, as well as the direct LHC bounds on the mass of superpartners, which are entering into the TeV range, suggest that the minimal surviving supersymmetric extension of the SM (MSSM), should be characterized by a heavy SUSY-breaking scale. Several variants of the MSSM have been proposed to account for this result, which vary according to the accepted degree of fine-tuning. We propose an alternative scenario here, Slim SUSY, which contains sfermions with multi-TeV masses and gauginos/higgsinos near the EW scale, but it includes the heavy MSSM Higgs bosons ($H^0$, $A^0$, $H^\\pm$) near the EW scale too. We discuss first the formulation and constraints of the Slim SUSY scenario, and then identify distinctive heavy Higgs signals that could be searched at the LHC, within scenarios with the minimal number of superpartners with masses near the EW scale. △ Less", "We argue that a generic trigger for photon and other gauge fields to emerge as massless Nambu-Goldstone modes could be spontaneously broken supersymmetry rather than physically manifested Lorentz violation. We consider supersymmetric QED model extended by an arbitrary polynomial potential of vector superfield that induces the spontaneous SUSY violation in the visible sector. As a consequence, massless photon appears as a companion of massless photino being Goldstone fermion state in tree approximation. Remarkably, the photon masslessness appearing at tree level is further protected against radiative corrections due to the simultaneously generated special gauge invariance in the broken SUSY phase. Meanwhile, photino being mixed with another goldstino appearing from a spontaneous SUSY violation in the hidden sector largely turns into light pseudo-goldstino whose physics seems to be of special interest. △ Less", "We study the contribution of the gluino-squark mediated flavor changing process for the CP violation in $b\\to s$ and $b\\to d$ transitions facing on recent experimental data. The mass insertion parameters of squarks are constrained by the branching ratios of $b\\to sγ$ and $b\\to dγ$ decays. In addition, the time dependent CP asymmetries of $B^0\\to φK_S$ and $B^0\\to η' K^0$ decays severely restrict the allowed region of the mass insertion parameter for the $b\\to s$ transition. By using these constraints with squark and gluino masses of 1.5 TeV, we predict the CP asymmetries of $B_s\\to φφ$, $B_s\\to η'φ$, and $B^0\\to K^0\\bar K^0$ decays, as well as the CP asymmetries in $b\\to sγ$ and $b\\to dγ$ decays. The CP violation in the $B_s\\to φφ$ decay is expected to be large owing to the squark flavor mixing, which will be tested at LHCb soon. △ Less", "The recent LHC discovery of a Higgs-like boson at 126 GeV has important consequences for SUSY, pushing the spectrum of strong-interacting supersymmetric particles to high energies, very difficult to probe at the LHC. This gives extra motivation to study the direct production of electroweak particles, as charginos and neutralinos, which are presently very poorly constrained. The aim of this work is to improve the analysis of chargino-neutralino pair production at LHC, focusing on the kinematics of the processes. We propose a new method based on the study of the poles of a certain kinematical variable. This complements other approaches, giving new information about the spectrum and improving the signal-to-background ratio. We illustrate the method in particular SUSY models, and show that working with the LHC at 100/fb luminosity one would be able to distinguish the SUSY signal from the Standard Model background. △ Less", "The purely leptonic rare decay Bs -> mu+mu- is very sensitive to supersymmetric contributions which are free from the helicity suppression of its Standard Model diagrams. The recent observation of the decay by the LHCb experiment and the first determination of its branching fraction motivate a review of their impact on the viable parameter space of supersymmetry. In this paper we discuss the implications of the present and expected future accuracy on BR(Bs -> mu+mu-) for constrained and unconstrained MSSM scenarios, in relation to the results from direct SUSY searches and the Higgs data at the LHC. While the constraints from BR(Bs -> mu+mu-) can be very important in specific SUSY regions, we show that the current result, and even foreseen future improvements in its accuracy, will leave a major fraction of the SUSY parameter space, compatible with the results of direct searches, unconstrained. We also highlight the complementarity of the Bs -> mu+mu- decay with direct SUSY searches. △ Less", "We analyze the implications for the status and prospects of supersymmetry of the Higgs discovery and the last XENON data. We focus mainly, but not only, on the CMSSM and NUHM models. Using a Bayesian approach we determine the distribution of probability in the parameter space of these scenarios. This shows that, most probably, they are now beyond the LHC reach . This negative chances increase further (at more than 95% c.l.) if one includes dark matter constraints in the analysis, in particular the last XENON100 data. However, the models would be probed completely by XENON1T. The mass of the LSP neutralino gets essentially fixed around 1 TeV. We do not incorporate ad hoc measures of the fine-tuning to penalize unnatural possibilities: such penalization arises automatically from the careful Bayesian analysis itself, and allows to scan the whole parameter space. In this way, we can explain and resolve the apparent discrepancies between the previous results in the literature. Although SUSY has become hard to detect at LHC, this does not necessarily mean that is very fine-tuned. We use Bayesian techniques to show the experimental Higgs mass is at $\\sim 2\\ σ$ off the CMSSM or NUHM expectation. This is substantial but not dramatic. Although the CMSSM or the NUHM are unlikely to show up at the LHC, they are still interesting and plausible models after the Higgs observation; and, if they are true, the chances of discovering them in future dark matter experiments are quite high. △ Less", "We study the phenomenological viability of a constrained NMSSM with parameters subject to unified boundary conditions from F-theory GUTs. We find that very simple assumptions about modulus dominance SUSY breaking in F-theory unification lead to a predictive set of boundary conditions, consistent with all phenomenological constraints. The second lightest scalar Higgs H_2 can get a mass m_{H_2} ~ 125 GeV and has properties similar to the SM Higgs. On the other hand the lightest scalar H_1, with a dominant singlet component, would have barely escaped detection at LEP and could be observable at LHC as a peak in H_1 -> gamma gamma at around 100 GeV. The LSP is mostly singlino and is consistent with WMAP constraints due to coannihilation with the lightest stau, whose mass is in the range 100-250 GeV. Such light staus may lead to very characteristic signatures at LHC and be directly searched at linear colliders. In these models tan(beta) is large, of order 50, still the branching ratio for B_s -> mu+ mu- is consistent with the LHCb bounds and in many cases is also even smaller than the SM prediction. Gluinos and squarks have masses in the 2 - 3 TeV region and may be accessible at the LHC at 14 TeV. No large enhancement of the H_2 -> gamma gamma rate over that of the SM Higgs is expected. △ Less", "We point out that in the irreducible natural SUSY spectrum, stops have comparable branching fractions to chargino-bottom and neutralino-top in the vast bulk of parameter space, provided only that both decay modes are kinematically accessible. The total stop pair branching fractions into ttbar + MET can therefore be reduced to O(50%), while b bbar + X branching fractions are typically much smaller, O(10%), thus limiting the reach of traditional stop searches. We propose a new stop search targeting the asymmetric final state tt* --> t chi^0 b chi^pm, which can restore sensitivity to natural stops in the 7 and 8 TeV LHC runs. In addition we present a new variable, topness, which efficiently suppresses the dominant top backgrounds to semi-leptonic top partner searches. We demonstrate the utility of topness in both our asymmetric search channel and traditional tt* --> ttbar + MET searches and show that it matches or out-performs existing variables. △ Less", "Models of natural supersymmetry seek to solve the little hierarchy problem by positing a spectrum of light higgsinos <~ 200-300 GeV and light top squarks <~ 600 GeV along with very heavy squarks and TeV-scale gluinos. Such models have low electroweak fine-tuning and satisfy the LHC constraints. However, in the context of the MSSM, they predict too low a value of m(h), are frequently in conflict with the measured b\\to sγbranching fraction and the relic density of thermally produced higgsino-like WIMPs falls well below dark matter (DM) measurements. We propose \"radiative natural SUSY\" (RNS) which can be realized within the MSSM (avoiding the addition of extra exotic matter) and which maintains features such as gauge coupling unification and radiative electroweak symmetry breaking. The RNS model can be generated from SUSY GUT type models with non-universal Higgs masses (NUHM). Allowing for high scale soft SUSY breaking Higgs mass m_{H_u}> m_0 leads to automatic cancellations during renormalization group (RG) running, and to radiatively-induced low fine-tuning at the electroweak scale. Coupled with large mixing in the top squark sector, RNS allows for fine-tuning at the 3-10% level with TeV-scale top squarks and a 125 GeV light Higgs scalar h. The model allows for at least a partial solution to the SUSY flavor, CP and gravitino problems since first/second generation scalars (and the gravitino) may exist in the 10-30 TeV regime. We outline some possible signatures for RNS at the LHC and at a linear e^+e^- collider. If the strong CP problem is solved by the Peccei-Quinn mechanism, then RNS naturally accommodates mixed axion-higgsino cold dark matter, where the light higgsino-like WIMPS - which in this case make up only a fraction of the measured relic abundance - should be detectable at upcoming WIMP detectors. △ Less", "Very precise measurements of masses and cross sections are expected to be achievable with a future linear collider. With such an accuracy one must incorporate loop corrections in order to make meaningful predictions for the underlying new physics parameters. For the electroweakino sector, this involves fitting one-loop predictions to expected measurements of the cross section and forward-backward asymmetry for chargino pair production and of the accessible chargino and neutralino masses. We consider two scenarios with characteristic features, chosen taking recent LHC SUSY and Higgs searches into account. Our analysis allows the accurate determination of the desired parameters and, additionally, access to stop sector parameters that enter via loop corrections. △ Less", "We investigate the possibility to discriminate between different pairs of CP non-conserving mechanisms inducing the neutrinoless double beta $\\betabeta$-decay by using data on $\\betabeta$-decay half-lives of nuclei with largely different nuclear matrix elements (NMEs). The mechanisms studied are: light Majorana neutrino exchange, heavy left-handed (LH) and heavy right-handed (RH) Majorana neutrino exchanges, lepton charge non-conserving couplings in SUSY theories with R-parity breaking giving rise to the \"dominant gluino exchange\" and the \"squark-neutrino\" mechanisms. The nuclei considered are $^{76}$Ge, $^{82}$Se, $^{100}$Mo, $^{130}$Te and $^{136}$Xe. Four sets of nuclear matrix elements (NMEs) of the decays of these five nuclei, derived within the Self-consistent Renormalized Quasiparticle Random Phase Approximation (SRQRPA), were employed in our analysis. While for each of the five single mechanisms discussed, the NMEs for $^{76}$Ge, $^{82}$Se, $^{100}$Mo and $^{130}$Te differ relatively little, the relative difference between the NMEs of any two nuclei not exceeding 10%, the NMEs for $^{136}Xe$ differ significantly from those of $^{76}$Ge, $^{82}Se$, $^{100}$Mo and $^{130}$Te, being by a factor $\\sim (1.3 - 2.5)$ smaller. This allows, in principle, to draw conclusions about the pair of non-interfering (interfering) mechanisms possibly inducing the $\\betabeta$-decay from data on the half-lives of $^{136}Xe$ and of at least one (two) more isotope(s) which can be, e.g., any of the four, $^{76}Ge$, $^{82}Se$, $^{100}Mo$ and $^{130}Te$. Depending on the sets of mechanisms considered, the conclusion can be independent of, or can depend on, the NMEs used in the analysis. The implications of the EXO lower bound on the half-life of $^{136}Xe$ for the problem studied are also exploited. △ Less", "The present note relies on the recently published conceptual design report of the LHeC and extends the first contribution to the European strategy debate in emphasising the role of the LHeC to complement and complete the high luminosity LHC programme. The brief discussion therefore focuses on the importance of high precision PDF and $α_s$ determinations for the physics beyond the Standard Model (GUTs, SUSY, Higgs). Emphasis is also given to the importance of high parton density phenomena in nuclei and their relevance to the heavy ion physics programme at the LHC. △ Less", "We reinvestigate the scenario that the amount of the baryons and the gravitino dark matter is naturally explained by the decay of the Q balls in the gauge-mediated SUSY breaking. Equipped by the more correct decay rates into gravitinos and baryons recently derived, we find that the scenario with the direct production of the gravitino dark matter from the Q-ball decay works naturally. △ Less", "We demonstrate that in supersymmetry (SUSY) with relatively light top superpartners, h -> bb can be a very promising channel to discover the SM-like Higgs resonance at the Large Hadron Collider (LHC), although in general contexts it is thought to be challenging because of its huge QCD background. In this scenario, the SM-like Higgs boson is mainly produced via cascade decays initiated by pair-produced stop or sbottom squarks. The good sensitivity to h -> bb owes a great deal to the application of multiple (>= 4) b-jet tagging in removing the QCD background, and color-flow variables for reconstructing the Higgs resonance. We show in two benchmark points that a SM-like Higgs resonance can be discovered at the 14 TeV LHC (with a signal-to-background ratio as high as 0.35), with ~< 40/fb of data. Potentially, this strategy can be also applied to non-SUSY theories with cascade decays of top partners for the SM-like Higgs search, such as little Higgs, composite Higgs, and Randall-Sundrum models. △ Less", "In the presence of even minuscule baryonic R-parity violation, the stop can be the lightest superpartner and evade LHC searches because it decays into two jets. In order to cover this interesting possibility, we here consider new searches for RPV stops produced in gluino cascades. While typical searches for gluinos decaying to stops rely on same-sign dileptons, the RPV cascades usually have fewer hard leptons, less excess missing energy, and more jets than R-parity conserving cascades. If the gluino is a Dirac fermion, same-sign dilepton signals are also often highly depleted. We therefore explore search strategies that use single-lepton channels, and combat backgrounds using HT, jet counting, and more detailed multijet kinematics or jet substructure. We demonstrate that the stop mass peaks can be fully reconstructed over a broad range of spectra, even given the very high jet multiplicities. This would not only serve as a \"double-discovery\" opportunity, but would also be a spectacular confirmation that the elusive top-partner has been hiding in multijets. △ Less", "At a future linear collider, very precise measurements, typically with errors of <1%, are expected to be achievable. Such an accuracy yields sensitivity to quantum corrections, which therefore must be incorporated into theoretical calculations in order to determine the underlying new physics parameters from linear collider measurements. In the context of the chargino--neutralino sector of the minimal supersymmetric standard model, this involves fitting one-loop predictions to prospective measurements of cross sections, forward-backward asymmetries and the accessible chargino and neutralino masses. Taking recent results from LHC SUSY and Higgs searches into account, we consider three phenomenological scenarios, each displaying characteristic features. Our analysis demonstrates how an accurate determination of the desired parameters is possible, and could additionally provide access to the stop masses and mixing angle. △ Less", "We extend the formalism developed in Ref. [20] for the renormalisation of the chargino-neutralino sector to the most general case of the MSSM with complex parameters. We show that products of imaginary parts arising from MSSM parameters and from absorptive parts of loop integrals can already contribute to predictions for physical observables at the one-loop level, and demonstrate that the consistent treatment of such contributions gives rise to non-trivial structure, either in the field renormalisation constants or the corrections associated with the external legs of the considered diagrams. We furthermore point out that the phases of the parameters in the chargino-neutralino sector do not need to be renormalised at the one-loop level, and demonstrate that the appropriate choice for the mass parameters used as input for the on-shell conditions depends both on the process and the region of MSSM parameter space under consideration. As an application, we compute the complete one-loop results in the MSSM with complex parameters for the process h(a) to chi(i)+chi(j)- (Higgs-propagator corrections have been incorporated up to the two-loop level), which may be of interest for SUSY Higgs searches at the LHC, and for chargino pair-production at an e+e- Linear Collider, e+e- to chi(i)+chi(j)-. We investigate the dependence of the theoretical predictions on the phases of the MSSM parameters, analysing in particular the numerical relevance of the absorptive parts of loop integrals. △ Less", "We further examine the capability of the 7 and 8 TeV LHC to explore the parameter space of the p(henomenological)MSSM with neutralino LSPs. Here we present an updated study employing all of the relevant ATLAS SUSY analyses, as well as all relevant LHC non-MET searches, whose data were publically available as of mid-September 2012. We find that roughly 1/3 of our pMSSM model points are excluded at present with an important role being played by both the heavy flavor and multi-lepton searches, as well as those for heavy stable charged particles. Nonetheless, we find that light gluinos, 1st/2nd generation squarks, and stop/sbottoms (\\lsim 400-700 GeV), as well as models with 1% fine-tuning or better, are still viable in the pMSSM. In addition, we see that increased luminosity at 8 TeV is unlikely to significantly improve the reach of the \"vanilla\" searches. The impact of these null searches on the SUSY sparticle spectrum is discussed in detail and the implications of these results for models with low fine-tuning, a future lepton collider and dark matter searches are examined. △ Less", "We revisit the issue of considering stochasticity of Grassmannian coordinates in N=1 superspace, which was analyzed previously by Kobakhidze {\\it et al}. In this stochastic supersymmetry(SUSY) framework, the soft SUSY breaking terms of the minimal supersymmetric Standard Model(MSSM) such as the bilinear Higgs mixing, trilinear coupling as well as the gaugino mass parameters are all proportional to a single mass parameter ξ, a measure of supersymmetry breaking arising out of stochasticity. While a nonvanishing trilinear coupling at the high scale is a natural outcome of the framework, a favorable signature for obtaining the lighter Higgs boson mass $m_h$ at 125 GeV, the model produces tachyonic sleptons or staus turning to be too light. The previous analyses took $Λ$, the scale at which input parameters are given, to be larger than the gauge coupling unification scale $M_G$ in order to generate acceptable scalar masses radiatively at the electroweak scale. Still this was inadequate for obtaining $m_h$ at 125 GeV. We find that Higgs at 125 GeV is highly achievable provided we are ready to accommodate a nonvanishing scalar mass soft SUSY breaking term similar to what is done in minimal anomaly mediated SUSY breaking (AMSB) in contrast to a pure AMSB setup. Thus, the model can easily accommodate Higgs data, LHC limits of squark masses, WMAP data for dark matter relic density, flavor physics constraints and XENON100 data. In contrast to the previous analyses we consider $Λ=M_G$, thus avoiding any ambiguities of a post-grand unified theory physics. The idea of stochastic superspace can easily be generalized to various scenarios beyond the MSSM . PACS Nos: 12.60.Jv, 04.65.+e, 95.30.Cq, 95.35.+d △ Less", "The Hubble parameter during the inflationary era must be smaller than the gravitino mass if the moduli are stabilized by the Kachru-Kallosh-Linde-Trivedi mechanism. This condition represents the difficulty to combine the low scale SUSY breaking and the high scale inflation. We propose a simple mechanism which can naturally separate the inflation scale from the SUSY breaking scale today. △ Less", "We study a supersymmetric version of the seesaw mechanism type-III considering two variants of the model: a minimal version for explaining neutrino data with only two copies of 24-plet superfields and a model with three generations of 24-plets. The latter predicts in general rates for $μ\\to eγ$ inconsistent with experimental data. However, this bound can be evaded if certain special conditions within the neutrino sector are fulfilled. In case of two 24-plets lepton flavour violation constraints can be satisfied much easier. After specifying the corresponding regions in the CMSSM parameter space we show that under favorable conditions one can test the corresponding flavour structures in the leptonic sector at the LHC. For this we perform Monte Carlo studies for the signals taking also into account the SUSY background. We find that it is only of minor importance for the scenarios studied here. △ Less", "The recent discovery of a new boson at the LHC, which resembles a SM-like Higgs boson with $m_h=125$ GeV, is starting to provide strong guidelines into SUSY model building. For instance, the identification of such a state with the lightest CP-even Higgs boson of the MSSM ($h^0$), requires large values of $\\tanβ$ and/or heavy sfermions. One outcome of this result is the possibility to solve the SUSY flavor and CP problems by decoupling, which points towards some realization of Split-inspired SUSY scenarios, in which scalars are much heavier than gauginos and higgsinos. However, we argue here that the remaining Higgs bosons of the MSSM ($H^0$, $A^0$, $H^{\\pm}$) do not have to be as heavy as the sfermions, and having them with masses near the EW scale does not pose any conflict with current MSSM constraints. We discuss then some SUSY scenarios with heavy sfermions, from a bottom-up approach, which contain the full Higgs sector, as well as a possible dark matter candidate, with masses near the EW scale, and identify distinctive signals from these scenarios that could be searched at the LHC. △ Less", "For a 4D N=1 supersymmetric model with a low SUSY breaking scale (f) and general Kahler potential K(Phi^i,Phi_j^*) and superpotential W(Phi^i) we study, in an effective theory approach, the relation of the goldstino superfield to the (Ferrara-Zumino) superconformal symmetry breaking chiral superfield X. In the presence of more sources of supersymmetry breaking, we verify the conjecture that the goldstino superfield is the (infrared) limit of X for zero-momentum and Lambda->\\infty. (Lambda is the effective cut-off scale). We then study the constraint X^2=0, which in the one-field case is known to decouple a massive sgoldstino and thus provide an effective superfield description of the Akulov-Volkov action for the goldstino. In the presence of additional fields that contribute to SUSY breaking we identify conditions for which X^2=0 remains valid, in the effective theory below a large but finite sgoldstino mass. The conditions ensure that the effective expansion (in 1/Lambda) of the initial Lagrangian is not in conflict with the decoupling limit of the sgoldstino (1/m_sgoldstino\\sim Lambda/f, f<Lambda^2). △ Less", "In this article we compute the two-loop SQCD corrections to Higgs-quark-quark couplings in the generic MSSM generated by diagrams involving squarks and gluinos. We give analytic results for the two-loop contributions in the limit of vanishing external momenta for general SUSY masses valid in the MSSM with general flavour-structure. Working in the decoupling limit (M_SUSY >> v) we resum all chirally enhanced corrections (related to Higgs-quark-quark couplings) up to order α_s^(n+1) tan(β)^n. This resummation allows for a more precise determination of the Yukawa coupling and CKM elements of the MSSM superpotential necessary for the study of Yukawa coupling unification. The knowledge of the Yukawa couplings of the MSSM superpotential in addition allows us to derive the effective Higgs-quark-quark couplings entering FCNC processes. These effective vertices can in addition be used for the calculation of Higgs decays into quarks as long as M_SUSY > M_Higgs holds. Furthermore, our calculation is also necessary for consistently including the chirally enhanced self-energies contributions into the calculation of FCNC processes in the MSSM beyond leading order. At two-loop order, we find an enhancement of the SUSY threshold corrections, induced by the quark self-energies, of approximately 9% for μ=M_SUSY compared to the one-loop result. At the same time, the matching scale dependence of the effective Higgs-quark-quark couplings is significantly reduced. △ Less", "We analyze quantitatively the tuning of composite Higgs models with partial compositeness and its interplay with the predicted Higgs mass. In this respect we identify three classes of models, characterized by different quantum numbers of the fermionic colored resonances associated with the top quark, the so-called top partners. The main result of this classification is that in all models with moderate tuning a light Higgs, of 125 GeV mass, requires the presence of light top partners, around 1 TeV. The minimal tuning is comparable to the one of the most attractive supersymmetric models in particular the ones realizing Natural SUSY. This gives further support to an extensive program of top partners searches at the LHC that can already probe the natural region of composite Higgs models. △ Less", "Recent results from ATLAS gives a Higgs mass of 125.5 GeV, further constrain already highly constrained supersymmetric models such as pMSSM or CMSSM/mSUGRA. Finding potentially discoverable and non-excluded regions of model parameter space is becoming increasingly difficult. Several groups have invested large effort in studying the consequences of Higgs mass bounds, upper limits on rare $B$-meson decays, and limits on relic dark matter density on constrained models, aiming at predicting superpartner masses, and establishing likelihood of SUSY models compared to that of the Standard Model vis-á-vis experimental data. In this paper a framework for efficient search for discoverable, non-excluded regions of different SUSY spaces giving specific experimental signature of interest is presented. The method employs an improved Markov Chain Monte Carlo (MCMC) scheme exploiting an iteratively updated likelihood function to guide search for viable models. Existing experimental and theoretical bounds as well as the LHC discovery potential are taken into account. This includes recent bounds on relic dark matter density, the Higgs sector and rare $B$-mesons decays. A clustering algorithm is applied to classify selected models according to expected phenomenology enabling automated choice of experimental benchmarks and regions to be used for optimizing searches. The aim is to provide experimentalist with a viable tool helping to target experimental signatures to search for, once a class of models of interest is established. As an example a search for viable CMSSM models with $τ$-lepton signatures observable with the 2012 LHC data set is presented. In the search 105209 unique models were probed. From these, ten reference benchmark points covering different ranges of phenomenological observables at the LHC were selected. △ Less", "We study direct detection of dark matter in supersymmetric (SUSY) model where most of SUSY particles have very high-scale masses beyond the weak scale. In the scenario, Wino-like or Higgsino-like neutralino is a good candidate for the dark matter in the universe. The neutralino scatters off nuclei by a Higgs-boson exchange diagram and also electroweak loop diagrams. It is found that the elastic-scattering cross section with nuclei is enhanced or suppressed due to constructive or deconstructive interference among the diagrams. Such a cross section is within the reach of future experiment in some parameter region. △ Less", "We compute how bulk loops renormalize both bulk and brane effective interactions for codimension-two branes in 6D gauged chiral supergravity, as functions of the brane tension and brane-localized flux. We do so by explicitly integrating out hyper- and gauge-multiplets in 6D gauged chiral supergravity compactified to 4D on a flux-stabilized 2D rugby-ball geometry, specializing the results of a companion paper, arXiv:1210.3753, to the supersymmetric case. While the brane back-reaction generically breaks supersymmetry, we show that the bulk supersymmetry can be preserved if the amount of brane-localized flux is related in a specific BPS-like way to the brane tension, and verify that the loop corrections to the brane curvature vanish in this special case. In these systems it is the brane-bulk couplings that fix the size of the extra dimensions, and we show that in some circumstances the bulk geometry dynamically adjusts to ensure the supersymmetric BPS-like condition is automatically satisfied. We investigate the robustness of this residual supersymmetry to loops of non-supersymmetric matter on the branes, and show that supersymmetry-breaking effects can enter only through effective brane-bulk interactions involving at least two derivatives. We comment on the relevance of this calculation to proposed applications of codimension-two 6D models to solutions of the hierarchy and cosmological constant problems. △ Less", "The first LHC results seem to disfavour, from the point of view of naturalness, any constrained MSSM realization with universal conditions at the SUSY-breaking scale. A more motivated scenario is given by split-family SUSY, in which the first two generations of squarks are heavy, compatible with a U(2)^3 flavour symmetry. We consider this flavour symmetry to be broken at a very high scale and study the consequences at low energies through its RGE evolution. Initial conditions compatible with a split scenario are found, and the preservation of correlations from minimal U(2)^3 breaking are checked. The various chiral operators in $ΔF=2$ processes are analyzed, and we show that, due to LHC gluino bounds, the (LL)(RR) operators can not always be neglected. Finally, we also study a possible extension of the U(2)^3 model compatible with the lepton sector. △ Less", "The recent discovery of a 125 GeV Higgs-like resonance at LHC, coupled with the lack of evidence for weak scale supersymmetry (SUSY), have severely constrained SUSY models such as mSUGRA/CMSSM. As LHC probes deeper into SUSY model parameter space, the little hierarchy problem -- how to reconcile the Z and Higgs boson mass scale with the scale of SUSY breaking -- will become increasingly exacerbated unless a sparticle signal is found. We evaluate two different measures of fine-tuning in the mSUGRA/CMSSM model. The more stringent of these, Δ_{HS}, includes effects that arise from the high scale origin of the mSUGRA parameters while the second measure, Δ_{EW}, is determined only by weak scale parameters: hence, it is universal to any model with the same particle spectrum and couplings. Our results incorporate the latest constraints from LHC7 sparticle searches, LHCb limits from B_s ->μ^+μ^- and also require a light Higgs scalar with m_h ~123-127 GeV. We present fine-tuning contours in the m_0 vs. m_{1/2} plane for several sets of A_0 and tan(β) values. We also present results for Δ_{HS} and Δ_{EW} from a scan over the entire viable model parameter space. We find a Δ_{HS} > 10^3, or at best 0.1% fine-tuning. For the less stringent electroweak fine tuning, we find Δ_{EW} > 10^2, or at best 1% fine-tuning. Two benchmark points are presented that have the lowest values of Δ_{HS} and Δ_{EW}. Our results provide a quantitative measure for ascertaining whether or not the remaining mSUGRA/CMSSM model parameter space is excessively fine-tuned, and so could provide impetus for considering alternative SUSY models. △ Less", "We show that inclusion of a TeV scale chiral superfield transforming in the adjoint representation of the color SU(3) to the MSSM particle content modifies the renormalization group running of some parameters in such a way that a 125 GeV mass of the light Higgs boson is accommodated more comfortably than in cMSSM / mSUGRA. Put differently, the introduction of a color adjoint TeV scale superfield helps resurrecting lighter choices for the stop and gluino which are otherwise disfavored in cMSSM / mSUGRA. △ Less", "Most discussion of metastable dynamical supersymmetry breaking (MDSB) has focussed on low energy breaking, as in gauge mediation. It is of interest to consider possible implications for intermediate scale breaking (\"gravity mediation\"), especially as the early LHC results suggest the possibility that supersymmetry, if broken at relatively low energies, might be tuned. A somewhat high scale for susy breaking could ameliorate the usual flavor problems of gravity mediation, resolve the question of cosmological moduli, and account for a Higgs with mass well above $M_Z$. We study MDSB in gravity mediation, especially retrofitted models in which discrete $R$ symmetries play an important role, considering questions including implications of symmetries for $B$ and $A$ terms, and the genericity of split supersymmetry. △ Less", "Inspired by the recent LHC Higgs data and null search results of supersymmetry (SUSY), we scan the parameter space of the Minimal Supersymmetric Standard Model (MSSM) with relatively heavy sparticles (1-3 TeV). Then in the parameter space allowed by current collider experiments and dark matter detections, we calculate the complete one-loop SUSY QCD corrections to $pp\\to b\\bar{b}h$ at the LHC with $\\sqrt{s}=14$ TeV and obtain the following observations: (i) For the large values of $\\tanβ$ and low values of $m_{A}$, the SUSY QCD effects can be quite large, which, however, have been excluded by the latest results of LHC search for $H/A \\to τ^{+}τ^{-}$; (ii) For modest values of $\\tanβ$ and $m_{A}$ which so far survived all experimental constraints, the SUSY QCD corrections can maximally reach about -9%. △ Less", "In a recent paper arXiv:1107.5048, we discussed the correlation between the elastic neutralino-nucleon scattering cross section, constrained by dark matter direct detection experiments, and fine-tuning at tree-level in the electroweak symmetry breaking sector of the Minimal Supersymmetric Standard Model (MSSM). Here, we show that the correlation persists in the Next-to-Minimal Supersymmetric Standard Model (NMSSM), and its variant, lambda-SUSY. Both models are strongly motivated by the recent discovery of a 125 GeV Higgs-like particle. We also discuss the implications of the recently published bound on the direct detection cross section from 225 live days of XENON100 experiment. In both the MSSM and the NMSSM, most of the parameter space with fine-tuning less than 10% is inconsistent with the XENON100 bound. In lambda-SUSY, on the other hand, large regions of completely natural electroweak symmetry breaking are still allowed, primarily due to a parametric suppression of fine-tuning with large λ. The upcoming XENON1T experiment will be able to probe most of the parameter space with less than 1% fine-tuning in all three models. △ Less", "Following up the work of [1] on deformed algebras, we present a class of Poincaré invariant quantum field theories with particles having deformed internal symmetries. The twisted quantum fields discussed in this work satisfy commutation relations different from the usual bosonic/fermionic commutation relations. Such twisted fields by construction are nonlocal in nature. Despite this nonlocality we show that it is possible to construct local interaction Hamiltonians which satisfy cluster decomposition principle and are Lorentz invariant. We further illustrate these ideas by considering global SU(N) symmetries. Specifically we show that twisted internal symmetries can significantly simplify the discussion of the marginal deformations (β-deformations) of the N=4 SUSY theories. △ Less"]