["Searches for supersymmetric partner particles of the top and bottom quarks at the Large Hadron Collider are reviewed. The focus is on the status of searches for a relatively light partner of the top quark performed by the CMS and ATLAS Collaborations. No excess beyond Standard Model expectations is observed and exclusion limits are set on the masses of supersymmetric particles. △ Less", "The structure of the B-L MSSM theory--specifically, the relevant mass scales and soft supersymmetric breaking parameters--is discussed. The space of initial soft parameters is explored at the high scale using random statistical sampling subject to a constraint on the range of dimensionful parameters. For every chosen initial point, the complete set of renormalization group equations is solved. The low energy results are then constrained to be consistent with present experimental data. It is shown that a large set of initial conditions satisfy these constraints and lead to acceptable low energy particle physics. Each such initial point has explicit predictions, such as the exact physical sparticle spectrum--which is presented for two such points. There are also statistical predictions for the masses of the sparticles and the LSP species which are displayed as histograms. Finally, the fine-tuning of the $μ$ parameter--which is always equivalent to or smaller than in the MSSM--is discussed. △ Less", "Finite Unified Theories (FUTs) are N = 1 supersymmetric Grand Unified Theories (GUTs) which can be made finite to all-loop orders, based on the principle of reduction of couplings, and therefore are provided with a large predictive power. We confront the predictions of an SU(5) FUT with the top and bottom quark masses and other low-energy experimental constraints, resulting in a relatively heavy SUSY spectrum, naturally consistent with the non-observation of those particles at the LHC. The light Higgs boson mass is automatically predicted in the range compatible with the Higgs discovery at the LHC. Requiring a light Higgs-boson mass in the precise range of M_h = 125.6 +- 2.1 GeV favors the lower part of the allowed spectrum, resulting in clear predictions for the discovery potential at current and future pp, as well as future e+e- colliders. △ Less", "We study the decay of the lightest neutral Higgs boson to a charm quark pair at full one-loop level in the MSSM with non-minimal quark flavour violation (QFV). In the numerical analysis we consider mixing between the second and the third squark generation and all relevant constraints from B meson data are taken into account. It is shown that the full one-loop corrected decay width can be quite sensitive to the MSSM QFV parameters due to large $\\tilde c - \\tilde t$ mixing and large trilinear couplings. After summarising the theoretical and experimental errors, we conclude that an observation of these SUSY QFV effects is possible at the ILC. △ Less", "We consider a class of models with gauged U(1)_R symmetry in 4D N=1 supergravity that have, at the classical level, a metastable ground state, an infinitesimally small (tunable) positive cosmological constant and a TeV gravitino mass. We analyse if these properties are maintained under the addition of visible sector (MSSM-like) and hidden sector state(s), where the latter may be needed for quantum consistency. We then discuss the anomaly cancellation conditions in supergravity as derived by Freedman, Elvang and Körs and apply their results to the special case of a U(1)_R symmetry, in the presence of the Fayet-Iliopoulos term ($ξ$) and Green-Schwarz mechanism(s). We investigate the relation of these anomaly cancellation conditions to the \"naive\" field theory approach in global SUSY, in which case U(1)_R cannot even be gauged. We show the two approaches give similar conditions. Their induced constraints at the phenomenological level, on the above models, remain strong even if one lifted the GUT-like conditions for the MSSM gauge couplings. In an anomaly-free model, a tunable, TeV-scale gravitino mass may remain possible provided that the U(1)_R charges of additional hidden sector fermions (constrained by the cubic anomaly alone) do not conflict with the related values of U(1)_R charges of their scalar superpartners, constrained by existence of a stable ground state. This issue may be bypassed by tuning instead the coefficients of the Kahler connection anomalies (b_K, b_{CK}). △ Less", "Highlights of the search for SUSY at ATLAS are presented emphasising on the variety of searches that were performed in the LHC Run I in p-p collisions at a centre of mass of 7 TeV and 8TeV. Searches for squars, gluinos, third generation squarks and electroweakinos in R-parity conserving scenarios and an example of searches in R-parity violating scenarios are highlighted. △ Less", "Weak scale supersymmetry (SUSY) remains a prime explanation for the radiative stability of the Higgs field. A natural account of the Higgs boson mass, however, strongly favors extensions of the Minimal Supersymmetric Standard Model (MSSM). A plausible option is to introduce a new supersymmetric sector coupled to the MSSM Higgs fields, whose associated states resolve the little hierarchy problem between the third generation squark masses and the weak scale. SUSY also accomodates a weakly interacting cold dark matter (DM) candidate in the form of a stable neutralino. In minimal realizations, the thus-far null results of direct DM searches, along with the DM relic abundance constraint, introduce a level of fine-tuning as severe as the one due to the SUSY little hierarchy problem. We analyse the generic implications of new SUSY sectors parametrically heavier than the minimal SUSY spectrum, devised to increase the Higgs boson mass, on this little neutralino DM problem. We focus on the SUSY operator of smallest scaling dimension in an effective field theory description, which modifies the Higgs and DM sectors in a correlated manner. Within this framework, we show that recent null results from the LUX experiment imply a tree-level fine-tuning for gaugino DM which is parametrically at least a few times larger than that of the MSSM. Higgsino DM whose relic abundance is generated through a thermal freeze-out mechanism remains also severely fine-tuned, unless the DM lies below the weak boson pair-production threshold. As in the MSSM, well-tempered gaugino-Higgsino DM is strongly disfavored by present direct detection results. △ Less", "In a previous paper we have developed a novel method in order to parametrize the effect of the large number of HETs into as fewer parameters as possible. Apart from its obvious advantages this parametrization serves as a vehicle for the examination of the validity of a minimal SO(10) model concerning a series of constraints. Among them is demand for unification of the gauge couplings, the experimental values of the strong coupling constant and lower experimental bound of the proton lifetime. All of these claims lead to preferred regions both in the soft the superheavy parameter space. In this paper we give the necessary updates of our results which stem mainly from the recent experimental measurements. We also include some additions in our analysis involving the universal trilinear coupling A_0 and the rate x, which is related to superheavy vevs. Finally we cross-check the preferred regions of the parameter space and narrow the even more by applying new constraints based on the results of the LHC experiment for the mass of the Higgs particle and the supersymmetry exclusion limits. △ Less", "We propose that inflation is driven by a (complex) neutral Higgs of the MSSM extension of the SM, in a chaotic-like inflation setting. The SUSY breaking soft term masses are of order $10^{12}-10^{13}$ GeV, which is identified with the inflaton mass scale and is just enough to stabilise the SM Higgs potential. The fine-tuned SM Higgs has then a mass around 126 GeV, in agreement with LHC results. We point out that the required large field excursions of chaotic inflation may be realised in string theory with the (complex) inflaton/Higgs identified with a continuous Wilson line or D-brane position. We show specific examples and study in detail a IIB orientifold with D7-branes at singularities, with SM gauge group and MSSM Higgs sector. In this case the inflaton/Higgs fields correspond to D7-brane positions along a two-torus transverse to them. Masses and monodromy are induced by closed string $G_3$ fluxes, and the inflaton potential can be computed directly from the DBI+CS action. We show how this action sums over Planck suppressed corrections, which amount to a field dependent rescaling of the inflaton fields, leading to a linear potential in the large field regime. We study the evolution of the two components of the Higgs/inflaton and compute the slow-roll parameters for purely adiabatic perturbations. For large regions of initial conditions slow roll inflation occurs and 50-60 efolds are obtained with r>0.07, testable in forthcoming experiments. Our scheme is economical in the sense that both EWSB and inflation originate in the same sector of the theory, all inflaton couplings are known and reheating occurs efficiently. △ Less", "Neutralino pair production via photon-photon collisions is analyzed in the context of Minimal Supersymmetric Standard Model at future linear collider. Since photon does not have self coupling, this process is only possible at Next-to-Leading order and all the possible terms are calculated for the photon-photon interaction, including box, triangles and quartic coupling diagrams. Numerical analysis of the production rates for $ \\tildeχ^0_1 \\tildeχ^0_1$, $ \\tildeχ^0_1 \\tildeχ^0_2$ and $ \\tildeχ^0_2 \\tildeχ^0_2$ are presented for four new distinct benchmark models which are presented in the light of LHC8. Angular dependence of each neutralino pairs for the benchmark points are also presented. Total integrated photonic cross section goes up to $1.23\\;fb$ and $1.26\\;fb$ for the $ \\tildeχ^0_1 \\tildeχ^0_1$ and $ \\tildeχ^0_2 \\tildeχ^0_2$ pairs, respectively for the Radiatively driven natural susy benchmark point. △ Less", "We find and thoroughly study new supergravity domain wall solutions which are holographic realizations of supersymmetry breaking strongly coupled gauge theories. We set ourselves in an N=2 gauged supergravity with a minimal content in order to reproduce a dual N=1 effective SCFT which has a U(1)_R symmetry, a chiral operator whose components are responsible for triggering the RG flow, and an additional U(1)_F symmetry. We present a full three dimensional parameter space of solutions, which generically break supersymmetry. Some known solutions are recovered for specific sets of values of the parameters, with the new solutions interpolating between them. The generic backgrounds being singular, we provide a stability test of their dual theories by showing that there are no tachyonic resonances in the two point correlators. We compute the latter by holographic renormalization. We also carefully analyze the appearance of massless modes, such as the dilaton and the R axion, when the respective symmetries are spontaneously broken, and their lifting when the breaking is explicit. We further comment on the application of such class of backgrounds as archetypes of strongly coupled hidden sectors for gauge mediation of supersymmetry breaking. In particular, we show that it is possible to model in this way all types of hierarchies between the visible sector gaugino and sfermion masses. △ Less", "We explore the pMSSM parameter space in view of the constraints from SUSY and monojet searches at the LHC, from Higgs data and flavour physics observables, as well as from dark matter searches. We show that whilst the simplest SUSY scenarios are already ruled out, there are still many possibilities left over in the pMSSM. We discuss the complementarity between different searches and consistency checks which are essential in probing the pMSSM and will be even more important in the near future with the next round of data becoming available. △ Less", "Non-decoupling D-term extensions of the MSSM enhance the tree-level Higgs mass compared to the MSSM, therefore relax fine-tuning and may allow lighter stops with rather low masses even without maximal mixing. We present the anatomy of various non-decoupling D-term extensions of the MSSM and explore the potential of the LHC and of the International Linear Collider (ILC) to determine their deviations in the Higgs couplings with respect to the Standard Model. Depending on the mass of the heavier Higgs $m_H$, such deviations may be constrained at the LHC and determined at the ILC. We evaluate the Higgs couplings in different models and study the prospects for a model distinction at the different stages of the ILC at $\\sqrt{s}=$250, 500, 1000 GeV, including the full luminosity upgrade and compare it with the prospects at HL-LHC. △ Less", "Supersymmetry is one of the most popular theories that have been proposed to solve or alleviate the Hierarchy Problem and is one of the most active areas of research of Physics beyond the Standard Model at the LHC. In this contribution the results of recent SUSY searches performed by the CMS Collaboration on the 8 TeV dataset collected during 2012 are presented. Emphasis is given to R-parity conserving scenarios, where the Lightest Supersymmetric Particle is stable and may constitute a viable candidate for the Dark Matter in the Universe. △ Less", "We consider the exotic decays of the SM-like Higgs state within the E6 inspired supersymmetric (SUSY) models. In these models the lightest SUSY particle (LSP) can be substantially lighter than 1 eV forming hot dark matter in the Universe. The next--to--lightest SUSY particle (NLSP) also tend to be light. We argue that the NLSP with GeV scale mass may lead to the substantial branching ratio of the nonstandard decays of the SM-like Higgs boson into NLSPs. △ Less", "The latest results from CMS on searches for supersymmetry are presented. Searches involving all-hadronic final states with jets and missing transverse energy, and in final states including one or more isolated leptons are discussed. The results are based on 19.5/fb of LHC proton-proton collisions at sqrt = 8 TeV taken with the CMS detector. △ Less", "In this article we calculate the 1-loop supersymmetric QCD (SQCD) corrections to the decay $\\tilde u_1\\to c \\tildeχ^0_1$ in the MSSM with generic flavour structure. This decay mode is phenomenologically important if the mass difference between the lightest squark $\\tilde u_1$ (which is assumed to be mainly stop-like) and the neutralino LSP $\\tilde χ^0_1$ is smaller than the top mass. In such a scenario $\\tilde u_1\\to t \\tildeχ^0_1$ is kinematically not allowed and searches for $\\tilde u_1\\to W b \\tildeχ^0_1$ and $\\tilde u_1\\to c \\tildeχ^0_1$ are performed. A large decay rate for $\\tilde u_1\\to c \\tildeχ^0_1$ can weaken the LHC bounds from $\\tilde u_1\\to W b χ^0_1$ which are usually obtained under the assumption ${\\rm Br}[\\tilde u_1\\to W b χ^0_1]=100\\%$. We find the SQCD corrections enhance $Γ[\\tilde u_1\\to c \\tildeχ^0_1]$ by approximately 10\\% if the flavour-violation originates from bilinear terms. If flavour-violation originates from trilinear terms, the effect can be $\\pm 50\\%$ or more, depending on the sign of $A^t$. We note that connecting a theory of SUSY breaking to LHC observables, the shift from the $\\overline{\\rm DR}$ to the on-shell mass is numerically very important for light stop decays. △ Less", "While LHC8 Higgs mass and sparticle search constraints favor a multi-TeV value of gravitino mass m_{3/2}, electroweak naturalness favors a superpotential higgsino mass μ~100-200 GeV: the mis-match results in an apparent Little Hierarchy characterized by μ<< m_{3/2}. It has been suggested that the Little Hierarchy arises from a mis-match between Peccei-Quinn (PQ) and hidden sector intermediate scales v_{PQ}<< m_{\\rm hidden}. We examine the Murayama-Suzuki-Yanagida (MSY) model of radiatively-driven PQ symmetry breaking which not only generates a weak scale value of μbut also produces intermediate scale Majorana masses for right-hand neutrinos. For this model, we show ranges of parameter choices with multi-TeV values of m_{3/2} which can easily generate values of μ~100-200 GeV so that the apparent Little Hierarchy suggested from data emerges quite naturally. In such a scenario, dark matter would be comprised of an axion plus a higgsino-like WIMP admixture where the axion mass and higgsino masses are linked by the value of the PQ scale. The required light higgsinos should ultimately be detected at a linear e^+e^- collider with \\sqrt{s}>2m({\\rm higgsino}). △ Less", "It might be expected that only global symmetries are fundamental symmetries of Nature, whereas local symmetries and associated massless gauge fields could solely emerge due to spontaneous breaking of underlying spacetime symmetries involved, such as relativistic invariance and supersymmetry. This breaking, taken in the form of the nonlinear sigma-model type pattern for vector fields or superfields, puts essential restrictions on geometrical degrees of freedom of a physical field system that makes it to adjust itself in such a way that its global internal symmetry G turns into the local symmetry G_{loc}. Remarkably, this emergence process may naturally be triggered by spontaneously broken supersymmetry, as is illustrated in detail by an example of a general supersymmetric QED model which is then extended to electroweak models and grand unified theories. Among others, the U(1)xSU(2) symmetrical Standard Model and flipped SU(5) GUT appear preferable to emerge at high energies. △ Less", "We present the latest results from the MasterCode Collaboration on supersymmetric models, in particular on the CMSSM, the NUHM1, the NUHM2 and the pMSSM. We combine the data from LHC Run I with astrophysical observables, flavor and electroweak precision observables. We determine the best fit regions of these models and analyze the discovery potential of squarks and gluinos at LHC Run II and direct detection experiments. △ Less", "In N=1 supergravity the scalar potential of the hidden sector may have degenerate supersymmetric (SUSY) and non-supersymmetric Minkowski vacua. In this case local SUSY in the second supersymmetric Minkowski phase can be broken dynamically. Assuming that such a second phase and the phase associated with the physical vacuum are exactly degenerate, we estimate the value of the cosmological constant. We argue that the observed value of the dark energy density can be reproduced if in the second vacuum local SUSY breaking is induced by gaugino condensation at a scale which is just slightly lower than Λ_{QCD} in the physical vacuum. The presence of a third degenerate vacuum, in which local SUSY and electroweak (EW) symmetry are broken near the Planck scale, may lead to small values of the quartic Higgs self--coupling and the corresponding beta function at the Planck scale in the phase in which we live. △ Less", "We investigate the prospects of discovering split Supersymmetry at a future 100 TeV proton-proton collider through the direct production of electroweakino next-to-lightest-supersymmetric-particles (NLSPs). We focus on signatures with multi-lepton and missing energy: $3\\ell$, opposite-sign dileptons and same-sign dileptons. We perform a comprehensive study of different electroweakino spectra. A 100 TeV collider with 3000/fb data is expected to exclude Higgsino thermal dark matter candidates with $m_{\\rm{LSP}}\\sim 1 $ TeV if Wino NLSPs are lighter than about 3.2 TeV. The $3\\ell$ search usually offers the highest mass reach, which varies in the range of (2-4) TeV depending on scenarios. In particular, scenarios with light Higgsinos have generically simplified parameter dependences. We also demonstrate that, at a 100 TeV collider, lepton collimation becomes a crucial issue for NLSPs heavier than about 2.5 TeV. We finally compare our results with the discovery prospects of gluino pair productions and deduce which SUSY breaking model can be discovered first by electroweakino searches. △ Less", "We present the first complete calculation of flavour violating lepton decays taking into account all supersymmetric (SUSY) and non-SUSY contributions in the context of the supersymmetric inverse seesaw, a specific SUSY low-scale seesaw model. We consider radiative and 3-body lepton decays as well as neutrinoless $μ-e$ conversion in muonic atoms and perform a full one-loop calculation in the mass basis. Taking CMSSM-like boundary conditions for the soft SUSY breaking parameters, we find that cancellations between different contributions are present in several regions, which might reduce the branching ratios by as much as one order of magnitude. This has important consequences when translating current measurements into constraints and estimating the reach of future experiments, and justifies the use of a full calculation. We also show that the ratio of different cross-sections can discriminate between dominant SUSY or non-SUSY contributions. △ Less", "Constrained supersymmetric models like the CMSSM might look less attractive nowadays because of fine tuning arguments. They also might look less probable in terms of Bayesian statistics. The question how well the model under study describes the data, however, is answered by frequentist p-values. Thus, for the first time, we calculate a p-value for a supersymmetric model by performing dedicated global toy fits. We combine constraints from low-energy and astrophysical observables, Higgs boson mass and rate measurements as well as the non-observation of new physics in searches for supersymmetry at the LHC. Using the framework Fittino, we perform global fits of the CMSSM to the toy data and find that this model is excluded at more than 95% confidence level. △ Less", "Recent CMS searches for di-leptoquark production report local excesses of 2.4$σ$ in a $eejj$ channel and 2.6$σ$ in a $ejj$ missing $p_T$ channel. Here, we simultaneously explain both excesses with resonant slepton production in ${\\mathcal R}-$parity violating supersymmetry (SUSY). We consider resonant slepton production, which decays to a lepton and a chargino/neutralino, followed by three-body decays of the neutralino/chargino via an $\\mathcal{R}-$parity violating coupling. There are regions of parameter space which are also compatible at the 95% confidence level (CL) with a 2.8$σ$ $eejj$ excess in a recent CMS $W_R$ search, while being compatible with other direct search constraints. Phase-II of the GERDA neutrinoless double beta decay ($0νββ$) experiment will probe a sizeable portion of the good-fit region. △ Less", "Sparticle mass hierarchies contain significant information regarding the origin and nature of supersymmetry breaking. The hierarchical patterns are severely constrained by electroweak symmetry breaking as well as by the astrophysical and particle physics data. They are further constrained by the Higgs boson mass measurement. The sparticle mass hierarchies can be used to generate simplified models consistent with the high scale models. In this work we consider supergravity models with universal boundary conditions for soft parameters at the unification scale as well as supergravity models with nonuniversalities and delineate the list of sparticle mass hierarchies for the five lightest sparticles. Simplified models can be obtained by a truncation of these, retaining a smaller set of lightest particles. The mass hierarchies and their truncated versions enlarge significantly the list of simplified models currently being used in the literature. Benchmarks for a variety of supergravity unified models appropriate for SUSY searches at future colliders are also presented. The signature analysis of two benchmark models has been carried out and a discussion of the searches needed for their discovery at LHC RUN-II is given. An analysis of the spin independent neutralino-proton cross section exhibiting the Higgs boson mass dependence and the hierarchical patterns is also carried out. It is seen that a knowledge of the spin independent neutralino-proton cross section and the neutralino mass will narrow down the list of the allowed sparticle mass hierarchies. Thus dark matter experiments along with analyses for the LHC Run-II will provide strong clues to the nature of symmetry breaking at the unification scale. △ Less", "R-symmetry is a fundamental symmetry which can solve the SUSY flavor problem and relax the search limits on SUSY masses. Here we provide a complete next-to-leading order computation and discussion of the lightest Higgs boson mass, the W boson mass and muon decay in the minimal R-symmetric SUSY model (MRSSM). This model contains non-MSSM particles including a Higgs triplet, Dirac gauginos and higgsinos, and leads to significant new tree-level and one-loop contributions to these observables. We show that the model can accommodate the measured values of the observables for interesting regions of parameter space with stop masses of order 1 TeV in spite of the absence of stop mixing. We characterize these regions and provide typical benchmark points, which are also checked against further experimental constraints. A detailed exposition of the model, its mass matrices and its Feynman rules relevant for computations in this paper is also provided. △ Less", "Most phenomenological models of supersymmetry breaking rely on nonzero F-terms rather than nonzero D-terms. An important reason why D-terms are often neglected is that it turns out to be very challenging to realize D-terms at energies parametrically smaller than the Planck scale in supergravity. As we demonstrate in this paper, all conventional difficulties may, however, be overcome if the generation of the D-term is based on strong dynamics. To illustrate our idea, we focus on a certain class of vector-like SUSY breaking models that enjoy a minimal particle content and which may be easily embedded into more complete scenarios. We are then able to show that, upon gauging a global flavor symmetry, an appropriate choice of Yukawa couplings readily allows to dynamically generate a D-term at an almost arbitrary energy scale. This includes in particular the natural and consistent realization of D-terms around, above and below the scale of grand unification in supergravity, without the need for fine-tuning of any model parameters. Our construction might therefore bear the potential to open up a new direction for model building in supersymmetry and early universe cosmology. △ Less", "Between the ATLAS and CMS collaborations at the LHC, hundreds of individual event selections have been measured in the data to look for evidence of supersymmetry at a center of mass energy of 8 TeV. While there is currently no significant evidence for any particular model of supersymmetry, the large number of searches should have produced some large statistical fluctuations. By analyzing the distribution of p-values from the various searches, we determine that the number of excesses is consistent with the Standard Model only hypothesis. However, we do find a shortage of signal regions with far fewer observed events than expected in both the ATLAS and CMS datasets (at $1.65σ$ and $2.77σ$, respectively). While not as compelling as a surplus of excesses, the lack of deficits could be a hint of new physics already in the 8 TeV datasets. △ Less", "Considering the constraints from collider experiments and dark matter detections, we investigate the SUSY effects in the Higgs productions $e^+e^- \\to Zh$ at an $e^+e^-$ collider with a center-of-mass energy above 240 GeV and $γγ\\to h \\to b\\bar{b}$ at a photon collider with a center-of-mass energy above 125 GeV. In the parameter space allowed by current experiments, we find that the SUSY corrections to $e^+e^- \\to Zh$ can reach a few percent and the production rate of $γγ\\to h \\to b\\bar{b}$ can be enhanced by a factor of 1.2 over the SM prediction. We also calculate the exotic Higgs productions $e^+e^-\\to Zh_1$ and $e^+e^-\\rightarrow A_1h$ in the next-to-minimal supersymmetric model (NMSSM) ($h$ is the SM-like Higgs, $h_1$ and $A_1$ are respectively the CP-even and CP-odd singlet-dominant Higgs bosons which can be much lighter than $h$). We find that at a 250 GeV $e^+e^-$ collider the production rates of $e^+e^-\\rightarrow Zh_1$ and $e^+e^-\\to A_1h$ can reach 60 fb and 0.1 fb, respectively. △ Less", "We present SUSY_FLAVOR version 2.5 - program that calculates over 30 low-energy flavor observables in the general $R$-parity conserving MSSM. Comparing to previous versions, in SUSY_FLAVOR v2.5 parameter initialization in SLHA2 formats has been significantly generalized, so that the program accepts most of the output files produced by other libraries analyzing the MSSM phenomenology. Number of bugs and inconsistencies have been fixed, based on users feedback. Calculations of several processes implemented in earlier versions have been corrected. New processes of rare decays of the top quark to Higgs boson have been included. Variables controlling inclusion of contributions from various MSSM sectors have been added. Full updated manual of SUSY_FLAVOR v2.5 integrating the details of the modifications listed below can be found at {\\tt arxiv.org/abs/arXiv:1203.5023}. △ Less", "We consider the case that $μ$-$e$ conversion signal is discovered but other charged lepton flavor violating (cLFV) processes will never be found. In such a case, we need other approaches to confirm the $μ$-$e$ conversion and its underlying physics without conventional cLFV searches. We study R-parity violating (RPV) SUSY models as a benchmark. We briefly review that our interesting case is realized in RPV SUSY models with reasonable settings according to current theoretical/experimental status. We focus on the exotic collider signatures at the LHC ($pp \\to μ^- e^+$ and $pp \\to jj$) as the other approaches. We show the correlations between the branching ratio of $μ$-$e$ conversion process and cross sections of these processes. It is first time that the correlations are graphically shown. We exhibit the RPV parameter dependence of the branching ratio and the cross sections, and discuss the feasibility to determine the parameters. △ Less", "We study dark matter at the MSSM pseudoscalar Higgs resonance (A-funnel), which is one of the few remaining MSSM thermal dark matter candidates in the $100-1000$ GeV range safe from direct detection constraints. To illustrate the various factors at play, this study is performed in two contrasting set-ups: a bottom-up phenomenological MSSM (pMSSM) approach that allows significant freedom, and the top-down, highly constrained Yukawa unified $SO(10)$ GUT model. In the pMSSM, for $μ> 0$, the entire parameter space lies above the coherent neutrino background and mostly within reach of XENON1T and LZ, while blind spots exist at $m_A\\,> \\, 800\\,$GeV for $μ< 0$; the strongest constraints come from $A/H \\rightarrow ττ$ searches at the LHC. For Yukawa unified models, the confluence of $B_s \\rightarrow μ^+ μ^-$ constraints, fits to the bottom quark and Higgs masses, and gluino mass bounds from the LHC result in a prediction: realizing the pseudoscalar resonance $requires$ gaugino mass non-universality, with a mass ratio that is determined to within a small range. △ Less", "We analyze the role of the left-left squark mixing in the rare $K^+ \\rightarrow π^+ν\\barν$ decay within the minimal supersymmetry with a large $\\tanβ$. A Higgs boson mass of 125 GeV has been taken into account leading to correlation between stop masses and trilinear soft supersymmetry breaking coupling $A_{\\tilde{t}}$. We find that measurable effects, similar to that of the well known $LR$ squark mixing terms, are possible for large $A_{\\tilde{t}}$ combined with the off-diagonal $LL$-insertions. Precise measurements of the decay rate are expected from the ongoing NA62 experiment at CERN. We emphasize that the effect we present can put certain limits on the left-left flavor changing structure of the squark mass matrix. △ Less", "As a most natural realization of the Next-to Minimal Supersymmetry Standard Model (NMSSM), λ-SUSY is parameterized by a large λ around one and a low tan$β$ below 10. In this work, we first scan the parameter space of λ-SUSY by considering various experimental constraints, including the limitation from the Higgs data updated by the ATLAS and CMS collaborations in the summer of 2014, then we study the properties of the Higgs bosons. We get two characteristic features of λ-SUSY in experimentally allowed parameter space. One is the triple self coupling of the SM-like Higgs boson may get enhanced by a factor over 10 in comparison with its SM prediction. The other is the pair production of the SM-like Higgs boson at the LHC may be two orders larger than its SM prediction. All these features seems to be unachievable in the Minimal Supersymmetric Standard Model and in the NMSSM with a low λ. Moreover, we also find that naturalness plays an important role in selecting the parameter space of λ-SUSY, and that the Higgs $χ^2$ obtained with the latest data is usually significantly smaller than before due to the more consistency of the two collaboration measurements. △ Less", "This is a compact overview of Higgs sectors in extensions of the MSSM. The focus is on the summary of the main features of models with additional singlets and triplets as well as of models with Dirac gauginos. In addition, also important aspects of models with an extended gauge sector are shown. Finally, I comment on available tools which can be used for an adequate study of non-minimal SUSY models. △ Less", "In full one-loop generality and in next-to-leading order in QCD, we study rare top to Higgs boson flavour changing decay processes $t\\to q h$ with $q=u,c$ quarks, in the general MSSM with R-parity conservation. Our primary goal is to search for enhanced effects on $Br(t\\to q h)$ that could be visible at current and high luminosity LHC running. To this end, we perform an analytical expansion of the amplitude in terms of flavour changing squark mass insertions that treats both cases of hierarchical and degenerate squark masses in a unified way. We identify two enhanced effects allowed by various constraints: one from holomorphic trilinear soft SUSY breaking terms and/or right handed up squark mass insertions and another from non-holomorphic trilinear soft SUSY breaking terms and light Higgs boson masses. Interestingly, even with $\\mathcal{O}(1)$ flavour violating effects in the, presently unconstrained, up-squark sector, SUSY effects on $Br(t\\to q h)$ come out to be unobservable at LHC mainly due to leading order cancellations between penguin and self energy diagrams and the constraints from charge- and colour-breaking minima (CCB) of the MSSM vacuum. An exception to this conclusion may be effects arising from non-holomorphic soft SUSY breaking terms in the region where the CP-odd Higgs mass is smaller than the top-quark mass but this scenario is disfavoured by recent LHC searches. Our calculations for $t\\to q h$ decay are made available in SUSY_FLAVOR numerical library. △ Less", "At this stage of the LHC program, the prospect for a new physics signal in the very rare K ---> pi nu nu bar decays may be dented, but remains well alive thanks to their intrinsic qualities. First, these decays are among the cleanest observables in the quark flavor sector. When combined with their terrible suppression in the Standard Model, they thus offer uniquely sensitive probes. Second, the LHC capabilities are not ideal for all kinds of new physics, even below the TeV scale. For example, rather elusive scenarios like natural-SUSY-like hierarchical spectrum, baryon number violation, or new very light but very weakly interacting particles may well induce deviations in rare K decays. Even though experimentalists should brace themselves for tiny deviations, these modes thus have a clear role to play in the LHC era. △ Less", "We present a summary of results for searches for new particles and interactions at the Fermilab Tevatron collider by the CDF and the D0 experiments. These include results from Run I as well as Run II for the time period up to July 2014. We focus on searches for supersymmetry, as well as other models of new physics such as new fermions and bosons, various models of excited fermions, leptoquarks, technicolor, hidden-valley model particles, long-lived particles, extra dimensions, dark matter particles, and signature-based searches. △ Less", "Separate, validated implementations of the ATLAS and CMS new physics analyses are necessary to fully exploit the potential of these searches. To this end, we use MadAnalysis 5, a public framework for collider phenomenology. In this talk, we present recent developments of MadAnalysis 5, as well as a new public database of reimplemented LHC analyses. The validation of one ATLAS and one CMS search for supersymmetry, present in the database, is also summarized. △ Less", "In the context of a Coleman-Weinberg mechanism for the Higgs boson mass, we address the strong CP problem. We show that a DFSZ-like invisible axion model with a gauge-singlet complex scalar field S, whose couplings to the Standard Model are naturally ultra-weak, can solve the strong CP problem and simultaneously generate acceptable electroweak symmetry breaking. The ultra-weak couplings of the singlet S are associated with underlying approximate shift symmetries that act as custodial symmetries and maintain technical naturalness. The model also contains a very light pseudo-Goldstone dilaton that is consistent with cosmological Polonyi bounds, and the axion can be the dark matter of the universe. We further outline how a SUSY version of this model, which may be required in the context of Grand Unification, can avoid introducing a hierarchy problem. △ Less", "We discuss the ${\\cal O}(α_s)$ supersymmetric QCD corrections to neutralino-stop coannihilation into a top quark and a gluon in the Minimal Supersymmetric Standard Model (MSSM). This particular channel can be numerically important in wide ranges of the MSSM parameter space with rather light stops. We discuss technical details such as the renormalization scheme and the phase-space slicing method with two cutoffs. We also comment on improvements with respect to earlier works on the given process. Further, we study for the first time the phenomenologically very interesting interplay of neutralino-stop coannihilation with neutralino-pair annihilation into quark pairs taking the full next-to-leading order SUSY-QCD corrections into account. We demonstrate that the numerical impact of these corrections on the total (co)annihilation cross section and finally on the theoretically predicted neutralino relic density is significant. △ Less", "Traditional searches for R-parity conserving natural supersymmetry (SUSY) require large transverse mass and missing energy cuts to separate the signal from large backgrounds. SUSY models with compressed spectra inherently produce signal events with small amounts of missing energy that are hard to explore. We use this difficulty to motivate the construction of \"deconstructed\" transverse mass variables which are designed preserve information on both the norm and direction of the missing momentum. We demonstrate the effectiveness of these variables in searches for the pair production of supersymmetric top-quark partners which subsequently decay into a final state with an isolated lepton, jets and missing energy. We show that the use of deconstructed transverse mass variables extends the accessible compressed spectra parameter space beyond the region probed by traditional methods. The parameter space can further be expanded to neutralino masses that are larger than the difference between the stop and top masses. In addition, we also discuss how these variables allow for novel searches of single stop production, in order to directly probe unconstrained stealth stops in the small stop- and neutralino-mass regime. We also demonstrate the utility of these variables for generic gluino and stop searches in all-hadronic final states. Overall, we demonstrate that deconstructed transverse variables are essential to any search wanting to maximize signal separation from the background when the signal has undetected particles in the final state. △ Less", "In this paper we propose a method to compute the running top-Yukawa coupling in supersymmetric models with heavy mass spectrum based on the \"running\" and \"decoupling\" procedure. In order to enable this approach we compute the two-loop SUSY-QCD radiative corrections required in the decoupling process. The method has the advantage that large logarithmic corrections are automatically resummed through the Renormalization Group Equations. As phenomenological application we study the effects of this approach on the prediction of the lightest Higgs boson mass at three-loop accuracy. We observe a significant reduction of the renormalization scale dependence as compared to the direct method, that is based on the conversion relation between the running and pole mass for the top quark. The effect of resummation of large logarithmic contributions consists in an increased prediction for the Higgs boson mass, an observation in agreement with the previous analyses. △ Less", "We consider the case that $μ$-$e$ conversion signal is discovered but other charged lepton flavor violating (cLFV) processes will never be found. In such a case, we need other approaches to confirm the $μ$-$e$ conversion and its underlying physics without conventional cLFV searches. We study R-parity violating (RPV) SUSY models as a benchmark. We briefly review that our interesting case is realized in RPV SUSY models with reasonable settings according to current theoretical/experimental status. We focus on the exotic collider signatures at the LHC ($pp \\to μ^- e^+$ and $pp \\to jj$) as the other approaches. We show the correlations between the branching ratio of $μ$-$e$ conversion process and cross sections of these processes. It is first time that the correlations are graphically shown. We exhibit the RPV parameter dependence of the branching ratio and the cross sections, and discuss the feasibility to determine the parameters. △ Less", "We use our resummed quantum gravity approach to Einstein's general theory of relativity in the context of the Planck scale cosmology formulation of Bonanno and Reuter to estimate the value of the cosmological constant as ρ_Λ=(0.0024 eV)^4. We show that the closeness of this estimate to experiment constrains susy GUT models. We also address various consistency checks on the calculation. △ Less", "In the first part of the review article, we discuss the possibility of realizing \"mu-split-like SUSY\" scenario from a phenomenological model, which we show could be realizable locally as the large volume limit of a type IIB Swiss-Cheese Calabi-Yau orientifold involving a mobile space-time filling D3-brane localized at a nearly special Lagrangian three-cycle embedded in the \"big\" divisor and multiple fluxed stacks of space-time filling D7-branes wrapping the same \"big\" divisor. We show that the mass of one of the Higgs doublets can be produced to be of the order of 125 GeV whereas other Higgs as well as higgsino mass parameter to be very heavy- the \"mu-split-like SUSY\" scenario. Then we discuss the role of the heavy squarks/sleptons and the light Higgs in (i) obtaining long-lived gluinos (ii) in verifying that the NLSPs (squarks/sleptons/neutralino) decay into the LSP (gravitino) respects the BBN constraints with the lifetime of the LSP (gravitino) coming out to be of the order or larger than the age of the universe, (iii) getting gravitino relic abundance of around 0.1, and (iv) obtaining electronic EDM close to the experimental upper bounds. In second part of the review article, we obtain local M-theory uplift of Type IIB background involving non-compact (resolved) warped deformed conifold and (N) space time filling D3-branes placed on the singularity of the conifold, (M) D5-branes wrapped around compact 2-sphere, and (N_f) D7-branes wrapped around non-compact four-cycle via Strominger-Yau-Zaslow's mirror symmetry prescription and show the stability of the solution so obtained. We propose a new MQGP limit corresponding to finite-string-coupling (g_s~ 1)- large-t'Hooft-coupling regime of M-theory. Interestingly, we obtain eta/s=1/4 pi for the uplift and the diffusion constant D~1/T for types IIB/IIA backgrounds in the both limits. △ Less", "A recent CMS search for the right handed gauge boson $W_R$ reports an interesting deviation from the Standard Model. The search has been conducted in the $eejj$ channel and has shown a 2.8$σ$ excess around $m_{eejj} \\sim 2$ TeV. In this work, we explain the reported CMS excess with R-parity violating supersymmetry (SUSY). We consider resonant selectron and sneutrino production, followed by the three body decays of the neutralino and chargino via an $\\mathcal{R}-$parity violating coupling. We fit the excess for slepton masses around 2 TeV. The scenario can further be tested in neutrinoless double beta decay ($0νββ$) experiments. GERDA Phase-II will probe a significant portion of the good-fit parameter space. △ Less", "The properties of the deconfined phase of ${\\cal N}=1$ supersymmetric Yang-Mills theory in $(3+1)$-dimensions are studied within a $\\cal T$-matrix formulation of statistical mechanics in which the medium under study is seen as a gas of quasigluons and quasigluinos interacting nonperturbatively. Emphasis is put on the temperature range (1-5)~$T_c$, where the interaction are expected to be strong enough to generate bound states. Binary bound states of gluons and gluinos are indeed found to be bound up to 1.4 $T_c$ for any gauge group. The equation of state is given for SU($N$) and $G_2$; it is found to be nearly independent of the gauge group and very close to that of non-supersymmetric Yang-Mills when normalized to the Stefan-Boltzmann pressure and expressed as a function of $T/T_c$. Finally the orientifold equivalence is shown to hold at the level of the equation of state and its accuracy at $N=3$ is shown to be very good. △ Less", "The dark matter relic density has been measured by Planck and its predecessors with an accuracy of about 2%. We present theoretical calculations with the numerical program DM@NLO in next-to-leading order SUSY QCD and beyond, which allow to reach this precision for gaugino and squark (co-)annihilations, and use them to scan the phenomenological MSSM for viable regions, applying also low-energy, electroweak and hadron collider constraints. △ Less", "We consider the supersymmetry breaking effects on typical inflation models with different types of Kähler potential. The critical size of supersymmetry-breaking scale, above which the flatness of the inflaton potential is spoiled, drastically changes model by model. We present the universal description of such effects in terms of a field-dependent scaling factor by which gravity-mediated supersymmetry breaking terms are suppressed or enhanced, based on the conformal supergravity framework. Such a description would be useful when we estimate them in constructing supersymmetric models of particle cosmology. △ Less", "We investigate the flavour-changing neutral current decay of the lightest stop into a charm quark and the lightest neutralino and its four-body decay into the lightest neutralino, a down-type quark and a fermion pair. These are the relevant stop search channels in the low-mass region. The SUSY-QCD corrections to the two-body decay have been calculated for the first time and turn out to be sizeable. In the four-body decay both the contributions from diagrams with flavour-changing neutral current (FCNC) couplings and the mass effects of final state bottom quarks and $τ$ leptons have been taken into account, which are not available in the literature so far. The resulting branching ratios are investigated in detail. We find that in either of the decay channels the branching ratios can deviate significantly from one in large parts of the allowed parameter range. Taking this into account, the experimental exclusion limits on the stop, which are based on the assumption of branching ratios equal to one, are considerably weakened. This should be taken into account in future searches for light stops at the next run of the LHC, where the probed low stop mass region will be extended. △ Less", "Considering a third-generation squark as the lightest supersymmetric particle (LSP), we investigate R-parity violating collider signatures with bilinear LH or trilinear LQD operators that may contribute to observed neutrino masses and mixings. Reinterpreting the LHC 7+8 TeV results of SUSY and leptoquark searches, we find that third-generation squark LSPs decaying to first- or second-generation leptons are generally excluded up to at least about 660 GeV at 95%C.L.. One notable feature of many models is that sbottoms can decay to top quarks and charged leptons that lead to a broader invariant mass spectrum and weaker collider constraints. More dedicated searches with $b$-taggings or top reconstructions are thus encouraged. Finally, we discuss that the recently observed excesses in the CMS leptoquark search can be accommodated by the decay of sbottom LSPs in the LQD$_{113+131}$ model. △ Less", "We make a frequentist analysis of the parameter space of the NUHM2, in which the soft supersymmetry (SUSY)-breaking contributions to the masses of the two Higgs multiplets, $m^2_{H_{u,d}}$, vary independently from the universal soft SUSY-breaking contributions $m^2_0$ to the masses of squarks and sleptons. Our analysis uses the MultiNest sampling algorithm with over $4 \\times 10^8$ points to sample the NUHM2 parameter space. It includes the ATLAS and CMS Higgs mass measurements as well as their searches for supersymmetric jets + MET signals using the full LHC Run~1 data, the measurements of $B_s \\to μ^+ μ^-$ by LHCb and CMS together with other B-physics observables, electroweak precision observables and the XENON100 and LUX searches for spin-independent dark matter scattering. We find that the preferred regions of the NUHM2 parameter space have negative SUSY-breaking scalar masses squared for squarks and sleptons, $m_0^2 < 0$, as well as $m^2_{H_u} < m^2_{H_d} < 0$. The tension present in the CMSSM and NUHM1 between the supersymmetric interpretation of $g_μ- 2$ and the absence to date of SUSY at the LHC is not significantly alleviated in the NUHM2. We find that the minimum $χ^2 = 32.5$ with 21 degrees of freedom (dof) in the NUHM2, to be compared with $χ^2/{\\rm dof} = 35.0/23$ in the CMSSM, and $χ^2/{\\rm dof} = 32.7/22$ in the NUHM1. We find that the one-dimensional likelihood functions for sparticle masses and other observables are similar to those found previously in the CMSSM and NUHM1. △ Less", "We study a realistic top-down M-theory compactification with low-scale effective Supersymmetry, consistent with phenomenological constraints. A combination of top-down and generic phenomenological constraints fix the spectrum. The gluino mass is predicted to be about 1.5 TeV. Three and only three superpartner channels, $\\tilde{g} \\tilde{g}$, $χ_2^0 χ_1^\\pm$ and $χ_1^+ χ_1^-$ (where $χ_2^0, χ_1^\\pm$ are Wino-like), are expected to be observable at LHC-14. We also investigate the prospects of finding heavy squarks and Higgsinos at future colliders. Gluino-stop-top, gluino-sbottom-bottom associated production and first generation squark associated production should be observable at a 100 TeV collider, along with direct production of heavy Higgsinos. Within this framework the discovery of a single sparticle is sufficient to determine uniquely the SUSY spectrum, yielding a number of concrete testable predictions for LHC-14 and future colliders, and determination of $M_{3/2}$ and thereby other fundamental quantities. △ Less", "We study the anatomy and phenomenology of Lepton Flavor Violation (LFV) in the context of Flavored Gauge Mediation (FGM). Within FGM, the messenger sector couples directly to the MSSM matter fields with couplings controlled by the same dynamics that explains the hierarchies in the SM Yukawas. Although the pattern of flavor violation depends on the particular underlying flavor model, FGM provides a built-in flavor suppression similar to wave function renormalization or SUSY Partial Compositeness. Moreover, in contrast to these models, there is an additional suppression of left-right (LR) flavor transitions by third-generation Yukawas that in particular provides an extra protection against flavor-blind phases. We exploit the consequences of this setup for lepton flavor phenomenology, assuming that the new couplings are controlled by simple U(1) flavor models that have been proposed to accommodate large neutrino mixing angles. Remarkably, it turns out that in the context of FGM these models can pass the impressive constraints from LFV processes and leptonic EDMs even for light superpartners, therefore offering the possibility of resolving the longstanding muon g-2 anomaly. △ Less", "Taking the supersymmetric inverse seesaw mechanism as the explanation for neutrino oscillation data, we investigate charged lepton flavor violation in radiative and 3-body lepton decays as well as in neutrinoless $μ-e$ conversion in muonic atoms. In contrast to former studies, we take into account all possible contributions: supersymmetric as well as non-supersymmetric. We take CMSSM-like boundary conditions for the soft supersymmetry breaking parameters. We find several regions where cancellations between various contributions exist, reducing the lepton flavor violating rates by an order of magnitude compared to the case where only the dominant contribution is taken into account. This is in particular important for the correct interpretation of existing data as well as for estimating the reach of near future experiments where the sensitivity will be improved by one to two orders of magnitude. Moreover, we demonstrate that ratios like BR($τ\\to 3 μ$)/BR($τ\\to μe^+ e^-$) can be used to determine whether the supersymmetric contributions dominate over the $W^\\pm$ and $H^\\pm$ contributions or vice versa. △ Less", "Extending previous work on the predictions for the production of supersymmetric (SUSY) particles at the LHC, we present the fully differential calculation of the next-to-leading order (NLO) SUSY-QCD corrections to the production of squark and squark-antisquark pairs of the first two generations. The NLO cross sections are combined with the subsequent decay of the final state (anti)squarks into the lightest neutralino and (anti)quark at NLO SUSY-QCD. No assumptions on the squark masses are made, and the various subchannels are taken into account independently. In order to obtain realistic predictions for differential distributions the fixed-order calculations have to be combined with parton showers. Making use of the Powheg method we have implemented our results in the Powheg-Box framework and interfaced the NLO calculation with the parton shower Monte Carlo programs Pythia6 and Herwig++. The code is publicly available and can be downloaded from the Powheg-Box webpage. The impact of the NLO corrections on the differential distributions is studied and parton shower effects are investigated for different benchmark scenarios. △ Less", "We revisit the cosmological aspects of axion models. In the high-scale inflation scenario, the Peccei-Quinn (PQ) symmetry is likely to be restored during/after inflation. If the curvature of the PQ scalar potential at the origin is smaller than its vacuum expectation value; for instance in a class of SUSY axion models, thermal inflation happens before the radial component of the PQ scalar (saxion) relaxes into the global minimum of the potential and the decay of saxion coherent oscillation would produce too much axion dark radiation. In this paper, we study how to avoid the overproduction of axion dark radiation with some concrete examples. We show that, by taking account of the finite-temperature dissipation effect appropriately, the overproduction constraint can be relaxed since the PQ scalar can take part in the thermal plasma again even after the PQ phase transition. We also show that it can be further relaxed owing to the late time decay of another heavy CP-odd scalar, if it is present. △ Less", "The parameter space of the MSSM can be probed via many avenues, such as by pre- cision measurements of the couplings of the ~126 GeV Higgs boson, as well as the direct searches for SUSY partners. We examine the connection between these two collider observables at the LHC and ILC in the 19/20-parameter p(henomenological)MSSM. Within this scenario, we address two questions: (i) How will potentially null direct searches for SUSY at the LHC influence the predicted properties of the lightest SUSY Higgs boson? (ii) What can be learned about the properties of the superpartners from precision measurements of the Higgs boson couplings? In this paper, we examine these questions by employing three different large sets of pMSSM models with either the neutralino or gravitino being the LSP. We make use of the ATLAS direct SUSY searches at the 7/8 TeV LHC as well as expected results from 14 TeV operations, and the anticipated precision measurements of the Higgs Boson couplings at the 14 TeV LHC and at the ILC. We demonstrate that the future Higgs coupling determinations can deeply probe the pMSSM parameter space and, in particular, can observe the effects of models that are projected to evade the direct searches at the 14 TeV LHC with 3 inverse ab of integrated luminosity. In addition, we compare the reach of the Higgs coupling determinations to the direct heavy Higgs searches in the MA - tan beta plane and show that they cover orthogonal regions. This analysis demonstrates the complementarity of the direct and indirect approaches in searching for Supersymmetry, and the importance of precision studies of the properties of the Higgs Boson. △ Less", "Decomposing the Higgs potential $\\mathcal{V}_{higgs}$ of next - to - Minimal Supersymmetric Standard Model (n-MSSM) \\ as the sum of three contributions like $\\mathcal{V}_{ch}+\\mathcal{V}_{kah}+\\mathcal{V}_{expl}$ and assuming the two following things: $\\left( a\\right) $ $\\mathcal{V}_{higgs}$ dominated by $\\mathcal{V}_{ch}$ coming from the chiral sector of supersymmetry: $\\mathcal{V}_{ch}=\\left \\vert \\mathrm{ν}\\right \\vert ^{2}\\mathcal{U}$ with $\\left \\vert \\mathrm{ν}\\right \\vert $ large and $\\frac{\\mathrm{r}}{\\left \\vert \\mathrm{ν}\\right \\vert }<<1$; and $\\left( b\\right) $ replacing the chiral down Higgs superfield doublet $\\left( \\boldsymbol{H}_{d}\\right) ^{i}$ of n-MSSM by a chiral anti-doublet $\\left( \\boldsymbolΦ_{d}\\right) _{i}$; we derive the explicit geometry of the Higgs fields in the ground state $\\left \\vert Σ_{higgs}\\right \\rangle $ found to be given by two intersecting conifolds. We show as well that the property $\\tan β_{susy}=1$ living at singularity $r=0$ is a supersymmetric signal; and deviation away reads in terms of the Kahler parameter $r$ and the $\\vartheta_{_{W}}$- Weinberg angle as $\\tan β\\simeq1+\\frac{\\mathrm{r}}{2\\left \\vert \\mathrm{ν}\\right \\vert }\\sin^{2}\\vartheta _{_{W}}$. Other related issues are also studied. △ Less", "We study SUSY signatures at the 7, 8 and 14 TeV LHC employing the 19-parameter, R-Parity conserving p(henomenological)MSSM, in the scenario with a neutralino LSP. Our results were obtained via a fast Monte Carlo simulation of the ATLAS SUSY analysis suite. The flexibility of this framework allows us to study a wide variety of SUSY phenomena simultaneously and to probe for weak spots in existing SUSY search analyses. We determine the ranges of the sparticle masses that are either disfavored or allowed after the searches with the 7 and 8 TeV data sets are combined. We find that natural SUSY models with light squarks and gluinos remain viable. We extrapolate to 14 TeV with both 300 fb$^{-1}$ and 3 ab$^{-1}$ of integrated luminosity and determine the expected sensitivity of the jets + MET and stop searches to the pMSSM parameter space. We find that the high-luminosity LHC will be powerful in probing SUSY with neutralino LSPs and can provide a more definitive statement on the existence of natural Supersymmetry. △ Less", "Assuming that supersymmetry exists well above the weak scale, we derive the full one-loop matching conditions between the SM and the supersymmetric theory, allowing for the possibility of an intermediate Split-SUSY scale. We also compute two-loop QCD corrections to the matching condition of the Higgs quartic coupling. These results are used to improve the calculation of the Higgs mass in models with high-scale supersymmetry or split supersymmetry, reducing the theoretical uncertainty. We explore the phenomenology of a mini-split scenario with gaugino masses determined by anomaly mediation. Depending on the value of the higgsino mass, the theory predicts a variety of novel possibilities for the dark-matter particle. △ Less", "Recently, it has been argued that various measures of SUSY naturalness-- electroweak, Higgs mass and EENZ/BG-- when applied consistently concur with one another and make very specific predictions for natural supersymmetric spectra. Highly natural spectra are characterized by light higgsinos with mass not too far from m_h and well-mixed but TeV-scale third generation squarks. We apply the unified naturalness measure to the case of heavy Higgs bosons A, H and H^\\pm. We find that their masses are bounded from above by naturalness depending on tan(beta): e.g. for 10% fine-tuning and tan(beta)~ 10, we expect m_A< 2.5 TeV whilst for 3% fine-tuning and tan(beta) as high as 50, then m_A< 8 TeV. Furthermore, the presence of light higgsinos seriously alters the heavy Higgs boson branching ratios, thus diminishing prospects for usual searches into Standard Model (SM) final states, while new discovery possibilities arise due to the supersymmetric decay modes. The heavy SUSY decay modes tend to be H, A, H^\\pm-> W, Z, or h+MET + soft tracks so that single heavy Higgs production is characterized by the presence of high p_T W, Z or h bosons plus missing E_T. These new heavy Higgs boson signatures seem to be challenging to extract from SM backgrounds. △ Less", "We investigate the sources of the Hubble-induced mass for a flat direction in supersymmetric theories and show that the sign of the Hubble-induced mass generally changes just after the end of inflation. This implies that global cosmic strings generally form after the end of inflation in most supersymmetric models, including the Minimal Supersymmetric Standard Model. The cosmic strings emit gravitational waves whose frequency corresponds to the Hubble scale, until they disappear when the Hubble parameter decreases down to the soft mass of the flat direction. As a result, the peak frequency of gravitational waves is related to the supersymmetric scale. The observation of this gravitational wave signal will give us information of supersymmetric scale and reheating temperature. △ Less", "A future 100 TeV pp collider will explore energies much higher than the scale of electroweak (EW) symmetry breaking. In this paper we study some of the phenomenological consequences of this fact, concentrating on enhanced bremsstrahlung of EW gauge bosons. We survey a handful of possible new physics experimental searches one can pursue at a 100 TeV collider using this phenomenon. The most dramatic effect is the non-negligible radiation of EW gauge bosons from neutrinos, making them partly visible objects. The presence of collinear EW radiation allows for the full reconstruction of neutrinos under certain circumstances. We also show that the presence of EW radiation allows one to distinguish the $SU(2)$ quantum numbers of various new physics particles. We consider examples of two completely different new physics paradigms, additional gauge groups and SUSY, where the bremsstrahlung radiation of $W$ and $Z$ from $W'$s, $Z'$s or stops allows one to determine the couplings and the mixing angles of the new particles (respectively). Finally, we show how the emission of $W$s and $Z$s from high $p_T$ Higgs bosons can be used to test the couplings of new physics to the Higgs boson. △ Less", "We analyze minimal supersymmetric models in order to determine in what parameter regions with what amount of fine-tuning they are capable of accomodating the LHC-allowed top-stop degeneracy window. The stops must be light enough to enable Higgs naturalness yet heavy enough to induce a 125 GeV Higgs boson mass. These two constraints imply a large mass splitting. By an elaborate scan of the parameter space, we show that stop-on-top scenario requires at least Delta_CMSSM ~ O(10^4) fine-tuning in the CMSSM. By relaxing the CMSSM parameter space with nonuniversal Higgs masses, we find that Delta_NUHM1 ~ O(10^4). The CMSSM with gravitino LSP works slightly better than the NUHM1 model. Compared to all these, the CMSSM with mu<0 and nonuniversal gauginos yield a much smaller fine-tuning Delta_{mu,g} ~ O(100). Our results show that gaugino sector can pave the road towards a more natural stop-on-top scenario. △ Less", "To escape the current LHC supersymmetry (SUSY) search constraints while preserve the naturalness condition, we propose the heavy Lightest Supersymmetric Particle (LSP) SUSY. According to the different dependence on the LSP mass, we systematically classify the discriminating variables into three categories. We find the strong dependence of all current SUSY searches on variables in the first category render the weak sensitivity for the heavy LSP SUSY. Especially, all the current LHC SUSY search constraints can be evaded if the LSP mass is around 600 GeV or higher. In the Minimal Supersymmetric Standard Model (MSSM), we find that the heavy LSP SUSY does not induce more fine-tuning than Higgs boson mass. Moreover, the muon anomalous magnetic moment can be satisfied within 3-$σ$ level. We systematically study the viable parameter space for heavy LSP SUSY, and present four benchmark points which realize our proposal concretely. An improved collider search for those benchmark points, which mainly relies on the variable in the second category, is discussed in detail. △ Less", "The scalar particle recently discovered at the LHC has the same gauge quantum numbers as the neutrino, so they could be one the superpartner of the other. We discuss the conditions that should be satisfied in order to realize such identification and present a model where this is realized. This model possesses an interesting phenomenology that we present here. △ Less", "Theories with extra-dimensional coordinates provide interesting mechanisms to achieve the rupture of symmetries. Here we present a novel alternative to the usual geometric considerations to achieve supersymmetric breaking for an extra-dimensional Wess-Zumino model. A supersymmetric model is constructed where the superpotential contains an effective supersymmetric non renormalizable operator, which generates, after compactification, the explicitly rupture of supersymmetry for the excited Kaluza-Klein excitations. The supersymmetry breaking is, in turn, communicated, by the radiatives corrections, to the zero mode. △ Less", "Increasingly stringent limits from LHC searches for new physics, coupled with lack of convincing signals of weakly interacting massive particle (WIMP) in dark matter searches, have tightly constrained many realizations of the standard paradigm of thermally produced WIMPs as cold dark matter. In this article, we review more generally both thermally and non-thermally produced dark matter (DM). One may classify DM models into two broad categories: one involving bosonic coherent motion (BCM) and the other involving WIMPs. BCM and WIMP candidates need, respectively, some approximate global symmetries and almost exact discrete symmetries. Supersymmetric axion models are highly motivated since they emerge from compelling and elegant solutions to the two fine-tuning problems of the Standard Model: the strong CP problem and the gauge hierarchy problem. We review here non-thermal relics in a general setup, but we also pay particular attention to the rich cosmological properties of various aspects of mixed SUSY/axion dark matter candidates which can involve both WIMPs and BCM in an interwoven manner. We also review briefly a panoply of alternative thermal and non-thermal DM candidates. △ Less", "We discuss the sparticle (and Higgs) spectrum in a class of flavor symmetry-based minimal supersymmetric standard models, referred to here as sMSSM. In this framework the SUSY breaking Lagrangian takes the most general form consistent with a grand unified symmetry such as SO(10) and a non-Abelian flavor symmetry acting on the three families with either a 2+1 or a 3 family assignment. Models based on gauged SU(2) and SO(3) flavor symmetry, as well as non-Abelian discrete symmetries such as S_3 and A_4, have been suggested which fall into this category. These models describe supersymmetry breaking in terms of seven phenomenological parameters. The soft supersymmetry breaking masses at M_GUT of all sfermions of the first two families are equal in sMSSM, which differ in general from the corresponding third family mass. In such a framework we show that the muon g-2 anomaly, the observed Higgs boson mass of ~ 125 GeV, and the observed relic neutralino dark matter abundance can be simultaneously accommodated. The resolution of the muon g-2 anomaly in particular yields the result that the first two generation squark masses, as well the gluino mass, should be <~ 2 TeV, which will be tested at LHC14. △ Less", "Non-universal gaugino mass models can naturally account for the dark matter relic density via the bulk annihilation process with relatively light bino LSP and right sleptons in the mass range of ~ 100 GeV, while accommodating the observed Higgs boson mass of ~ 125 GeV with TeV scale squark/gluino masses. A class of these models can also account for the observed muon g-2 anomaly via SUSY loops with wino and left sleptons in the mass range of 400 -- 700 GeV. These models can be tested at LHC via electroweak production of charged and neutral wino pair, leading to robust trilepton and same sign dilepton signals. We investigate these signals along with the standard model background for both 8 and 13 TeV LHC runs. △ Less", "We investigate the IR dynamics of N=2 SUSY gauge theories in 3D with antisymmetric matter. The presence of the antisymmetric fields leads to further splitting of the Coulomb branch. Counting zero modes in the instanton background suggests that more than a single direction along the Coulomb branch may remain unlifted. We examine the case of SU(4) with one or two antisymmetric fields and various flavors in detail. Using the results for the corresponding 4D theories, we find the IR dynamics of the 3D cases via compactification and a real mass deformation. We find that for the s-confining case with two antisymmetric fields, a second unlifted Coulomb branch direction indeed appears in the low-energy dynamics. We present several non-trivial consistency checks to establish the validity of these results. We also comment on the expected structure of general s-confining theories in 3D, which might involve several unlifted Coulomb branch directions. △ Less", "We present a class of supersymmetric models in which symmetry considerations alone dictate the form of the soft SUSY breaking Lagrangian. We develop a class of minimal models, denoted as sMSSM -- for flavor symmetry-based minimal supersymmetric standard model, which respect a grand unified symmetry such as SO(10) and a non-Abelian flavor symmetry H which suppresses SUSY-induced flavor violation. Explicit examples are constructed with the flavor symmetry being gauged SU(2)_H and SO(3)_H with the three families transforming as 2 + 1 and 3 representations respectively. A simple solution is found in the case of SU(2)_H for suppressing the flavor violating D--terms based on an exchange symmetry. Explicit models based on SO(3)_H without the D--term problem are developed. In addition, models based on discrete non-Abelian flavor groups are presented which are automatically free from D--term issues. The permutation group S_3 with a 2 + 1 family assignment, as well as the tetrahedral group A_4 with a 3 assignment are studied. In all cases, a simple solution to the SUSY CP problem is found, based on spontaneous CP violation leading to a complex quark mixing matrix. We develop the phenomenology of the resulting sMSSM, which is controlled by seven soft SUSY breaking parameters for both the 2 + 1 assignment and the 3 assignment of fermion families. These models are special cases of the phenomenological MSSM (pMSSM), but with symmetry restrictions. We discuss the parameter space of sMSSM compatible with LHC searches, B physics constraints and dark matter relic abundance. Fine-tuning in these models is relatively mild, since all SUSY particles can have masses below about 3 TeV. △ Less", "Are topological solitons elementary or composites? We answer this question by drawing up a corpuscular formalism in which solitons are coherent states of quantum constituents. This naturally leads to a functional integral representation, in which the classical saddle point is reached as the most probable distribution of corpuscles in the $\\hbar = 0$ limit and where quantum corpuscular corrections correspond to excursions away from such a distribution that occur only for finite $\\hbar$. Several striking features come up. Topological charge emerges as a collective flow of quantum numbers carried by individual corpuscles. Moreover, the corpuscular corrections are not reducible to any known form of quantum corrections, such as loop expansions in the coupling constant $\\hbar g^2$ or semiclassical $e^{-1/\\hbar g^2}$ effects. Corpuscular corrections are stronger and appear already at order $\\sqrt{\\hbar g^2}$. In SUSY theories quantum corpuscular corrections generically break supersymmetry. We show that a domain wall which perturbatively is a BPS state, violates all supersymmetries when the corpuscular effects are taken into account. The extension of the corpuscular structure to $D$-branes can lead to a built-in supersymmetry breaking mechanism in string theory, insensitive to technicalities such as moduli stabilization, with the SUSY breaking scale set by the string coupling times the $D$-brane tension. △ Less", "Within the minimal supersymmetric extension of the Standard Model (MSSM) the associated production of neutral Higgs bosons with top and bottom quarks belongs to the most important Higgs-boson production processes at the LHC. At large values of tan(beta), in particular, bottom--Higgs associated production constitutes the dominant production channel within the MSSM. We have calculated the next-to-leading-order supersymmetric QCD corrections to neutral Higgs production through the parton processes q qbar, gg -> t tbar / b bbar + h/H/A and present results for the total cross sections. The genuine SUSY-QCD corrections are of moderate size for small tan(beta), but can be sizable for large tan(beta). In the latter case the bulk of these corrections can be absorbed into effective bottom Yukawa couplings. △ Less", "Recently, in February 2014, we held a comprehensive meeting at UCLA on the Search for Dark Matter. 190 scientists came to the meeting, many of the leaders in the field of WIMP Dark Matter searches. We first review the data from LUX that excludes the low-mass WIMP region and slightly lowers the XENON100 limits. We provide a brief review of the problems with the claimed low-mass signals. We discuss the current expectations for SUSY-WIMP Dark Matter and show why very massive detectors like Darwin may be required. We discuss some theoretical predictions from the meeting. △ Less", "In this paper, we give a systematic procedure for building locally stable dS vacua in $\\mathcal{N}=1$ supergravity models motivated by string theory. We assume that one of the superfields has a Kahler potential of no-scale type and impose a hierarchy of supersymmetry breaking conditions. In the no-scale modulus direction the supersymmetry breaking is not small, in all other directions it is of order $ε$. We establish the existence of an abundance of vacua for large regions in the parameter space spanned by $ε$ and the cosmological constant. These regions exist regardless of the details of the other moduli, provided the superpotential can be tuned such that the off-diagonal blocks of the mass matrix are parametrically small. We test and support this general dS landscape construction by explicit analytic solutions for the STU model. The Minkowski limits of these dS vacua either break supersymmetry or have flat directions in agreement with a no-go theorem that we prove, stating that a supersymmetric Minkowski vacuum without flat directions cannot be continuously deformed into a non-supersymmetric vacuum. We also describe a method for finding a broad class of stable supersymmetric Minkowski vacua that can be F-term uplifted to dS vacua and which have an easily controllable SUSY breaking scale. △ Less", "In Split-SUSY with BRpV we show that the Gravitino DM solution is consistent with experimental evidence on its relic density and life time. We arrive at this conclusion by performing a complete numerical and algebraic study of the parameter space, including constraints from the recently determined Higgs mass, updated neutrino physics, and BBN constraints on NLSP decays. The Higgs mass requires a relatively low Split-SUSY mass scale, which is naturally smaller than usual values for reheating temperature, allowing the use of the standard expression for the relic density. We include restrictions from neutrino physics with three generations, and notice that the gravitino decay width depends on the atmospheric neutrino mass scale. We calculate the neutralino decay rate and find it consistent with BBN. We mention some implications on indirect DM searches. △ Less", "We study the neutralino being the Lightest Supersymmetric Particle (LSP) as a cold Dark Matter (DM) candidate with a mass less than 40 GeV in the framework of the Next-to-Minimal-Supersymmetric-Standard-Model (NMSSM). We find that with the current collider constraints from LEP, the Tevatron and the LHC, there are three types of light DM solutions consistent with the direct/indirect searches as well as the relic abundance considerations: (i) A1, H1-funnels, (ii) stau coannihilation and (iii) sbottom coannihilation. Type-(i) may take place in any theory with a light scalar (or pseudo-scalar) near the LSP pair threshold; while Type-(ii) and (iii) could occur in the framework of Minimal-Supersymmetric-Standard-Model (MSSM) as well. We present a comprehensive study on the properties of these solutions and point out their immediate relevance to the experiments of the underground direct detection such as superCDMS and LUX/LZ, and the astro-physical indirect search such as Fermi-LAT. We also find that the decays of the SM-like Higgs boson may be modified appreciably and the new decay channels to the light SUSY particles may be sizable. The new light CP-even and CP-odd Higgs bosons will decay to a pair of LSPs as well as other observable final states, leading to interesting new Higgs phenomenology at colliders. For the light sfermion searches, the signals would be very challenging to observe at the LHC given the current bounds. However, a high energy and high luminosity lepton collider, such as the ILC, would be able to fully cover these scenarios by searching for events with large missing energy plus charged tracks or displaced vertices. △ Less", "We explore naturalness constraints on the masses of the heavy Higgs bosons H^0, H^+/-, and A^0 in supersymmetric theories. We show that, in any extension of MSSM which accommodates the 125 GeV Higgs at the tree level, one can derive an upper bound on the SUSY Higgs masses from naturalness considerations. As is well-known for the MSSM, these bounds become weak at large tan beta. However, we show that measurements of b to s gamma together with naturalness arguments lead to an upper bound on tan beta, strengthening the naturalness case for heavy Higgs states near the TeV scale. The precise bound depends somewhat on the SUSY mediation scale: allowing a factor of 10 tuning in the stop sector, the measured rate of b to s gamma implies tan beta < 30 for running down from 10 TeV but tan beta < 4 for mediation at or above 100 TeV, placing m_A near the TeV scale for natural EWSB. Because the signatures of heavy Higgs bosons at colliders are less susceptible to being \"hidden\" than standard superpartner signatures, there is a strong motivation to make heavy Higgs searches a key part of the LHC's search for naturalness. In an appendix we comment on how the Goldstone boson equivalence theorem links the rates for H to hh and H to ZZ signatures. △ Less", "The basic principle of naturalness has driven the majority of the LHC program, but so far all searches for new physics beyond the SM have come up empty. On the other hand, existing measurements of SM processes contain interesting anomalies, which allow for the possibility of new physics with mass scales very close to the Electroweak Scale. In this paper we show that SUSY could have stops with masses ~ O(200) GeV based on an anomaly in the WW cross section, measured by both ATLAS and CMS at 7 and 8 TeV. In particular we show that there are several different classes of stop driven scenarios that not only evade all direct searches, but improve the agreement with the data in the SM measurement of the WW cross section. △ Less", "We discuss the consequences of relaxing the Minimal Flavour Violation assumption in the up-squark sector on the phenomenology of SUSY models. We study the impact of the off-diagonal entries in the soft SUSY-breaking matrices on the mass of the lightest Higgs scalar and we derive the approximate analytical formulae that quantify this effect. We show that $m_h$ can be enhanced by up to 13-14 GeV in the case of the phenomenological MSSM with the inverted hierarchy of masses in the squark sector and zero stop mixing, and up to 4-5 GeV in GUT-constrained scenarios where the magnitude of the enhancement is mitigated by renormalization group effects. We also perform a global analysis of an inverted hierarchy GFV scenario, taking into account the experimental bounds from the measurements of relic density, EW precision observables and B-physics. We show that the allowed parameter space of the model is strongly constrained by $m_W$, $\\sin^2θ_{eff}$ and $BR(B_s \\to μ^+μ^-)$, requiring $m_0(3)$<1500 GeV and $m_{1/2}$<1800 GeV, as well as a large non-zero (2,3) entry in the up-squark trilinear matrix. △ Less", "Radiatively generated neutrino masses ($m_ν$) are proportional to supersymmetry (SUSY) breaking, as a result of the SUSY non-renormalisation theorem. In this work, we investigate the space of SUSY radiative seesaw models with regard to their dependence on SUSY breaking ($\\require{cancel}\\cancel{\\text{SUSY}}$). In addition to contributions from sources of $\\cancel{\\text{SUSY}}$ that are involved in electroweak symmetry breaking ($\\cancel{\\text{SUSY}}_\\text{EWSB}$ contributions), and which are manifest from $\\langle F^\\dagger_H \\rangle = μ\\langle \\bar H \\rangle \\neq 0$ and $\\langle D \\rangle = g \\sum_H \\langle H^\\dagger \\otimes_H H \\rangle \\neq 0$, radiatively generated $m_ν$ can also receive contributions from $\\cancel{\\text{SUSY}}$ sources that are unrelated to EWSB ($\\cancel{\\text{SUSY}}_\\text{EWS}$ contributions). We point out that recent literature overlooks pure-$\\cancel{\\text{SUSY}}_\\text{EWSB}$ contributions ($\\propto μ/ M$) that can arise at the same order of perturbation theory as the leading order contribution from $\\cancel{\\text{SUSY}}_\\text{EWS}$. We show that there exist realistic radiative seesaw models in which the leading order contribution to $m_ν$ is proportional to $\\cancel{\\text{SUSY}}_\\text{EWS}$. To our knowledge no model with such a feature exists in the literature. We give a complete description of the simplest model-topologies and their leading dependence on $\\cancel{\\text{SUSY}}$. We show that in one-loop realisations $L L H H$ operators are suppressed by at least $μ\\, m_\\text{soft} / M^3$ or $m_\\text{soft}^2 / M^3$. We construct a model example based on a one-loop type-II seesaw. An interesting aspect of these models lies in the fact that the scale of soft-$\\cancel{\\text{SUSY}}$ effects generating the leading order $m_ν$ can be quite small without conflicting with lower limits on the mass of new particles. △ Less", "We give a quantitative analysis of the electric dipole moments as a probe of high scale physics. We focus on the electric dipole moment of the electron since the limit on it is the most stringent. Further, theoretical computations of it are free of QCD uncertainties. The analysis presented here first explores the probe of high scales via electron EDM within MSSM where the contributions to the electric dipole moment (EDM) arise from the chargino and the neutralino exchanges in loops. Here it is shown that the electron EDM can probe mass scales from tens of TeV into the PeV range.The analysis is then extended to include a vectorlike generation which can mix with the three ordinary generations. Here new CP phases arise and it is shown that the electron EDM now has not only a supersymmetric contribution from the exchange of charginos and neutralinos but also a non-supersymmetric contribution from the exchange of W and Z bosons. It is further shown that the interference of the supersymmetric and the non-supersymmetric contribution leads to the remarkable phenomenon where the electron EDM as a function of the slepton mass first falls and become vanishingly small and then rises again as the slepton mass increases This phenomenon arises as a consequence of cancellation between the SUSY and the non-SUSY contribution at low scales while at high scales the SUSY contribution dies out and the EDM is controlled by the non-SUSY contribution alone. The high mass scales that can be probed by the EDM are far in excess of what accelerators will be able to probe. The sensitivity of the EDM to CP phases both in the SUSY and the non-SUSY sectors are also discussed. △ Less", "The predicted Standard Model (SM) electric dipole moments (EDMs) of electrons and quarks are tiny, providing an important window to observe new physics. Theories beyond the SM typically allow relatively large EDMs. The EDMs depend on the relative phases of terms in the effective Lagrangian of the extended theory, which are generally unknown. Underlying theories, such as string/M-theories compactified to four dimensions, could predict the phases and thus EDMs in the resulting supersymmetric (SUSY) theory. Earlier one of us, with collaborators, made such a prediction and found, unexpectedly, that the phases were predicted to be zero at tree level in the theory at the unification or string scale $\\sim\\mathcal{O}(10^{16}$ GeV). Electroweak (EW) scale EDMs still arise via running from the high scale, and depend only on the SM Yukawa couplings that also give the CKM phase. Here we extend the earlier work by studying the dependence of the low scale EDMs on the constrained but not fully known fundamental Yukawa couplings. The dominant contribution is from two loop diagrams and is not sensitive to the choice of Yukawa texture. The electron EDM should not be found to be larger than about $ 5\\times 10^{-30} e$ cm, and the neutron EDM should not be larger than about $5\\times 10^{-29}e$ cm. These values are quite a bit smaller than the reported predictions from Split SUSY and typical effective theories, but much larger than the Standard Model prediction. Also, since models with random phases typically give much larger EDMs, it is a significant testable prediction of compactified M-theory that the EDMs should not be above these upper limits. The actual EDMs can be below the limits, so once they are measured they could provide new insight into the fundamental Yukawa couplings of leptons and quarks. We comment also on the role of strong CP violation. EDMs probe fundamental physics near the Planck scale. △ Less", "We examine the evolution of cosmological perturbations in a non-thermal post-inflationary history with a late-time matter domination period prior to BBN. Such a cosmology could arise naturally in the well-motivated moduli scenario in the context of supersymmetry (SUSY) -- in particular in models of Split-SUSY. Sub-horizon dark matter perturbations grow linearly during the matter dominated phase before reheating and can lead to an enhancement in the growth of substructure on small scales, even in the presence of dark matter annihilations. This suggests that a new scale (the horizon size at reheating) could be important for determining the primordial matter power spectrum. However, we find that in many non-thermal models free-streaming effects or kinetic decoupling after reheating can completely erase the enhancement leading to small-scale structures. In particular, in the moduli scenario with wino or higgsino dark matter we find that the dark matter particles produced from moduli decays would thermalize with radiation and kinetically decouple below the reheating temperature. Thus, the growth of dark matter perturbations is not sustained, and the predictions for the matter power spectrum are similar to a standard thermal history. We comment on possible exceptions, but these appear difficult to realize within standard moduli scenarios. We conclude that although enhanced structure does not provide a new probe for investigating the cosmic dark ages within these models, it does suggest that non-thermal histories offer a robust alternative to a strictly thermal post-inflationary history. △ Less", "We discuss how the double missing partner mechanism solution to the doublet-triplet splitting problem in four-dimensional supersymmetric SU(5) Grand Unified Theories (GUTs) can be combined with predictive models for the quark-lepton Yukawa coupling ratios at the GUT scale. It is argued that towards this goal a second SU(5) breaking Higgs field in the adjoint representation is very useful and we discuss all possible renormalizable superpotentials with two adjoint Higgs fields and calculate the constraints on the GUT scale and effective triplet mass from a two-loop gauge coupling unification analysis. Two explicit flavour models with different predictions for the GUT scale Yukawa sector are presented, including shaping symmetries and a renormalizable messenger sector. Towards calculating the rates for proton decay induced by the exchange of colour triplets, the required Clebsch-Gordan coefficients for their couplings are calculated for the possible dimension five and six operators. They are provided in detailed tables in the appendix, together with additional helpful material for GUT flavour model building. △ Less", "Post-sphaleron baryogenesis, a fresh and profound mechanism of baryogenesis accounts for the matter-antimatter asymmetry of our present universe in a framework of Pati-Salam symmetry. We attempt here to embed this mechanism in a non-SUSY SO(10) grand unified theory by reviving a novel symmetry breaking chain with Pati-Salam symmetry as an intermediate symmetry breaking step and as well to address post-sphaleron baryogenesis and neutron-antineutron oscillation in a rational manner. The Pati-Salam symmetry based on the gauge group $SU(2)_L \\times SU(2)_{R} \\times SU(4)_C$ is realized in our model at $10^{5}-10^{6}$ GeV and the mixing time for the neutron-antineutron oscillation process having $ΔB=2$ is found to be $τ_{n-\\bar{n}} \\simeq 10^{8}-10^{10}\\,\\mbox{secs}$ with the model parameters which is within the reach of forthcoming experiments. Other novel features of the model includes low scale right-handed $W^{\\pm}_R$, $Z_R$ gauge bosons, explanation for neutrino oscillation data via gauged inverse (or extended) seesaw mechanism and most importantly TeV scale color sextet scalar particles responsible for observable $n-\\bar{n}$ oscillation which can be accessible to LHC. We also look after gauge coupling unification and estimation of proton life-time with and without the addition of color sextet scalars. △ Less", "I summarize the status of the inclusive SUSY searches conducted by the ATLAS and CMS experiments using the 20 fb-1 of 8 TeV LHC data in the all inclusive, 0 lepton, >=1 lepton and >=2 lepton final states. Current searches show that data are consistent with the SM. The impact of this consistency was explored on a rich variety of SUSY scenarios and simplified models, examples of which I present here. △ Less", "In MSSM models with various boundary conditions for the soft breaking terms (m_{soft}) and for a higgs mass of 126 GeV, there is a (minimal) electroweak fine-tuning Delta\\approx 800 to 1000 for the constrained MSSM and Delta\\approx 500 for non-universal gaugino masses. These values, often regarded as unacceptably large, may indicate a problem of supersymmetry (SUSY) breaking, rather than of SUSY itself. A minimal modification of these models is to lower the SUSY breaking scale in the hidden sector (\\sqrt f) to few TeV, which we show to restore naturalness to more acceptable levels Delta\\approx 80 for the most conservative case of low tan_beta and ultraviolet boundary conditions as in the constrained MSSM. This is done without introducing additional fields in the visible sector, unlike other models that attempt to reduce Delta. In the present case Delta is reduced due to additional (effective) quartic higgs couplings proportional to the ratio m_{soft}/(\\sqrt f) of the visible to the hidden sector SUSY breaking scales. These couplings are generated by the auxiliary component of the goldstino superfield. The model is discussed in the limit its sgoldstino component is integrated out so this superfield is realized non-linearly (hence the name of the model) while the other MSSM superfields are in their linear realization. By increasing the hidden sector scale \\sqrt f one obtains a continuous transition for fine-tuning values, from this model to the usual (gravity mediated) MSSM-like models. △ Less", "We show that the sizable $D$-term contributions to sfermion mass spectrum can be signatures of certain GUT, $E_6\\times SU(2)_F\\times U(1)_A$ GUT. Note that these $D$-term contributions deviate the degenerate sfermion masses among different generations in this model. This is different from the previous works which have argued the $D$-term contributions, which deviate masses only between sfermions with different quantum charges, as a signature of GUT with larger rank unification group. Such $D$-terms are strongly constrained by the FCNC processes if the SUSY breaking scale is the weak scale. However, in $E_6\\times SU(2)_F\\times U(1)_A$, natural SUSY type sfermion mass spectrum is obtained, and if the masses of ${\\bf 10}_3$ sfermions are larger than $O(1{\\rm TeV})$ to realize 126 GeV Higgs and the other sfermion masses are $O(10{\\rm TeV})$, then sizable $D$-term contribution is allowed. If the deviations by these $D$-terms can be observed in future experiments like 100 TeV proton collider or muon collider, we may confirm the $E_6\\times SU(2)_F\\times U(1)_A$ GUT. △ Less", "We study the Higgs boson mass and the spectrum of supersymmetric (SUSY) particles in the well-motivated particle physics model derived from a ten-dimensional supersymmetric Yang-Mills theory compactified on three factorizable tori with magnetic fluxes. This model was proposed in a previous work, where the flavor structures of the standard model including the realistic Yukawa hierarchies are obtained from non-hierarchical input parameters on the magnetized background. Assuming moduli- and anomaly-mediated contributions dominate the soft SUSY breaking terms, we study the precise SUSY spectra and analyze the Higgs boson mass in this mode, which are compared with the latest experimental data. △ Less", "F-theory GUTs provide a promising UV completion for models with approximate gauge coupling unification, such as the (non-supersymmetric) Standard Model. More specifically, if the superparters have masses well above the TeV scale, the resulting imperfection in unification can be accounted for by the, in principle calculable, classical F-theory correction at the high scale. In this paper we argue for the correct form of the F-theory corrections to unification, including KK mode loop effects. However, the price of compensating the imprecise unification in such High Scale SUSY models with F-theory corrections is that the GUT scale is lowered, potentially leading to a dangerously high proton decay rate from dimension-6 operators. We analyse the possibility of suppressing the decay rate by the localization of $X,Y$ gauge bosons in higher dimensions. While this effect can be very strong for the zero modes, we find that in the simplest models of this type it is difficult to realize a significant suppression for higher modes (Landau levels). Notably, in the absence of substantial suppressions to the proton decay rate, the superpartners must be lighter than 100 TeV to satisfy proton decay constraints. We highlight that multiple correlated signals of proton decay could verify this scenario. △ Less", "In the Minimal Supersymmetric extension of the Standard Model or MSSM, the lighter Higgs boson has a rather large mass, $M_h\\approx 125$ GeV. Together with the non-observation of superpartners at the LHC, this suggests that the SUSY-breaking scale is rather high, $M_S > 1$ TeV. This implies a dramatic simplification of the MSSM Higgs sector that is summarised here. △ Less", "In this paper we present an analysis strategy and a dedicated tool to determine the exclusion confidence level for any scenario involving multiple heavy extra quarks with generic decay channels, as predicted in several extensions of the Standard Model. We have created, validated and used a software package, called XQCAT (eXtra Quark Combined Analysis Tool), which is based on publicly available experimental data from direct searches for top partners and from Supersymmetry inspired searches. By means of this code, we recast the limits from CMS on new heavy extra quarks considering a complete set of decay channels. The resulting exclusion confidence levels are presented for some simple scenarios with multiple states and general coupling assumptions. Highlighting the importance of combining multiple topology searches to obtain accurate re-interpretations of the existing searches, we discuss the reach of the SUSY analyses so as to set bounds on new quark resonances. In particular, we report on the re-interpretation of the existing limits on benchmark scenarios with one and multiple pair-produced top partners having non-exclusive couplings to the third Standard Model generation of quarks. △ Less", "We present statistically convergent profile likelihood maps obtained via global fits of a phenomenological Minimal Supersymmetric Standard Model with 15 free parameters (the MSSM-15), based on over 250M points. We derive constraints on the model parameters from direct detection limits on dark matter, the Planck relic density measurement and data from accelerator searches. We provide a detailed analysis of the rich phenomenology of this model, and determine the SUSY mass spectrum and dark matter properties that are preferred by current experimental constraints. We evaluate the impact of the measurement of the anomalous magnetic moment of the muon ($g-2$) on our results, and provide an analysis of scenarios in which the lightest neutralino is a subdominant component of the dark matter. The MSSM-15 parameters are relatively weakly constrained by current data sets, with the exception of the parameters related to dark matter phenomenology ($M_1$, $M_2$, $μ$), which are restricted to the sub-TeV regime, mainly due to the relic density constraint. The mass of the lightest neutralino is found to be < 1.5 TeV at 99% C.L., but can extend up to 3 TeV when excluding the $g - 2$ constraint from the analysis. Low-mass bino-like neutralinos are strongly favoured, with spin-independent scattering cross-sections extending to very small values, $\\sim 10^{-20}$ pb. ATLAS SUSY null searches strongly impact on this mass range, and thus rule out a region of parameter space that is outside the reach of any current or future direct detection experiment. The best-fit point obtained after inclusion of all data corresponds to a squark mass of 2.3 TeV, a gluino mass of 2.1 TeV and a 130 GeV neutralino with a spin-independent cross-section of $2.4 \\times 10^{-10}$ pb, which is within the reach of future multi-ton scale direct detection experiments and of the upcoming LHC run at increased centre-of-mass energy. △ Less", "The discovery of a large tensor-to-scalar ratio by the BICEP2 experiment points to large field excursions during inflation. One framework that predicts large $r$ is monodromy inflation. While discussed mainly in the context of string theory, the phenomenon can be illustrated and studied in the well-understood framework of SUSY QCD with a large number of colors. We discuss the requirements for viable inflation as well as various difficulties for model building, including tunneling, tuning, and the species problem. △ Less", "The large tensor spectrum recently observed by the BICEP2 Collaboration requires a super-Planckian field variation of the inflaton in the single-field inflationary scenario. The required slow-roll parameter ε\\approx 0.01 would restrict the e-folding number to around 7 in (sub-)Planckian inflationary models. To overcome such problems, we consider a two-field scenario based on the natural assisted supersymmetric (SUSY) hybrid model (\"natural SUSY hybrid inflation\" [1]), which combines the SUSY hybrid and the natural inflation models. The axionic inflaton field from the natural inflation sector can admit the right values for the tensor spectrum as well as a spectral index of 0.96 with a decay constant smaller than the Planck scale, f \\lesssim M_P. On the other hand, the vacuum energy of 2 x 10^{16} GeV with 50 e-folds is provided by the inflaton coming from the SUSY hybrid sector, avoiding the eta problem. These are achieved by introducing both the U(1)_R and a shift symmetry, and employing the minimal Kahler potential. △ Less", "We consider 4D weak scale theories arising from 5D supersymmetric (SUSY) theories with maximal Scherk-Schwarz breaking at a Kaluza-Klein (KK) scale of several TeV. Many of the problems of conventional SUSY are avoided. Apart from 3rd family sfermions the SUSY spectrum is heavy, with only ~50% tuning at a gluino mass of ~2TeV and a stop mass of ~650 GeV. A single Higgs doublet acquires a vacuum expectation value, so the physical Higgs is automatically Standard-Model-like. A new U(1)' interaction raises the Higgs mass to 126 GeV. For minimal tuning the associated Z', as well as the 3rd family sfermions, must be accessible to LHC13. A gravitational wave signal consistent with BICEP2 is possible if inflation occurs when the extra dimensions are small. △ Less", "Naturalness arguments applied to supersymmetric theories imply a spectrum containing four light higgsinos \\tz_{1,2} and \\tw_1^+- with masses ~ 100-300 GeV (the closer to M_Z the more natural). The compressed mass spectrum and associated low energy release from \\tw_1 and \\tz_2 three-body decay makes higgsinos difficult to detect at LHC14, while the other sparticles might be heavy, and possibly even beyond LHC14 reach. In contrast, the International Linear e^+e^- Collider (ILC) with \\sqrt{s}>2m(higgsino) would be a {\\it higgsino factory} in addition to a Higgs boson factory and would serve as a discovery machine for natural SUSY! In this case, both chargino and neutralino production %which give rise to distinct event topologies, occur at comparable rates, and lead to observable signals above SM backgrounds. We examine two benchmark cases, one just beyond the LHC8 reach with \\tw_1(\\tz_2)-\\tz_1 mass gap of 15 (21) GeV, and a second more difficult case beyond even the LHC14 reach, where the mass gap is just 10 GeV, close to its minimum in models with no worse than 3% fine-tuning. The signal is characterized by low visible energy events together with MET in the one or two jets +1\\ell channel from chargino production, and in the opposite sign, same-flavour, acoplanar dilepton channel from \\tz_1\\tz_2 production. For both cases, we find that the signal is observable above backgrounds from the usual 2-> 2 SM events and from γγcollisions with just a few fb^{-1} of integrated luminosity. We also show that with an integrated luminosity of 100~fb^{-1}, it should be possible to extract \\tw_1, \\tz_2 and \\tz_1 masses to percent level. These measurements would point to higgsinos as the origin of new physics and strongly suggest a link to a natural origin for W, Z and h masses. △ Less", "A review of direct searches for new particles predicted by Supersymmetry after the first run of the LHC is proposed. This review is based on the results provided by the ATLAS and CMS experiments. △ Less", "In this paper we study Yukawa-unified SO(10) SUSY GUTs with two types of SO(10) boundary conditions: (i) universal gaugino masses and (ii) non-universal gaugino masses with effective \"mirage\" mediation. With these boundary conditions, we perform a global chi^2 analysis to obtain the parameters consistent with 11 low energy observables, including the top, bottom, and tau masses. Both boundary conditions have universal scalar masses and \"just so\" splitting for the up- and down-type Higgs masses. In these models, the third family scalars are lighter than the first two families and the gauginos are lighter than all the scalars. We therefore focus on the gluino phenomenology in these models. In particular, we estimate the lowest allowed gluino mass in our models coming from the most recent LHC data and compare these to limits obtained using simplified models. We find that the lower bound on M_gluino in Yukawa-unified SO(10) SUSY GUTs is generically ~1.2 TEV at the 1 sigma level unless there is considerable degeneracy between the gluino and the LSP, in which case the bounds are much weaker. Hence many of our benchmark points are not ruled out by the present LHC data and are still viable models which can be tested at LHC 14. △ Less", "It has been recently pointed out that the polarization BICEP2 results are consistent with the identification of an inflaton mass m \\simeq 10^{13} GeV with the SUSY breaking scale in an MSSM with a fine-tuned SM Higgs. This identification leads to a Higgs mass m_h \\simeq 126 GeV, consistent with LHC measurements. Here we propose that this naturally suggests to identify the inflaton with the heavy MSSM Higgs system. The fact that the extrapolated Higgs coupling lambda_{SM}\\simeq 0 at scales below the Planck scale suggests the Higgs degrees of freedom could be associated to a Wilson line or D-brane position modulus in string theory. The Higgs system then has a shift symmetry and an N=2 structure which guarantees that its potential has an approximate quadratic chaotic inflation form. These moduli in string compactifications, being compact, allow for a trans-Planckian inflaton field range analogous to a version of monodromy inflation. △ Less", "The QCD axion solving the strong CP problem may originate from antisymmetric tensor gauge fields in compactified string theory, with a decay constant around the GUT scale. Such possibility appears to be ruled out now by the detection of tensor modes by BICEP2 and the PLANCK constraints on isocurvature density perturbations. A more interesting and still viable possibility is that the string theoretic QCD axion is charged under an anomalous U(1)_A gauge symmetry. In such case, the axion decay constant can be much lower than the GUT scale if moduli are stabilized near the point of vanishing Fayet-Illiopoulos term, and U(1)_A-charged matter fields get a vacuum value far below the GUT scale due to a tachyonic SUSY breaking scalar mass. We examine the symmetry breaking pattern of such models during the inflationary epoch with the Hubble expansion rate 10^{14} GeV, and identify the range of the QCD axion decay constant, as well as the corresponding relic axion abundance, consistent with known cosmological constraints. In addition to the case that the PQ symmetry is restored during inflation, there are other viable scenarios, including that the PQ symmetry is broken during inflation at high scales around 10^{16}-10^{17} GeV due to a large Hubble-induced tachyonic scalar mass from the U(1)_A D-term, while the present axion scale is in the range 10^{9}-5\\times 10^{13} GeV, where the present value larger than 10^{12} GeV requires a fine-tuning of the axion misalignment angle. We also discuss the implications of our results for the size of SUSY breaking soft masses. △ Less", "We study cosmological constraints in the context of $R$-parity violating MFV SUSY and find it is driven to $\\tan(β)\\approx1$. These constraints are from two sources: first from the requirement that baryon number violation not undo baryogenesis and second that the flux of decay products from gravitino dark matter not exceed that observed by experiments such as PAMELA and Fermi LAT. The latter discussion favors relatively low gravitino masses of a few GeV. △ Less", "Gravitinos are generically produced by inflaton decays, which place tight constraints on inflation models as well as supersymmetry breaking scale. We revisit the gravitino production from decays of the inflaton and the supersymmetry breaking field, based on a chaotic inflation model suggested by the recent BICEP2 result. We study cosmological constraints on thermally and non-thermally produced gravitinos for a wide range of the gravitino mass, and show that there are only three allowed regions of the gravitino mass: $m_{3/2}\\lesssim 16$eV, $m_{3/2}\\simeq 10$--$1000$TeV and $m_{3/2}\\gtrsim 10^{13}$GeV. △ Less", "Recent null results from LHC8 SUSY searches along with the discovery of a SM-like Higgs boson with mass m(h) ~ 125.5 GeV indicates sparticle masses in the TeV range, causing tension with conventional measures of electroweak fine-tuning. We propose a simple Fine-tuning Rule which should be followed under any credible evaluation of fine-tuning. We believe that overestimates of electroweak fine-tuning by conventional measures all arise from violations of this rule. We show that to gain accord with the Fine-tuning Rule, then both Higgs mass and the traditional Δ_{BG} fine-tuning measures reduce to the model-independent electroweak fine-tuning measure Δ_{EW}. This occurs by combining dependent contributions to m(Z) or m(h) into independent units. Then, using Δ_{EW}, we evaluate EW fine-tuning for a variety of SUSY models including mSUGRA, NUHM1, NUHM2, mGMSB, mAMSB, hyper-charged AMSB and nine cases of mixed moduli-anomaly (mirage) mediated SUSY breaking models (MMAMSB) whilst respecting LHC Higgs mass and B-decay constraints (we do not impose LHC8 sparticle mass constraints due to the possibility of compressed spectra within many of these models). We find mSUGRA, mGMSB, mAMSB and MMAMSB models all to be highly fine-tuned. The NUHM1 model is moderately fine-tuned while NUHM2 which allows for radiatively-driven naturalness (RNS) allows for fine-tuning at a meager 10% level in the case where m(higgsinos) ~ 100-200 GeV and the TeV-scale top squarks are well-mixed. Models with RNS may or may not be detect at LHC14. A \\sqrt{s} ~ 500 GeV e^+e^- collider will be required to make a definitive search for the requisite light higgsinos. △ Less", "High-scale supersymmetry (SUSY) with a split spectrum has become increasingly interesting given the current experimental results. A SUSY scale above the weak scale could be naturally associated with a heavy unstable gravitino, whose decays populate the dark matter (DM) particles. In the mini-split scenario with gravitino at about the PeV scale and the lightest TeV scale neutralino being (a component of) DM, the requirement that the DM relic abundance resulting from gravitino decays does not overclose the Universe and satisfies the indirect detection constraints demand the reheating temperature to be below 10^9 - 10^{10} GeV. On the other hand, the BICEP2 result prefers a heavy inflaton with mass at around 10^{13} GeV and a reheating temperature at or above 10^9 GeV with some general assumptions. The mild tension could be alleviated if SUSY scale is even higher with the gravitino mass above the PeV scale. Intriguingly, in no-scale supergravity, gravitinos could be very heavy at about 10^{13} GeV, the inflaton mass scale, while gauginos could still be light at the TeV scale. △ Less", "We point out that recently discovered 3.5 keV line in X-ray spectra from various galaxy clusters and the Andromeda galaxy can be naturally explained by physics of a sector responsible for spontaneous supersymmetry breaking in models with R-parity. In this scenario the source of this line could be decay of sgoldstino - scalar superpartner of massive gravitino. At the same time the dominant dark matter component is stable gravitino whose mass is predicted to be about 0.25 GeV. △ Less", "We show how gauged flavour breaking and N = 1 supersymmetry breaking can be dynamically aligned to produce natural models. Supersymmetry is broken in a metastable vacuum, while a weakly gauged flavour symmetry is identified with an SU(3)_F subgroup of the global symmetry of the SQCD model. We find that alignment can easily occur either through strongly coupled flavour models, with SQCD bound states playing the role of flavons, or entirely weakly coupled and renormalizable models with elementary SU(3)_F adjoint flavons. In both cases it is essential that the SU(3)_F breaking, and hence all the flavour structure, is driven dynamically by the SUSY breaking. The resulting flavour gauge mediation in conjunction with the usual gauge mediation contribution leads to naturally light third generations squarks, with first and second generations above exclusions. △ Less", "In light of the Higgs discovery and the nonobservation of sparticles at the LHC, we revisit the SUSY induced top quark flavor changing decay into the Higgs boson. We perform a scan over the relevant SUSY parameter space by considering the constraints from the Higgs mass measurement, the LHC search for SUSY, the vacuum stability, the precision electro-weak observables as well as $B \\to X_s γ$. We have the following observations: (1) In the MSSM, the branching ratio of $ t \\to c h$ can only reach $3.0\\times10^{-6}$, which is about one order smaller than previous results obtained before the advent of the LHC. Among the considered constraints, the Higgs mass and the LHC search for sparticles are found to play an important role in limiting the prediction. (2) In the singlet extension of the MSSM, since the squark sector is less constrained by the Higgs mass, the branching ratio of $t \\to c h$ can reach the order of $10^{-5}$ in the allowed parameter space. (3) The chiral-conserving mixings $δ_{LL}$ and $δ_{RR}$ may have remanent effects on $t \\to c h$ in heavy SUSY limit. In the MSSM with squarks and gluino above 3 TeV and meanwhile the CP-odd Higgs boson mass around 1 TeV, the branching ratio of $t\\to c h$ can still reach the order of $10^{-8}$ under the constraints. △ Less", "Closed string fluxes induce generically SUSY-breaking soft terms on supersymmetric type IIB orientifold compactifications with D3/D7 branes. This was studied in the past by inserting those fluxes on the DBI+CS actions for adjoint D3/D7 fields, where D7-branes had no magnetic fluxes. In the present work we generalise those computations to the phenomenologically more relevant case of chiral bi-fundamental fields laying at 7-brane intersections and F-theory local matter curves. We also include the effect of 7-brane magnetic flux as well as more general closed string backgrounds, including the effect of distant (anti-)D3-branes. We discuss several applications of our results. We find that squark/slepton masses become in general flux-dependent in F-theory GUT's. Hypercharge-dependent non-universal scalar masses with a characteristic sfermion hierarchy m_E^2 < m_L^2 < m_Q^2 < m_D^2 < m_U^2 are obtained. There are also flavor-violating soft terms both for matter fields living at intersecting 7-branes or on D3-branes at singularities. They point at a very heavy sfermion spectrum to avoid FCNC constraints. We also discuss the possible microscopic description of the fine-tuning of the EW Higgs boson in compactifications with a MSSM spectrum. △ Less", "We probe the high scale SUSY at 10-50 TeV in the CP violations of K, B0 and Bs mesons. In order to estimate the contribution of the squark flavor mixing to these CP violations, we discuss the squark mass spectrum, which is consistent with the recent Higgs discovery. Taking the universal soft parameters at the SUSY breaking scale, we obtain the squark mass spectrum at 10 TeV and 50 TeV, where the SM emerges. Then, the 6times6 mixing matrix between down-squarks and down-quarks is discussed by input of the experimental data of K, B0 and Bs mesons.It is found that epsilon_K is most sensitive to the high scale SUSY. The SUSY contributions for the time-dependent CP asymmetries S_{ J/psi K_S} and S_{ J/psi phi} are 6-8% at the SUSY scale of 10 TeV. We also discuss the SUSY contribution to the chromo-EDM of the strange quark. △ Less", "We analyze the LHC SUSY 1exclusion limits in the cha1-neu2 channel. We take into account the decay neu2 -> neu1 h (based on a full one-loop calculation in the complex MSSM), which has a non-negligible branching ratio. Including this decay strongly reduces the excluded parameter space in the m_neu2-m_neu1 plane. This opens up a large parameter space for electroweak SUSY particles, easily allowing the production of these particles at the ILC. △ Less", "We study the production of scalar and pseudoscalar Higgs bosons via gluon fusion and bottom-quark annihilation in the MSSM. Relying on the NNLO-QCD calculation implemented in the public code SusHi, we provide precise predictions for the Higgs-production cross section in six benchmark scenarios compatible with the LHC searches. We also provide a detailed discussion of the sources of theoretical uncertainty in our calculation. We examine the dependence of the cross section on the renormalization and factorization scales, on the precise definition of the Higgs-bottom coupling and on the choice of PDFs, as well as the uncertainties associated to our incomplete knowledge of the SUSY contributions through NNLO. In particular, a potentially large uncertainty originates from uncomputed higher-order QCD corrections to the bottom-quark contributions to gluon fusion. △ Less", "The signal discovered in the Higgs searches at the LHC can be interpreted as the Higgs boson of the Standard Model as well as the light CP-even Higgs boson of the Minimal Supersymmetric Standard Model (MSSM). In this context the measured mass value, having already reached the level of a precision observable with an experimental accuracy of about 500 MeV, plays an important role. This precision can be improved substantially below the level of about 50 MeV at the future International Linear Collider (ILC). Within the MSSM the mass of the light CP-even Higgs boson, M_h, can directly be predicted from the other parameters of the model. The accuracy of this prediction should match the one of the experimental measurements. The relatively high experimentally observed value of the mass of about 125.6 GeV has led to many investigations where the supersymmetric (SUSY) partners of the top quark have masses in the multi-TeV range. We review the recent improvements for the prediction for M_h in the MSSM for large scalar top masses. They were obtained by combining the existing fixed-order result, comprising the full one-loop and leading and subleading two-loop corrections, with a resummation of the leading and subleading logarithmic contributions from the scalar top sector to all orders. In this way for the first time a high-precision prediction for the mass of the light CP-even Higgs boson in the MSSM is possible all the way up to the multi-TeV region of the relevant supersymmetric particles. However, substantial further improvements will be needed to reach the ILC precision. The newly obtained corrections to M_h are included into the code FeynHiggs. △ Less", "We consider the situation in which $m_{3/2}\\sim O(100{\\rm TeV})$ for solving the gravitino problem and the other supersymmetry(SUSY) breaking parameters are $O(1{\\rm TeV})$ for the naturalness. We point out that the anomaly mediation cancels out the renormalization group contribution to the gaugino masses and the sfermion masses other than the stop masses at a scale which is called the mirage scale. The situation is similar to the mirage mediation, in which special boundary conditions for the SUSY breaking parameters are required, though for the stop masses and the up-type Higgs mass, such cancellation at the mirage scale does not happen. Despite no cancellation for the up-type Higgs mass, we show that the little hierarchy problem becomes less severe in this situation. One advantage of this situation over the mirage mediation is that the stop mixing parameter $A_t$ can be larger and therefore, smaller stop mass is sufficient for 125 GeV Higgs. When the mirage scale is around TeV scale, the SUSY breaking parameters induced by the gravity mediation at the grand unification scale can be observed directly by the TeV scale experiments. △ Less", "Supersymmetry is under pressure from LHC searches requiring colored superpartners to be heavy. We demonstrate R-parity violating spectra for which the dominant signatures are not currently well searched for at the LHC. In such cases, the bounds can be as low as 800 GeV on both squarks and gluinos. We demonstrate that there are nontrivial constraints on squark and gluino masses with baryonic RPV (UDD operators) and show that in fact leptonic RPV can allow comparable or even lighter superpartners. The constraints from many searches are weakened if the LSP is significantly lighter than the colored superpartners, such that it is produced with high boost. The LSP decay products will then be collimated, leading to the miscounting of leptons or jets and causing such models to be missed even with large production cross-sections. Other leptonic RPV scenarios that evade current searches include the highly motivated case of a higgsino LSP decaying to a tau and two quarks, and the case of a long-lived LSP with a displaced decay to electrons and jets. The least constrained models can have SUSY production cross-sections of ~pb or larger, implying tens of thousands of SUSY events in the 8 TeV data. We suggest novel searches for these signatures of RPV, which would also improve the search for general new physics at the LHC. △ Less", "Split supersymmetry (SUSY) -- in which SUSY is relevant to our universe but largely inaccessible at current accelerators -- has become increasingly plausible given the absence of new physics at the LHC, the success of gauge coupling unification, and the observed Higgs mass. Indirect probes of split SUSY such as electric dipole moments (EDMs) and flavor violation offer hope for further evidence but are ultimately limited in their reach. Inflation offers an alternate window into SUSY through the direct production of superpartners during inflation. These particles are capable of leaving imprints in future cosmological probes of primordial non-gaussianity. Given the recent observations of BICEP2, the scale of inflation is likely high enough to probe the full range of split SUSY scenarios and therefore offers a unique advantage over low energy probes. The key observable for future experiments is equilateral non-gaussianity, which will be probed by both cosmic microwave background (CMB) and large scale structure (LSS) surveys. In the event of a detection, we forecast our ability to find evidence for superpartners through the scaling behavior in the squeezed limit of the bispectrum. △ Less", "In this note we shortly comment on our analytical results in PRD73(2006)055003 for the $Z$ boson one-loop form factors contributing to the Lepton Flavour Violating $Z$ penguin diagrams in SUSY. In a recent communication [arXiv:1312.5318v1] it has been pointed out a mistake in our formulas for the chargino contribution to the $Z$-form factor, $F_L^{(c)}$, and these authors have included corrections to our results in a way that we do not agree with. We wish to clarify here what are the correct results for these form factors. △ Less", "Radiative flavor models where the hierarchies of Standard Model (SM) fermion masses and mixings are explained via loop corrections are elegant ways to solve the SM flavor puzzle. Here we build such a model in the context of Mini-Split Supersymmetry (SUSY) where both flavor and SUSY breaking occur at a scale of 1000 TeV. This model is consistent with the observed Higgs mass, unification, and WIMP dark matter. The high scale allows large flavor mixing among the sfermions, which provides part of the mechanism for radiative flavor generation. In the deep UV, all flavors are treated democratically, but at the SUSY breaking scale, the third, second, and first generation Yukawa couplings are generated at tree level, one loop, and two loops, respectively. Save for one, all the dimensionless parameters in the theory are O(1), with the exception being a modest and technically natural tuning that explains both the smallness of the bottom Yukawa coupling and the largeness of the Cabibbo angle. △ Less", "Recent BICEP2 results on CMB polarisation B-modes suggest a high value for the inflation scale $V_0^{1/4} \\simeq 10^{16}$ GeV, giving experimental evidence for a physical scale in between the EW scale and the Planck mass. We propose that this new high scale could be interpreted as evidence for a high SUSY breaking scale $M_{ss}\\simeq 10^{12}-10^{13}$ GeV. We show that such a large value for $M_{ss}$ is consistent with a Higgs mass around 126 GeV. We briefly discuss some possible particle physics implications of this assumption. △ Less", "The LHC search for nearly degenerate gluinos and neutralinos, which can occur, for example, in SUSY axion models, is limited by the reduced missing transverse momentum and effective mass in the events. We propose the use of kinematic correlations between jets coming from initial state radiation (ISR) in gluino pair production events at the 13 TeV LHC. A significant improvement in the signal to background ratio is obtained for the highly compressed gluino-neutralino search, by using cuts on the rapidity and azimuthal angle separation between the pair of tagged jets with the highest transverse momenta. Furthermore, the distribution of the azimuthal angle difference between the tagged jets in the gluino-pair+jets process is found to be distinctly different from the dominant background process of Z+jets. We also find quark and gluon jet tagging methods to be useful in separating the signal, which contains a higher fraction of gluon initiated jets compared to the dominant backgrounds. △ Less", "The large value of the tensor-to-scalar ratio in the cosmic microwave background radiation reported by the BICEP2 collaboration gives strong impact on models of supersymmetry (SUSY). The large ratio indicates inflation with a high-energy scale and thus a high reheating temperature in general, and various SUSY models suffer from the serious gravitino and Polonyi problems. In this article, we discuss a class of the high-scale SUSY breaking models which are completely free from those problems. With especially focusing on the dark matter relic abundance, we examine how the BICEP2 result narrows down the parameter space of the models, assuming the simplest chaotic inflation model. We find that the mass of the dark matter is predicted to be less than about 1 TeV thanks to the non-thermal production in the early universe through the decay of abundant gravitinos produced after the reheating process. We also discuss implications in some details to dark matter searches at collider and indirect dark matter detection experiments. △ Less", "The multi-sector SUSY breaking predicts the existence of pseudo-goldstino, which could couple more strongly to visible fields than ordinary gravitino. Then the lightest neutralino and chargino can decay into a pseudo-goldstino plus a Z-boson, Higgs boson or W-boson. In this note we perform a Monte Carlo simulation for the direct productions of the lightest neutralino and chargino followed by the decays to pseudo-goldstino. Considering scenarios with higgsino-like, bino-like or wino-like lightest neutralino, we find that the signal-to-background ratio at the high luminosity LHC is between 6% and 25% and the statistical significance can be above 5-sigma. △ Less", "We examine the possibilities for constructing models with Dirac gaugino masses and unification of gauge couplings. We identify one promising model, and discuss to what extent it can have a \"natural SUSY\" spectrum. We then determine the low-energy constraints upon it, and propose a constrained set of boundary conditions at the unification scale. We describe the implementation of these boundary conditions in the spectrum-generator generator \\SARAH and we perform a first exploration of the parameter space, specifically searching for points where the spectrum is relatively light. It is shown that the pattern of the masses of SUSY states is very different compared to any expectations from the constrained MSSM. △ Less", "We consider scenarios of gravitino LSP and DM with stop NLSP both within R-parity conserving and R-parity violating supersymmetry (RPC and RPV SUSY, respectively). We discuss cosmological bounds from Big Bang Nucleosynthesis (BBN) and the gravitino abundance and then concentrate on the signals of long-lived stops at the LHC as displaced vertices or metastable particles. Finally we discuss how to distinguish R-parity conserving and R-parity breaking stop decays if they happen within the detector and suppress SM backgrounds. △ Less", "The non-observation of supersymmetric signatures in searches at the Large Hadron Collider strongly constrains minimal supersymmetric models like the CMSSM. We explore the consequences on the SUSY particle spectrum in a minimal SO(10) with large D-terms and non-universal gaugino masses at the GUT scale. This changes the sparticle spectrum in a testable way and for example can sufficiently split the coloured and non-coloured sectors. The splitting provided by use of the SO(10) D-terms can be exploited to obtain light first generation sleptons or third generation squarks, the latter corresponding to a compressed spectrum scenario. △ Less", "We show that the Li problems can be solved in the next-to-minimal supersymmetric standard model where the slepton as the next-to-lightest SUSY particle is very long-lived. Such a long-lived slepton induces exotic nuclear reactions in big-bang nucleosynthesis, and destroys and produces the $^7$Li and $^6$Li nuclei via bound state formation. We study cases where the lightest SUSY particle is singlino-like neutralino and bino-like neutralino to present allowed regions in the parameter space which is consistent with the observations on the dark matter and the Higgs mass. △ Less", "The empirical mass of the Higgs boson suggests small to vanishing values of the quartic Higgs self--coupling and the corresponding beta function at the Planck scale, leading to degenerate vacua. This leads us to suggest that the measured value of the cosmological constant can originate from supergravity (SUGRA) models with degenerate vacua. This scenario is realised if there are at least three exactly degenerate vacua. In the first vacuum, associated with the physical one, local supersymmetry (SUSY) is broken near the Planck scale while the breakdown of the SU(2)_W\\times U(1)_Y symmetry takes place at the electroweak (EW) scale. In the second vacuum local SUSY breaking is induced by gaugino condensation at a scale which is just slightly lower than Λ_{QCD} in the physical vacuum. Finally, in the third vacuum local SUSY and EW symmetry are broken near the Planck scale. △ Less", "The high-scale supersymmetry (SUSY) breaking scenario is now attracting many attentions, because it is consistent with almost all experiments of particle physics, astrophysics, and cosmology performed so far: e.g. it is possible to explain the Higgs mass of about 126GeV and contains WIMP dark matter candidates. In the scenario, gauginos are predicted to be around the TeV scale, and thus within a kinematically accessible range of near future experiments. Calculation of the thermal relic abundance for gaugino (bino or wino) dark matter is then of particular importance in order to clarify its mass consistent with cosmology and to determine future directions for exploring the high-scale SUSY breaking scenario. In this article, we calculate the abundance of the gaugino dark matter, with especially focusing on various coannihilations between gauginos, which has not been extensively studied so far. Our calculation involves the Sommerfeld effect on wino and gluino annihilations, which is known to give significant contributions to their cross sections. Based on obtained results, we discuss some implications to gaugino searches at collider and indirect detection experiments of dark matter. △ Less", "We argue that supersymmetry with its well known advantages, such as naturalness, grand unification and dark matter candidate seems to possess one more attractive feature: it may trigger, through its own spontaneous violation in the visible sector, a dynamical generation of gauge fields as massless Nambu-Goldstone modes during which physical Lorentz invariance itself is ultimately preserved. We consider the supersymmetric QED model extended by an arbitrary polynomial potential of massive vector superfield that breaks gauge invariance in the SUSY invariant phase. However, the requirement of vacuum stability in such class of models makes both supersymmetry and Lorentz invariance to become spontaneously broken. As a consequence, massless photino and photon appear as the corresponding Nambu-Goldstone zero modes in an emergent SUSY QED, and also a special gauge invariance is simultaneously generated. Due to this invariance all observable relativistically noninvariant effects appear to be completely cancelled out among themselves and physical Lorentz invariance is recovered. Nevertheless, such theories may have an inevitable observational evidence in terms of the goldstino-photino like state presented in the low-energy particle spectrum. Its study is of a special interest for this class of SUSY models that, apart from some indication of an emergence nature of QED and the Standard Model, may appreciably extend the scope of SUSY breaking physics being actively studied in recent years. △ Less", "These proceedings discuss results from recent searches for third generation SUSY particles by the ATLAS and CMS experiments at the LHC. Analyses performed with 8 TeV data probing direct pair production of bottom and top squarks are presented. △ Less", "The distinguishing feature of the Dine-Fischler-Srednicki-Zhitnitsky (DFSZ) axion is that it couples to the electroweak Higgs fields. There is thus an immediate connection between the Peccei-Quinn (PQ) scale and the weak scale. We wish to incorporate the DFSZ axion in a complete supersymmetric model, valid at all scales, and then to implement it in a numerical code connecting the high scale and the low scale physics on a quantitative level. We find that the simplest supersymmetric DFSZ model, as proposed by Rajagopal et al. in 1990, is inconsistent when we consider the minimization of the scalar potential. The problem is that we obtain a negative squared mass for the saxion, the scalar partner of the axion, at the minimum. We then consider the minimal extension in order to get a consistent model for all scales: one has to include an additional explicit sector to spontaneously break the PQ symmetry. In the complete model we can determine the mass of the axino, the fermionic partner of the axion. It is useful to distinguish two cases: (1) the supersymmetry (SUSY) breaking scale is lower than the PQ breaking scale, and (2) the scales are comparable. We find that the axino is very light in (1), while its mass is generically of the order of the other soft SUSY breaking masses in (2). We have implemented SUSY breaking via generic soft breaking terms, and thus make no explicit statement about the form and mediation of SUSY breaking. This complete model can then be incorporated in a numerical code connecting the two scales. We briefly discuss the renormalization group equations and the couplings of the axion to gluons and photons. △ Less", "The collider phenomenology of models with Universal Extra Dimensions (UED) is surprisingly similar to that of supersymmetric (SUSY) scenarios. For each level-1 bosonic (fermionic) Kaluza-Klein (KK) state, there is a fermionic (bosonic) analog in SUSY and thus UED scenarios are often known as bosonic supersymmetry. The minimal version of UED (mUED) gives rise to a quasi-degenerate particle spectrum at each KK-level and thus, can not explain the enhanced Higgs to diphoton decay rate hinted by the ATLAS collaboration of the Large Hadron Collider (LHC) experiment. However, in the non-minimal version of the UED (nmUED) model, the enhanced Higgs to diphoton decay rate can be easily explained via the suitable choice of boundary localized kinetic (BLK) terms for higher dimensional fermions and gauge bosons. BLK terms remove the degeneracy in the KK mass spectrum and thus, pair production of level-1 quarks and gluons at the LHC gives rise to hard jets, leptons and large missing energy in the final state. These final states are studied in details by the ATLAS and CMS collaborations in the context of SUSY scenarios. We find that the absence of any significant deviation of the data from the Standard Model (SM) prediction puts a lower bound of about 2.1 TeV on equal mass excited quarks and gluons. △ Less", "Discussions are underway for a high-energy proton-proton collider. Two preliminary ideas are the $\\sqrt{s}=33$ TeV HE-LHC and the $\\sqrt{s}=100$ TeV VLHC. With Bayesian statistics, we calculate the probabilities that the LHC, HE-LHC and VLHC discover SUSY in the future, assuming that nature is described by the CMSSM and given the experimental data from the LHC, LUX and Planck. We find that the LHC with $300$/fb at $\\sqrt{s}=14$ TeV has a $15$-$75%$ probability of discovering SUSY. Should that run fail to discover SUSY, the probability of discovering SUSY with $3000$/fb is merely $1$-$10%$. Were SUSY to remain undetected at the LHC, the HE-LHC would have a $35$-$85%$ probability of discovering SUSY with $3000$/fb. The VLHC, on the other hand, ought to be definitive; the probability of it discovering SUSY, assuming that the CMSSM is the correct model, is $100%$. △ Less", "As experimental constraints on the parameter space of the MSSM and close variations thereof become stronger, the motivation to explore supersymmetric models that challenge some of the standard assumptions of the MSSM also become stronger. For example, models where the gauginos are Dirac instead of Majorana have recently received more attention. Beside allowing for a supersoft SUSY breaking mechanism where the gauginos only provide finite threshold corrections to scalar masses, the cross section for the production of a squark pairs is reduced. In addition, Dirac gauginos can be used to build models that possess a U(1)R symmetry. This symmetry can then be identified with a lepton number, leading to models that are quite different from conventional scenarios. The sneutrinos in these models can acquire a vev and give mass to the leptons and the down-type squark. The phenomenology is novel, combining signatures that are typical of R-parity violating scenarios with signatures arising from leptoquarks. Correspondingly the constraints from electroweak precision data are also different. In these models, one of the leptons mixes with gauginos and superpotential Yukawa couplings can contribute to EWPM at tree level. In addition, lepton universality is broken. In this paper we adapt the operators analysis of Han and Skiba [1] to include the relevant violation of lepton universality, and do a global fit of the model to electroweak precision data, including all relevant tree-level and loop-level effects. We obtain bounds on the vev of the sneutrino and on the superpotential couplings of the model. △ Less", "We highlight the differences of the dark matter sector between the constrained minimal supersymmetric SM (CMSSM) and the next-to-minimal supersymmetric SM (NMSSM) including the 126 GeV Higgs boson using GUT scale parameters. In the dark matter sector the two models are quite orthogonal: in the CMSSM the WIMP is largely a bino and requires large masses from the LHC constraints. In the NMSSM the WIMP has a large singlino component and is therefore independent of the LHC SUSY mass limits. The light NMSSM neutralino mass range is of interest for the hints concerning light WIMPs in the Fermi data. Such low mass WIMPs cannot be explained in the CMSSM. Furthermore, prospects for discovery of XENON1T and LHC at 14 TeV are given. △ Less", "We review the emergence and fate of goldstinos in different frameworks. First, we consider a super-Higgs mechanism when supersymmetry breaking is induced by neither an F-term nor a D-term but related to a more general stress energy-momentum tensor. This allows us to build a novel Lagrangian that describes the propagation of a spin-3/2 state in a fluid. Then we briefly review the ubiquitous pseudo-goldstinos when breaking supersymmetry in an extra dimension. We remind that the fermion (gravitino or gaugino) soft masses can be tuned to be of Dirac-type. Finally, we briefly connect the latter to the study of models with Dirac-type gaugino masses and stress the advantage of having both an F and a D-term sizable contributions for the hierarchies of soft-terms as well as for minimizing R-symmetry breaking. △ Less", "An inverted mass hierarchy in the squark sector, as in so-called \"natural supersymmetry\", requires non-universal boundary conditions at the mediation scale of supersymmetry breaking. We propose a formalism to define such boundary conditions in a basis-independent manner and apply it to generic scenarios where the third-generation squarks are light, while the first two generation squarks are heavy and near-degenerate. We show that not only is our formalism particularly well-suited to study such hierarchical squark mass patterns, but in addition the resulting soft terms at the TeV scale are manifestly compatible with the principle of minimal flavour violation, and thus automatically obey constraints from flavour physics. △ Less", "We revisit the monophoton plus missing energy signature at $e^+e^-$ colliders in supersymmetric (SUSY) models where the gravitino is very light. There are two possible processes which provide the signal: gravitino pair production and associated gravitino production with a neutralino, leading the monophoton final state via an additional photon radiation and via the neutralino decay, respectively. By using the superspace formalism, we construct a model that allows us to study the parameter space for the both processes. We show that the signal cross section and the photon spectra provide information on the masses of the SUSY particles as well as the SUSY breaking scale. △ Less", "We analyse the current status of the dilaton domination scenario in the MSSM and its singlet extensions taking into account the measured value of the Higgs mass, the relic abundance of dark matter and constraints from SUSY searches at the LHC. We find that in the case of the MSSM the requirement of a dark matter relic abundance in accord with observation severely restricts the allowed parameter space, implying an upper bound on the superpartner masses which makes it fully testable at LHC-14. In singlet extensions with a large singlet-MSSM coupling $λ$ as favoured by naturalness arguments the coloured sparticles should again be within the reach of the LHC-14, while for small $λ$ it is possible to decouple the MSSM and singlet sectors, achieving the correct dark matter abundance with a singlino LSP while allowing for a heavy MSSM spectrum. △ Less", "Monojet searches using Effective Field Theory (EFT) operators are usually interpreted as a robust and model independent constraint on direct detection (DD) scattering cross-sections. At the same time, a mediator particle must be present to produce the dark matter (DM) at the LHC. This mediator particle may be produced on shell, so that direct searches for the mediating particle can constrain the effective operator being applied to monojet constraints. In this first paper, we do a case study on t-channel models in monojet searches, where the (Standard Model singlet) DM is pair produced via a t-channel mediating particle, whose supersymmetric analogue is the squark. We compare monojet constraints to direct constraints on single or pair production of the mediator from multi-jets plus missing energy searches and we identify the regions where the latter dominate over the former. We show that computing bounds using supersymmetric simplified models and in the narrow width approximation, as done in previous work in the literature, misses important quantitative effects. We perform a full event simulation and statistical analysis, and we compute the effects of both on- and off-shell production of the mediating particle, showing that for both the monojet and multi-jets plus missing energy searches, previously derived bounds provided more conservative bounds than what can be extracted by including all relevant processes in the simulation. Monojets and searches for supersymmetry (SUSY) provide comparable bounds on a wide range of the parameter space, with SUSY searches usually providing stronger bounds, except in the regions where the DM particle and the mediator are very mass degenerate. The EFT approximation rarely is able to reproduce the actual limits. In a second paper to follow, we consider the case of s-channel mediators. △ Less", "New self-dualities involving two index tensors are derived. These new self-dualities are used to build various duality cascades. Both vector like and chiral cascades are presented. Aside from ending in confinement, these duality cascades can also end in interacting conformal field theories, free field theories, and meta-stable supersymmetry breaking. Higgsing effects are built into the self-duality so that when the gauge groups are small enough, supersymmetry is broken through the rank condition. Dynamical supersymmetry restoration occurs far from the SUSY breaking vacuum resulting in a long lived meta-stable vacuum. It is found that Coulomb branches are critical in the stabilization of runaways and dynamical supersymmetry restoration. △ Less", "I review the ideas of holographic space-time (HST), Cosmological SUSY breaking (CSB), and the Pyramid Schemes, which are the only known models of Tera-scale physics consistent with CSB, current particle data, and gauge coupling unification. There is considerable uncertainty in the estimate of the masses of supersymmetric partners of the standard model particles, but the model predicts that the gluino is probably out of reach of the LHC, squarks may be in reach, and the NLSP is a right handed slepton, which should be discovered soon. △ Less", "Fastlim is a tool to calculate conservative limits on extensions of the Standard Model from direct LHC searches without performing any Monte Carlo event generation. The program reconstructs the visible cross sections from pre-calculated efficiency tables and cross section tables for simplified event topologies. As a proof of concept of the approach, we have implemented searches relevant for supersymmetric models with R-parity conservation. Fastlim takes the spectrum and coupling information of a given model point and provides, for each signal region of the implemented analyses, the visible cross sections normalised to the corresponding upper limit, reported by the experiments, as well as the exclusion $p$-value. To demonstrate the utility of the program we study the sensitivity of the recent ATLAS missing energy searches to the parameter space of natural SUSY models. The program structure allows the straight-forward inclusion of external efficiency tables and can be generalised to R-parity violating scenarios and non-SUSY models. This paper serves as a self-contained user guide, and indicates the conventions and approximations used. △ Less", "We compute the tuning in supersymmetric models associated with the constraints from collider measurements of the Higgs couplings to fermions and gauge bosons. In supersymmetric models, a CP-even state with SM Higgs couplings mixes with additional, heavier CP-even states, causing deviations in the Higgs couplings from SM values. These deviations are reduced as the heavy states are decoupled with large soft masses, thereby exacerbating the tuning associated with the electroweak scale. This new source of tuning is different from that derived from collider limits on stops, gluinos and Higgsinos. It can be offset with large tan beta in the MSSM, however this compensating effect is limited in the NMSSM with a large Higgs-singlet coupling due to restrictions on large tan beta from electroweak precision tests. We derive a lower bound on this tuning and show that the level of precision of Higgs coupling measurements at the LHC will probe naturalness in the NMSSM at the few-percent level. This is comparable to the tuning derived from superpartner limits in models with a low messenger scale and split families. Instead the significant improvement in sensitivity of Higgs coupling measurements at the ILC will allow naturalness in these models to be constrained at the per-mille level, beyond any tuning derived from direct superpartner limits. △ Less", "We present a simple new way to visualize the constraints of Higgs coupling measurements on light stops in natural SUSY scenarios beyond the MSSM, which works directly in the plane of stop mass eigenvalues (with no need to make assumptions about mixing angles). For given stop mass eigenvalues, the smallest value of $X_t$ that can bring the correction to the $h \\to gg$ and $h\\to γγ$ couplings into agreement with data is computed. Requiring that this $X_t$ is consistent--i.e. that the chosen mass eigenvalues can be the outcome of diagonalizing a matrix with a given off-diagonal term--rules out the possibility that both stops have a mass below $\\approx$ 400 GeV. Requiring that $X_t$ is not fine-tuned for agreement with the data shows that neither stop can be lighter than $\\approx$ 100 GeV. These constraints are interesting because, unlike direct searches, they apply no matter how stops decay, and suggest a minimum electroweak fine-tuning of between a factor of 5 and 10. We show that a multi-parameter fit can slightly weaken this conclusion by allowing a large Higgs coupling to $b$-quarks, but only if a second Higgs boson is within reach of experiment. Certain models, like $R$-symmetric models with Dirac gauginos, are much more strongly constrained because they predict negligible $X_t$. We illustrate how the constraints will evolve given precise measurements at future colliders (HL-LHC, ILC, and TLEP), and comment on the more difficult case of Folded Supersymmetry. △ Less", "The supersymmetry (SUSY) may be one of the most favorable extensions of the standard model (SM), however, so far at LHC no evidence of the SUSY particles were observed. An obvious question is whether they have already emerged, but escaped from our detection, or do not exist at all. We propose that the future ILC may provide sufficient energy to produce SUSY particles if they are not too heavy in the low background environment. The superflavor symmetry associates baryons with mesons as long as both of them containing a heavy constituent and a light one. In this work, we estimate the production rate of SUSY baryons near their production threshold in terms of the $B\\bar B$ production data. Our analysis indicates that if the SUSY baryons with masses below $\\sqrt s/2$ ($\\sqrt s$ is the ILC energy) exist, they could be observed at future ILC. △ Less", "We investigate the renormalization group evolution of masses and mixing angles of Majorana neutrinos under the `High Scale Mixing Unification' hypothesis. Assuming the unification of quark-lepton mixing angles at a high scale, we show that all the experimentally observed neutrino oscillation parameters can be obtained, within 3-$σ$ range, through the running of corresponding renormalization group equations provided neutrinos have same CP parity and are quasi-degenerate. One of the novel results of our analysis is that $θ_{23}$ turns out to be non-maximal and lies in the second octant. Furthermore, we derive new constraints on the allowed parameter space for the unification scale, SUSY breaking scale and $\\tan β$, for which the `High Scale Mixing Unification' hypothesis works. △ Less", "In the previous paper, we have shown that $R_1\\equiv\\frac{Γ_{n \\rightarrow π^0 + ν^c}}{Γ_{p \\rightarrow π^0 + e^c}}$ and $R_2\\equiv\\frac{Γ_{p \\rightarrow K^0 + μ^c}}{Γ_{p \\rightarrow π^0 + e^c}}$ can identify the grand unification group $SU(5)$, $SO(10)$, or $E_6$ in typical anomalous $U(1)_A$ supersymmetric (SUSY) grand unified theory (GUT) in which nucleon decay via dimension-6 operators becomes dominant. When $R_1 > 0.4$ the grand unification group is not $SU(5)$, while when $R_1 > 1$ the grand unification group is $E_6$. Moreover, when $R_2 > 0.3$, $E_6$ is implied. Main ambiguities come from the diagonalizing matrices for quark and lepton mass matrices in this calculation once we fix the vacuum expectation values of GUT Higgs bosons. In this paper, we calculate $R_1$ and $R_2$ in $E_6\\times SU(2)_F$ SUSY GUT with anomalous $U(1)_A$ gauge symmetry, in which realistic quark and lepton masses and mixings can be obtained though the flavor symmetry $SU(2)_F$ constrains Yukawa couplings at the GUT scale. The ambiguities of Yukawa couplings are expected to be reduced. We show that the predicted region for $R_1$ and $R_2$ is more restricted than in the $E_6$ model without $SU(2)_F$ as expected. Moreover, we re-examine the previous claim for the identification of grand unification group with $100$ times more model points ($10^6$ model points), including $E_6 \\times SU(2)_F$ model. △ Less", "We provide a detailed analysis of the impact of the newly measured optimised observables in the B -> K* mu+ mu- decay by the LHCb experiment. The analysis is performed in the MSSM, both in the context of the usual constrained scenarios, and in the context of a more general set-up where the SUSY partner masses are independent. We show that the global agreement of the MSSM solutions with the data is still very good. Nevertheless, especially in the constrained scenarios, the limits from B -> K* mu+ mu- are now very strong, and are at the same level as the well-known b -> s gamma constraints. We describe the implications of the B -> K* mu+ mu- measurements both on the Wilson coefficients and on the SUSY parameters. △ Less", "An exponentially large extra dimension can be naturally realized by the Casimir energy and the gaugino condensation in 5D supersymmetric theory. The model does not require any hierarchies among the 5D parameters. The key ingredient is an additional modulus other than the radion, which generically exists in 5D supergravity. SUSY is broken at the vacuum, which can be regarded as the Scherk-Schwarz SUSY breaking. We also analyze the mass spectrum and discuss some phenomenological aspects. △ Less", "Recently the DiracNMSSM has been proposed as a possible solution to reduce the fine tuning in supersymmetry. We determine the degree of fine tuning needed in the DiracNMSSM with and without non-universal gaugino masses and compare it with the fine tuning in the GNMSSM. To apply reasonable cuts on the allowed parameter regions we perform a precise calculation of the Higgs mass. In addition, we include the limits from direct SUSY searches and dark matter abundance. We find that both models are comparable in terms of fine tuning, with the minimal fine tuning in the GNMSSM slightly smaller. △ Less", "Conventionally for observable $n-{\\bar n}$ oscillation through Pati-Salam intermediate gauge symmetry in $SO(10)$, the canonical seesaw mechanism is also constrained by $M_R \\sim M_C \\le 10^6$ GeV which yields light neutrino masses much larger than the neutrino oscillation data. Recently, this difficulty has been evaded via inverse seesaw mechanism, but with proton lifetime far beyond the experimentally accessible limits. In the present work, adopting the view that we may have only a TeV scale $Z^{\\prime}$ gauge boson, we show how a class of non-SUSY $SO(10)$ models allow experimentally verifiable proton lifetime and the new contributions to neutrinoless double beta decay in the $W_L-W_L$ channel, lepton flavor violating branching ratios, observable $n-{\\bar n}$ oscillation, and lepto-quark gauge boson mediated rare kaon decays. The occurrence of Pati-Salam gauge symmetry with unbroken D-parity and two gauge couplings at the highest intermediate scale guarantees precision unification in such models. This symmetry also ensures vanishing GUT threshold uncertainy on $\\sin^2θ_W$ or on the highest intermediate scale. Although the proton lifetime prediction is brought closer to the ongoing search limits with GUT threshold effects in the minimal model, no such effects are needed in a non-minimal model. We derive a new analytic expression for the $0νββ$ decay half-life and show how the existing experimental limits impose the lower bound on the lightest of the three heavy sterile neutrino masses, $M_{S_1}\\ge 14\\pm 4$ GeV. We also derive a new lower bound on the lepto-quark gauge boson mass mediating rare kaon decay, $M_{\\rm lepto} \\ge (1.53{\\pm 0.06})\\times 10^6$ GeV. The $n-{\\bar n}$ mixing times are predicted in the range$τ_{n-{\\bar n}}\\simeq 10^8-10^{13}$ sec. △ Less", "Although the Large Hadron Collider (LHC) has not observed supersymmetric (SUSY) partners of the Standard Model particles, their existence is not ruled out yet. One recently explored scenario in which there are light SUSY partners that have evaded current bounds from the LHC is that of a light long-lived stop quark. In this paper we consider light stop pair production at the LHC when the stop mass is between 200 and 400 GeV. If the stops are long-lived they can form a bound state, stoponium, which then undergoes two-body decays to Standard Model particles. By considering the near-threshold production of such a pair through the gluon-gluon fusion process and taking into account the strong Coulombic interactions responsible for the formation of this bound state, we obtain factorization theorems for the stop pair inclusive and differential production cross sections. We also perform a resummation of large threshold logarithms up to next-to-next-to-leading logarithmic accuracy using well-established renormalization group equations in an effective field theory methodology. These results are used to calculate the invariant mass distributions of two photons or two Z bosons coming from the decay of the stoponium at the LHC. For our choices of SUSY model parameters, the stoponium is not detectable above Standard Model backgrounds in γγor ZZ at 8 TeV, but will be visible with 400 fb^(-1) of accumulated data if its mass is below 500 GeV when the LHC runs at 14 TeV. △ Less", "We construct the Next to Leading Order JIMWLK Hamiltonian for high energy evolution in ${\\cal N}=4$ SUSY theory, and show that it possesses conformal invariance, even though it is derived using sharp cutoff on rapidity variable. The conformal transformation properties of Wilson lines are not quite the naive ones, but at NLO acquire an additional anomalous piece. We construct explicitly the inversion symmetry generator. We also show how to construct for every operator $O$, including the Hamiltonian itself, its \"conformal extension\" $\\cal O$, such that it transforms under the inversion in the naive way. △ Less", "The discovery of the Higgs boson with a mass of around 125 GeV gives a strong motivation for further study of a high-scale supersymmetry (SUSY) breaking model. In this framework, the minimal SUSY SU(5) grand unification model may be viable since heavy sfermions suppress the proton decay via color-triplet Higgs exchanges. At the same time, sizable flavor violation in sfermion masses is still allowed by low-energy precision experiments when the mass scale is as high as O(100) TeV, which naturally explains the 125 GeV Higgs mass. In the presence of the sfermon flavor violation, however, the rates and branching fractions of proton decay can be drastically changed. In this paper, we study the effects of sfermion flavor structure on proton decay and discuss the experimental constraints on sfermion flavor violation. We find that proton-decay experiments may give us a valuable knowledge on sfermon flavor violation, and by combining it with the results from other low-energy precision experiments, we can extract insights to the structure of sfermion sector as well as the underlying grand unification model. △ Less", "A natural model of realizing the effective supersymmetry is presented. Two sets of the Standard Model-like gauge group $G_1\\times G_2$ are introduced, where $G_i=SU(3)_i\\times SU(2)_i\\times U(1)_i$, which break diagonally to the Standard Model gauge group at the energy scale $M \\sim 10^7$ GeV. Gauge couplings in $G_1$ are assumed much larger than that in $G_2$. Gauge mediated supersymmetry breaking is adopted. The first two generations (third one) are charged only under $G_1$ ($G_2$). The effective supersymmetry spectrum is obtained. How to reproduce realistic Yukawa couplings is studied. Fine-tuning for an 126 GeV Higgs is much reduced by the large $A$ term due to direct Higgs-messenger interaction. Finally, $G_2$ is found to be a non-trivial realization of the strong unification scenario in which case we can predict $α_s(M_Z)$ without real unification △ Less", "In this work, we examine the sensitivity of monojet searches at the LHC to directly produced charginos and neutralinos (electroweakinos) in the limit of small mass splitting, where the traditional multilepton plus missing energy searches loose their sensitivity. We first recast the existing 8 TeV monojet search at CMS in terms of a SUSY simplified model with only light gauginos (winos and binos) or only light higgsinos. The current searches are not sensitive to MSSM like production cross sections, but would be sensitive to models with 2-20 times enhanced production cross section, for particle masses between 100 GeV and 250 GeV. Then we explore the sensitivity in the 14 TeV run of the LHC. Here we emphasise that in addition to the pure monojet search, soft leptons present in the samples can be used to increase the sensitivity. Exclusion of electroweakino masses up to 200 GeV is possible with 300 fb$^{-1}$ at the LHC, if the systematic error can be reduced to the 1% level. Discovery is possible with 3000 fb$^{-1}$ in some regions of parameter space. △ Less", "In supersymmetric models, very heavy stop squarks introduce large logarithms into the computation of the Higgs boson mass. Although it has long been known that in simple cases these logs can be resummed using effective field theory techniques, it is technically easier to use fixed-order formulas, and many public codes implement the latter. We calculate three- and four-loop next-to-next-to-leading-log corrections to the Higgs mass and compare the fixed order formulas numerically to the resummation results in order to estimate the range of supersymmetry scales where the fixed-order results are reliable. We find that the four-loop result may be accurate up to a few tens of TeV. We confirm an accidental cancellation between different three-loop terms, first observed in S. P. Martin, Phys. Rev. D 75, 055005 (2007), and show that it persists to higher scales and becomes more effective with the inclusion of higher radiative corrections. Existing partial three-loop calculations that include only one of the two cancelling terms may overestimate the Higgs mass. We give analytic expressions for the three- and four-loop corrections in terms of Standard Model parameters and provide a complete dictionary for translating parameters between the SM and the MSSM and the $\\MSbar$ and $\\DRbar$ renormalization schemes. △ Less", "We study the consequences of combining SUSY with a pseudo Nambu-Goldstone boson Higgs coming from an SO(5)/SO(4) coset and partial compositeness. In particular, we focus on how electroweak symmetry breaking and the Higgs mass are reproduced in models where the symmetry SO(5) is linearly realized. The global symmetry forbids tree-level contributions to the Higgs potential coming from D-terms, differently from what happens in most of the SUSY little-Higgs constructions. While the stops are generally heavy, light fermion top partners below 1 TeV are predicted. In contrast to what happens in non-SUSY composite Higgs models, they are necessary to reproduce the correct top, rather than Higgs, mass. En passant, we point out that, independently of SUSY, models where tR is fully composite and embedded in the 5 of SO(5) generally predict a too light Higgs. △ Less", "We consider a scenario where supersymmetry is broken at a high energy scale, out of reach of the LHC, but leaves a few fermionic states at the TeV scale. The particle content of the low-energy effective theory is similar to that of Split Supersymmetry. However, the gauginos and higgsinos are replaced by fermions carrying the same quantum numbers but having different couplings, which we call fake gauginos and fake higgsinos. We study the prediction for the light-Higgs mass in this Fake Split SUSY Model (FSSM). We find that, in contrast to Split or high-scale supersymmetry, a 126 GeV Higgs boson is easily obtained even for arbitrarily high values of the supersymmetry scale. For a supersymmetry scale greater than roughly 100 PeV, the Higgs mass is almost independent of the supersymmetry scale and the stop mixing parameter, while the observed value is achieved for tan beta between 1.3 and 1.8 depending on the gluino mass. △ Less", "This paper is devoted to reconcile the tension between theoretic expectation from naturalness and the present LHC limits on superpartner mass bounds. We argue that in SUSY models of direct gauge mediation the focusing phenomenon appears, which dramatically reduces the fine tuning associated to 126 GeV Higgs boson. This type of model is highly predictive in mass spectrum, with multi-TeV third generation, $A_t$ term of order 1 TeV, gluino mass above LHC mass bound, and light neutralinos and charginos beneath 1 TeV. △ Less", "If low-energy SUSY exists, LHC data favors a high mass scale for scalar superpartners (above a TeV), while sfermions and the dark matter can be parametrically lighter -- leading to a so-called split-spectrum. When combining this fact with the motivation from fundamental theory for shift-symmetric scalars (moduli) prior to SUSY breaking, this leads to a non-thermal history for the early universe. Such a history implies different expectations for the microscopic properties of dark matter, as well as the possibility of dark radiation and a cosmic axion background. In this paper we examine how correlated and mixed isocurvature perturbations are generated in such models, as well as the connection to dark radiation. WMAP constraints on multiple correlated isocurvature modes allow up to half of the primordial perturbations to be isocurvature, contrary to the case of a single isocurvature mode where perturbations must be dominantly adiabatic. However, such bounds are strongly prior dependent, and have not been investigated with the latest Planck data. In this paper we use the example of a SUSY non-thermal history to establish theoretical priors on cosmological parameters. Of particular interest, we find that priors on dark radiation are degenerate with those on the total amount of isocurvature -- they are inversely correlated. Dark radiation is tightly constrained in the early universe and has been used recently to place stringent constraints on string-based approaches to beyond the standard model. Our results suggest such constraints can require more input from theory. Data from cosmological probes -- such as Planck -- can help guide model building in models of the MSSM, split-SUSY, and beyond. Our model also demonstrates the utility of UV models in constructing cosmological priors. (abridged) △ Less", "In this paper, we investigate $τ^- \\to e^-(μ^-) K\\bar{K}(K\\bar{K}=K ^+K^-,K^0\\bar{K}^0)$ decays in the framework of the RPV SUSY model. We discuss the tree level contribution of the sparticles $\\tildeν$ and $\\tilde{u}$ to these decay branching ratios. In the two channels, the $\\tildeν$-mediated channel is more sensitive to the parameter product $|λ^{'*}_{i22}λ_{i31(2)}|$ than the $\\tilde{u}$-mediated channel to $|λ^{'*}_{1(2)j2}λ'_{3j2}|$. And the parameter product $|λ^{'*}_{i22}λ_{i31(2)}|$ is severely constrained to the order of ${\\cal O}(10^{-5})$ by the experiment data with $m_{\\tildeν}=100 GeV$, which is one order of magnitude more stringent than before. In the calculation of hadronic matrix elements, the resonant effects are large than those of non-resonant terms. Especially, the resonant contribution of scalar meson $f_{(980)}$ plays a dominate role in $\\tildeν$-mediated channel. △ Less", "We study models of gauge mediated SUSY breaking with more than one hidden sector. In these models the neutralino sector of the MSSM is supplemented with additional light neutral fermions, the nearly massless gravitino and the massive pseudo-goldstini. For the case where the Bino is the lightest ordinary SUSY particle, its preferred decay is to a photon and the heaviest pseudo-goldstino, which generically cascades down to lighter pseudo-goldstini, or to the gravitino, in association with photons. This gives rise to multiphoton plus missing energy signatures at the LHC. We investigate in detail simplified models where the SUSY spectrum consists of the right-handed sleptons, a Bino-like neutralino, the pseudo-goldstini and the gravitino. We compare against existing LHC searches and show that the sensitivity to our models could be significantly improved by relaxing the kinematic cuts and requiring additional final state particles. We propose inclusive searches in the final state with at least three photons plus missing energy and in the final state with at least two photons plus two leptons plus missing energy, the former being sensitive to any production mode and the latter being optimized for slepton pair production. We show that they could lead to an observation (or strong constraints) already with the data set from LHC Run I, and present prospects for LHC Run II. △ Less", "We study models of gauge-mediated supersymmetry breaking with a gauged horizontal SU(3)_F symmetry acting on the quark superfields. If SU(3)_F is broken non-supersymmetrically by F-term vacuum expectation values, the massive gauge bosons and gauginos become messengers for SUSY breaking mediation. These gauge messenger fields induce a flavour-dependent, negative contribution to the soft masses of the squarks at one loop. In combination with the soft terms from standard gauge mediation, one obtains large and degenerate first- and second-generation squark masses, while the stops and sbottoms are light. We discuss the implications of this mechanism for the superparticle spectrum and for flavour precision observables. We also provide an explicit realization in a model with simultaneous SUSY and SU(3)_F breaking. △ Less", "Our study starts with a sequence of puzzles that include $(a)$ at which level $μ$ problem involving electroweak symmetry breaking can be solved; $(b)$ in which paradigm masses of superpartners in the third family can be lighter than in the first two families; $(c)$ whether it is possible to accommodate 125 GeV Higgs boson simultaneously; and $(d)$ how natural such paradigm is. These issues are considered in the context of two-site SUSY models. Both the MSSM and NMSSM as low-energy effective theory below the scale of two-site gauge symmetry breaking are investigated. We find that the fine tuning can be indeed reduced in comparison with ordinary MSSM with $m_{h}=125$ GeV. In general, the fine tuning parameter $Δ$ is in the range of $20-400$. △ Less", "Several supersymmetric models in which there is a (partially) composite Higgs boson arising from (coupled to) a strong sector have been proposed. Such strong dynamics would help to cause the electroweak symmetry breaking naturally. In this paper, we focus on the compositeness of the Higgsinos in such models. We show that such a Higgsino compositeness can induce the characteristic decay branching fraction of the neutralinos. In such scenarios, the decay branching fraction of the second lightest neutral Higgsino into the lightest neutral Higgsino with photon can be large due to a dipole interaction. We also discuss the Higgsino dark matter feature. The annihilation cross section into gamma Z can be large. △ Less", "Results are presented for a variety of SUSY Simplified Models at the 14 TeV LHC as well as a 33 and 100 TeV proton collider. Our focus is on models whose signals are driven by colored production. We present projections of the upper limit and discovery reach in the gluino-neutralino (for both light and heavy flavor decays), squark-neutralino, and gluino-squark Simplified Model planes. Depending on the model a jets + MET, mono-jet, or same-sign di-lepton search is applied. The impact of pileup is explored. This study utilizes the Snowmass backgrounds and combined detector. Assuming 3000 fb^{-1} of integrated luminosity, a gluino that decays to light flavor quarks can be discovered below 2.3 TeV at the 14 TeV LHC and below 11 TeV at a 100 TeV machine. △ Less", "Unlike the Standard Model (SM), supersymmetric models stabilize the electroweak (EW) scale $v$ at the quantum level and {\\it predict} that $v$ is a function of the TeV-valued SUSY parameters ($γ_α$) of the UV Lagrangian. We show that the (inverse of the) covariance matrix of the model in the basis of these parameters and the usual deviation $δχ^2$ (from $χ^2_{min}$ of a model) automatically encode information about the \"traditional\" EW fine-tuning measuring this stability, {\\it provided that} the EW scale $v\\sim m_Z$ is indeed regarded as a function $v=v(γ)$. It is known that large EW fine-tuning may signal an incomplete theory of soft terms and can be reduced when relations among $γ_α$ exist (due to GUT symmetries, etc). The global correlation coefficient of this matrix can help one investigate if such relations are present. An upper bound on the usual EW fine-tuning measure (\"in quadrature\") emerges from the analysis of the $δχ^2$ and the s-standard deviation confidence interval by using $v=v(γ)$ and the theoretical approximation (loop order) considered for the calculation of the observables. This upper bound avoids subjective criteria for the \"acceptable\" level of EW fine-tuning for which the model is still \"natural\". △ Less", "Superheavy threshold corrections to the matching condition between matter Yukawa couplings of the effective Minimal Supersymmetric Standard Model (MSSM) and the New Minimal Supersymmetric (SO(10)) GUT(NMSGUT) provide a novel and generic mechanism for reducing the long standing and generically problematic operator dimension 5 Baryon decay rates. In suitable regions of the parameter space strong wave function renormalization of the effective MSSM Higgs doublets due to the large number of heavy fields can take the wave function renormalization of the MSSM Higgs field close to the dissolution value ($Z_{H,\\overline{H}}=0$). Rescaling to canonical kinetic terms lowers the SO(10) Yukawas required to match the MSSM fermion data. Since the same Yukawas determine the dimension 5 B violation operator coefficients, the associated rates can be suppressed to levels compatible with current limits. Including these threshold effects also relaxes the constraint $ y_b-y_τ\\simeq y_s-y_μ$ operative between $\\textbf{10} -\\textbf{120} $ plet generated tree level MSSM matter fermion Yukawas $y_f$. We exhibit accurate fits of the MSSM fermion mass-mixing data in terms of NMSGUT superpotential couplings and 5 independent soft Susy breaking parameters specified at $10^{16.25}\\,$ GeV with the claimed suppression of Baryon decay rates. As before, our s-spectra are of the mini split supersymmetry type with large $|A_0|,μ,m_{H,\\overline H} > 100\\,\\,$ TeV, light gauginos and normal s-hierarchy. Large $A_0,μ$ and soft masses allow significant deviation from the canonical GUT gaugino mass ratios and ensure vacuum safety. Even without optimization, prominent candidates for BSM discovery such as the muon magnetic anomaly, $b\\rightarrow sγ$ and Lepto-genesis CP violation emerge in the preferred ball park. △ Less", "The SUSY flavor, CP, gravitino and proton-decay problems are all solved to varying degrees by a decoupling solution wherein first/second generation matter scalars would exist in the multi-TeV regime. Recent models of natural SUSY presumably allow for a co-existence of naturalness with the decoupling solution. We show that: if sfermions are heavier than $\\sim 10$ TeV, then a small first/second generation contribution to electroweak fine-tuning (EWFT) requires a rather high degree of intra-generational degeneracy of either 1. (separately) squarks and sleptons, 2. (separately) left- and right-type sfermions, 3. members of SU(5) multiplets, or 4. all members of a single generation as in SO(10). These (partial) degeneracy patterns required by naturalness hint at the necessity of an organizing principle, and highlight the limitations of models such as the pMSSM in the case of decoupled first/second generation scalars. △ Less", "Democracy among the same type of particles is a useful paradigm in studying masses and interactions of particles with supersymmetry(SUSY) or without SUSY. This simple idea predicts the presence of massless particles. We attempt to use one of these massless pseudoscalar particles as generating the cosmological dark energy(DE) potential. To achieve the extremely shallow potential of DE, the pseudoscalar boson is required not to couple to the QCD anomaly. So, we consider two pseudoscalars, one coupling to the QCD anomaly (i.e. QCD axion) and the other not coupling to the QCD anomaly. To obtain these two pseudoscalars, we introduce two approximate global U(1) symmetries to realize them as the pseudo-Goldstone bosons of the spontaneously broken U(1)'s. These global symmetries are dictated by a gravity respected discrete symmetry. Specifically, we consider an S2(L) X S2(R) X Z(10R) example, and attempt to obtain the DE scale in terms of two observed fundamental mass scales, the grand unification scale M(G) and the electroweak scale v(ew). △ Less", "In split-family SUSY, one can use a U(2)^3 symmetry to protect flavour observables in the quark sector from SUSY contributions. However, attempts to extend this procedure to the lepton sector by using an analogous U(2)^5 symmetry fail to reproduce the neutrino data without introducing some form of fine-tuning. In this work, we solve this problem by shifting the U(2)^2 symmetry acting on leptons towards the second and third generations. This allows neutrino data to be reproduced without much difficulties, as well as protecting the leptonic flavour observables from SUSY. Key signatures are a $μ\\to eγ$ branching ratio possibly observable in the near future, as well as having selectrons as the lightest sleptons. △ Less", "Recently, first results were presented for two-loop corrections to the muon (g-2) from fermion/sfermion loops in the MSSM. These corrections were shown to be generally large and even logarithmically enhanced for heavy sfermions. Here, full details of the calculation and analytical results are presented. Also, a very compact formula is provided which can be easily implemented and serves as a good approximation of the full result as a function of the fourteen most important input parameters. Finally, a thorough discussion of the numerical behaviour of the fermion/sfermion-loop corrections to (g-2)_μ is given. The discussion includes the case of very heavy SUSY masses as well as experimentally allowed scenarios with very light SUSY masses. △ Less", "We describe a methodology for testing No-Scale Supergravity by the LAT instrument onboard the Fermi Space Telescope via observation of gamma ray emissions from lightest supersymmetric (SUSY) neutralino annihilations. For our test vehicle we engage the framework of the supersymmetric grand unified model No-Scale Flipped $SU(5)$ with extra vector-like flippon multiplets derived from F-Theory, known as $\\cal{F}$-$SU(5)$. We show that through compression of the light stau and light bino neutralino mass difference, where internal bremsstrahlung (IB) photons give a dominant contribution, the photon yield from annihilation of SUSY dark matter can be elevated to a number of events potentially observable by the Fermi-LAT in the coming years. Likewise, the increased yield in No-Scale $\\cal{F}$-$SU(5)$ may also have rendered the existing observation of a 133 GeV monochromatic gamma ray line visible, if additional data should exclude systematic or statistical explanations. The question of intensity aside, No-Scale $\\cal{F}$-$SU(5)$ can indeed provide a natural weakly interacting massive particle (WIMP) candidate with a mass in the correct range to yield $γγ$ and $γZ$ emission lines at $m_χ \\sim 133$ GeV and $m_χ \\sim 145$ GeV, respectively. Additionally, we elucidate the emerging empirical connection between recent Planck satellite data and No-Scale Supergravity cosmological models which mimic the Starobinsky model of inflation. Together, these experiments furnish rich alternate avenues for testing No-Scale $\\cal{F}$-$SU(5)$, and similarly structured models, the results of which may lend independent credence to observations made at the LHC. △ Less", "In SUSY, a light dark matter is usually accompanied by light scalars to achieve the correct relic density, which opens new decay channels of the SM like Higgs boson. Under current experimental constraints including the latest LHC Higgs data and the dark matter relic density, we examine the status of a light neutralino dark matter in the framework of NMSSM and confront it with the direct detection results of CoGeNT, CDMS-II and LUX. We have the following observations: (i) A dark matter as light as 8 GeV is still allowed and its scattering cross section off the nucleon can be large enough to explain the CoGeNT/CDMS-II favored region; (ii) The LUX data can exclude a sizable part of the allowed parameter space, but still leaves a light dark matter viable; (iii) The SM-like Higgs boson can decay into the light dark matter pair with an invisible branching ratio reaching 30% under the current LHC Higgs data, which may be tested at the 14 TeV LHC experiment. △ Less", "Supersymmetric scenarios where the lightest superparticle (LSP) is the gravitino are an attractive alternative to the widely studied case of a neutralino LSP. A strong motivation for a gravitino LSP arises from the possibility of achieving higher reheating temperatures and thus potentially allow for thermal leptogenesis. The predictions for the primordial abundances of light elements in the presence of a late decaying next-to-LSP (NSLP) as well as the currently measured dark matter abundance allow us to probe the cosmological viability of such a scenario. Here we consider a gravitino-stau scenario. Utilizing a pMSSM scan we work out the implications of the 7 and 8 TeV LHC results as well as other experimental and theoretical constraints on the highest reheating temperatures that are cosmologically allowed. Our analysis shows that points with T_R>10^9 GeV survive only in a very particular corner of the SUSY parameter space. Those spectra feature a distinct signature at colliders that could be looked at in the upcoming LHC run. △ Less", "We study resonant gravitino production in the early Universe in the presence of SUSY flat directions whose large VEVs break some but not all gauge symmetries. We find that for a large region of parameter space the gravitino abundance is several orders of magnitude larger than the cosmological upper bound. Since flat directions with large VEVs are generically expected in supersymmetric theories this result further exacerbates the gravitino problem. △ Less", "We examine the effective low-energy theory of the adjoint sector of Dirac gaugino models and its UV completions, and identify the main source of tuning. A holomorphic scalar adjoint mass square (the \"$b_M$ term\") is generated at the same order (1-loop) as the Dirac gaugino mass (the \"$m_D$ term\"), leading to the problematic relation $b_M\\sim16π^2 m_D^2$, somewhat analogous to the $μ-B_μ$ problem of gauge mediation. We identify the leading operators of the low-energy effective theory contributing to the adjoint sector, and evaluate them in various UV completions, confirming the existence of this problem. We suggest a solution by introducing messenger mixing and tuning the relevant parameters. We also present a novel dynamical model for Dirac gauginos based on a strongly coupled SUSY QCD theory, where the additional adjoint $M$ is identified with a confined meson, the U(1) with a baryon-number like symmetry, and the messengers with the confined baryons. We find a SUSY breaking vacuum with a non-vanishing D-term, which after tuning the messenger mixing angles gives rise to a realistic gaugino and squark sector. △ Less", "We investigate a strategy to search for light, nearly degenerate higgsinos within the natural MSSM at the LHC. We demonstrate that the higgsino mass range $μ$ in $100-150$ GeV, which is preferred by the naturalness, can be probed at $2σ$ significance through the monojet search at 14 TeV HL-LHC with 3000 fb$^{-1}$ luminosity. The proposed method can also probe certain region in the parameter space for the lightest neutralino with a high higgsino purity, that cannot be reached by planned direct detection experiments at XENON-1T(2017). △ Less", "The LHC has placed stringent limits on superpartner masses, in conflict with naturalness. R-parity violation is one of the few scenarios that allows reduction of these limits and is thus worth significant exploration at the LHC. We demonstrate that if the R-parity violating operator UDD is used, we generically expect all SUSY events at the LHC to have displaced vertices. If a squark is the LSP, it will have a short displaced vertex. If any other particle is the LSP, the displaced vertex is naturally expected to be quite long, possibly even outside the detectors. These scenarios are already constrained by existing searches for missing energy. This arises because this operator efficiently washes-out the baryon asymmetry in the early universe, unless the squarks are heavy and the coupling is small. Avoiding displaced vertices is possible, but requires baryogenesis below the weak scale. Thus, for example, the use of sphalerons in baryogenesis does not avoid the requirement of displaced vertices. This motivates searching for hadronic displaced vertices at the LHC with decay lengths anywhere from tens of microns to meters. △ Less", "We perform a comprehensive study of $SU(5)$, $SO(10)$ and $E(6)$ supersymmetric GUT models where the gaugino masses are generated through the F-term breaking vacuum expectation values of the non-singlet scalar fields. In these models the gauginos are non-universal at the GUT scale unlike in the mSUGRA scenario. We discuss the properties of the LSP which is stable and a viable candidate for cold dark matter. We look for the GUT scale parameter space that leads to the the lightest SM like Higgs mass in the range of 122-127 GeV compatible with the observations at ATLAS and CMS, the relic density in the allowed range of WMAP-PLANCK and compatible with other constraints from colliders and direct detection experiments. We scan universal scalar ($m_0^G$), trilinear coupling $A_0$ and $SU(3)_C$ gaugino mass ($M_3^G$) as the independent free parameters for these models. Based on the gaugino mass ratios at the GUT scale, we classify 25 SUSY GUT models and find that of these only 13 models satisfy the dark matter and collider constraints. Out of these 13 models there is only one model where there is a sizeable SUSY contribution to muon $(g-2)$. △ Less", "Supersymmetric models with a small neutralino-chargino mass difference, and as a result metastable charginos, have been a popular topic of investigation in collider phenomenology, e.g. in anomaly-mediated models of supersymmetry breaking. Recently, the absence of any supersymmetric signal at the 8 TeV LHC data has led to significant interest in the so-called Natural SUSY models with light higgsinos. These models also have a naturally small neutralino-chargino mass difference. However, we show here that when relevant indirect constraints from results at the LHC and elsewhere are applied, this possibility is heavily constrained within the Minimal Supersymmetric Standard Model (MSSM): massive metastable higgsinos are not a signature of Natural SUSY. △ Less", "We recalculate the two-loop beta functions for three gauge couplings taking into account all low energy threshold corrections in split supersymmetry (split-SUSY) which assumes a very high scalar mass scale M_S. We find that, in split-SUSY with gaugino mass unification assumption and a large M_S, the gauge coupling unification requires a lower bound on gaugino mass. Combined with the constraints from the dark matter relic density and direct detection limits, we find that split-SUSY is very restricted and for dark matter mass below 1 TeV the allowed parameter space can be fully covered by XENON-1T(2017). △ Less", "We investigate the connection between R-parity violation (RPV) in supersymmetric models and Baryogenesis. First we discuss in detail the assumptions of a theorem by Nanopoulos and Weinberg on the CP asymmetry generated from the decay of massive particles. In light of this statement, we analyse some interesting models of Baryogenesis through RPV. We then explore, in the context of RPV SUSY, the possibility to generate the baryon asymmetry through the out-of-equilibrium decay of a metastable Weakly Interacting Massive Particle (WIMP), as proposed in \\cite{Cui:2012jh}. This setting is also motivated by the observed coincidence between the abundances of dark and baryonic matter. In this framework, we propose two models of out-of-equilibrium decay of a would-be cold relic, and compute the associated CP asymmetry. With a TeV-scale parent, the observed baryon abundance can be reproduced in these models when the stop is in the multi-TeV region. Furthermore, annihilation of the metastable particle into SM states must be characterised by a very weak coupling, $g\\sim 10^{-2}$ and by a heavy mediator $m_{med}\\sim 10$ TeV. These models can also accommodate stop masses far from the TeV scale, at the expense of weakening the explanation of the $Ω_{B}-Ω_{DM}$ coincidence. △ Less", "Following recent experimental developments, in this study we re-evaluate if the interplay of high- and low-energy lepton flavour violating observables remains a viable probe to test the high-scale type-I supersymmetric seesaw. Our analysis shows that fully constrained supersymmetric scenarios no longer allow to explore this interplay, since recent LHC data precludes the possibility of having sizeable slepton mass differences for a slepton spectrum sufficiently light to be produced, and in association to BR(mu -> e gamma) within experimental reach. However, relaxing the strict universality of supersymmetric soft-breaking terms, and fully exploring heavy neutrino dynamics, still allows to have slepton mass splittings O(few %), for slepton masses accessible at the LHC, with associated mu -> e gamma rates within future sensitivity. For these scenarios, we illustrate how the correlation between high- and low-energy lepton flavour violating observables allows to probe the high-scale supersymmetric seesaw. △ Less", "We present the new version of the Mathematica package SARAH which provides the same features for a non-supersymmetric model as previous versions for supersymmetric models. This includes an easy and straightforward definition of the model, the calculation of all vertices, mass matrices, tadpole equations, and self-energies. Also the two-loop renormalization group equations for a general gauge theory are now included and have been validated with the independent Python code PyR@te. Model files for FeynArts, CalcHep/CompHep, WHIZARD and in the UFO format can be written, and source code for SPheno for the calculation of the mass spectrum, a set of precision observables, and the decay widths and branching ratios of all states can be generated. Furthermore, the new version includes routines to output model files for Vevacious for both, supersymmetric and non-supersymmetric, models. Global symmetries are also supported with this version and by linking Susyno the handling of Lie groups has been improved and extended. △ Less", "We discussed in arXiv:1209.0772 that the laboratory frame distribution of the energy of a massless particle from a two-body decay at a hadron collider has a peak whose location is identical to the value of this daughter's (fixed) energy in the rest frame of the corresponding mother particle. For that result to hold we assumed that the mother is unpolarized and has a generic boost distribution in the laboratory frame. In this work we discuss how this observation can be applied for determination of masses of new particles, without requiring a full reconstruction of their decay chains or information about the rest of the event. We focus on a two-step cascade decay of a massive particle that has one invisible particle in the final state: C -> Bb -> Aab, where C, B and A are new particles of which A is invisible and a, b are visible particles. Combining the measurements of the peaks of energy distributions of a and b with that of the edge in their invariant mass distribution, we demonstrate that it is in principle possible to determine separately all three masses of the new particles, in particular, without using any measurement of missing transverse momentum. Furthermore, we show how the use of the peaks in an inclusive energy distribution is generically less affected by combinatorial issues as compared to other mass measurement strategies. For some simplified, yet interesting, scenarios we find that these combinatorial issues are absent altogether. As an example of this general strategy, we study SUSY models where gluino decays to an invisible lightest neutralino via an on-shell bottom squark. Taking into account the dominant backgrounds, we show how the mass of the bottom squark, the gluino and (for some class of spectra) that of the neutralino can be determined using this technique. △ Less", "We analyse the two-loop renormalization group (RG) flow of the gauge and Yukawa couplings within the E6 inspired supersymmetric (SUSY) models with extra U(1)_{N} gauge symmetry under which right-handed neutrinos have zero charge. In these models single discrete \\tilde{Z}^{H}_2 symmetry forbids the tree-level flavor-changing transitions and the most dangerous baryon and lepton number violating operators. We consider two different scenarios A and B that involve extra matter beyond the MSSM contained in three and four 5+\\overline{5} representations of SU(5) respectively plus three SU(5) singlets which carry U(1)_{N} charges. In the scenario A the measured values of the SU(2)_W and U(1)_Y gauge couplings lie near the fixed points of the RG equations. In the scenario B the contribution of two--loop corrections spoils the unification of gauge couplings resulting in the appearance of the Landau pole below the Grand Unification scale M_X. The solutions for the Yukawa couplings also approach the quasi fixed points with increasing their values at the scale M_X. We calculate the two--loop upper bounds on the lightest Higgs boson mass in the vicinity of these quasi fixed points and compare the results of our analysis with the corresponding ones in the NMSSM. In all these cases the theoretical restrictions on the SM--like Higgs boson mass are rather close to 125 GeV. △ Less", "In this paper, we consider high scale (100 TeV) supersymmetry (SUSY) breaking and realize the idea of hilltop supernatural inflation in concrete particle physics models based on flipped-SU(5) and Pati-Salam models in the framework of supersymmetric grand unified theories (SUSY GUTs). The inflaton can be a flat direction including right-handed sneutrino and the waterfall field is a GUT Higgs. The spectral index is $n_s=0.96$ which fits very well with recent data by PLANCK satellite. There is no both thermal and non-thermal gravitino problems. Non-thermal leptogenesis can be resulted from the decay of right-handed sneutrino which plays (part of) the role of inflaton. △ Less", "Direct LHC bounds on colored SUSY particles now corner naturalness more than the measured value of the Higgs mass does. Bounds on the gluino are of particular importance, since it radiatively \"sucks\" up the stop and Higgs-up soft masses. As a result, even models that easily accommodate a 125 GeV Higgs are almost as tuned as the simplest version of SUSY, the MSSM: at best at the percent level. In this paper, we further examine how current LHC results constrain naturalness in three classes of models that may relax LHC bounds on sparticles: split families, baryonic RPV, and Dirac gauginos. In models of split families and bRPV, the bounds on the gluino are only slightly reduced, resulting in a few percent tuning. In particular, having a natural spectrum in bRPV models typically implies that tops, Ws, and Zs are easily produced in the cascade decays of squarks and gluinos. The resulting leptons and missing energy push the gluino mass limit above 1 TeV. Even when the gluino has a Dirac mass and does not contribute to the stop mass at one loop, tuning reappears in calculable models because there is no symmetry imposing the supersoft limit. We conclude that, even if sparticles are found at LHC-14, naturalness will not emerge triumphant. △ Less", "We present and publish a Mathematica package, which can be used to automatically obtain any numerical MSSM input parameter from SUSY spectrum generators, which follow the SLHA standard, like Spheno, Softsusy, Suseflav or Suspect. The package enables a very comfortable way of numerical evaluations within the MSSM using Mathematica. It implements easy to use predefined high scale and low scale scenarios like mSUGRA or $m_h^{\\rm max}$ and if needed enables the user to directly specify the input required by the spectrum generators. In addition it supports an automatic saving and loading of SUSY spectra to and from a SQL data base, avoiding the rerun of a spectrum generator for a known spectrum. △ Less", "Recent results from the LHC experiments, both for the Higgs mass measurement and the direct search for supersymmetric (SUSY) particles, might indicate that the SUSY breaking scale is much higher than the electroweak scale. Although it is difficult to investigate such a scenario at collider experiments, the measurement of the hadronic electric dipole moments is one of promising ways to detect the effects of the SUSY particles. These effects are expressed in terms of the CP-violating effective operators defined at the SUSY breaking scale, which involve quarks, gluons, photons, and gluinos. In this paper, we discuss the QCD corrections to the effective operators in the high-scale SUSY scenario. To appropriately evaluate the radiative corrections in the presence of large mass hierarchy among the SUSY particles, we exploit an effective theoretical approach based on the renormalization-group equations. As a result, it is found that the low-energy quark electric and chromoelectric dipole moments may differ from those evaluated in previous works by O(100) % and O(10) %, respectively. △ Less", "Within the framework of N=1 gauged supergravity, using a phenomenological model which can be obtained locally as a Swiss-Cheese Calabi-Yau string-theoretic compactification with a mobile D3-brane localized on a nearly sLag three-cycle in the Calabi-Yau and fluxed stacks of wrapped D7-branes, and which provides a natural realization of mu-Split SUSY, we show that in addition to getting a significant value of electron/neutron EDM d_{e,n}/e at two-loop level, one can obtain a sizable contribution of d_{e,n}/e even at one-loop level. We obtain d_{e}/e ~ O(10^{-29}) cm from two-loop diagrams involving heavy sfermions and a light Higgs, and d_{e}/e ~ O(10^{-32}) cm from one-loop diagram involving heavy chargino and a light Higgs. Also, d_{n}/e ~ O(10^{-33}) cm from one-loop diagram involving SM-like quarks and Higgs. Next, by considering a Barr-Zee diagram involving W bosons and Higgs, and conjecturing that the CP-violating phase can appear from a linear combination of Higgs doublet obtained in the context of mu-split SUSY, we obtain d_{e,n}/e ~ O(10^{-27}) cm at two-loop level . △ Less", "In this work we study the collider phenomenology of a compressed supersymmetric model with gluino and the lightest neutralino. All other sparticles are assumed to be heavy. We consider gluino pair production at the 14 TeV LHC and present the mass reach of gluino as a function of mass splitting between gluino and the the lightest neutralino. We find that the gluino mass below 1 TeV can be excluded at 95% CL with integrated luminosity of 100 fb$^{-1}$ for extreme degenerate case where mass separation between gluino and the lightest neutralino is about 20 GeV. On the other hand, the lower bound on the mass of gluino increases to 1.2 - 1.3 TeV if the mass splitting between the gluino and neutralino is about 200 GeV. This result shows that for degenerate gluino, the current mass limit may extend approximately 400-500 GeV at 14 TeV LHC. △ Less"]