["We revisit a class of $SU(5)$ SUSY GUT models which arise in the context of the spectral cover with Klein Group monodromy $V_4=Z_2\\times Z_2$. We show that $Z_2$ matter parities can be realised via new geometric symmetries respected by the spectral cover. We discuss a particular example of this kind, where the low energy effective theory below the GUT scale is just the MSSM with no exotics and standard matter parity, extended by the seesaw mechanism with two right-handed neutrinos. △ Less", "The addition of the QCD axion to the Minimal Supersymmetric Standard Model (MSSM) not only solves the strong CP problem but also modifies the dark sector with new dark matter candidates. While SUSY axion phenomenology is usually restricted to searches for the axion itself or searches for the ordinary SUSY particles, this work focuses on scenarios where the axion's superpartner, the axino, may be detectable at the Large Hadron Collider (LHC) in the decays of neutralinos displaced from the primary vertex. In particular, we focus on the KSVZ axino within the hadronic axion window. The decay length of neutralinos in this scenario easily fits the ATLAS detector for SUSY spectra expected to be testable at the 14 TeV LHC. We compare this signature of displaced decays to axinos to other well motivated scenarios containing a long lived neutralino which decays inside the detector. These alternative scenarios can in some cases very closely mimic the expected axino signature, and the degree to which they are distinguishable is discussed. We also briefly comment on the cosmological viability of such a scenario. △ Less", "I discuss some essential features of the electroweak hierarchy problem and the ensuing motivation for weak-scale supersymmetry. Taking the hierarchy problem seriously, null results in searches for SUSY at the LHC favor specific regions of SUSY parameter space. More broadly, they suggest investigating a variety of alternative approaches to the hierarchy problem with diverse experimental signatures. △ Less", "Grand Unified Theories (GUTs) can feature predictions for the ratios of quark and lepton Yukawa couplings at high energy, which can be tested with the increasingly precise results for the fermion masses, given at low energies. To perform such tests, the renormalization group (RG) running has to be performed with sufficient accuracy. In supersymmetric (SUSY) theories, the one-loop threshold corrections (TC) are of particular importance and, since they affect the quark-lepton mass relations, link a given GUT flavour model to the sparticle spectrum. To accurately study such predictions, we extend and generalize various formulas in the literature which are needed for a precision analysis of SUSY flavour GUT models. We introduce the new software tool SusyTC, a major extension to the Mathematica package REAP, where these formulas are implemented. SusyTC extends the functionality of REAP by a full inclusion of the (complex) MSSM SUSY sector and a careful calculation of the one-loop SUSY threshold corrections for the full down-type quark, up-type quark and charged lepton Yukawa coupling matrices in the electroweak-unbroken phase. Among other useful features, SusyTC calculates the one-loop corrected pole mass of the charged (or the CP-odd) Higgs boson as well as provides output in SLHA conventions, i.e. the necessary input for external software, e.g. for performing a two-loop Higgs mass calculation. We apply SusyTC to study the predictions for the parameters of the CMSSM (mSUGRA) SUSY scenario from the set of GUT scale Yukawa relations $y_e / y_d = - 1/2$, $y_μ/ y_s = 6$, and $y_τ/ y_b = - 3/2$, which has been proposed recently in the context of SUSY GUT flavour models. △ Less", "The ATLAS experiment observed an excess at the $3σ$ level in the channel of $Z$ boson, jets and high missing transverse momentum in the full 2012 dataset at 8 TeV while searching for SUSY. The question arises whether the abundance and the kinematical features of this excess are compatible with the yet unconstrained supersymmetric realm, respecting at the same time the measured Higgs boson properties and dark matter density. By trying to explain this signal with SUSY we find that only relatively light gluinos together with a heavy neutralino NLSP decaying predominantly to a $Z$ boson plus a light gravitino could reproduce the excess. We construct an explicit general gauge mediation model able to match the observed signal. More sophisticated models could also reproduce the signal, as long as it features light gluinos, or heavy particles with a strong production cross section, producing at least one $Z$ boson in its decay chain. The implications of our findings for the Run II at LHC with the scaling on the $Z$ peak, as well as for the direct search of gluinos and other SUSY particles, are also discussed. △ Less", "The evidence for a new singlet scalar particle from the 750 GeV diphoton excess, and the absence of any other signal of new physics at the LHC so far, suggest the existence of new coloured scalars. To study this possibility, we propose a supersymmetry inspired simplified model, extending the Standard Model with a singlet scalar and with heavy scalar fields carrying both colour and electric charges -- the `squarks'. To allow the latter to decay, and to generate the dark matter of the Universe, we also add a neutral fermion to the particle content. We show that this model provides a two-parameter fit to the observed diphoton excess consistently with cosmology, while the allowed parameter space is bounded by the consistency of the model. In the context of our simplified model this implies the existence of other supersymmetric particles accessible at the LHC, rendering this scenario falsifiable. If this excess persists, it will imply a paradigm shift in assessing supersymmetry breaking and the role of scalars in low scale physics. △ Less", "Searches for supersymmetry (SUSY) at the LHC frequently assume the conservation of $R$-parity in their design, optimization and interpretation. In the case that $R$-parity is not conserved, constraints on SUSY particle masses tend to be weakened with respect to $R$-parity-conserving models. We review the current status of searches for $R$-parity-violating (RPV) supersymmetry models at the ATLAS and CMS experiments, limited to 8 TeV search results published or submitted for publication as of the end of March 2015. All forms of renormalisable RPV terms leading to prompt signatures have been considered in the set of analyses under review. Discussing results for searches for prompt R-parity-violating SUSY signatures summarizes the main constraints for various RPV models from LHC Run I and also defines the basis for promising signal regions to be optimized for Run II. In addition to identifying highly constrained regions from existing searches, also gaps in the coverage of the parameter space of RPV SUSY are outlined. △ Less", "We provide an anthropic reason that the supersymmetry breaking scale is much higher than the electroweak scale as indicated by the null result of collider experiments and observed 125 GeV Higgs boson. We focus on a new inflation model as a typical low-scale inflation model that may be expected in the string landscape. In this model, the R-symmetry is broken at the minimum of the inflaton potential and its breaking scale is related to the reheating temperature. Once we admit that the anthropic principle requires thermal leptogenesis, we obtain a lower bound on gravitino mass, which is related to R-symmetry breaking scale. This scenario and resulting gravitino mass predict the consistent amplitude of density perturbations. We also find that string axions and saxions are consistently implemented in this scenario. △ Less", "We analyse the low-energy phenomenology of alignment models both model-independently and within supersymmetric (SUSY) scenarios focusing on their CP violation tests at LHCII. Assuming that New Physics (NP) contributes to K-Kbar and D-Dbar mixings only through non-renormalizable operators involving SU(2)_L quark-doublets, we derive model-independent correlations among CP violating observables of the two systems. Due to universality of CP violation in Delta F=1 processes the bound on CP violation in Kaon mixing generically leads to an upper bound on the size of CP violation in D mixing. Interestingly, this bound is similar in magnitude to the current sensitivity reached by the LHCb experiment which is starting now to probe the natural predictions of alignment models. Within SUSY, we perform an exact analytical computation of the full set of contributions for the D-Dbar mixing amplitude. We point out that chargino effects are comparable and often dominant with respect to gluino contributions making their inclusion in phenomenological analyses essential. As a byproduct, we clarify the limit of applicability of the commonly used mass insertion approximation in scenarios with quasi-degenerate and split squarks. △ Less", "Intersecting D-brane models in string theory can naturally support the gauge and matter content of left-right symmetric extensions of the Standard Model with gauge symmetry SU(3)_c x SU(2)_L x SU(2)_R x U(1)_{B-L}. Considering such models as candidates for explaining the 2TeV excesses seen in Run-1 by both ATLAS and CMS, the minimal possible scale of supersymmetry breaking is determined by the requirement of precise one-loop gauge coupling unification. For the vector-like, bifundamental and (anti-)symmetric Higgs content of such brane configurations, this comes out fairly universally at around 19TeV. For the SU(2)_R gauge coupling one finds values 0.48<g_R(M_R)<0.6. Threshold corrections can potentially lower the scale of supersymmetry breaking. △ Less", "The SUSY-GUT paradigm is the most promising scenario for the physics beyond the Standard Model. After the LHC run I, it is of interest to reanalyze the room still remaining for SUSY-GUT inspired models and to study the limits on the SUSY mass spectrum. Assuming one step unification of gauge couplings, under some natural requirements we have obtained the energy upper bound for the observation of SUSY phenomenology. We found that in the SUSY-GUT framework the mass of lightest gluino or Higgsino cannot be larger than about 20 TeV. △ Less", "Searches at the Large Hadron Collider (LHC) for neutral, long-lived particles have historically relied on the detection of displaced particles produced by their decay $\\textit{within}$ the detector volume. In this paper we study the potential of the complementary signature comprising of the missing transverse energy ($E_T^{miss}$) signal, traditionally used to look for dark matter, e.g., the lightest supersymmetric particle (LSP), to extend the LHC coverage to models with long-lived (LL) particles when they decay $\\textit{outside}$ the detector. Using CMS and ATLAS analyses at the 8 TeV LHC, we set an upper limit at the 95% confidence level (CL) on the production cross sections for two specific scenarios: (i) a model with a heavy non-standard model Higgs boson decaying to a LL scalar and (ii) an R-parity violating RPV SUSY model with a LL neutralino. We show that this method can significantly extend the LHC sensitivity to neutral, LL particles with arbitrary large lifetimes and that the limits obtained from a $E_T^{miss}$ signal are comparable to those from displaced particle searches for decay distances above a few meters. Results obtained in this study do not not depend on the specific decay channel of the LL particle and therefore are model-independent in this sense. We provide limits for the whole two-dimensional plane in terms of the mass of the LL particle and the mass of the mediator up to masses of 2 TeV including particular benchmarks studied in the original experimental papers. We have made these limits available in the form of a grid which can be used for the interpretation of various other new physics models. △ Less", "The classic method for mass determination in a SUSY-like cascade decay chain relies on measurements of the kinematic endpoints in the invariant mass distributions of suitable collections of visible decay products. However, the procedure is complicated by combinatorial ambiguities: e.g., the visible final state particles may be indistinguishable (as in the case of QCD jets), or one may not know the exact order in which they are emitted along the decay chain. In order to avoid such combinatorial ambiguities, we propose to treat the final state particles fully democratically and consider the sorted set of the invariant masses of all possible partitions of the visible particles in the decay chain. In particular, for a decay to N visible particles, one considers the sorted sets of all possible n-body invariant mass combinations (2 <= n <= N) and determines the kinematic endpoint m_(n,r)^max of the distribution of the r-th largest n-body invariant mass m_(n,r) for each possible value of n and r. For the classic example of a squark decay in supersymmetry, we provide analytical formulas for the interpretation of these endpoints in terms of the underlying physical masses. We point out that these measurements can be used to determine the structure of the decay topology, e.g., the number and position of intermediate on-shell resonances. △ Less", "We construct inflationary models in the context of supergravity with orthogonal nilpotent superfields [1]. When local supersymmetry is gauge-fixed in the unitary gauge, these models describe theories with only a single real scalar (the inflaton), a graviton and a gravitino. Critically, there is no inflatino, no sgoldstino, and no sinflaton in these models. This dramatically simplifies cosmological models which can simultaneously describe inflation, dark energy and SUSY breaking. △ Less", "We review strongly coupled and extra dimensional models of electroweak symmetry breaking. Models examined include warped extra dimensions, bulk Higgs, \"little\" Higgs, dilaton Higgs, composite Higgs, twin Higgs, quantum critical Higgs, and \"fat\" SUSY Higgs. We also discuss current bounds and future LHC searches for this class of models. △ Less", "A compressed spectrum was initially proposed as an explanation for the elusiveness of low-energy supersymmetry (SUSY). Some characteristic signals at the Large Hadron Collider (LHC), such as mono-jet + \\slashed{E}_T, had been propounded as its trademark signals. However, later investigations suggested that lower limits on the supersymmetric particle masses would be quite stringent in spite of compression. Also, most compressed SUSY scenarios studied so far are only partially compressed. In this backdrop, we make an exhaustive analysis of the compressed SUSY scenarios for the 13 TeV run of LHC, keeping the level of compression in the entire spectrum as high as possible. A broad class of benchmark spectra are thus considered, after ensuring consistency with the observed Higgs mass as well as the dark matter constraints. The rates of observable events in the high-energy run are obtained through detailed simulation, for both the multi-jet +\\slashed{E}_T and mono-jet + \\slashed{E}_T final states. Our conclusion is that the former is still more efficient to reveal a compressed SUSY spectrum first, while the latter can serve as a useful confirmatory channel. △ Less", "In this dissertation, the Minimal Supersymmetric Standard Model (MSSM) is studied as a low-energy theory stemming from the $SU(5)$ Grand Unified Theory (GUT). We investigate the possibility of satisfying the minimal $SU(5)$ boundary condition $\\mathbf{Y}^d=\\mathbf{Y}^{e\\,T}$ for the full $3\\!\\times\\!3$ down-quark and lepton Yukawa matrices at the GUT scale within the $R$-parity conserving MSSM. We give numerical evidence in favour of the statement: There exist regions in the parameter space of the R-parity conserving MSSM for which the unification of the down-quark and lepton Yukawa matrices takes place, while the predicted values of flavour, electroweak and other collider observables are consistent with experimental constraints. Furthermore, we find evidence that the bottom-tau and strange-muon Yukawa unification is possible with a stable MSSM vacuum in the standard form. We investigate two separate scenarios of the soft supersymmetry breaking terms at the GUT scale. In the first one, it is assumed that the soft terms are flavour-diagonal in the super-CKM basis. In such a case, the trilinear Higgs-squark-squark $A$-terms can generate large threshold corrections to $\\mathbf{Y}^d$ at the superpartner decoupling scale. In effect, the condition $\\mathbf{Y}^d=\\mathbf{Y}^{e\\,T}$ imposed at the GUT scale can be satisfied. However, the large trilinear terms make the usual Higgs vacuum metastable (though sufficiently long-lived). In the second scenario, we consider non-vanishing flavour off-diagonal entries in the soft SUSY-breaking mass matrices. We show that a non-trivial flavour structure of the soft SUSY-breaking sector can allow a precise bottom-tau and strange-muon Yukawa coupling unification, while satisfying all phenomenological constraints. △ Less", "Collider experiments provide an opportunity to shed light on dark matter (DM) self-interactions. In this work, we study the possibility of generating DM bound states -- the Darkonium -- at the LHC and discuss how the annihilation decay of the Darkonium produces force carriers. We focus on two popular scenarios that contain large DM self-couplings: the Higgsinos in the $λ$-SUSY model, and self-interacting DM (SIDM) framework. After forming bound states, the DM particles annihilate into force mediators, which decay into the standard model particles either through a prompt or displaced process. This generates interesting signals for the heavy resonance search. We calculate the production rate of bound states and study the projected future constraints from the existing heavy resonance searches. △ Less", "The Minimal Supersymmetric SO(10) GUT has developed into a fully realistic theory in which not only are the gauge couplings unified but the known fermion spectrum and mixing matrices could fit accurately using the latitude introduced by inclusion of quantum corrections to the GUT-effective MSSM-SM matching conditions. The fits yield predictions about the nature of the sparticle spectrum on the basis of the required threshold corrections. This indicated a necessarily large value for $A_0$ in 2008 : well before Higgs discovery at 126 GeV made it a commonplace assumption. GUT scale threshold corrections to the normalization of the emergent effective MSSM Higgs ameliorate the long standing Susy GUT puzzle of fast dimension five operator mediated proton decay. Numerical investigation indicates that B-violation rates below or near the current experimental upper limits are feasible in fully realistic models. Our results imply that UV completion models with large numbers of fields, like Kaluza-Klein models or String Theory, must be able to compute threshold corrections to be considered quantitative theories and not just fables. Required improvements in the fitting procedure are discussed. A generalization of the NMSGUT by gauging the flavour symmetry of the kinetic terms,while retaining renormalizability and the successful MSGUT symmetry breaking patterns, may allow dynamical generation of the observed Yukawa structure of the MSSM via the spontaneous breaking of the full gauge symmetry down to the MSSM at the unification scale. Focus on the emergence of the MSSM Higgs from the multiple Higgs doublets in the GUT thus provides a crucial window to view the energetically remote UV dynamics specified in fully calculable and realistic MSGUTs. △ Less", "We perform a general analysis of axionic dark radiation produced from the decay of the lightest modulus in the sequestered LARGE Volume Scenario. We discuss several cases depending on the form of the Kahler metric for visible sector matter fields and the mechanism responsible for achieving a de Sitter vacuum. The leading decay channels which determine dark radiation predictions are to hidden sector axions, visible sector Higgses and SUSY scalars depending on their mass. We show that in most of the parameter space of split SUSY-like models squarks and sleptons are heavier than the lightest modulus. Hence dark radiation predictions previously obtained for MSSM-like cases hold more generally also for split SUSY-like cases since the decay channel to SUSY scalars is kinematically forbidden. However the inclusion of string loop corrections to the Kahler potential gives rise to a parameter space region where the decay channel to SUSY scalars opens up, leading to a significant reduction of dark radiation production. In this case, the simplest model with a shift-symmetric Higgs sector can suppress the excess of dark radiation $ΔN_{eff}$ to values as small as 0.14, in perfect agreement with current experimental bounds. Depending on the exact mass of the SUSY scalars all values in the range 0.14 $\\lesssim ΔN_{eff} \\lesssim$ 1.6 are allowed. Interestingly dark radiation overproduction can be avoided also in the absence of a Giudice-Masiero coupling. △ Less", "We elaborate on a recent study of a model of supersymmetry breaking we proposed recently, in the presence of a tunable positive cosmological constant, based on a gauged shift symmetry of a string modulus, external to the Standard Model (SM) sector. Here, we identify this symmetry with a global symmetry of the SM and work out the corresponding phenomenology. A particularly attracting possibility is to use a combination of Baryon and Lepton number that contains the known matter parity and guarantees absence of dimension-four and five operators that violate B and L. △ Less", "We present two distinct topics: I) We describe the propagation of a spin-3/2 state in a background which preserves invariance under space translations and rotations but not under Lorentz boost transformations. We start by building a generalisation of the Volkov-Akulov Lagrangian for a goldstino in a fluid. A super-Higgs mechanism leads to the modified Rarita-Schwinger Lagrangian describing a slow gravitino. We identify the physical propagating degrees of freedom and derive the corresponding equations of motion. This includes some new results. II) Fake Split Supersymmetry Models are proposed to alleviate some of the problems of the original Split SUSY. In particular it is no more necessary to restrict to a Mini-Split scenario as higher values of the supersymmetry breaking scale (Mega-Split) are now allowed. The FSSM relies on swapping the higgsinos for new states in identical gauge group representations but different Yukawa couplings. △ Less", "We calculate the decay width of $h^0(125GeV) \\to c \\bar{c}$ in the Minimal Supersymmetric Standard Model (MSSM) with non-minimal quark flavor violation (QFV) at full one-loop level. We adopt the $\\overline{\\rm DR}$ renormalization scheme. We study the effects of the mixing of the second and third squark generations (i.e. scharm-stop mixing) on the decay width, respecting the experimental constraints from B-meson data, the Higgs mass measurement and supersymmetric (SUSY) particle searches. We show that the decay width $Γ(h^0 \\to c \\bar{c})$ at the full one-loop level is very sensitive to the SUSY QFV parameters. In a scenario with large scharm-stop mixing, the decay width can differ up to $\\sim \\pm 35\\%$ from its SM prediction. After taking into account the experimental and theoretical uncertainties of the decay width, we conclude that these QFV SUSY effects can be observed at a future $e^+ e^-$ collider such as ILC (International Linear Collider). △ Less", "In light of the conspicuous absence of SUSY in the energy range explored by the LHC during run I, non-supersymmetric BSM scenarios are becoming more and more attractive. One key ingredient in exploring such BSM physics are the renormalization group equations (RGEs) that are essential for extrapolating the theory to higher energy scales. Although the two-loop RGEs for a general quantum field theory have been known for some time, it is only recently that their automation has become available in the form of a Python program called PyR@TE. In this talk, I will present the features of PyR@TE as well as the latest developments of the code. In particular, the new ability to deal with sets of fields that have multiple ways of being contracted into a gauge singlet. △ Less", "We provide an example of a 4D theory that exhibits the Contino-Pomarol-Rattazzi mechanism, where breaking conformal symmetry by an almost marginal operator leads to a light pseudo-Goldstone boson, the dilaton, and a parametrically suppressed contribution to vacuum energy. We consider SUSY QCD at the edge of the conformal window and break conformal symmetry by weakly gauging a subgroup of the flavor symmetry. Using Seiberg duality we show that for a range of parameters the singlet meson in the dual theory reaches the unitarity bound, however, this theory does not have a stable vacuum. We stabilize the vacuum with soft breaking terms, compute the mass of the dilaton, and determine the range of parameters where the leading contribution to the dilaton mass is from the almost marginal coupling. △ Less", "We propose a new framework for the next-to-minimal supersymmetric standard model (NMSSM) in gauge mediation, where in general the correct electroweak symmetry breaking (EWSB) is difficult to be explained. The difficulty is caused by the absence of a soft supersymmetry (SUSY) breaking mass for the NMSSM singlet S. In our framework, S is a meson in a hidden QCD. This QCD is responsible for the dynamical SUSY breaking, forming S, and the soft SUSY breaking mass for S, which is a key to explain the correct EWSB: all the ingredients for successful phenomenology originate from the common dynamics. From the requirement of the successful EWSB, the low-scale SUSY breaking around 100-1000 TeV is predicted. This is favored to avoid the large fine-tuning. △ Less", "We studied the interplay between the mass reach for electroweakinos at future hadron colliders and direct detection experiments. The lack of new phenomena at the LCH motivates us to focus on split supersymmetry scenarios with different electroweakino spectra. A 100 TeV hadron collider may reach masses up to 3 TeV in models of anomaly mediation with long-lived thermal Winos. Moreover, in scenarios where the lightest neutralino is not the only dark matter component, the interplay between collider searches and direct detection experiments might cover large part of the parameter space. △ Less", "Natural supersymmetric theories of the weak scale are under growing pressure given present LHC constraints, raising the question of whether untuned supersymmetric (SUSY) solutions to the hierarchy problem are possible. In this paper, we explore a class of 5-dimensional natural SUSY theories in which SUSY is broken by the Scherk-Schwarz mechanism. We pedagogically explain how Scherk-Schwarz elegantly solves the traditional problems of 4-dimensional SUSY theories (based on the MSSM and its many variants) that usually result in an unsettling level of fine-tuning. The minimal Scherk-Schwarz set up possesses novel phenomenology, which we briefly outline. We show that achieving the observed physical Higgs mass motivates extra structure that does not significantly affect the level of tuning (always better than $\\sim 10\\%$) and we explore three qualitatively different extensions: the addition of extra matter that couples to the Higgs, an extra $U(1)^\\prime$ gauge group under which the Higgs is charged and an NMSSM-like solution to the Higgs mass problem. △ Less", "We briefly review the super-natural supersymmetry (SUSY), which provides a most promising solution to the SUSY electroweak fine-tuning problem. In particular, we address its subtle issues as well. Unlike the Minimal Supersymmetric Standard model (MSSM), the Next to MSSM (NMSSM) can be scale invariant and has no mass parameter in its Lagrangian before SUSY and gauge symmetry breakings. Therefore, the NMSSM is a perfect framework for super-natural SUSY. To give the SUSY breaking soft mass to the singlet, we consider the moduli and dilaton dominant SUSY breaking scenarios in M-theory on $S^1/Z_2$. In these scenarios, SUSY is broken by one and only one $F$-term of moduli or dilaton, and the SUSY breaking soft terms can be determined via the Kähler potential and superpotential from Calabi-Yau compactification of M-theory on $S^1/Z_2$. Thus, as predicted by super-natural SUSY, the SUSY electroweak fine-tuning measure is of unity order. In the moduli dominant SUSY breaking scenario, the right-handed sleptons are relatively light around 1 TeV, stau can be even as light as 580 GeV and degenerate with the lightest neutralino, chargino masses are larger than 1 TeV, the light stop masses are around 2 TeV or larger, the first two-generation squark masses are about 3 TeV or larger, and gluinos are heavier than squarks. In the dilaton dominant SUSY breaking scenario, the qualitative picture remain the same but we have heavier spectra as compared to moduli dominant SUSY breaking scenario. In addition to it, we have Higgs $H_{2}/A_{1}$-resonance solutions for dark matter (DM). In both scenarios, the minimal value of DM relic density is about 0.2. To obtain the observed DM relic density, we can consider the dilution effect from supercritical string cosmology or introduce the axino as the lightest supersymmetric particle. △ Less", "The discovery of the Higgs boson along with the vigorous confirmation of the SM coupled with non-appearance of new (SUSY) particles has led to an apparent naturalness crisis. We argue the crisis stems from overestimates of finetuning. A proper evaluation of naturalness in SUSY leads to light higgsinos with mass mu~ 100-300 GeV while other sparticles may inhabit the multi-TeV range at little cost to naturalness. Special signatures like dilepton mass edges in gluino pair events and same-sign dibosons from wino pairs might occur at LHC13. An ILC with \\sqrt{s}>2 mu would make the definitive test of naturalness in the MSSM. Naturalness in the QCD sector requires the axion leading to mixed axion-WIMP dark matter. There appears a deep connection between electroweak naturalness and a DFSZ-like SUSY axion sector which gives rise to the mu~ f_a^2/M_P parameter. Ultimately we expect detection of a higgsino-like WIMP at ton-scale DM detectors and detection of a DFSZ-type axion at ADMX. △ Less", "After motivation and short presentation of the minimal supersymmetric model with R-symmetry (MRSSM), we address the question of accomodating the measured Higgs boson mass in accordance with electroweak precision observables and LHC constraints. △ Less", "Search for invisible final states produced at the Large Hadron Collider (LHC) by new physics scenarios are normally carried out resorting to a variety of probes emerging from the initial state, in the form of single-jet, -photon and -$Z$ boson signatures. These are particularly effective for models of Supersymmetry (SUSY) in presence of $R$-parity conservation, owing to the presence in their spectra of a stable neutralino as dark matter candidate. We assume here as theoretical framework Supersymmetric ($B-L$) extension of the Standard Model (BLSSM), wherein a mediator for invisible decays can be $Z'$ boson. The peculiarity of the signal is thus that the final state objects carry a very large (transverse) missing energy, since the $Z'$ is naturally massive and constrained by direct searches and electro-weak precision tests to be at least in TeV scale region. Under these circumstances the efficiency in accessing the invisible final state and rejecting the standard model background is very high. This somehow compensates the rather meagre production rates. Another special feature of this invisible BLSSM signal is its composition, which is often dominated by sneutrino decays (alongside the more traditional neutrino and neutralino modes). Sensitivity of the CERN machine to these two features can therefore help disentangling the BLSSM from more popular SUSY models. We assess in this analysis the scope of the LHC in establishing the aforementioned invisible signals through a sophisticated signal-to-background simulation carried out in presence of parton shower, hadronisation and detector effects. We find that significant sensitivity exists already after 300 fb$^{-1}$ during Run 2. We find that mono-jet events can be readily accessible at the LHC, so as to enable one to claim a prompt discovery, while mono-photon and -$Z$ signals can be used as diagnostic tools of the underlying scenario. △ Less", "With the latest Planck results the dark matter relic density is determined to an unprecedented precision. In order to reduce current theoretical uncertainties in the dark matter relic density prediction, we have calculated next-to-leading order SUSY-QCD corrections to neutralino (co)annihilation processes including Coulomb enhancement effects. We demonstrate that these corrections can have significant impact on the cosmologically favoured MSSM parameter space and are thus of general interest for parameter studies and global fits. △ Less", "As the LHC begins Run 2 at an even higher energy, one of the top priorities will be to search for new particles (possibly from SUSY) at the highest energy scales. In addition to direct production of new particles, they can mix with Standard Model (SM) particles to yield discrepancies from the usual predictions. To distinguish this new physics from old uncertainties, we need tools to precisely quantify the uncertainties of the SM predictions. Here we present a versatile set of utility functions built with Mathematica that is capable of working with a variety of PDF formats including the recent LHAPDF6 format. This software can perform PDF calculations within the Mathematica framework and compare results from different PDF collaborations. The package includes both the central PDF value as well as the full error sets needed for PDF uncertainty analysis; a variety of sample error definitions are implemented. We demonstrate this package for the case of a new heavy scalar particle production at the LHC. △ Less", "The phenomenological implications of the E6 inspired supersymmetric models based on the Standard Model gauge group together with extra U(1)_N gauge symmetry under which right-handed neutrinos have zero charge are examined. In these models single discrete symmetry forbids the tree-level flavour changing processes and the most dangerous operators that violate baryon and lepton numbers. The two-loop renormalisation group flow of the gauge and Yukawa couplings is explored and the qualitative pattern of the Higgs spectrum in the case of the quasi-fixed point scenario is discussed. These E6 inspired models contain two dark-matter candidates. The presence of exotic states in these models gives rise to the nonstandard decays of the lightest Higgs boson which are also considered. △ Less", "We argue that the exact degeneracy of vacua in N=1 supergravity can shed light on the smallness of the cosmological constant. The presence of such vacua, which are degenerate to very high accuracy, may also result in small values of the quartic Higgs coupling and its beta function at the Planck scale in the phase in which we live. △ Less", "The string axion may provide the most attractive solution to the strong CP problem in QCD. However, the axion energy density easily exceeds the dark matter density in the present universe due to a large decay constant around $10^{16}$ GeV, unless the initial value of the axion field is fine-tuned. We show that this problem is alleviated if and only if the SUSY particle mass scale is 10-100 TeV, since the decay of the saxion can produce a large enough amount of entropy after the QCD phase transition, not disturbing the BBN prediction. The saxion decay also produces a large number of the lightest SUSY particles (LSPs). As a consequence, R-parity needs to be violated to avoid the overproduction of the LSPs. The saxion field can be stabilized with relatively simple Kahler potentials, not inducing a too large axion dark radiation. Despite the large entropy production, the observed baryon number is explained by the Affleck-Dine mechanism. Furthermore, the constraint from isocurvature perturbations is relaxed, and the Hubble constant during inflation can be as large as several $\\times$ $10^{10}$ GeV. △ Less", "The stability of dark matter is naturally explained if there is an additional U(1) symmetry which is spontaneously broken to a discrete symmetry at a high-energy scale. Such a framework is realized in the context of the SO(10) grand unification. In this work, we discuss dark matter models in the non-supersymmetric SO(10) grand unified models in which the stability of dark matter is assured by this mechanism. We find that the requirement of gauge coupling unification with a sufficiently high unification scale to evade the proton decay constraints plays an important role in selecting viable candidates. Some of the dark matter models can be tested in future dark matter direct searches and proton decay experiments. △ Less", "Solutions to the strong CP problem typically introduce new scales associated with the spontaneous breaking of symmetries. Absent any anthropic argument for small $\\barθ$, these scales require stabilization against ultraviolet corrections. Supersymmetry offers a tempting stabilization mechanism, since it can solve the \"big\" electroweak hierarchy problem at the same time. One family of solutions to strong CP, including generalized parity models, heavy axion models, and heavy $η^\\prime$ models, introduces $\\mathbb{Z}_2$ copies of (part of) the Standard Model and an associated scale of $\\mathbb{Z}_2$-breaking. We review why, without additional structure such as supersymmetry, the $\\mathbb{Z}_2$-breaking scale is unacceptably tuned. We then study \"SUZ$_2$\" models, supersymmetric theories with $\\mathbb{Z}_2$ copies of the MSSM. We find that the addition of SUSY typically destroys the $\\mathbb{Z}_2$ protection of $\\barθ=0$, even at tree level, once SUSY and $\\mathbb{Z}_2$ are broken. In theories like supersymmetric completions of the twin Higgs, where $\\mathbb{Z}_2$ addresses the little hierarchy problem but not strong CP, two axions can be used to relax $\\barθ$. △ Less", "$R$-parity violating supersymmetric models (RPV SUSY) are becoming increasingly more appealing than its $R$-parity conserving counterpart in view of the hitherto non-observation of SUSY signals at the LHC. In this paper, we discuss RPV scenarios where neutrino masses are naturally generated, namely RPV through bilinear terms (bRPV) and the $μ$-from-$ν$ supersymmetric standard model ($μν$SSM). The latter is characterised by a rich Higgs sector that easily accommodates a 125-GeV Higgs boson. The phenomenology of such models at the LHC is reviewed, giving emphasis on final states with displaced objects, and relevant results obtained by LHC experiments are presented. The implications for dark matter for these theoretical proposals is also addressed. △ Less", "If weak scale supersymmetry (SUSY) is to somehow explain the radiative stability of the Higgs boson mass, it is likely that non-minimal variants of SUSY models should be considered. Under the assumption that the dark matter of the universe is comprised of neutralinos, recent limits from direct detection experiments as well as dark matter abundance measurements place stringent bounds on the naturalness of minimal supersymmetric models. We show that even non-minimal models introducing moderately decoupled new physics in order to address the Higgs boson mass problem face similar issues, with one interesting exception. △ Less", "We consider Supersymmetric (SUSY) and non-SUSY models of chaotic inflation based on the simplest power-law potential with exponents n=2 and 4. We propose a convenient non-minimal coupling to gravity and a non-minimal kinetic term which ensure, mainly for n=4, inflationary observables favored by the BICEP2/Keck Array and Planck results. Inflation can be attained for subplanckian inflaton values with the corresponding effective theories retaining the perturbative unitarity up to the Planck scale. △ Less", "In this topical review we argue that neutrino mass and mixing data motivates extending the Standard Model to include a non-Abelian discrete flavour symmetry in order to accurately predict the large leptonic mixing angles and CP violation. We begin with an overview of the Standard Model puzzles, followed by a description of some classic lepton mixing patterns. Lepton mixing may be regarded as a deviation from tri-bimaximal mixing, with charged lepton corrections leading to solar mixing sum rules, or tri-maximal lepton mixing leading to atmospheric mixing rules. We survey neutrino mass models, using a roadmap based on the open questions in neutrino physics. We then focus on the seesaw mechanism with right-handed neutrinos, where sequential dominance (SD) can account for large lepton mixing angles and CP violation, with precise predictions emerging from constrained SD (CSD). We define the flavour problem and discuss progress towards a theory of flavour using GUTs and discrete family symmetry. We classify models as direct, semidirect or indirect, according to the relation between the Klein symmetry of the mass matrices and the discrete family symmetry, in all cases focussing on spontaneous CP violation. Finally we give two examples of realistic and highly predictive indirect models with CSD, namely an A to Z of flavour with Pati-Salam and a fairly complete $A_4\\times SU(5)$ SUSY GUT of flavour, where both models have interesting implications for leptogenesis. △ Less", "Natural SUSY scenarios with a low value of the $μ$ parameter, are characterised by a higgsino-like dark matter candidate, and a compressed spectrum for the lightest higgsinos. We explore the prospects for probing this scenario at the 13 TeV stage of the LHC via monojet searches, with various integrated luminosity options, and demonstrate how these results are affect by different assumptions on the achievable level of control on the experimental systematic uncertainties. The complementarity between collider and direct detection experiments (present and future) is also highlighted. △ Less", "The AdS/CFT correspondence is applied to a close analogue of the little hierarchy problem in $AdS_{d+1}$, $d \\geq 3$. The new mechanism requires a Maxwell field that gauges a $U(1)_R$ symmetry in a bulk supergravity theory with a negative cosmological constant. Supersymmetry is explicitly broken by a non-local boundary term with dimensionless coupling $h$. Non-locality appears to cause no pathology, and the SUSY breaking deformation engendered is exactly marginal. SUSY breaking effects in the bulk are computed using the $U(1)$ Ward identity. Conformal dimensions and thus masses of scalar and spinor partners are split simply because they carry different R-charges. However SUSY breaking effects cancel to all orders for R-neutral fields, even in diagrams with internal R-charged loops. SUSY breaking corrections can be summed to all orders in $h$. Diagrams involving graviton loops do not introduce any further SUSY breaking corrections. A possible scenario for a flat spacetime limit is outlined. △ Less", "Supersymmetric models with radiatively-driven electroweak naturalness require light higgsinos of mass ~ 100-300 GeV. Naturalness in the QCD sector is invoked via the Peccei-Quinn (PQ) axion leading to mixed axion-higgsino dark matter. The SUSY DFSZ axion model provides a solution to the SUSY mu problem and the Little Hierarchy μ<< m_{3/2} may emerge as a consequence of a mismatch between PQ and hidden sector mass scales. The traditional gravitino problem is now augmented by the axino and saxion problems, since these latter particles can also contribute to overproduction of WIMPs or dark radiation, or violation of BBN constraints. We compute regions of the T_R vs. m_{3/2} plane allowed by BBN, dark matter and dark radiation constraints for various PQ scale choices f_a. These regions are compared to the values needed for thermal leptogenesis, non-thermal leptogenesis, oscillating sneutrino leptogenesis and Affleck-Dine leptogenesis. The latter three are allowed in wide regions of parameter space for PQ scale f_a~ 10^{10}-10^{12} GeV which is also favored by naturalness: f_a~ \\sqrt{μM_P/λ_μ}\\sim 10^{10}-10^{12} GeV. These f_a values correspond to axion masses somewhat above the projected ADMX search regions. △ Less", "We review moduli stabilization in type IIB string theory compactification with fluxes. We focus on the KKLT and Large Volume Scenario (LVS). We show that the predicted soft SUSY breaking terms in KKLT model are not phenomenological viable. In LVS, the following result for scalar mass, gaugino mass, and trilinear term is obtained: $m_0 =m_{1/2}= - A_0=m_{3/2}$, which may account for Higgs mass limit if $m_{3/2} \\sim {\\cal O}(1.5)$ TeV. However, in this case the relic abundance of the lightest neutralino can not be consistent with the measured limits. We also study the cosmological consequences of moduli stabilization in both models. In particular, the associated inflation models such as racetrack inflation and Kähler inflation are analyzed. Finally the problem of moduli destabilization and the effect of string moduli backreaction on the inflation models are discussed. △ Less", "We present the package GravitinoPack that calculates the two- and three-body decays of unstable supersymmetric particles involving the gravitino in the final or initial state. In a previous paper, we already showed results for the gravitino decays into two and three particles. In this paper, we incorporate the processes where an unstable neutralino, stau or stop decays into a gravitino and Standard Model particles. This is the case in gravitino dark matter supersymmetric models, where the gravitino is the lightest SUSY particle. We give instructions for the installation and the use of the package. In the numerical analysis, we discuss various MSSM scenarios. We show that the calculation of all the decay channels and the three-body decay branching ratios is essential for the accurate application of cosmological bounds on these models. △ Less", "This review surveys the territory of supersymmetry beyond the vanilla MSSM. With a viewpoint guided by electroweak naturalness, the review focuses on constructions that weaken or bypass current LHC constraints. Models of SUSY containing Dirac gluinos, compressed spectra, flavor-violating squarks, R-parity violation, stealth sectors, exotic detector objects, and more are discussed. In addition to presenting ways of hiding SUSY, these models highlight a few opportunities to improve LHC coverage. △ Less", "Typical searches for supersymmetry cannot test models in which the two lightest particles have a small (\"compressed\") mass splitting, due to the small momentum of the particles produced in the decay of the second-to-lightest particle. However, datasets with large missing transverse momentum ($E_{\\rm T}^{\\rm miss}$) can generically search for invisible particle production and therefore provide constraints on such models. We apply data from the ATLAS mono-jet (jet+$E_{\\rm T}^{\\rm miss}$) and vector-boson-fusion (forward jets and $E_{\\rm T}^{\\rm miss}$) searches to such models. The two datasets have complementary sensitivity, but in all cases experimental limits are at least five times weaker than theoretical predictions. △ Less", "Models of inflation are instructive playgrounds for supersymmetry breaking in Supergravity and String Theory. In particular, combinations of branes and orientifolds that are not mutually BPS can lead to \\emph{brane supersymmetry breaking}, a phenomenon where non--linear realizations are accompanied, in tachyon--free vacua, by the emergence of steep exponential potentials. When combined with milder terms, these exponentials can lead to slow--roll after a fast ascent and a turning point. This leaves behind distinctive patterns of scalar perturbations, where pre--inflationary peaks can lie well apart from an almost scale invariant profile. I review recent attempts to connect these power spectra to the low--$\\ell$ CMB, and a corresponding one--parameter extension of $Λ$CDM with a low--frequency cut $Δ$. A detailed likelihood analysis led to $Δ= (0.351 \\pm 0.114) \\times 10^{-3} \\, \\mbox{Mpc}^{-1}$, at $99.4\\%$ confidence level, in an extended Galactic mask with $f_{sky}=39\\%$, to be compared with a nearby value at $88.5\\%$ in the standard Planck 2015 mask with $f_{sky}=94\\%$. In these scenarios one would be confronted, in the CMB, with relics of an epoch of deceleration that preceded the onset of slow--roll. △ Less", "The Large Electron Positron Collider (LEP) established the Standard Model (SM) of particle physics with unprecedented precision, including all its radiative corrections. These led to predictions for the masses of the top quark and Higgs boson, which were beautifully confirmed later on. After these precision measurements the Nobel Prize in Physics was awarded in 1999 jointly to 't Hooft and Veltman \"for elucidating the quantum structure of electroweak interactions in physics\". Another hallmark of the LEP results were the precise measurements of the gauge coupling constants, which excluded unification of the forces within the SM, but allowed unification within the supersymmetric extension of the SM. This increased the interest in Supersymmetry (SUSY) and Grand Unified Theories, especially since the SM has no candidate for the elusive dark matter, while Supersymmetry provides an excellent candidate for dark matter. In addition, Supersymmetry removes the quadratic divergencies of the SM and {\\it predicts} the Higgs mechanism from radiative electroweak symmetry breaking with a SM-like Higgs boson having a mass below 130 GeV in agreement with the Higgs boson discovery at the LHC. However, the predicted SUSY particles have not been found either because they are too heavy for the present LHC energy and luminosity or Nature has found alternative ways to circumvent the shortcomings of the SM. △ Less", "Motivated by the tension between the Higgs mass and muon g-2 in minimal supersymmetric standard model (MSSM), we analyze the muon g-2 in supersymmertic B-L extension of the standard model (BLSSM) with inverse seesaw mechanism. In this model, the Higgs mass receives extra important radiative corrections proportional to large neutrino Yukawa coupling. We point out that muon g-2 also gets significant contribution, due to the constructive interferences of light neutralino effects. The light neutralinos are typically the MSSM Bino like and the supersymmetric partner of U(1)_B-L gauge boson (B'-ino). We show that with universal soft supersymmetry breaking terms, the muon g-2 resides within 2 sigma of the measured value, namely ~17 x 10^-10, with Higgs mass equal to 125 GeV . △ Less", "It has been widely known that bino-like dark matter in supersymmetric theories suffers from over-production. The situation can be improved if the gluino or wino has a mass of O(10) GeV heavier than the bino, sufficiently reducing the bino abundance through co-annihilation. In this scenario, the gluino decays to the bino via squark exchange, and the wino decays to the bino via higgsino exchange. In split SUSY models favoured after the Higgs discovery, the intermediate particles in these decays would be much heavier than gauginos, suppressing the decay of the gluino and wino. This, in addition to the small mass differences, results in long lifetimes for the gluino and wino. We show that searches performed at the LHC for long-lived particles with displaced vertices offer a powerful method to test this scenario. △ Less", "The simple assumption of an instantaneous reionization of the Universe may bias estimates of cosmological parameters. In this paper a model-independent principal component method for the reionization history is applied to give constraints on the cosmological parameters from recent Planck 2015 data. We find that the Universe are not completely reionized at redshifts $z \\ge 8.5$ at 95% CL. Both the reionization optical depth and the matter fluctuation amplitude are higher than but consistent with those obtained in the standard instantaneous reionization scheme. The high estimated value of the matter fluctuation amplitude strengthens the tension between Planck CMB observations and some astrophysical data, such as cluster counts and weak lensing. The tension can significantly be relieved if the neutrino masses are allowed to vary. Thanks to a high scalar spectral index, the low-scale spontaneously broken SUSY inflationary model can fit the data well, which is marginally disfavored at 95% CL in the Planck analysis. △ Less", "We present results for the matrix elements of the additional $ΔS=2$ operators that appear in models of physics beyond the Standard Model (BSM), expressed in terms of four BSM $B$-parameters. Combined with experimental results for $ΔM_K$ and $ε_K$, these constrain the parameters of BSM models. We use improved staggered fermions, with valence HYP-smeared quarks and $N_f=2+1$ flavors of \"asqtad\" sea quarks. The configurations have been generated by the MILC collaboration. The matching between lattice and continuum four-fermion operators and bilinears is done perturbatively at one-loop order. We use three lattice spacings for the continuum extrapolation: $a\\approx 0.09$, $0.06$ and $0.045\\;$fm. Valence light-quark masses range down to $\\approx m_s^{\\rm phys}/13$ while the light sea-quark masses range down to $\\approx m_s^{\\rm phys}/20$. Compared to our previous published work, we have added four additional lattice ensembles, leading to better controlled extrapolations in the lattice spacing and sea-quark masses. We report final results for two renormalization scales, $μ=2\\;\\text{GeV}$ and $3\\;\\text{GeV}$, and compare them to those obtained by other collaborations. Agreement is found for two of the four BSM $B$-parameters ($B_2$ and $B_3^\\text{SUSY}$). The other two ($B_4$ and $B_5$) differ significantly from those obtained using RI-MOM renormalization as an intermediate scheme, but are in agreement with recent preliminary results obtained by the RBC-UKQCD collaboration using RI-SMOM intermediate schemes. △ Less", "The ATLAS Collaboration announced a 3$σ$ excess in the leptonic-$Z+jets+\\met$ channel. We show that such an excess can be interpreted in the extension of the Next-to-Minimal Supersymmetric Standard Model (NMSSM) with a heavy Dirac gluino and light squarks. The abundant $Z$ bosons can be produced by light squark pair productions with the subsequent decays $\\tilde{q} \\to q \\tildeχ_2^0 \\to q Z \\tildeχ_1^0$. We investigate the relevant parameter space by considering the constraints from both the ATLAS and CMS direct SUSY searches. Our model can provide sufficient $Z$-signal events in large parameter space if only the ATLAS searches are considered. After combining the ATLAS and CMS searches, the maximal number of signal events can still reach about 15, which is within the $1σ$ region of the observed excess. For comparison, we study the conventional low energy NMSSM with a Majorana gluino and its maximal number of signal events are about 11, although we cannot realize such model in the known supersymmetry breaking scenarios. △ Less", "It was recently shown that certain perturbatively accessible, non-supersymmetric gauge-Yukawa theories have UV asymptotic safety, without asymptotic freedom: the UV theory is an interacting RG fixed point, and the IR theory is free. We here investigate the possibility of asymptotic safety in supersymmetric theories, and use unitarity bounds, and the a-theorem, to rule it out in broad classes of theories. The arguments apply without assuming perturbation theory. Therefore, the UV completion of a non-asymptotically free susy theory must have additional, non-obvious degrees of freedom, such as those of an asymptotically free (perhaps magnetic dual) extension. △ Less", "We study the thermal leptogenesis in the $E_6\\times U(1)_A$ SUSY GUT model in which realistic masses and mixings of quarks and leptons can be realized. We show that the sufficient baryon number can be produced by the leptogenesis in the model, in which the mass parameter of the lightest right-handed neutrino is predicted to be smaller than $10^8$ GeV. The essential point is that the mass of the lightest right-handed neutrino can be enhanced in the model because it has a lot of mass terms whose mass parameters are predicted to be the same order of magnitude which is smaller than $10^8$ GeV. We show that O(10) enhancement for the lightest right-handed neutrino mass is sufficient for the observed baryon asymmetry. Note that such mass enhancements do not change the predictions of neutrino masses and mixings at the low energy scale in the $E_6$ model which has six right-handed neutrinos. In the calculation, we include the effects of supersymmetry and flavor in final states of the right-handed neutrino decay. We show that the effect of supersymmetry is quite important even in the strong washout regime when the effect of flavor is included. This is because the washout effects on the asymmetries both of the muon and the electron become weaker than that of the tau asymmetry. △ Less", "We provide an interpretation of the recent ATLAS diboson excess in terms of a class of supersymmetric models in which the scale of supersymmetry (SUSY) breaking is in the few TeV range. The particle responsible for the excess is the scalar superpartner of the Goldstone fermion associated with SUSY breaking, the sgoldstino. This scalar couples strongly to the Standard Model vector bosons and weakly to the fermions, with all coupling strengths determined by ratios of soft SUSY breaking parameters over the SUSY breaking scale. Explaining the ATLAS excess selects particular relations and ranges for the gaugino masses, while imposing no constraints on the other superpartner masses. Moreover, this signal hypothesis predicts a rate in the $Zγ$ final state that is expected to be observable at the LHC Run II already with a few fb$^{-1}$ of integrated luminosity. △ Less", "Supergravity is a well-motivated theory beyond the standard model of particle physics, and a suitable arena to study high-energy physics at the early universe including inflation, whose observational evidences are growing more and more. Inflation in supergravity, however, cannot be easily described because of restrictions from supersymmetry (SUSY). The scalar potential has an exponential factor and a large negative term whereas a flat and positive potential is needed to realize inflation. The standard method to obtain such an inflationary scalar potential requires an additional superfield to the one containing inflaton. In this thesis, we propose and develop an alternative method which does not require the additional superfield and thus reduces the necessary degrees of freedom by half. That is, we study inflation in supergravity with only a single chiral superfield which contains inflaton. We accomplish it by introducing a higher dimensional term in the inflaton Kahler potential, which plays an important dual role: fixing the value of the scalar superpartner of the inflaton resulting in effective single field models, and ensuring the positivity of the inflaton potential at the large field region. Our proposal is not just particular models but rather a new framework to realize various inflationary models in supergravity. In particular, large field inflation in supergravity using one superfield without tuning has become possible for the first time. In our generic models, SUSY breaking at the inflationary scale by inflaton is not completely restored after inflation, so null results for SUSY search at the LHC are predicted for the simplest cases. Remarkably, however, it is possible with tuning to embed arbitrary positive semidefinite scalar potentials into supergravity preserving SUSY at the vacuum. Our discovery opens up an entirely new branch of model building of inflation in supergravity. △ Less", "We explore the phenomenological predictions of a supersymmetric standard model, with a large extra dimension and unifying gauge couplings. The modified five dimensional renormalisation group equations make it possible to obtain light, maximally mixed stops, with a low scale of supersymmetry breaking and a low unification scale. This allows the fine-tuning to be lowered right down to the barrier coming directly from experimental lower limits on the stop masses. We also show that attempts at modifying the SUSY breaking pattern to obtain more natural soft terms at the high scale do not give the expected fine-tuning relaxation, and only RGE effects turn out to be effective in generating a lower fine-tuning. △ Less", "Muon g-2 anomaly, which is mismatch between the theoretical and the experimental values of the anomalous magnetic moment of muons, provides a sensitive probe of new physics. In SUSY, if masses of the superpartners relevant to the muon g-2 are O(100) GeV, the SUSY contributions to the muon g-2 become sizable and the anomaly can be solved. There are two representative SUSY contributions to the muon g-2, the chargino and the neutralino contributions, respectively. Particularly, when the discrepancy of the muon g-2 is dominated by the neutralino contributions, it is found that the discrepancy can be explained if only the Bino and sleptons are light. This setup is \"minimal\" to solve the muon g-2 anomaly. In this dissertation, we discuss the \"minimal\" SUSY models where only the Bino and sleptons are light, while the other superparticles are decoupled. When the slepton soft masses are universal, we show that the upper bound on the smuon mass becomes 330 (460) GeV in order to solve the muon g-2 anomaly at the 1sigma (2 sigma) level. It is within the reach of LHC and ILC. Further, light staus might affect the Higgs coupling to di-photon, which is sensitive to new physics. We also study future prospects of the stau which contributes to the Higgs coupling. If the stau is heavier than the smuon, we show that the bound can be as large as 1.4 (1.9) TeV. Such non-universal slepton mass spectrum generically predicts too large LFV/CPV. We show that the models are expected to be probed by LHC/ILC and LFV/CPV complementarily in future. △ Less", "If new phenomena beyond the Standard Model will be discovered at the LHC, the properties of the new particles could be determined with data from the High-Luminosity LHC and from a future linear collider like the ILC. We discuss the possible interplay between measurements at the two accelerators in a concrete example, namely a full SUSY model which features a small stau_1-LSP mass difference. Various channels have been studied using the Snowmass 2013 combined LHC detector implementation in the Delphes simulation package, as well as simulations of the ILD detector concept from the Technical Design Report. We investigate both the LHC and ILC capabilities for discovery, separation and identification of various parts of the spectrum. While some parts would be discovered at the LHC, there is substantial room for further discoveries at the ILC. We finally highlight examples where the precise knowledge about the lower part of the mass spectrum which could be acquired at the ILC would enable a more in-depth analysis of the LHC data with respect to the heavier states. △ Less", "In this letter we have presented a novel version of \"long-lived\" gluinos in supersymmetric models with the gluino the lightest ordinary supersymmetric particle [LOSP] and axino LSP. Within certain ranges of the axion decay constant $f_a < 1 \\times 10^{10}$ GeV, the gluino mass bounds are reduced to less than 1000 GeV. The best limits can be obtained by looking for decaying R-hadrons in the detector where the gluino decays to a gluon and axino in the calorimeters. SUSY models with a gluino LOSP can occur over a significant region of parameter space in either {\\em mirage-mediation} or general gauge-mediated SUSY breaking models. The gluino LOSP is not constrained by cosmology, but in this scenario the axion/axino may be good dark matter candidates. △ Less", "The apparent unification of gauge couplings in Grand Unified Theories around 10$^{16}$ GeV is one of the strong arguments in favor of Supersymmetric extensions of the Standard Model. In this paper, an analysis of the measurements of the strong coupling running from the CMS experiment at the LHC is combined with a \"traditional\" gauge coupling unification analysis using data at the Z peak. This approach places powerful constraints on the possible scales of new physics and on the parameters around the unification scale. A supersymmetric analysis without GUT threshold corrections describes the CMS data well and provides perfect unification. The favored scales are $M_{SUSY}\\ =\\ 2820\\ +670\\ -540$ GeV and $M_{GUT}\\ =\\ 1.05 \\pm 0.06 \\cdot 10^{16}$ GeV. For zero or small threshold corrections the scale of new physics may be well within LHC reach. △ Less", "We study a cogenesis mechanism in which the observed baryon asymmetry of the universe and the dark matter abundance can be produced simultaneously at low reheating temperature without violating baryon number in the fundamental vertex. In particular, we consider a model which could be realized in the context of type IIB large volume string compactifications. The matter superfields in this model include additional pairs of color triplet and singlet superfields in addition to the Minimal Supersymmetric Standard Model (MSSM) superfields. Assuming that the mass of the additional singlet fermions is O(GeV) and color triplet fermions is O(TeV), we show that the modulus dominantly decays into the additional color triplet superfields. After soft supersymmetry (SUSY) breaking, the lightest eigenstate of scalar component of color triplet superfield further decays into fermionic component of singlet superfield and quarks without violating baryon number. Assuming R-parity conservation, it follows that the singlet superfield will not further decay into the SM particles and therefore it can be considered as a stable asymmetric dark matter (ADM) component. We find that the decay of the lightest eigenstate of scalar component of color triplet superfield gives the observed baryon asymmetry in the visible sector, an asymmetric dark matter component with the right abundance and naturally explains cosmic coincidence. △ Less", "We comparatively analyze the rare $Λ_b\\rightarrow Λ\\ell^+ \\ell^-$ channel in standard model, supersymmetry and Randall-Sundrum model with custodial protection (RS$_c$). Using the parametrization of the matrix elements entering the low energy effective Hamiltonian in terms of form factors, we calculate the corresponding differential decay width and lepton forward-backward asymmetry in these models. We compare the results obtained with the most recent data from LHCb as well as lattice QCD results on the considered quantities. It is obtained that the standard model, with the form factors calculated in light-cone QCD sum rules, can not reproduce some experimental data on the physical quantities under consideration but the supersymmetry can do it. The RS$_c$ model predictions are roughly the same as the standard model and there are no considerable differences between the predictions of these two models. In the case of differential decay rate, the data in the range $4 $ GeV$^2/$c$^4\\leq$ $q^2 \\leq 6$ GeV$^2/$c$^4$ can not be described by any of the considered models. △ Less", "Thermal inflation is an attractive idea to dilute cosmic density of unwanted particles such as moduli fields which cause cosmological difficulties. However, it also dilutes preexisting baryon asymmetry and some viable baryogenesis is necessary for a cosmologically consistent scenario. We investigate whether the Affleck-Dine mechanism can produce baryon asymmetry enough to survive after the dilution in gauge-mediated SUSY breaking models. Flat directions except for $LH_u$ flat direction cannot provide such huge baryon number because of Q-ball formation. We show that although the $LH_u$ flat direction is special in terms of having $μ$-term which prevents Q-ball formation, it cannot explain the observed baryon asymmetry either. △ Less", "We propose to introduce general messenger-matter interactions in the deflected anomaly mediated SUSY breaking scenario. The most general form for the resulting soft parameters are derived. New interference terms between the GMSB type and AMSB type contributions are the unique feature of this scenario. Messenger-matter interactions involving sleptons can be used to solve the tachyonic slepton problem and naturally lead to positive slepton masses regardless of the sign of deflection parameter. Besides, due to the new contributions, large $|A_t|$ that will not trigger color-breaking stop VEV are also possible in this scenario, thus can easily give the 125 GeV higgs which was discovered by LHC. This type of deflected AMSB scenario need very few messenger species, thus can avoid possible non-perturbative gauge couplings below the GUT scale ( or Landau pole below the Planck scale ). △ Less", "The Supergravity model named No-Scale ${\\cal F}$-$SU(5)$, which is based upon the flipped $SU$(5) Grand Unified Theory (GUT) with additional TeV-scale vector-like flippon multiplets, has been partially probed during the LHC Run 1 at 7-8 TeV, though the majority of its model space remains viable and should be accessible by the 13-14 TeV LHC during Run 2. The model framework possesses the rather unique capacity to provide a light CP-even Higgs boson mass in the favored 124-126 GeV window while simultaneously retaining a testably light supersymmetry (SUSY) spectrum. We summarize the outlook for No-Scale ${\\cal F}$-$SU(5)$ at the 13-14 TeV LHC and review a promising methodology for the discrimination of its long-chain cascade decay signature. We further show that proportional dependence of all model scales upon the unified gaugino mass $M_{1/2}$ minimizes electroweak fine-tuning, allowing the $Z$-boson mass $M_Z$ to be expressed as an explicit function of $M_{1/2}$, $M_Z^2 = M_Z^2 (M_{1/2}^2)$, with implicit dependence upon a dimensionless ratio $c$ of the supersymmetric Higgs mixing parameter $μ$ and $M_{1/2}$. Finally, we elucidate an empirical connection between recent scalar tensor measurements and No-Scale Supergravity cosmological models that mimic the Starobinsky model of inflation. △ Less", "We propose a focus point gauge mediation model based on the product group unification (PGU), which solves the doublet-triplet splitting problem of the Higgs multiplets. In the focus point gauge mediation, the electroweak symmetry breaking scale can be naturally explained even for multi-TeV stops. It is known that the focus point behavior appears if a ratio of the number of SU(2) doublet messengers to that of SU(3) triplet messengers is close to 5/2. Importantly, this ratio (effectively) appears in our scenario based on the PGU, if the messenger field is an adjoint representation of SU(5) gauge group. Therefore, our focus point scenario is very predictive. It is also pointed out the gravitino can be dark matter without spoiling the success of the thermal leptogenesis. The absence of the SUSY CP-problem is guaranteed in the case that the Higgs B-term vanishes at the messenger scale. △ Less", "We consider the case that $μ$-$e$ conversion signal is discovered but other charged lepton flavor violating (cLFV) processes will never be found. In such a case, we need other approaches to confirm the $μ$-$e$ conversion and its underlying physics without conventional cLFV searches. We study R-parity violating (RPV) SUSY models as a benchmark. We briefly review that our interesting case is realized in RPV SUSY models with reasonable settings according to current theoretical/experimental status. We focus on the exotic collider signatures at the LHC ($pp \\to μ^- e^+$ and $pp \\to jj$) as the other approaches. We show the correlations between the branching ratio of $μ$-$e$ conversion process and cross sections of these processes. It is first time that the correlations are graphically shown. We exhibit the RPV parameter dependence of the branching ratio and the cross sections, and discuss the feasibility to determine the parameters. △ Less", "The ATLAS collaboration recently reported a $3σ$ excess in the leptonic-$Z+jets+E_{T}^{miss}$ channel. We intend to interpret this excess by squark pair production in the Next-to-Minimal Supersymmetric Standard Model (NMSSM). The decay chain we employ is $\\tilde{q} \\to q \\tildeχ_2^0 \\to q \\tildeχ_1^0 Z$, where $\\tildeχ_1^0$ and $\\tildeχ_2^0$ denote the lightest and the next-to-lightest neutralinos with singlino and bino as their dominant components respectively. Our simulations indicate that after considering the constraints from the ATLAS searches for $jets + E_{T}^{miss}$ signal the central value of the excess can be obtained for $m_{\\tilde{q}} \\lesssim 1.2 {\\rm TeV}$, and if the constraint from the CMS on-$Z$ search is further considered, more than 10 signal events are still attainable for $m_{\\tilde{q}} \\lesssim 750 {\\rm GeV}$. Compared with the interpretation by gluino pair production, the squark explanation allows for a significantly wider range of $m_{\\tilde{q}}$ as well as a less compressed SUSY mass spectrum. We also show that the squark explanation will be readily tested at the initial stage of the 14 TeV LHC. △ Less", "We express the action of six-dimensional supergravity in terms of four-dimensional N=1 superfields, focusing on the moduli dependence of the action. The gauge invariance of the action in the tensor-vector sector is realized in a quite nontrivial manner, and it determines the moduli dependence of the action. The resultant moduli dependence is intricate, especially on the shape modulus. Our result is reduced to the known superfield actions of six-dimensional global SUSY theories and of five-dimensional supergravity by replacing the moduli superfields with their background values and by performing the dimensional reduction, respectively. △ Less", "In order to significantly reduce the fine-tuning associated with the electroweak symmetry breaking in the minimal supersymmetric standard model (MSSM), we consider not only the minimal gravity mediation effects but also the minimal gauge mediation ones for a common supersymmetry breaking source at a hidden sector. In this \"Minimal Mixed Mediation model,\" the minimal forms for the Kahler potential and the gauge kinetic function are employed at tree level. The MSSM gaugino masses are radiatively generated through the gauge mediation. Since a \"focus point\" of the soft Higgs mass parameter, m_{h_u}^2 appears around 3-4 TeV energy scale in this case, m_{h_u}^2 is quite insensitive to stop masses. Instead, the naturalness of the small m_{h_u}^2 is more closely associated with the gluino mass rather than the stop mass unlike the conventional scenario. As a result, even a 3-4 TeV stop mass, which is known to explain the 125 GeV Higgs mass at three-loop level, can still be compatible with the naturalness of the electroweak scale. On the other hand, the requirements of various fine-tuning measures much smaller than 100 and |μ| < 600 GeV constrain the gluino mass to be 1.6 TeV < M_3 < 2.2 TeV, which is well-inside the discovery potential range of LHC RunII. △ Less", "Some doubts have been expressed about low energy supersymmetry (SUSY) following the first run of the LHC. In this talk I will try to present a more upbeat view based on data, rather than theoretical expectations. In particular, I will make the following points: (a) in my opinion the most attractive candidate for dark matter (DM) is now the lightest neutralino with mass around 1 TeV and with well defined properties (a nearly pure higgsino). This follows primarily from a combination of the properties of the discovered Higgs boson, in particular its mass close to 125 Gev, and the relic density of dark matter, and is most clearly visible in the context of unified, or constrained, SUSY frameworks, although the DM candidate is quite generic; (b) this DM candidate will be nearly fully tested in forthcoming one-tonne DM underground search detectors; (c) the CMSSM will be nearly fully tested in the next few years by a combination of expected data from LHC experiments and from direct DM searches, as well as potentially also by the Cherenkov Telescope Array; (d) if naturalness plays any real role in SUSY (which remains unclear), then the amount of fine tuning, which is very large in simple models like the CMSSM, can be significantly reduced (even down to 1 in 20) with properly selected boundary conditions at the unification scale; (e) the (g-2) muon anomaly can be accommodated not only in the context of the general MSSM but also of some unified SUSY models with some superpartners to be within reach of the LHC. △ Less", "We examine the prospects for detecting light charged higgsinos that are expected to be a necessary feature of natural SUSY models via $pp\\to {\\widetilde W}^\\pm{\\widetilde W}_1^\\pm jj+X$ processes arising dominantly from $W^\\pm W^\\pm$ fusion at LHC13. The signal will be a pair of same-sign leptons ($e$ or $μ$) in events with two relatively forward, hemispherically-separated jets with a large rapidity gap. We find that even though the higgsinos have a full-strength $SU(2)$ gauge couplings to $W$-bosons, the LHC13 cross section for the production of same sign higgsino pairs is smaller than 0.02 fb over most of the interesting range of natural SUSY parameters, even before leptonic branching fractions of the chargino are included. This cross section is strongly suppressed because the two neutral Majorana higgsinos can be combined into a single Dirac neutralino if the bino and the winos are much heavier than the higgsinos, as is the case in natural SUSY models: in this limit, higgsino couplings to $W$-bosons exhibit an emergent (approximate) $U(1)_{\\rm ino}$ global symmetry that suppresses same sign higgsino production by vector boson fusion. We conclude that this channel is not a viable way to search for natural SUSY even at the high luminosity upgrade of the Large Hadron Collider. △ Less", "LHC searches for non-standard Higgs bosons decaying into tau lepton pairs constitute a sensitive experimental probe for physics beyond the Standard Model (BSM), such as Supersymmetry (SUSY). Recently, the limits obtained from these searches have been presented by the CMS collaboration in a nearly model-independent fashion - as a narrow resonance model - based on the full 8 TeV dataset. In addition to publishing a 95% C.L. exclusion limit, the full likelihood information for the narrow resonance model has been released. This provides valuable information that can be incorporated into global BSM fits. We present a simple algorithm that maps an arbitrary model with multiple neutral Higgs bosons onto the narrow resonance model and derives the corresponding value for the exclusion likelihood from the CMS search. This procedure has been implemented into the public computer code HiggsBounds (version 4.2.0 and higher). We validate our implementation by cross-checking against the official CMS exclusion contours in three Higgs benchmark scenarios in the Minimal Supersymmetric Standard Model (MSSM), and find very good agreement. Going beyond validation, we discuss the combined constraints of the tau tau search and the rate measurements of the SM-like Higgs at 125 GeV in a recently proposed MSSM benchmark scenario, where the lightest Higgs boson obtains SM-like couplings independently of the decoupling of the heavier Higgs states. Technical details for how to access the likelihood information within HiggsBounds are given in the appendix. The program is available at http://higgsbounds.hepforge.org. △ Less", "The electric dipole moments (EDMs) of electron and nucleons are promising probes of the new physics. In generic high-scale supersymmetric (SUSY) scenarios such as models based on mixture of the anomaly and gauge mediations, gluino has an additional contribution to the nucleon EDMs. In this paper, we studied the effect of the $CP$-violating gluon Weinberg operator induced by the gluino chromoelectric dipole moment in the high-scale SUSY scenarios, and we evaluated the nucleon and electron EDMs in the scenarios. We found that in the generic high-scale SUSY models, the nucleon EDMs may receive the sizable contribution from the Weinberg operator. Thus, it is important to compare the nucleon EDMs with the electron one in order to discriminate among the high-scale SUSY models. △ Less", "In pure gravity mediation (PGM), the most minimal scheme for the mediation of supersymmetry (SUSY) breaking to the visible sector, soft masses for the standard model gauginos are generated at one loop rather than via direct couplings to the SUSY-breaking field. In any concrete implementation of PGM, the SUSY-breaking field is therefore required to carry nonzero charge under some global or local symmetry. As we point out in this note, a prime candidate for such a symmetry might be B-L, the Abelian gauge symmetry associated with the difference between baryon number B and lepton number L. The F-term of the SUSY-breaking field then not only breaks SUSY, but also B-L, which relates the respective spontaneous breaking of SUSY and B-L at a fundamental level. As a particularly interesting consequence, we find that the heavy Majorana neutrino mass scale ends up being tied to the gravitino mass, Lambda_N ~ m_3/2. Assuming nonthermal leptogenesis to be responsible for the generation of the baryon asymmetry of the universe, this connection may then explain why SUSY necessarily needs to be broken at a rather high energy scale, so that m_3/2 >~ 1000 TeV in accord with the concept of PGM. We illustrate our idea by means of a minimal model of dynamical SUSY breaking, in which B-L is identified as a weakly gauged flavor symmetry. We also discuss the effect of the B-L gauge dynamics on the superparticle mass spectrum as well as the resulting constraints on the parameter space of our model. In particular, we comment on the role of the B-L D-term. △ Less", "We perform the first analysis of Dark Matter scenarios in a constrained model with Dirac Gauginos. The model under investigation is the Constrained Minimal Dirac Gaugino Supersymmetric Standard model (CMDGSSM) where the Majorana mass terms of gauginos vanish. However, $R$-symmetry is broken in the Higgs sector by an explicit and/or effective $B_μ$-term. This causes a mass splitting between Dirac states in the fermion sector and the neutralinos, which provide the dark matter candidate, become pseudo-Dirac states. We discuss two scenarios: the universal case with all scalar masses unified at the GUT scale, and the case with non-universal Higgs soft-terms. We identify different regions in the parameter space which fullfil all constraints from the dark matter abundance, the limits from SUSY and direct dark matter searches and the Higgs mass. Most of these points can be tested with the next generation of direct dark matter detection experiments. △ Less", "The search for supersymmetry at Run 1 of LHC has resulted in gluino mass limits m(gluino)>~ 1.3 TeV for the case where m(gluino)<<m(squark) and in models with gaugino mass unification. The increased energy and ultimately luminosity of LHC13 will explore the range m(gluino)~ 1.3-2 TeV. We examine how the discovery of SUSY via gluino pair production would unfold via a comparative analysis of three LSP archetype scenarios: 1. mSUGRA/CMSSM model with a bino-like LSP, 2. charged SUSY breaking (CSB) with a wino-like LSP and 3. SUSY with radiatively-driven naturalness (RNS) and a higgsino-like LSP. In all three cases we expect heavy-to-very-heavy squarks as suggested by a decoupling solution to the SUSY flavor and CP problems and by the gravitino problem. For all cases, initial SUSY discovery would likely occur in the multi-b-jet + ETMISS channel. The CSB scenario would be revealed by the presence of highly-ionizing, terminating tracks from quasi-stable charginos. As further data accrue, the RNS scenario with 100-200 GeV higgsino-like LSPs would be revealed by the build-up of a mass edge/bump in the OS/SF dilepton invariant mass which is bounded by the neutralino mass difference. The mSUGRA/CMSSM archetype would contain neither of these features but would be revealed by a buildup of the usual multi-lepton cascade decay signatures. △ Less", "We study a possible explanation of a 3.0 $σ$ excess recently reported by the ATLAS Collaboration in events with Z-peaked same-flavour opposite-sign lepton pair, jets and large missing transverse momentum in the context of gauge-mediated SUSY breaking with more than one hidden sector, the so-called goldstini scenario. In a certain parameter space, the gluino two-body decay chain $\\tilde g\\to g\\tildeχ^0_{1,2}\\to gZ\\tilde G'$ becomes dominant, where $\\tildeχ^0_{1,2}$ and $\\tilde G'$ are the Higgsino-like neutralino and the massive pseudo-goldstino, respectively, and gluino pair production can contribute to the signal. We find that a mass spectrum such as $m_{\\tilde g}\\sim 1000$ GeV, $m_{\\tildeχ^0_{1,2}}\\sim 800$ GeV and $m_{\\tilde G'}\\sim 600$ GeV demonstrates the rate and the distributions of the excess, without conflicting with the stringent constraints from jets plus missing energy analyses and with the CMS constraint on the identical final state. △ Less", "In this work I present a full analysis of proton decay in an $SO(10)$ model previously proposed by Dutta, Mimura, and Mohapatra. The $\\bf{10}$, $\\overline{\\bf{126}}$, and $\\bf{120}$ Yukawa couplings contributing to fermion masses in this model have well-motivated restrictions on their textures intended to give favorable results for proton lifetime as well as a realistic fermion sector without the need for fine-tuning and for either type-I or type-II dominance in the neutrino mass matrix. I obtain a valid fit for the entire fermion sector for both types of seesaw dominance, including $θ_{13}$ in good agreement with the most recent data. For the case with type-II seesaw, I find that using the Yukawa couplings fixed by the successful fermion sector fit, proton partial lifetime limits are satisfied for nearly every pertinent decay mode, even for nearly arbitrary values of the triplet Higgs mixing parameters, with only the $K^+ \\barν$ mode requiring a minor ${\\cal O}(10^{-1})$ cancellation in order to satisfy the experimental limit. I also find a maximum lifetime for that mode of $τ(K^+ \\barν) \\sim 10^{36}$ years, which should be tested by eventual experiments. For the type-I seesaw case, I find that all six pertinent decay modes of interest are satisfied for values of the triplet mixing parameters giving no major enhancement, with modes other than $K^+ \\barν$ easily satisfied for arbitrary mixing values, and with a maximum lifetime for $K^+ \\barν$ of nearly $10^{38}$ years. △ Less", "It is still an open question whether the new scalar particle discovered at the LHC with a mass of 125 GeV is the SM Higgs boson or it belongs to models of new physics with an extended Higgs sector, as the MSSM or 2HDM. The ratio of branching fractions $R$ = BR($H \\to b \\bar b$)/BR($H \\to τ^+ τ^-$) of Higgs boson decays is a powerful tool in order to distinguish the MSSM Higgs sector from the SM or non-supersymmetric 2HDM. This ratio receives large renormalization-scheme independent radiative corrections in supersymmetric models at large $\\tanβ$, which are insensitive to the SUSY mass scale and absent in the SM or 2HDM. Making use of the current LHC data and the upcoming new results on Higgs couplings to be reported by ATLAS and CMS collaborations and in a future linear collider, we develop a detailed and updated study of this ratio $R$ which improves previous analyses and sets the level of accuracy needed to discriminate between models. △ Less", "SUSY models with a modified dark sector require constraints to be reinterpreted, which may allow for scenarios with low tuning. A modified dark sector can also change the phenomenology greatly. The addition of the QCD axion to the Minimal Supersymmetric Standard Model (MSSM) solves the strong CP problem and also modifies the dark sector with new dark matter candidates. While SUSY axion phenomenology is usually restricted to searches for the axion itself or searches for the ordinary SUSY particles, this work focuses on scenarios where the axion's superpartner, the axino may be detectable at the Large Hadron Collider (LHC) in the decays of neutralinos displaced from the primary vertex. In particular this work focuses on the KSVZ axino. The decay length of neutralinos in this scenario easily fits the ATLAS detector for SUSY spectra expected to be testable at the 14 TeV LHC. This signature of displaced decays to axinos is compared to other well motivated scenarios containing a long lived neutralino which decays inside the detector. These alternative scenarios can in some cases very closely mimic the expected axino signature, and the degree to which they are distinguishable is discussed. The cosmological viability of such a scenario is also considered briefly. △ Less", "Electroweak precision observables, being highly sensitive to loop contributions of new physics, provide a powerful tool to test the theory and to discriminate between different models of the underlying physics. In that context, the $W$ boson mass, $M_W$, plays a crucial role. The accuracy of the $M_W$ measurement has been significantly improved over the last years, and further improvement of the experimental accuracy is expected from future LHC measurements. In order to fully exploit the precise experimental determination, an accurate theoretical prediction for $M_W$ in the Standard Model (SM) and extensions of it is of central importance. We present the currently most accurate prediction for the $W$ boson mass in the Next-to-Minimal Supersymmetric extension of the Standard Model (NMSSM), including the full one-loop result and all available higher-order corrections of SM and SUSY type. The evaluation of $M_W$ is performed in a flexible framework, which facilitates the extension to other models beyond the SM. We show numerical results for the $W$ boson mass in the NMSSM, focussing on phenomenologically interesting scenarios, in which the Higgs signal can be interpreted as the lightest or second lightest CP-even Higgs boson of the NMSSM. We find that, for both Higgs signal interpretations, the NMSSM $M_W$ prediction is well compatible with the measurement. We study the SUSY contributions to $M_W$ in detail and investigate in particular the genuine NMSSM effects from the Higgs and neutralino sectors. △ Less", "The Supersymmetric SO(10) theory (\"NMSO(10)GUT\") based on the\\hfil\\break ${\\bf{210+126 +\\oot}}$ Higgs system proposed in 1982 has evolved into a realistic theory capable of fitting the known low energy Particle Physics data besides providing a Dark matter candidate and embedding Inflationary Cosmology. It dynamically resolves longstanding issues such as fast dimension five operator mediated proton decay in Susy GUTs by allowing explicit and complete calculation of crucial threshold effects at $M_{Susy}$ and $M_{GUT}$ in terms of fundamental parameters. This shows that SO(10) Yukawas responsible for observed fermion masses as well as operator dimension 5 mediated proton decay can be highly suppressed on a \"Higgs dissolution edge\" in the parameter space of GUTs with rich superheavy spectra. This novel and generically relevant result highlights the need for every realistic UV completion model with a large/infinite number of heavy fields coupled to the light Higgs doublets to explicitly account for the large wave function renormalization effects on emergent light Higgs fields in order to be considered a quantitatively well defined candidate UV completion. The NMSGUT predicts large soft Susy breaking trilinear couplings and distinctive sparticle spectra. Measurable or near measurable level of tensor perturbations- and thus large Inflaton mass scale- may be accommodated by Supersymetric Seesaw inflation within the NMSGUT based on an LHN flat direction Inflaton if the Higgs component contains contributions from heavy Higgs components. Successful NMSGUT fits suggest a \\emph{renormalizable} Yukawon Ultra minimal gauged theory of flavor based upon the NMSGUT Higgs structure. △ Less", "Supersymmetric GUTs based on SO(10) gauge group are leading contenders to describe particle physics beyond the Standard Model. Among these the \"New minimal supersymmetric SO(10) grand unified theory\" (NMSGUT) based on Higgs system 10+120+210+126+$\\overline{126}$ has been developing since 1982. It now successfully fits the whole standard Model gauge coupling, symmetry breaking and fermion mass-mixing data as well as the neutrino mass and mixing data in terms of NMSGUT parameters and just 6 soft supersymmetry breaking parameters defined at the GUT scale. In this thesis we study the phenomenology of NMSGUT, its implications for inflationary and Cold Dark matter cosmology and develop Renormalization group(RG) equations for the flow of NMSGUT couplings in the extreme ultraviolet. In the first part we show that superheavy threshold effects can drastically lower the SO(10) yukawa couplings required for realistic unification and this cures the long standing problem of fast proton decay in Susy GUT. Then we propose a novel Supersymmetric Seesaw inflection(SSI) scenario based upon a SU(2)_L x U(1)_R x U(1)_{B-L} invariant model, where the inflation mass is controlled by the large conjugate sneutrino mass. We show that it is much less fine-tuned and more stable than Dirac sneutrino based MSSM inflation. NMSGUT can embed SSI, and even provide a large tensor scalar ratio, but obstacles in achieving enough inflation remain. The NMSGUT Bino LSP is a good dark matter candidate when it can co-annihilate with a nearly degenerate sfermion as in fits with a light smuon. We also calculate two loop NMSGUT gauge-Yukawa Renormalization Group(RG) beta functions and show that GUT scale negative Higgs mass squared parameters required by NMSGUT fits can arise by RG flows from positive values at the Planck scale. △ Less", "We study the so-called new minimal supersymmetric SO(10) GUT(NMSGUT) where explicit spontaneous symmetry breaking allows determination of superheavy spectrum and thus threshold corrections to the effective MSSM couplings. This provides a generic mechanism to resolve the long standing super fast proton decay in Susy GUTs. We estimate lepton flavor violation associated with realistic charged fermion and (Type I seesaw) neutrino fit and show compatibility with baryon number and lepton flavour violation limits. We improve NMSGUT fits by including important loop corrections to sparticle spectra. Our fits use 5 GUT compatible soft supersymmetry breaking parameters of the Supergravity with Non-Universal Higgs Masses(SUGRY-NUHM) type. We calculate the full two loop NMSGUT gauge-Yukawa beta functions to study feasibility of the NUHM parameters via strong renormalization of SO(10) Higgs soft masses. Focus on MSSM Higgs allows formulation of a \"Yukawonification\" strategy for gauged flavour unification. △ Less", "Neutralino annihilation in the Galactic halo is the most definite observational signature proposed for indirect registration of the SUSY Dark Matter (DM) candidate particles. The corresponding annihilation signal (in the form of gamma-rays, positrons and antiprotons) may be boosted for one or three orders of magnitude due to the clustering of cold DM particles into the small-scale and very dense self-gravitating clumps. We discuss the formation of these clumps from the initial density perturbations and their successive fate in the Galactic halo. Only a small fraction of these clumps, $\\sim0.1$%, in each logarithmic mass interval $Δ\\log M\\sim1$ survives the stage of hierarchical clustering. We calculate the probability of surviving the remnants of dark matter clumps in the Galaxy by modelling the tidal destruction of the small-scale clumps by the Galactic disk and stars. It is demonstrated that a substantial fraction of clump remnants may survive through the tidal destruction during the lifetime of the Galaxy. The resulting mass spectrum of survived clumps is extended down to the mass of the core of the cosmologically produced clumps with a minimal mass. The survived dense remnants of tidally destructed clumps provide an amplification (boosting) of the annihilation signal with respect to the diffuse DM in the Galactic halo. We describe the anisotropy of clump distribution caused by the tidal destruction of clumps in the Galactic disk. △ Less", "We consider models of supersymmetry which can incorporate sizeable mixing between different generations of sfermions. While the mixing is constrained by the non-observation of various flavour changing neutral current (FCNC) processes, there exist regions of SUSY parameter space where the effects of such mixing can be probed at colliders. In this work, we explore this possibility by focussing on the slepton sector. The sleptons are produced through cascade decays in direct neutralino-chargino ($χ_2^0χ_1^\\pm$) pair production at the LHC. The final state is characterized by 3 leptons and missing energy. We probe the lepton flavour violating (LFV) vertex originating from $χ_2^0$ decay and identify a distinct and unambiguous combination of the tri-lepton final state which include a lepton pair with same flavour and same sign (SFSS) in addition to a pair with opposite flavour and opposite sign (OFOS). This combination of tri-lepton final state containing both OFOS and SFSS pairs, can not only suppress the SM background but can also differentiate the flavour violating decays of $χ_2^0$ from its corresponding flavour conserving decays. We present results for various signal benchmark points taking into account background contributions assuming two luminosity options (100 fb$^{-1}$ and 1000 fb$^{-1}$) for LHC Run 2 experiment. △ Less", "Supersymmetry (SUSY) is a complete and renormalisable candidate for an extension of the Standard Model. At an energy scale not too far above the electroweak scale it would solve the hierarchy problem of the SM Higgs boson, dynamically explain electroweak symmetry breaking, and provide a dark-matter candidate. Since it doubles the Standard Model degrees of freedom, SUSY predicts a large number of additional particles, whose properties and effects on precision measurements can be explicitly predicted in a given SUSY model. In this review the motivation for SUSY is outlined, the various searches strategies for SUSY particles at the LHC are described, and the status of SUSY in global analyses after the LHC Run 1 is summarized. △ Less", "We discuss the sensitivity of the high-scale SUSY at $10$-$1000$ TeV in $B^0$, $B_s$, $K^0$ and $D$ meson systems together with the neutron EDM and the mercury EDM. In order to estimate the contribution of the squark flavor mixing to these FCNCs,we calculate the squark mass spectrum, which is consistent with the recent Higgs discovery. The SUSY contribution in $ε_K$ could be large, around 40% in the region of the SUSY scale $10$-$100$ TeV. The neutron EDM and the mercury EDM are also sensitive to the SUSY contribution induced by the gluino-squark interaction. The predicted EDMs are roughly proportional to $|ε_K^{\\rm SUSY}|$. If the SUSY contribution is the level of O(10%) for epsilon_K, the neutron EDM is expected to be discovered in the region of $10^{-28}$-$10^{-26}$ecm. The mercury EDM also gives a strong constraint for the gluino-squark interaction. The SUSY contribution of $ΔM_D$ is also discussed. △ Less", "We develop four-parameter supergravity models of inflation and dark energy, constrained so that ${δρ\\over ρ}$, $n_s$ and the cosmological constant $Λ$ take their known observable values, but where the mass of gravitino $m_{3/2}$ and the tensor-to-scalar ratio $r$ are free parameters. We focus on generalized cosmological $α$-attractor models, with logarithmic Kahler potentials, a nilpotent goldstino and spontaneously broken supersymmetry at the de Sitter minimum. The future data on B-modes will specify the parameter $α$, measuring the geometry of the Kahler, manifold. The string landscape idea for dark energy is supported in these models via an incomplete cancellation of the universal positive goldstino and negative gravitino contribution. The scale of SUSY breaking M related to the mass of gravitino in our models is a controllable parameter, independent on the scale of inflation, it will be constrained by LHC data and future collider Energy-frontier experiments. △ Less", "We present the calculation of the electroweak corrections for squark-antisquark pair production at the LHC within the Minimal Supersymmetric Standard Model. Taking into account all possible chirality and light-flavor configurations, we evaluate the NLO EW corrections, which are of O(a_s^2 a), as well as the subleading tree-level contributions of O(a_s a) and O(a^2). Numerical results are presented for several scans in the SUSY parameter space and relevant differential distributions are investigated. The impact of the electroweak corrections is nonnegligible and strongly depends on the chirality configuration of the produced squarks. Our analysis includes a discussion of photon-gluon initiated processes with a focus on the impact of the corresponding large PDF uncertainties. △ Less", "The discovery of a Higgs boson with a mass of 126 GeV at the LHC when combined with the non-observation of new physics both in direct and indirect searches imposes strong constraints on supersymmetric models and in particular on the top squark sector. The experiments for direct detection of dark matter have provided with yet more constraints on the neutralino LSP mass and its interactions. After imposing limits from the Higgs, flavour and dark matter sectors, we examine the feasibility for a light stop in the context of the pMSSM, in light of current results for stop and other SUSY searches at the LHC. We only require that the neutralino dark matter explains a fraction of the cosmologically measured dark matter abundance. We find that a stop with mass below $\\sim$ 500 GeV is still allowed. We further study various probes of the light stop scenario that could be performed at the LHC Run - II either through direct searches for the light and heavy stop, or SUSY searches not currently available in simplified model results. Moreover we study the characteristics of heavy Higgs for the points in the parameter space allowed by all the available constraints and illustrate the region with large cross sections to fermionic or electroweakino channels. Finally we show that nearly all scenarios with a small stop$-$LSP mass difference will be tested by Xenon1T provided the NLSP is a chargino, thus probing a region hard to access at the LHC. △ Less", "The sweet spot supersymmetry (SUSY) solves the mu problem in the Minimal Supersymmetric Standard Model (MSSM) with gauge mediated SUSY breaking (GMSB) via the generalized Giudice-Masiero (GM) mechanism where only the mu-term and soft Higgs masses are generated at the unification scale of the Grand Unified Theory (GUT) due to the approximate PQ symmetry. Because all the other SUSY breaking soft terms are generated via the GMSB below the GUT scale, there exists SUSY electroweak (EW) fine-tuning problem to explain the 125 GeV Higgs boson mass due to small trilinear soft term. Thus, to explain the Higgs boson mass, we propose the GMSB with both the generalized GM mechanism and Higgs-messenger interactions. The renormalization group equations are runnings from the GUT scale down to EW scale. So the EW symmetry breaking can be realized easier. We can keep the gauge coupling unification and solution to the flavor problem in the GMSB, as well as solve the μ/B_μ-problem. Moreover, there are only five free parameters in our model. So we can determine the characteristic low energy spectra and explore its distinct phenomenology. The low-scale fine-tuning measure can be as low as 20 with the light stop mass below 1 TeV and gluino mass below 2 TeV. The gravitino dark matter can come from a thermal production with the correct relic density and be consistent with the thermal leptogenesis. Because gluino and stop can be relatively light in our model, how to search for such GMSB at the upcoming run II of the LHC experiment could be very interesting. △ Less", "We employ both the minimal gravity- and the minimal gauge mediations of supersymmetry breaking at the grand unified theory (GUT) scale in a single supergravity framework, assuming the gaugino masses are generated dominantly by the minimal gauge mediation effects. In such a \"minimal mixed mediation model,\" a \"focus point\" of the soft Higgs mass parameter, m_{h_u}^2 emerges at 3-4 TeV energy scale, which is exactly the stop mass scale needed for explaining the 126 GeV Higgs boson mass without the \"A-term\" at the three loop level. As a result, m_{h_u}^2 in the MSSM can be quite insensitive to various trial stop masses at low energy, reducing the fine-tuning measures to be much smaller than 100 even for a 3-4 TeV low energy stop mass and -0.5 < A_t / m_0 < +0.1 at the GUT scale. The $μ$ parameter is smaller than 600 GeV. The gluino mass is predicted to be about 1.7 TeV, which could readily be tested at LHC run2. △ Less", "The multi-parameter character of supersymmetric dark-matter models implies the combination of their experimental studies with astrophysical and cosmological probes. The physics of the early Universe provides nontrivial effects of non-equilibrium particles and primordial cosmological structures. Primordial black holes (PBHs) are a profound signature of such structures that may arise as a cosmological consequence of supersymmetric (SUSY) models. SUSY-based mechanisms of baryosynthesis can lead to the possibility of antimatter domains in a baryon asymmetric Universe. In the context of cosmoparticle physics, which studies the fundamental relationship of the micro- and macro-worlds, the development of SUSY illustrates the main principles of this approach, as the physical basis of the modern cosmology provides cross-disciplinary tests in physical and astronomical studies. △ Less", "We briefly review several Higgs inflation models and discuss their cosmological implications. We first classify the inflation models according to the predicted value of the tensor-to-scalar ratio: (i) $r = {\\cal O}(0.01-0.1)$, (ii) $r = {\\cal O}(10^{-3})$, and (iii) $r \\ll 10^{-3}$. For each case we study (i) the Higgs inflation with a running kinetic term, (ii) the Higgs inflation with a non-minimal coupling to gravity, and (iii) the $B-L$ Higgs inflation. In the last case we introduce supersymmetry to suppress the Coleman-Weinberg corrections for successful inflation, and derive the upper bound on the SUSY breaking scale. Interestingly, the SUSY $B-L$ Higgs inflation requires the SUSY breaking scale of order ${\\cal O}(100)$\\,TeV to explain the observed spectral index. We briefly discuss a topological Higgs inflation which explains the origin of the standard model near-criticality. We also mention the possibility of Higgs domain walls and the gravitational waves emitted by the collapsing domain walls. △ Less", "We address the influence of quantum corrections to neutrino masses and mixings and discuss the possibilities to completely generate the flavor mixing irrespective of any tree-level flavor model. Furthermore, we describe a new class of vacua with a new minimum appearing in the standard Higgs direction. The results hint towards a charge and color breaking global minimum and therefore extend existing bounds at tree-level. Finally, we combine the discussion of vacuum stability in the MSSM with the right-handed neutrino extension. The supersymmetric version of the seesaw mechanism rescues the potential and also does not induce further instabilities neither at the SUSY scale nor at the scale of heavy neutrinos, as long as both scales are well separated. Moreover, we resolve a degeneracy in name space. △ Less", "We study the viability of regions of large $\\tan β$ within the framework of Fat Higgs/$λ$-SUSY Models. We compute the one-loop effective potential to find the corrections to the Higgs boson mass due to the heavy non-standard Higgs bosons. As the tree level contribution to the Higgs boson mass is suppressed at large $\\tan β$, these one-loop corrections are crucial to raising the Higgs boson mass to the measured LHC value. By raising the Higgsino and singlino mass parameters, typical electroweak precision constraints can also be avoided. We illustrate these new regions of Fat Higgs/$λ$-SUSY parameter space by finding regions of large $\\tan β$ that are consistent with all experimental constraints including direct dark matter detection experiments, relic density limits and the invisible decay width of the $Z$ boson. We find that there exist regions around $λ= 1.25, \\tan β= 50$ and a uniform psuedo-scalar $4~{\\rm TeV} \\lsim M_A \\lsim 8$~TeV which are consistent will all present phenomenological constraints. In this region the dark matter relic abundance and direct detection limits are satisfied by a lightest neutralino that is mostly bino or singlino. As an interesting aside we also find a region of low $\\tan β$ and small singlino mass parameter where a well-tempered neutralino avoids all cosmological and direct detection constraints. △ Less", "We study the phase diagram of an $SU(N)$ gauge theory in terms of the number of colors $N$ and flavors $N_f$ with emphasis on the confinement and chiral symmetry breaking phases. We argue that as opposed to SUSY QCD there is a small region in the $(N,N_f)$ plane where the theory has the chiral symmetry broken but it is unconfined. The possibility of a new phase with strong confinement and chiral symmetry breaking is suggested. △ Less", "We compute the full next-to-leading order supersymmetric (SUSY) electroweak (EW) and SUSY-QCD corrections to the decays of CP-odd NMSSM Higgs bosons into stop pairs. In our numerical analysis we also present the decay of the heavier stop into the lighter stop and an NMSSM CP-odd Higgs boson. Both the EW and the SUSY-QCD corrections are found to be significant and have to be taken into account for a proper prediction of the decay widths. △ Less", "We study vortex solutions in Abelian Chern-Simons-Higgs theories with visible and hidden sectors. We first consider the case in which the two sectors are connected through a BF-like gauge mixing term with no explicit interaction between the the two scalars. Since first order Bogomolny equations do not exist in this case, we derive the second order field equations. We then proceed to an ${\\cal N}=2$ supersymmetric extension including a Higgs portal mixing among the visible and hidden charged scalars. As expected, Bogomolnyi equations do exist in this case and we study their string-like solutions numerically. △ Less", "An excess in $γ$-rays emanating from the galactic centre has recently been observed in the Fermi-LAT data. We investigate the new exciting possibility of fitting the signal spectrum by dark matter annihilating dominantly to a Higgs-pseudoscalar pair. We show that the fit to the $γ$-ray excess for the Higgs-pseudoscalar channel can be just as good as for annihilation into bottom-quark pairs. This channel arises naturally in a full model such as the next-to-minimal supersymmetric Standard Model (NMSSM) and we find regions where dark matter relic density, the $γ$-ray signal and other experimental constraints, can all be satisfied simultaneously. Annihilation into scalar pairs allows for the possibility of detecting the Higgs or pseudoscalar decay into two photons, providing a smoking-gun signal of the model. △ Less", "Supersymmetry (SUSY) is an attractive extension of the Standard Model (SM) of particle physics which solves the SM hierarchy problem. Motivated by the theoretical $μ$-term problem of the Minimal Supersymmetric Model (MSSM), the Next-to MSSM (NMSSM) can also account for experimental deviations from the SM like the anomalous muon magnetic moment and the dark matter relic density. Natural SUSY, motivated by naturalness considerations, exhibits small fine tuning and a characteristic phenomenology with light higgsinos, stops and gluinos. We describe a scan in NMSSM parameter space motivated by Natural SUSY and guided by the phenomenology of an NMSSM with a slightly broken Peccei-Quinn symmetry and a lightly coupled singlet. We identify a scenario which survives experimental constraints with a light singlet Higgs and a singlino lightest SUSY particle. We then discuss how the scenario is not presently excluded by searches at the Large Hadron Collider (LHC) and which channels are promising for discovery at the LHC and International Linear Collider. △ Less", "We estimate the Baryon Asymmetry of the Universe (BAU) arising from leptogenesis within a class of minimal predictive seesaw models involving two right-handed neutrinos and simple Yukawa structures with one texture zero. The two right-handed neutrinos are dominantly responsible for the \"atmospheric\" and \"solar\" neutrino masses with Yukawa couplings to $(ν_e, ν_μ, ν_τ)$ proportional to $(0,1,1)$ and $(1,n,n-2)$, respectively, where $n$ is a positive integer. The neutrino Yukawa matrix is therefore characterised by two proportionality constants with their relative phase providing a leptogenesis-PMNS link, enabling the lightest right-handed neutrino mass to be determined from neutrino data and the observed BAU. We discuss an $SU(5)$ SUSY GUT example, where $A_4$ vacuum alignment provides the required Yukawa structures with $n=3$, while a $\\mathbb{Z}_9$ symmetry fixes the relatives phase to be a ninth root of unity. △ Less", "Motivated by two experimental facts, the muon g-2 anomaly and the observed Higgs boson mass around 125 GeV, we propose a simple model of anomaly mediation, which can be seen as a generalization of mixed modulus-anomaly mediation. In our model, the discrepancy of the muon g-2 and the Higgs boson mass around 125 GeV are easily accommodated. The required mass splitting between the strongly and weakly interacting SUSY particles are naturally achieved by the contribution from anomaly mediation. This model is easily consistent with SU(5) or SO(10) grand unified theory. △ Less", "The magic couple of SUSY and GUT still appears the most elegant and predictive physics concept beyond the Standard Model. Since up to now LHC found no evidence for supersymmetric particles it becomes of particular relevance to determine an upper bound of the energy scale they have to show up. In particular, we have analyzed a generic SUSY-GUT model assuming one step unification like in SU(5), and adopting naturalness principles, we have obtained general bounds on the mass spectrum of SUSY particles. We claim that if a SUSY gauge coupling unification takes place, the lightest gluino or Higgsino cannot have a mass larger than about 20 TeV. Such a limit is of interest for planning new accelerator machines. △ Less", "The soft breaking terms in supersymmetric theories are calculated at some high scale characterizing the hidden supersymmetry breaking sector, and then evolved down to the TeV scale. These parameters are usually presented as the ones that should be compared to experiment. The physical parameters however are those occurring in the quantum effective (1PI) action - in particular the physical mass is the location of the pole in the full quantum propagator. Here we discuss the relation between the two and the possible existence of additive contributions to the gaugino mass. We argue that infra red effects which violate non-renormalization theorems are absent (for the 1PI action) if the calculation is done at a generic point in field space so that an effective IR cutoff is present. It follows that if a gaugino mass term is absent in the Wilsonian action it is absent in the 1PI action. △ Less", "We discuss a high-scale SUSY breaking scenario with the wino dark matter in the five-dimensional supergravity model on $S^1/Z_2$. The extra U(1) symmetries broken by the orbifold projection control the flavor structure of soft SUSY-breaking parameters as well as the Yukawa couplings, and a scalar component of the one of moduli multiplets, which arise from extra-dimensional components of the U(1) vector multiplets, induces the slow-roll inflation. Because of the supersymmetric moduli stabilization as well as the moduli inflation, it is found that the correct dark matter relic abundance is non-thermally generated by the gravitino decaying into the wino. △ Less", "Gravitino Dark Matter represents a compelling scenario in Supersymmetry, which brings together a variety of data from cosmology and collider physics. We discuss the constraints obtained from the LHC on supersymmetric models with gravitino dark matter and neutralino NLSP, which is the case most difficult to disentangle at colliders from a neutralino LSP forming DM. The phenomenological SUSY model with 19+1 free parameters is adopted. Results are obtained from broad scans of the phase space of these uncorrelated parameters. The relation between gravitino mass, gluino mass and reheating temperature as well as the derived constraints on these parameters are discussed in detail. This relation offers a unique opportunity to place stringent bounds on the cosmological model, within the gravitino dark matter scenario, from the results of the LHC searches in Run-2 and the planned High-Luminosity upgrade. △ Less", "In the post-LHC8 world-- where a Standard Model-like Higgs boson has been established but there is no sign of supersymmetry (SUSY)-- the detailed profiling of the Higgs boson properties has emerged as an important road towards discovery of new physics. We present calculations of the expected deviations in Higgs boson couplings $κ_{τ,b}$, $κ_t$, $κ_{W,Z}$, $κ_g$ and $κ_γ$ versus the naturalness measure $Δ_{\\rm EW}$. Low values of $Δ_{\\rm EW}\\sim 10-30$ give rise to a natural Little Hierarchy characterized by light higgsinos with a mass of $μ\\sim m_Z$ while top squarks are highly mixed but lie in the several TeV range. For such models with radiatively-driven naturalness, one expects the Higgs boson $h$ to look very SM-like although deviations can occur. The more promising road to SUSY discovery requires direct higgsino pair production at a high energy $e^+e^-$ collider operating with the center-of-mass energy $\\sqrt{s}>2μ\\sim \\sqrt{2Δ_{\\rm EW}}m_Z$. △ Less", "A summary of the different searches for weakly produced SUSY by both CMS and ATLAS is presented here. A review on the methodology of these searches, including event selection, background suppression and estimation methods, etc is covered. Other searches at the LHC already probe squarks and gluino masses up to 1.4 TeV, such scenario, may favour electroweak production of charginos and neutralinos, that will produce many-lepton final states accompanied by E$_{\\rm T}^{\\rm miss}\\,$ and very little hadronic activity. Latest searches include Higgs boson in the decay and exploits VBF associated production to probe scenarios with very small mass splittings. △ Less", "We discuss thermal production of (pseudo) goldstinos, the Goldstone fermions emerging from (multiple) SUSY breaking sectors, when the reheating temperature is well below the superpartner masses. In such a case, the production during matter-dominated era induced by inflaton decay stage is more important than after reheating. Depending on the SUSY breaking scale, goldstinos are produced by freeze-in or freeze-out mechanism via $1\\to 2$ decays and inverse decays. We solve the Boltzmann equation for the momentum distribution function of the goldstino.In the freeze-out case, goldstinos maintain chemical equilibrium far after they are kinetically decoupled from the thermal bath, and consequently goldstinos with different momentum decouple at different temperatures. As a result their momentum distribution function shows a peculiar shape and the final yield is smaller than if kinetic equilibrium was assumed. We revisit the cosmological implications in both R-parity-conserving and R-parity-violating supersymmetric scenarios. For the former, thermally produced goldstinos can still be abundant enough to be dark matter at present times even if the reheating temperature is low, of order $1$ GeV. For the latter, if the reheating temperature is low, of order $0.1-1$ GeV, they are safe from the BBN constraints. △ Less", "We propose a deflected anomaly mediation scenario from SUSY QCD which can lead to both positive and negative deflection parameters (there is a smooth transition between these two deflection parameter regions by adjusting certain couplings). Such a scenario can naturally give a SUSY spectrum in which all the colored sparticles are heavy while the sleptons are light. As a result, the discrepancy between the Brookheaven $g_μ-2$ experiment and LHC data can be reconciled in this scenario. We also find that the parameter space for explaining the $g_μ-2$ anomaly at $1σ$ level can be fully covered by the future LUX-ZEPLIN 7.2 Ton experiment. △ Less", "It is known that after Affleck-Dine baryogenesis, spatial inhomogeneities of Affleck-Dine field grow into non-topological solitons called Q-balls. In gauge mediated SUSY breaking models, sufficiently large Q-balls with baryon charge are stable while Q-balls with lepton charge can always decay into leptons. For a Q-ball that carries nonzero $B$ and $L$ charges, the difference between the baryonic component and the leptonic component in decay rate may induce nonzero electric charge on the Q-ball. This implies that charged Q-ball, also called gauged Q-ball, may emerge in our universe. In this paper, we investigate two complex scalar fields, a baryonic scalar field and a leptonic one, in an Abelian gauge theory. We find stable solutions of gauged Q-balls for different baryon and lepton charges. Those solutions shows that a Coulomb potential arises and the Q-ball becomes electrically charged as expected. It is energetically favored that some amount of leptonic component decays, but there is an upper bound on its amount due to the Coulomb force. The baryonic decay also becomes possible by virtue of electrical repulsion and we find the condition to suppress it so that the charged Q-balls can survive in the universe. △ Less", "We point out that the anomaly of the muon $g-2$ can be easily explained in a focus point supersymmetry scenario, which realizes the semi-natural supersymmetry. Among known focus point supersymmetry scenarios, we find that a model based on Higgs-gaugino mediation works with a mild fine-tuning $Δ=40$-$80$. We propose two new focus point supersymmetry scenarios where the anomaly of the muon $g-2$ is also explained. These scenarios are variants of the widely known focus point supersymmetry based on gravity mediation with universal scalar masses. △ Less", "We discuss the origin of both non-Abelian discrete family symmetry and Abelian continuous family symmetry, as well as matter parity, from F-theory SUSY GUTs. We propose a minimal model based on the smallest GUT group $SU(5)$, together with the non-Abelian family symmetry $D_4$ plus an Abelian family symmetry, where fluxes are responsible for doublet-triplet splitting, leading to a realistic low energy spectrum with phenomenologically acceptable quark and lepton masses and mixing. We show how a $Z_2$ matter parity emerging from F-theory can suppress proton decay while allowing neutron-antineutron oscillations, providing a distinctive signature of the set-up. △ Less", "We propose a fundamental theory whose low-energy effective theory provides a phenomenological description of electroweak baryogenesis, radiative neutrino mass generation, and dark matter. The model is based on SUSY SU(2)_H gauge theory with confinement, and the model contains new Z_2 discrete symmetry and Z_2-odd right-handed neutrino superfields. The Higgs sector in the low energy effective theory of this model below confinement scale is described by fifteen mesonic superfields of fundamental SU(2)_H doublets. We present a benchmark scenario of this model, where all the constraints from the current neutrino, dark matter, lepton flavour violation and LHC data are satisfied. We also discuss how to test the scenario by the future collider experiments. △ Less", "We examine the Higgs triple coupling in MSSM and NMSSM under current constraints, which include the LHC measurements, Higgs data, B physics, electroweak precision observables, relic density and so on. The ratio $λ^{\\rm MSSM}_{hhh}/λ^{\\rm SM}_{hhh}$ is above 0.97, due to the highly constrained parameter space. While the ratio $λ^{\\rm NMSSM}_{hhh}/λ^{\\rm SM}_{hhh}$ can reach 0.1 under current constraints. The precise measurement in future collider will give a tighter constraint to the Higgs triple coupling in MSSM and NMSSM. △ Less", "We compute the decay width of $h^0 \\to c \\bar{c}$ in the MSSM with quark flavor violation (QFV) at full one-loop level in the $\\overline{\\rm DR}$ renormalization scheme. We study the effects of $\\tilde{c}-\\tilde{t}$ mixing, taking into account the constraints on QFV from the B meson data. We find that the full one-loop corrected decay width $Γ(h^0 \\to c \\bar{c})$ is very sensitive to the MSSM QFV parameters. In a scenario with large $\\tilde{c}_{L,R}-\\tilde{t}_{L,R}$ mixing, $Γ(h^0 \\to c \\bar{c})$ can differ up to $\\sim \\pm 35\\%$ from its SM value. After estimating the uncertainties of the width, we conclude that an observation of these QFV SUSY effects is possible at a future $e^+ e^-$ collider such as ILC. △ Less", "We explore unification and natural supersymmetry in a five dimensional extension of the standard model in which the extra dimension may be large, of the order of 1-10 TeV. Power law running generates a TeV scale A_ term allowing for the observed 125 GeV Higgs and allowing for stop masses below 2 TeV, compatible with a natural SUSY spectrum. We supply the full one-loop RGEs for various models and use metastability to give a prediction that the gluino mass should be lighter than 3.5 TeV for A_t <= 2.5 TeV, for such a compactification scale, with brane localised 3rd generation matter. We discuss why models in which the 1st and 2nd generation of matter fields are located in the bulk are likely to be ruled out. We also look at electroweak symmetry breaking in these models. △ Less", "We introduce an explicit supersymmetric unification model where grand unified gauge symmetry breaking and supersymmetry (SUSY) breaking are caused by the same field. Besides, the SM-charged particles are also predicted by the symmetry breaking sector, and their loop corrections induce the soft SUSY breaking terms. Especially, nonzero A-term and B-term are generated at one-loop level according to the mediation via the vector superfields, so that the electro-weak symmetry breaking and 125 GeV Higgs mass could be achieved even if the stop mass is around 1 TeV. △ Less", "Measuring the Higgs self-coupling is one of the crucial physics goals at the LHC Run-2 and other future colliders. In this work, we attempt to figure out the size of SUSY effects on the trilinear self-coupling of the 125 GeV Higgs boson in the MSSM and NMSSM after the LHC Run-1. Taking account of current experimental constraints, such as the Higgs data, flavor constraints, electroweak precision observables and dark matter detections, we obtain the observations: (1) In the MSSM, the ratio of $λ^{MSSM}_{3h}/λ^{SM}_{3h}$ has been tightly constrained by the LHC data, which can be only slightly smaller than 1 and minimally reach 97\\%; (2) In the NMSSM with $λ<0.7$, a sizable reduction of $λ^{NMSSM}_{3h_2}/λ^{SM}_{3h_2}$ can occur and minimally reach 10\\% when the lightest CP-even Higgs boson mass $m_{h_1}$ is close to the SM-like Higgs boson $m_{h_2}$ due to the large mixing angle between the singlet and doublet Higgs bosons; (3) In the NMSSM with $λ>0.7$, a large enhancement or reduction $-1.1<λ^{NMSSM}_{3h_1}/λ^{SM}_{3h_1}<2$ can occur, which is accompanied by a sizable change of $h_1τ^+τ^-$ coupling. The future colliders, such as the HL-LHC and ILC, will have the capacity to test these large deviations in the NMSSM. △ Less", "We construct the minimal effective field theory (EFT) of supersymmetric inflation, whose field content is a real scalar, the goldstone for time-translation breaking, and a Weyl fermion, the goldstino for supersymmetry (SUSY) breaking. The inflating background can be viewed as a single SUSY-breaking sector, and the degrees of freedom can be efficiently parameterized using constrained superfields. Our EFT is comprised of a chiral superfield X_NL containing the goldstino and satisfying X_NL^2 = 0, and a real superfield B_NL containing both the goldstino and the goldstone, satisfying X_NL B_NL = B_NL^3 = 0. We match results from our EFT formalism to existing results for SUSY broken by a fluid background, showing that the goldstino propagates with subluminal velocities. The same effect can also be derived from the unitary gauge gravitino action after embedding our EFT in supergravity. If the gravitino mass is comparable to the Hubble scale during inflation, we identify a new parameter in the EFT related to a time-dependent phase of the gravitino mass parameter. We briefly comment on the leading contributions of goldstino loops to inflationary observables. △ Less", "We discuss the low-energy physics which arises on stacks of squashed brane solutions of $SU(N)$ ${\\cal N}=4$ SYM, deformed by a cubic soft SUSY breaking potential. A brane configuration is found which leads to a low-energy physics similar to the standard model in the broken phase, assuming suitable VEV's of the scalar zero modes. Due to the triple self-intersection of the branes, the matter content includes that of the MSSM with precisely 3 generations and right-handed neutrinos. No exotic quantum numbers arise, however there are extra chiral superfields with the quantum numbers of the Higgs doublets, the $W,Z$, $e_R$ and $u_R$, whose fate depends on the details of the rich Higgs sector. The chiral low-energy sector is complemented by a heavy mirror sector with the opposite chiralities, as well as super-massive Kaluza-Klein towers completing the ${\\cal N}=4$ multiplets. The sectors are protected by two gauged global $U(1)$ symmetries. △ Less", "The muon anomalous magnetic moment $a_μ$ is investigated in the MSSM for $\\tanβ\\to\\infty$. This is an attractive example of radiative muon mass generation with completely different qualitative parameter dependence compared to the MSSM with the usual, finite $\\tanβ$. The observed, positive difference between the experimental and Standard Model value can only be explained if there are mass splittings, such that bino contributions dominate over wino ones. The two most promising cases are characterized either by large Higgsino mass $μ$ or by large left-handed smuon mass $m_L$. The required mass splittings and the resulting $a_μ^\\text{SUSY}$ are studied in detail. It is shown that the current discrepancy in $a_μ$ can be explained even in cases where all SUSY masses are at the TeV scale. The paper also presents useful analytical formulas, approximations for limiting cases, and benchmark points. △ Less", "I review the Higgs sector of the $U(1)_{B-L}$ extension of the minimal supersymmetric standard model (MSSM). I will show that the gauge kinetic mixing plays a crucial role in the Higgs phenomenology. Two light bosons are present, a MSSM-like one and a $B-L$-like one, that mix at one loop solely due to the gauge mixing. After briefly looking at constraints from flavour observables, new decay channels involving right-handed (s)neutrinos are presented. Finally, it will be reviewed how model features pertaining to the gauge extension affect the model phenomenology, concerning the existence of R-Parity-conserving minima at loop level and the Higgs-to-diphoton coupling. △ Less", "We present the state-of-the-art of the effective field theory computation of the MSSM Higgs mass, improving the existing ones by including extra threshold corrections. We show that, with this approach, the theoretical uncertainty is within 1 GeV in most of the relevant parameter space. We confirm the smaller value of the Higgs mass found in the EFT computations, which implies a slightly heavier SUSY scale. We study the large tan(β) region, finding that sbottom thresholds might relax the upper bound on the scale of SUSY. We present SusyHD, a fast computer code that computes the Higgs mass and its uncertainty for any SUSY scale, from the TeV to the Planck scale, even in Split SUSY, both in the DRbar and in the on-shell schemes. Finally, we apply our results to derive bounds on some well motivated SUSY models, in particular we show how the value of the Higgs mass allows to determine the complete spectrum in minimal gauge mediation. △ Less", "We analyze the prospects of the detection of a $\\mathcal{O}(1)$ GeV neutralino dark matter, $\\widetildeχ^0_{1}$, in the Next-to-Minimal Supersymmetric Standard Model at the 14 TeV LHC. We perform dedicated scans of the relevant parameter space of the model and find a large number of points where the thermal relic abundance due to such a dark matter is consistent with the PLANCK measurement. We note that this dark matter is highly singlino-dominated and is always accompanied by a pseudoscalar, $A_1$, with a mass around twice its own, which is responsible for its resonant annihilation. For two benchmark points from our scan, we then carry out a detector-level signal-to-background analysis of the pair production of a heavier higgsino neutralino and a chargino. The higgsino thus produced decays into the dark matter and either the $Z$ boson or the $A_1$. For the $Z$-associated production of $\\widetildeχ^0_{1}$, we investigate the scope of the trilepton search channel. For the $A_1$-associated production mode, in order to identify the two collimated muons coming from the decay of the $A_1$, we employ an unconventional method of clustering them together into one jet-like object. Using this method, for certain parameter space configurations, a much larger sensitivity can be obtained at the 14 TeV LHC for the $A_1\\widetildeχ^0_{1}$ channel compared to the $Z\\widetildeχ^0_{1}$ channel, with an integrated luminosity of 300 fb$^{-1}$. △ Less", "This paper describes the physics case for a new fixed target facility at CERN SPS. The SHiP (Search for Hidden Particles) experiment is intended to hunt for new physics in the largely unexplored domain of very weakly interacting particles with masses below the Fermi scale, inaccessible to the LHC experiments, and to study tau neutrino physics. The same proton beam setup can be used later to look for decays of tau-leptons with lepton flavour number non-conservation, $τ\\to 3μ$ and to search for weakly-interacting sub-GeV dark matter candidates. We discuss the evidence for physics beyond the Standard Model and describe interactions between new particles and four different portals - scalars, vectors, fermions or axion-like particles. We discuss motivations for different models, manifesting themselves via these interactions, and how they can be probed with the SHiP experiment and present several case studies. The prospects to search for relatively light SUSY and composite particles at SHiP are also discussed. We demonstrate that the SHiP experiment has a unique potential to discover new physics and can directly probe a number of solutions of beyond the Standard Model puzzles, such as neutrino masses, baryon asymmetry of the Universe, dark matter, and inflation △ Less", "Supersymmetric (SUSY) models, even those described by relatively few parameters, generically allow many possible SUSY particle (sparticle) mass hierarchies. As the sparticle mass hierarchy determines, to a great extent, the collider phenomenology of a model, the enumeration of these hierarchies is of the utmost importance. We therefore provide a readily generalizable procedure for determining the number of sparticle mass hierarchies in a given SUSY model. As an application, we analyze the gravity-mediated SUSY breaking scenario with various combinations of GUT-scale boundary conditions involving different levels of universality among the gaugino and scalar masses. For each of the eight considered models, we provide the complete list of forbidden hierarchies in a compact form. Our main result is that the complete (typically rather large) set of forbidden hierarchies among the eight sparticles considered in this analysis can be fully specified by just a few forbidden relations involving much smaller subsets of sparticles. △ Less", "We propose a mechanism to generate the neutrino mixing matrix from supersymmetric threshold corrections. Flavor violating soft breaking terms induce flavor changing self-energies that give a finite renormalization to the mixing matrix. The described threshold corrections get enhanced in case of quasi-degenerate neutrino masses. In this scenario, we adjust potentially arbitrary soft breaking parameters in a way to reproduce the observed neutrino mixing at one loop working with non-minimal flavor violating soft parameters. To incorporate small neutrino masses already at tree-level via a type I seesaw mechanism, we extend the Minimal Supersymmetric Standard Model with singlet Majorana neutrinos. The radiative corrections do not decouple with the scale of Supersymmetry and persist when the spectrum is shifted to higher values. Moreover, the mixing matrix renormalization with flavor-changing self-energies is not restricted to supersymmetric theories and give similar results in any theory with new flavor structures. △ Less", "We present a frequentist analysis of the parameter space of the pMSSM10, in which the following 10 soft SUSY-breaking parameters are specified independently at the mean scalar top mass scale Msusy = Sqrt[M_stop1 M_stop2]: the gaugino masses M_{1,2,3}, the 1st-and 2nd-generation squark masses M_squ1 = M_squ2, the third-generation squark mass M_squ3, a common slepton mass M_slep and a common trilinear mixing parameter A, the Higgs mixing parameter mu, the pseudoscalar Higgs mass M_A and tan beta. We use the MultiNest sampling algorithm with 1.2 x 10^9 points to sample the pMSSM10 parameter space. A dedicated study shows that the sensitivities to strongly-interacting SUSY masses of ATLAS and CMS searches for jets, leptons + MET signals depend only weakly on many of the other pMSSM10 parameters. With the aid of the Atom and Scorpion codes, we also implement the LHC searches for EW-interacting sparticles and light stops, so as to confront the pMSSM10 parameter space with all relevant SUSY searches. In addition, our analysis includes Higgs mass and rate measurements using the HiggsSignals code, SUSY Higgs exclusion bounds, the measurements B-physics observables, EW precision observables, the CDM density and searches for spin-independent DM scattering. We show that the pMSSM10 is able to provide a SUSY interpretation of (g-2)_mu, unlike the CMSSM, NUHM1 and NUHM2. As a result, we find (omitting Higgs rates) that the minimum chi^2/dof = 20.5/18 in the pMSSM10, corresponding to a chi^2 probability of 30.8 %, to be compared with chi^2/dof = 32.8/24 (31.1/23) (30.3/22) in the CMSSM (NUHM1) (NUHM2). We display 1-dimensional likelihood functions for SUSY masses, and show that they may be significantly lighter in the pMSSM10 than in the CMSSM, NUHM1 and NUHM2. We discuss the discovery potential of future LHC runs, e+e- colliders and direct detection experiments. △ Less", "We present a new focus point supersymemtry breaking scenario based on the supersymmetric $E_7$ non-linear sigma model. In this non-linear sigma model, squarks and sleptons are identified with (pseudo) Nambu-Goldstone bosons. Their masses are generated only radiatively through gauge and yukawa interactions, and they are much smaller than the gravitino and gaugino masses at a high energy scale. On the other hand, Higgs doublets belong to matter multiplets and hence may have unsuppressed supersymmetry-breaking soft masses. We consider their masses to be equal to the gravitino mass at the high energy scale, assuming the minimal Kahler potential for Higgs doublets. We show that the fine-tuning measure of the electroweak symmetry breaking scale is reduced significantly to $Δ=30-70$, if the ratio of the gravitino mass to the gaugino mass is around $5/4$. Also, the prospects of the discovery/exclusion of supersymmetric particles at the Large Hadron Collider and dark matter direct detection experiments are discussed. △ Less", "We study to which extent SUSY extensions of the Standard Model can describe the excess of events of 3.0 standard deviations observed by ATLAS in the on-Z signal region, respecting constraints by CMS on similar signal channels as well as constraints from searches for jets and E^{miss}_T. GMSB-like scenarios are typically in conflict with these constraints, and do not reproduce well the shape of the E^{miss}_T distribution of the data. An alternative scenario with two massive neutralinos can improve fits to the total number of events as well as to the H_T and E^{miss}_T distributions. Such a scenario can be realised within the NMSSM. △ Less", "It has been widely known that bino-like dark matter in the supersymmetric (SUSY) theories in general suffers from over-production. The situation can be drastically improved if gluinos have a mass slightly heavier than the bino dark matter as they reduce the dark matter abundance through coannihilation. In this work, we consider such a bino-gluino coannihilation scenario in high-scale SUSY models, which can be actually realized when the squark-mass scale is less than 100-1000 TeV. We study the prospects for exploring this bino-gluino coannihilation scenario at the LHC. We show that the searches for long-lived colored particles with displaced vertices offer a strong tool to test this scenario in collider experiments. △ Less", "We discuss the role of a class of higher dimensional operators in 4D N=1 supersymmetric effective theories. The Lagrangian in such theories is an expansion in momenta below the scale of \"new physics\" ($Λ$) and contains the effective operators generated by integrating out the \"heavy states\" above $Λ$ present in the UV complete theory. We go beyond the \"traditional\" leading order in this momentum expansion (in $\\partial/Λ$). Keeping manifest supersymmetry and using superfield {\\it constraints} we show that the corresponding higher dimensional (derivative) operators in the sectors of chiral, linear and vector superfields of a Lagrangian can be \"unfolded\" into second-order operators. The \"unfolded\" formulation has only polynomial interactions and additional massive superfields, some of which are ghost-like if the effective operators were {\\it quadratic} in fields. Using this formulation, the UV theory emerges naturally and fixes the (otherwise unknown) coefficient and sign of the initial (higher derivative) operators. Integrating the massive fields of the \"unfolded\" formulation generates an effective theory with only polynomial effective interactions relevant for phenomenology. We also provide several examples of \"unfolding\" of theories with higher derivative {\\it interactions} in the gauge or matter sectors that are actually ghost-free. We then illustrate how our method can be applied even when including {\\it all orders} in the momentum expansion, by using an infinite set of superfield constraints and an iterative procedure, with similar results. △ Less", "We discuss a new mechanism of D-term dynamical supersymmetry breaking in the context of Dirac gaugino scenario. The existence of a nontrivial solution of the gap equation for D-term is shown. It is also shown that an observed 126 GeV Higgs mass is realized by tree level D-term effects in a broad range of parameters. △ Less", "We consider the possibility that the muon g-2 anomaly, $δ(g-2)$, finds its origins in low energy supersymmetry (SUSY). In the general MSSM the parameter space consistent with $δ(g-2)$ and correct dark matter relic density of the lightest neutralino easily evades the present direct LHC limits on sparticle masses and also lies to a large extent beyond future LHC sensitivity. The situation is quite different in GUT-defined scenarios where input SUSY parameters are no longer independent. We analyze to what extent the LHC can probe a broad class of GUT-inspired SUSY models with gaugino non-universality that are currently in agreement with the bounds from $δ(g-2)$, as well as with the relic density and the Higgs mass measurement. To this end we perform a detailed numerical simulation of several searches for electroweakino and slepton production at the LHC and derive projections for the LHC 14 TeV run. We show that, within GUT-scale SUSY there is still plenty of room for the explanation of the muon anomaly, although the current LHC data already imply strong limits on the parameter space consistent with $δ(g-2)$. On the other hand, we demonstrate that the parameter space will be basically fully explored within the sensitivity of the 14 TeV run with 300 fb$^{-1}$. This opens up the interesting possibility that, if the g-2 anomaly is real then some positive signals must be detected at the LHC, or else these models will be essentially ruled out. Finally, we identify the few surviving spectra that will provide a challenge for detection at the LHC 14 TeV run and we characterize their properties. △ Less", "Starting with 'High Scale Mixing Unification' hypothesis, we investigate the renormalization group evolution of mixing parameters and masses for both Dirac and Majorana type neutrinos. Following this hypothesis, the PMNS mixing parameters are taken to be identical to the CKM ones at a unifying high scale. Then, they are evolved to a low scale using MSSM renormalization-group equations. For both type of neutrinos, the renormalization group evolution 'naturally' results in a non-zero and small value of leptonic mixing angle $θ_{13}$. One of the important predictions of this analysis is that, in both cases, the mixing angle $θ_{23}$ turns out to be non-maximal for most of the parameter range. We also elaborate on the important differences between Dirac and Majorana neutrinos within our framework and how to experimentally distinguish between the two scenarios. Furthermore, for both cases, we also derive constraints on the allowed parameter range for the SUSY breaking and unification scales, for which this hypothesis works. The results can be tested by present and future experiments. △ Less", "The experimental limit on the neutron electric dipole moment is used as a possible probe of new physics beyond the standard model. Within MSSM we use the current experimental limit on the neutron EDM and possible future improvement as a probe of high scale SUSY. Quantitative analyses show that scalar masses as large as a PeV and larger could be probed in improved experiment far above the scales accessible at future colliders. We also discuss the neutron EDM as a probe of new physics models beyond MSSM. Specifically we consider an MSSM extension with a particle content including a vectorlike multiplet. Such an extension brings in new sources of CP violation beyond those in MSSM. These CP phases contribute to the EDM of the quarks and to the neutron EDM. These contributions are analyzed in this work where we include the supersymmetric loop diagrams involving the neutralinos, charginos, the gluino, squark and mirror squark exchange diagrams at the one loop level. We also take into account the contributions from the $W$, $Z$, quark and mirror quark exchanges arising from the mixings of the vectorlike generation with the three generations. It is shown that the experimental limit on the neutron EDM can be used to probe such new physics models. In the future one expects the neutron EDM to improve an order of magnitude or more allowing one to extend the probe of high scale SUSY and of new physics models. For the MSSM the probe of high scales could go up to and beyond PeV scale masses. △ Less", "We have studied the contribution of the high-scale SUSY to the K_L to pi^0 nu{bar nu} and K^+ to pi^+ nu{bar nu} processes correlating with the CP violating parameter epsilon_K. Taking account of the recent LHC results for the Higgs discovery and the SUSY searches, we consider the high-scale SUSY at the 10-50 TeV scale in the framework of the non-minimal squark (slepton) flavor mixing. The Z penguin mediated the chargino dominates the SUSY contribution for these decays. At the 10 TeV scale of the SUSY, the chargino contribution can enhance the branching ratio of K_L to pi^0 nu{bar nu} in eight times compared with the SM predictions whereas the predicted branching ratio BR(K^+ to pi^+ nu {bar nu}) increases up to three times of the SM one. The gluino box diagram dominates the SUSY contribution of epsilon_K up to 30%. If the down-squark mixing is neglected compared with the up-squark mixing, the Z penguin mediated the chargino dominates both SUSY contributions of K_L to pi^0 nu {bar nu} and epsilon_K. Then, it is found a correlation between them, but the chargino contribution to epsilon_K is at most 3%. Even if the SUSY scale is 50TeV, the chargino process still enhances the branching ratio of K_L to pi^0 nu {bar nu} from the SM prediction in the factor two, and epsilon_K is deviated from the SM prediction in O(10%) through the gluino box diagram unless the down-squark mixing is suppressed. We also discuss the chargino contribution to K_L to pi^0 e^+e^- process. △ Less", "We propose an $SO(10)$ supersymmetric grand unified theory (SUSY GUT), where the $SO(10)$ gauge symmetry breaks down to $SU(3)_c \\times SU(2)_L \\times U(1)_Y\\times U(1)_{X}$ at the GUT scale and $U(1)_X$ is radiatively broken at the SUSY-braking scale. In order to achieve the observed Higgs mass around $126$ GeV and also to satisfy constraints on flavor- and/or CP-violating processes, we assume that the SUSY-breaking scale is $O(100)$ TeV, so that the $U(1)_X$ breaking scale is also $O(100)$ TeV. One big issue in the SO(10) GUTs is how to realize realistic Yukawa couplings. In our model, not only ${\\bf 16}$-dimensional but also ${\\bf 10}$-dimensional matter fields are introduced to predict the observed fermion masses and mixings. The Standard-Model quarks and leptons are linear combinations of the ${\\bf 16}$- and ${\\bf 10}$-dimensional fields so that the $U(1)_{X}$ gauge interaction may be flavor-violating. We investigate the current constraints on the flavor-violating $Z'$ interaction from the flavor physics and discuss prospects for future experiments. △ Less", "Supersymmetry searches at the LHC are both highly varied and highly constraining, but the vast majority are focused on cases where the final-stage visible decays are prompt. Scenarios featuring superparticles with detector-scale lifetimes have therefore remained a tantalizing possibility for sub-TeV SUSY, since explicit limits are relatively sparse. Nonetheless, the extremely low backgrounds of the few existing searches for collider-stable and displaced new particles facilitates recastings into powerful long-lived superparticle searches, even for models for which those searches are highly non-optimized. In this paper, we assess the status of such models in the context of baryonic R-parity violation, gauge mediation, and mini-split SUSY. We explore a number of common simplified spectra where hadronic decays can be important, employing recasts of LHC searches that utilize different detector systems and final-state objects. The LSP/NLSP possibilities considered here include generic colored superparticles such as the gluino and light-flavor squarks, as well as the lighter stop and the quasi-degenerate Higgsino multiplet motivated by naturalness. We find that complementary coverage over large swaths of mass and lifetime is achievable by superimposing limits, particularly from CMS's tracker-based displaced dijet search and heavy stable charged particle searches. Adding in prompt searches, we find many cases where a range of sparticle masses is now excluded from zero lifetime to infinite lifetime with no gaps. In other cases, the displaced searches furnish the only extant limits at any lifetime. △ Less", "We consider Supersymmetric (SUSY) and non-SUSY models of chaotic inflation based on the phi^n potential with 2<=n<=6. We show that the coexistence of a nonminimal coupling to gravity, fR=1+cR phi^(n/2), with a kinetic mixing of the form fK=cK fR^m can accommodate values of the spectral index, ns, and the tensor-to-scalar ratio, r, favored by the Bicep2/Keck Array and Planck results for 0<=m<=4 and 2.5x10^(-4)<=rRK=cR/cK^{n/4}<=1, where the upper limit is not imposed for n=2. Inflation can be attained for subplanckian inflaton values with the corresponding effective theories retaining the perturbative unitarity up to the Planck scale. △ Less", "Recently the ATLAS experiment announced a 3 $σ$ excess at the Z-peak consisting of 29 pairs of leptons together with two or more jets, $E_T^{\\rm miss}> 225$ GeV and $H_T \\geq 600$ GeV, to be compared with $10.6 \\pm 3.2$ expected lepton pairs in the Standard Model. No excess outside the Z-peak was observed. By trying to explain this signal with SUSY we find that only relatively light gluinos, $m_{\\tilde g} \\lesssim 1.2$ TeV, together with a heavy neutralino NLSP of $m_{\\tilde χ} \\gtrsim 400$ GeV decaying predominantly to Z-boson plus a light gravitino, such that nearly every gluino produces at least one Z-boson in its decay chain, could reproduce the excess. We construct an explicit general gauge mediation model able to reproduce the observed signal overcoming all the experimental limits. Needless to say, more sophisticated models could also reproduce the signal, however, any model would have to exhibit the following features, light gluinos, or heavy particles with a strong production cross-section, producing at least one Z-boson in its decay chain. The implications of our findings for the Run II at LHC with the scaling on the Z peak, as well as for the direct search of gluinos and other SUSY particles, are pointed out. △ Less", "By insisting on naturalness in both the electroweak and QCD sectors of the MSSM, the portrait for dark matter production is seriously modified from the usual WIMP miracle picture. In SUSY models with radiatively-driven naturalness (radiative natural SUSY or RNS) which include a DFSZ-like solution to the strong CP and SUSY mu problems, dark matter is expected to be an admixture of both axions and higgsino-like WIMPs. The WIMP/axion abundance calculation requires simultaneous solution of a set of coupled Boltzmann equations which describe quasi-stable axinos and saxions. In most of parameter space, axions make up the dominant contribution of dark matter although regions of WIMP dominance also occur. We show the allowed range of PQ scale f_a and compare to the values expected to be probed by the ADMX axion detector in the near future. We also show WIMP detection rates which are suppressed from usual expectations because now WIMPs comprise only a fraction of the total dark matter. Nonetheless, ton-scale noble liquid detectors should be able to probe the entirety of RNS parameter space. Indirect WIMP detection rates are less propitious since they are reduced by the square of the depleted WIMP abundance. △ Less", "We propose a renormalisable model based on $A_4$ family symmetry with an $SU(5)$ grand unified theory (GUT) which leads to the minimal supersymmetric standard model (MSSM) with a two right-handed neutrino seesaw mechanism. Discrete $\\mathbb{Z}_9\\times \\mathbb{Z}_6$ symmetry provides the fermion mass hierarchy in both the quark and lepton sectors, while $\\mathbb{Z}_4^R$ symmetry is broken to $\\mathbb{Z}_2^R$, identified as usual R-parity. Proton decay is highly suppressed by these symmetries. We discuss both the $A_4$ and $SU(5)$ symmetry breaking sectors, including doublet-triplet splitting, Higgs mixing and the origin of the $μ$ term. The model provides an excellent fit (better than one sigma) to all quark and lepton (including neutrino) masses and mixing with spontaneous CP violation. With the $A_4$ vacuum alignments, $(0,1,1)$ and $(1,3,1)$, the model predicts the entire PMNS mixing matrix with no free parameters, up to a relative phase, selected to be $2π/3$ from a choice of the nine complex roots of unity, providing a direct link between neutrino oscillations and leptogenesis. △ Less", "In this talk I review the motivations for physics beyond the Standard Model at the TeV scale and the prospects for their detection in the second Run of LHC. Then I focus in the supersymmetric case, paying special attention to the formulation and implications of the Natural SUSY scenario. △ Less", "This paper introduces a random statistical scan over the high-energy initial parameter space of the minimal SUSY $B-L$ model--denoted as the $B-L$ MSSM. Each initial set of points is renormalization group evolved to the electroweak scale--being subjected, sequentially, to the requirement of radiative $B-L$ and electroweak symmetry breaking, the present experimental lower bounds on the $B-L$ vector boson and sparticle masses, as well as the lightest neutral Higgs mass of $\\sim$125 GeV. The subspace of initial parameters that satisfies all such constraints is presented, shown to be robust and to contain a wide range of different configurations of soft supersymmetry breaking masses. The low-energy predictions of each such \"valid\" point - such as the sparticle mass spectrum and, in particular, the LSP - are computed and then statistically analyzed over the full subspace of valid points. Finally, the amount of fine-tuning required is quantified and compared to the MSSM computed using an identical random scan. The $B-L$ MSSM is shown to generically require less fine-tuning. △ Less", "An analysis is given of the decay $μ\\to e+ γ$ in an MSSM extension with a vectorlike generation. Here mixing with the mirrors allows the possibility of this decay. The analysis is done at the one loop level with the exchange of charginos and neutralinos and of sleptons and mirror sleptons in the loops. A one loop analysis with W and Z boson exchange and mirror leptons and neutrinos is also considered. The effects of CP violating phases from the new sector on the decay $μ\\to e γ$ are analyzed in detail. The constraints arising from the current upper limit on the branching ratio ${\\cal{B}}(μ\\to {e} γ)$ from the MEG experiment of $2.4\\times 10^{-12}$ (at 90\\% CL) on the parameter space of SUSY models and on vectorlike models are explored. Further, the MEG experiment is likely to improve the upper limit by an order of magnitude in the coming years. The improved limits will allow one to probe a much larger domain of the parameter space of the extended models. △ Less", "R-parity violating supersymmetric models (RPV SUSY) are becoming increasingly more appealing than its R-parity conserving counterpart in view of the hitherto non-observation of SUSY signals at the LHC. In this talk, RPV scenarios where neutrino masses are naturally generated are discussed, namely RPV through bilinear terms (bRPV) and the \"mu from nu\" supersymmetric standard model. The latter is characterised by a rich Higgs sector that easily accommodates a 125-GeV Higgs boson. The phenomenology of such models at the LHC is reviewed, giving emphasis on final states with displaced objects, and relevant results obtained by LHC experiments are presented. The implications for dark matter for these theoretical proposals is also addressed. △ Less", "Motivated by the null results of LHC searches, which together with the Higgs mass, severely constrain minimal supersymmetric extensions of the standard model, we adopt a model-independent approach to study charged slepton flavor. We examine a number of simplified models, with different subsets of sleptons, electroweak gauginos, and Higgsinos, and derive the allowed slepton flavor dependence in the region probed by current LHC searches, and in the region relevant for the 14 TeV LHC. We then study the impact of the allowed flavor dependence on lepton plus missing energy searches. In some cases, flavor dependence significantly modifies the reach of the searches. These effects may be even larger at the next LHC run, since for the higher masses probed at 14 TeV, larger flavor mixings and relative mass splittings are compatible with low-energy constraints. Retaining the full lepton flavor information can increase the sensitivity of the searches. △ Less", "A variety of supersymmetric models give rise to a split mass spectrum characterized by very heavy scalars but sub-TeV gauginos, usually with a wino-like LSP. Such models predict a thermally-produced underabundance of wino-like WIMP dark matter so that non-thermal DM production mechanisms are necessary. We examine the case where theories with a wino-like LSP are augmented by a Peccei-Quinn sector including an axion-axino-saxion supermultiplet in either the SUSY KSVZ or SUSY DFSZ models and with/without saxion decays to axions/axinos. We show allowed ranges of PQ breaking scale f_a for various cases which are generated by solving the necessary coupled Boltzmann equations. We also present results for a model with radiatively-driven naturalness but with a wino-like LSP. △ Less", "An excess in gamma-rays emanating from the galactic centre has recently been observed in the Fermi-LAT data. This signal can be interpreted as resulting from WIMP annihilation, with the spectrum well-fit by dark matter annihilating dominantly into either bottom-quark or Higgs pairs. Supersymmetric models provide a well-motivated framework to study the implications of this signal in these channels. With a neutralino dark matter candidate, the gamma-ray excess cannot be easily accommodated in the minimal supersymmetric model, which in any case requires tuning below the percent level to explain the observed Higgs mass. Instead we are naturally led to consider the next-to-minimal model with a singlet superfield. This not only allows for the annihilation channel into bottom-quark pairs to be implemented, but also provides new possibilities for annihilation into Higgs-pseudoscalar pairs. We show that the fit to the gamma-ray excess for the Higgs-pseudoscalar channel can be just as good as for annihilation into bottom-quark pairs. Moreover, in the parameter range of interest, the next-to-minimal supersymmetric model solves the mu-problem and can explain the 125 GeV Higgs mass with improved naturalness. We also consider an extension by adding a right-handed neutrino superfield with the right-handed sneutrino acting as a dark matter candidate. Interestingly, this allows for the annihilation into pseudoscalar pairs which also provide a good fit to the gamma-ray excess. Furthermore, in the case of a neutralino LSP, the late decay of a sneutrino NLSP can non-thermally produce the observed relic abundance. Finally, the WIMP annihilation into scalar pairs allows for the possibility of detecting the Higgs or pseudoscalar decay into two photons, providing a smoking-gun signal of the model. △ Less", "We investigate the decays of the light stop in scenarios with the lightest neutralino $\\tildeχ_1^0$ being the lightest supersymmetric particle, including flavour-violating (FV) effects. We analyse the region where the three-body decay $\\tilde{t}_1\\to W b \\tildeχ_1^0$ is kinematically allowed and provide a proper description of the transition region between the three-body decay and the four-body decay $\\tilde{t}_1 \\to\\tildeχ_1^0 b f \\bar{f}'$. The improved treatment has been implemented in the Fortran package {\\tt SUSY-HIT} and is used for the analysis of this region. A scan over the parameter range including all relevant experimental constraints reveals that the FV two-body decay into charm and $\\tildeχ_1^0$ can be as important as the three-, respectively, four-body decays if not dominant and therefore should be taken into account in order to complete the experimental searches for the light stop. △ Less", "A recent CMS analysis has reported the observation of an excess in the invariant mass distribution of the opposite-sign same-flavour lepton pair, which can be interpreted as a kinematic edge due to new physics. Using collider simulation tools, we recast relevant LHC search results reported by ATLAS and CMS collaborations in order to determine constraints on supersymmetric models that could produce the observed features. In particular, we focus on models involving cascade decays of light-flavour squarks and sbottoms. We find no favourable supersymmetry scenario within our exploration that could explain the origin of the excess when other LHC constraints are taken into account. △ Less", "Models with Dirac gauginos provide appealing scenarios for physics beyond the standard model. They have smaller radiative corrections to the Higgs mass, a suppression of certain SUSY production processes, and ameliorated flavor constraints. Unfortunately, they also generally have tachyons, the solutions to which typically spoil these positive features. The recently proposed \"Goldstone Gaugino\" mechanism provides a simple solution that eliminates these tachyonic states. We provide details on this mechanism and explore models for its origin. In particular, we find SUSY QCD models that realize this idea simply, and discuss scenarios for unification. △ Less", "We describe a new type of discrete symmetry that relates heterotic-string models. It is based on the spectral flow operator which normally acts within a general N=(2,2) model and we use this operator to construct a map between N=(2,0) models. The landscape of N=(2,0) models is of particular interest among all heterotic-string models for two important reasons: Firstly, N=1 spacetime SUSY requires (2,0) superconformal invariance and secondly, models with the well motivated by the Standard Model SO(10) unification structure are of this type. This idea was inspired by a new discrete symmetry in the space of fermionic $\\mathbb{Z}_2\\times \\mathbb{Z}_2$ heterotic-string models that exchanges the spinors and vectors of the SO(10) GUT group, dubbed spinor-vector duality. We will describe how to generalize this to arbitrary internal rational Conformal Field Theories. △ Less", "More than 30 years ago, Arnowitt-Chamseddine-Nath (ACN) and others established the compelling framework of supergravity gauge theories (SUGRA) as a picture for the next step in beyond the Standard Model physics. We review the current SUGRA scenario in light of recent data from LHC8 collider searches and the Higgs boson discovery. While many SUSY and non-SUSY scenarios are highly disfavored or even excluded by LHC, the essential SUGRA scenario remains intact and as compelling as ever. For naturalness, some non-universality between matter and Higgs sector soft terms is required along with substantial trilinear soft terms. SUSY models with radiatively-driven naturalness (RNS) are found with high scale fine-tuning at a modest ~10%. In this case, natural SUSY might be discovered at LHC13 but could also easily elude sparticle search endeavors. A linear e^+e^- collider with \\sqrt{s}>2m(higgsino) is needed to provide the definitive search for the required light higgsino states which are the hallmark of natural SUSY. In the most conservative scenario, we advocate inclusion of a Peccei-Quinn sector so that dark matter is composed of a WIMP/axion admixture i.e. two dark matter particles. △ Less", "Models of supersymmetry with Dirac gauginos provide an attractive scenario for physics beyond the standard model. The \"supersoft\" radiative corrections and suppressed SUSY production at colliders provide for more natural theories and an understanding of why no new states have been seen. Unfortunately, these models are handicapped by a tachyon which is naturally present in existing models of Dirac gauginos. We argue that this tachyon is absent, with the phenomenological successes of the model preserved, if the right handed gaugino is a (pseudo-)Goldstone field of a spontaneously broken anomalous flavor symmetry. △ Less", "We propose the Supersymmetric Standard Models (SSMs) with a pseudo-Dirac gluino from hybrid $F-$ and $D-$term supersymmetry (SUSY) breakings. Similar to the SSMs before the LHC, all the supersymmetric particles in the Minimal SSM (MSSM) obtain the SUSY breaking soft terms from the traditional gravity mediation and have masses within about 1 TeV except gluino. To evade the LHC SUSY search constraints, the gluino also has a heavy Dirac mass above 3 TeV from $D-$term SUSY breaking. Interestingly, such a heavy Dirac gluino mass will not induce the electroweak fine-tuning problem. We realize such SUSY breakings via an anomalous $U(1)_X$ gauge symmetry inspired from string models. To maintain the gauge coupling unification and increase the Higgs boson mass, we introduce extra vector-like particles. We study the viable parameter space which satisfies all the current experimental constraints, and present a concrete benchmark point. This kind of models not only preserves the merits of pre-LHC SSMs such as naturalness, dark matter, etc, but also solves the possible problems in the SSMs with Dirac gauginos due to the $F$-term gravity mediation. △ Less", "We employ both the minimal gravity- and the minimal gauge mediations of supersymmetry breaking at the grand unified theory (GUT) scale in a single supergravity framework, assuming the gaugino masses are generated dominantly by the minimal gauge mediation effects. In such a \"minimal mixed mediation model,\" a \"focus point\" of the soft Higgs mass parameter, m_{h_u}^2 emerges at 3-4 TeV energy scale, which is exactly the stop mass scale needed for explaining the 126 GeV Higgs boson mass without the \"A-term\" at the three loop level. As a result, m_{h_u}^2 can be quite insensitive to various trial stop masses at low energy, reducing the fine-tuning measures to be much smaller than 100 even for a 3-4 TeV low energy stop mass and -0.5 < A_t/m_0 < +0.1 at the GUT scale. The gluino mass is predicted to be about 1.7 TeV, which could readily be tested at LHC run2. △ Less", "Very light gravitinos could be produced at a sizeable rate at colliders and have been searched for in the mono-photon or mono-jet plus missing momentum signature. Strategies for enhancing the signal over background and interpretations of the experimental results are typically obtained within an effective field theory approach where all SUSY particles except the gravitino are heavy and are not produced resonantly. We extend this approach to a simplified model that includes squarks and gluinos in the TeV range. In such a case, the jet(s)-plus-missing-momentum signature can be generated through three different concurring mechanisms: gravitino-pair production with an extra jet, associated gravitino production with a squark or a gluino, or squark/gluino pair production with their subsequent decay to a gravitino and a jet. By using a matrix-element parton-shower merging procedure, we take into account all the relevant production processes consistently, explore the SUSY parameter space with the LHC Run-I data set, and give prospects for the Run II. We also consider the reach of other signatures involving electroweak particles, e.g., the mono-photon, -Z, or -W plus missing momentum. The current mono-jet and mono-photon LHC analyses are interpreted to set a lower bound on the gravitino mass. We show how the limit of $m_{3/2}>1.7\\times10^{-13}$ GeV obtained in the effective field theory hypothesis is modified when the squarks and/or the gluino are in the TeV range. △ Less", "In the context of un-oriented open string theories, we identify quivers whereby a Majorana mass for the neutron is indirectly generated by exotic instantons. We discuss two classes of (Susy) Standard Model like quivers, depending on the embedding of SU(2)_W in the Chan-Paton group. In both cases, the main mechanism involves a vector-like pair mixing through a non-perturbative mass term. We also discuss possible relations between the phenomenology of Neutron-Antineutron oscillations and LHC physics in these models. In particular, a vector-like pair of color-triplet scalars or color-triplet fermions could be directly detected at LHC, compatibly with n-\\bar{n} limits. Finally we briefly comment on Pati-Salam extensions of our models. △ Less", "We consider the Higgs Lepton Flavor Violating process $h \\rightarrow τμ$, in which CMS found a $2.5 σ$ excess of events, from a model independent perspective, and find that it is difficult to generate this operator without also obtaining a sizeable Wilson coefficient for the dipole operators responsible for tau radiative decay, constrained by BABAR to ${BR}(τ\\rightarrow μγ)< 4.4 \\times 10^{-8} $. We then survey a set of representative models for new physics, to determine which ones are capable of evading this problem. We conclude that, should this measurement persist as a signal, type-III Two Higgs Doublet Models and Higgs portal-like models are favored, while SUSY and Composite Higgs models are unlikely to explain it. △ Less", "Recent positron flux fraction measurements in cosmic-rays (CR) made by the AMS-02 satellite confirm and extends the evidence on the existence of a new (yet unknown) source of high energy positrons. To explain this excess, we use the gravitino of bilinear R-parity violating SUSY models as a decaying Dark Matter candidate, as the source of those high energy particles. Being a long lived weak-interacting and spin 3/2 particle, it offers several particularities which makes it an attractive candidate. We compute the electron, positron and $γ$-ray\\ fluxes produced by each gravitino decay channel at the Earth. Combining the flux from the different decay modes we can fit AMS-02 measurements of the positron fraction, as well as the electron and positron fluxes, with a gravitino mass in the range $1-2$ TeV and lifetimes of $\\sim 1.0-0.8\\times 10^{26}$ s. . Then, we study the viability of these scenarios through their implications in $γ$-ray observations. We set limits on the gravitino lifetime using the Extragalactic $γ$-ray Background recently reported by the {\\it Fermi}-LAT Collaboration and a state-of-the-art model of its known contributors. These limits exclude the gravitino parameter space which provides an acceptable explanation of the AMS-02 data. Therefore, we conclude that the gravitino of bilinear R-parity violating models is ruled out as the unique primary source of electrons and positrons needed to explain the rise in the positron fraction. △ Less", "In this work we calculate important one loop SUSY-breaking parameters in models with Dirac gauginos, which are implied by the existence of heavy messenger fields. We find that these SUSY-breaking effects are all related by a small number of parameters, thus the general theory is tightly predictive. In order to make the most accurate analyses of one loop effects, we introduce calculations using an expansion in SUSY breaking messenger mass, rather than relying on postulating the forms of effective operators. We use this expansion to calculate one loop contributions to gaugino masses, non-holomorphic SM adjoint masses, new A-like and B-like terms, and linear terms. We also test the Higgs potential in such models, and calculate one loop contributions to the Higgs mass in certain limits of R-symmetric models, finding a very large contribution in many regions of the $μ$-less MSSM, where Higgs fields couple to standard model adjoint fields. △ Less", "We elaborate on a recently found SU(5) relation confined to the up-(s)quark flavour space, that remains immune to large quantum corrections up to the TeV scale. We investigate the possibilities opened by this new window on the GUT scale in order to find TeV-scale SU(5) tests realizable at the LHC. These SU(5) tests appear as relations among observables involving either flavour violation or chirality flip in the up-(s)quark sector. The power of these tests is systematically evaluated using a frequentist, p-value based criterion. SU(5) tests in the Heavy supersymmetry (SUSY), Natural supersymmetry and Top-charm supersymmetry spectra are investigated. The latter scenario features light stops and scharms and is well-motivated from various five-dimensional constructions. A variety of SU(5) tests is obtained, involving techniques of top polarimetry, charm-tagging, or Higgs detection from SUSY cascade decays. We find that O(10) to O(100) events are needed to obtain 50% of relative precision at 3-sigma significance for all of these tests. In addition, we propose a set of precision measurements in ultraperipheral collisions in order to search for the flavour-changing dipole operators of Heavy supersymmetry. △ Less", "We study the μ\\to e γdecay in the Z_3-invariant next-to-minimal supersymmetric (SUSY) Standard Model (NMSSM) with superheavy right-handed neutrinos. We assume that the soft SUSY breaking parameters are generated at the GUT scale, not universally as in the minimal supergravity scenario but in such a way that those soft parameters which are specific to the NMSSM can differ from the soft parameters which involve only the MSSM fields while keeping the universality at the GUT scale within the soft parameters for the MSSM and right-handed neutrino fields. We call this type of boundary conditions \"semi-constrained\". In this model, the lepton-flavor-violating off-diagonal elements of the slepton mass matrix are induced by radiative corrections from the neutrino Yukawa couplings, just like as in the MSSM extended with the right-handed neutrinos, and these off-diagonal elements induce sizable rates of μ\\to e γdepending on the parameter space. Since this model has more free parameters than the MSSM, the parameter region favored from the Higgs boson mass can slightly differ from that in the MSSM. We show that there is a parameter region in which the μ\\to e γdecay can be observable in the near future even if the SUSY mass scale is about 4 TeV. △ Less", "We perform global fits to the most recent data (after summer 2014) on Higgs boson signal strengths in the framework of the minimal supersymmetric standard model (MSSM). We further impose the existing limits on the masses of charginos, staus, stops and sbottoms together with the current Higgs mass constraint $|M_{H_1} - 125.5\\,{\\rm GeV}| < 6$ GeV. The heavy supersymmetric (SUSY) particles such as squarks enter into the loop factors of the $Hgg$ and $Hγγ$ vertices while other SUSY particles such as sleptons and charginos also enter into that of the $Hγγ$ vertex. We also take into account the possibility of other light particles such as other Higgs bosons and neutralinos, such that the 125.5 GeV Higgs boson can decay into. We use the data from the ATLAS, CMS, and the Tevatron, with existing limits on SUSY particles, to constrain on the relevant SUSY parameters. We obtain allowed regions in the SUSY parameter space of squark, slepton and chargino masses, and the $μ$ parameter. We find that $|ΔS^γ/S^γ_{\\rm SM}|\\lsim 0.1$ at $68\\%$ confidence level when $M_{\\tildeχ^{\\pm}_1}>300$ GeV and $M_{\\tildeτ_1}>300$ GeV, irrespective of the squarks masses. Furthermore, $|ΔS^γ/S^γ_{\\rm SM}|\\lsim 0.03 $ when $M_{\\tildeχ^\\pm_1,{\\tildeτ_1}} > 500$ GeV and $M_{{\\tilde t}_1,{\\tilde b}_1} \\gsim 600$ GeV. △ Less", "We propose the framework, \"generalized supersoft supersymmetry breaking\". \"Supersoft\" models, with $D$-type supersymmetry breaking and heavy Dirac gauginos, are considerably less constrained by the LHC searches than the well studied MSSM. These models also ameliorate the supersymmetric flavor and $CP$ problems. However, previously considered mechanisms for obtaining a natural size Higgsino mass parameter (namely, $μ$) in supersoft models have been relatively complicated and contrived. Obtaining a $125\\gev$ for the mass of the lightest Higgs boson has also been difficult. Additional issues with the supersoft scenario arise from the fact that these models contain new scalars in the adjoint representation of the standard model, which may obtain negative squared-masses, breaking color and generating too large a $T$-parameter. In this work we introduce new operators into supersoft models which can potentially solve all these issues. A novel feature of this framework is that the new $μ$-term can give unequal masses to the up and down type Higgs fields, and the Higgsinos can be much heavier than the Higgs boson without fine-tuning. However, unequal Higgs and Higgsino masses also remove some attractive features of supersoft susy. △ Less", "We propose to split the sparticle spectrum from the hierarchy between the GUT scale and the Planck scale. A split supersymmetric model, which gives non-universal gaugino masses, is built with proper high dimensional operators in the framework of SO(10) GUT. Based on a calculation of two-loop beta functions for gauge couplings (taking into account all weak scale threshold corrections), we check the gauge coupling unification and dark matter constraints (relic density and direct detections). We find that our scenario can achieve the gauge coupling unification and satisfy the dark matter constraints in some part of parameter space. We also examine the sensitivity of the future XENON1T experiment and find that the currently allowed parameter space in our scenario can be covered for a neutralino dark matter below about 1.0 TeV. △ Less", "Current Large Hadron Collider (LHC) analyses are blind to compressed supersymmetry (SUSY) models with sleptons near the lightest super partner (LSP) in mass: $m_{\\tilde{l}} - m_{\\tildeχ_1^0} \\equiv Δm \\lesssim 60$ GeV. We present a search sensitive to the very compressed range $3~\\text{GeV} < Δm < 24~\\text{GeV}$ using the channel $p p \\rightarrow \\tilde{l}^+ \\tilde{l}^- +\\rm{jet} \\rightarrow$ $l^+ l^- \\tildeχ_1^0 \\tildeχ_1^0 +\\rm{jet}$ with soft same-flavor leptons and one hard jet from initial state radiation ($p_{\\rm T}^j >100$ GeV). The sleptons recoil against the jet boosting them and their decay products, making the leptons detectable and providing substantial missing transverse momentum. We use the kinematic variable $m_{\\rm T 2}$ along with a different-flavor control region to reduce the large standard model backgrounds and control systematic uncertainty. We find the analysis should allow LHC14 with $100~\\text{fb}^{-1}$ to search for degenerate left-handed selectrons and smuons in the compressed region up to $m_{\\tilde{l}_L} \\lesssim 150$ GeV. In addition, it should be sensitive to $m_{\\tilde{l}_L} \\lesssim 110$ GeV for the very challenging case of auto-concealed SUSY, in which left-handed sleptons decay to the Kaluza-Klein tower of a modulino LSP which lives in $d=6$ extra dimensions. In both the compressed spectrum and auto-concealed SUSY scenarios this analysis will need more data to improve on LEP2 limits for right-handed sleptons due to their smaller cross sections. △ Less", "We have systematically investigated the production of a Higgs boson with a mass of about $125$ GeV in the decays of supersymmetric particles within the phenomenological MSSM (pMSSM). We find regions of parameter space that are consistent with all world data and that predict a sizeable rate of anomalous Higgs, di-Higgs and even tri-Higgs events at the 14 TeV LHC. All relevant SUSY production processes are investigated. We find that Higgs bosons can be produced in a large variety of SUSY processes, resulting in a large range of different detector signatures containing missing transverse momentum. Such Higgs events are outstanding signatures for new physics already for the early 14 TeV LHC data. SUSY processes are also important to interprete deviations found in upcoming Standard Model Higgs and di-Higgs production measurements. △ Less", "This proceeding describes the experimental results presented at the TOP2014 conference on searches for physics beyond the standard model in final states containing top quarks by the ATLAS and CMS experiments at the LHC. The searches presented were done in the context of a wide range of theoretical models except those related to Supersymmetry. Results presented use about 20 fb$^{-1}$ of data taken with 8 TeV proton-proton collisions from the LHC. No significant excesses beyond the standard model are observed, therefore limits on potential new signals are set. △ Less", "A brief review is given of the implications of a 126 GeV Higgs boson for the discovery of supersymmetry. Thus a 126 GeV Higgs boson is problematic within the Standard Model because of vacuum instability pointing to new physics beyond the Standard Model. The problem of vacuum stability is overcome in the SUGRA GUT model but the 126 GeV Higgs mass implies that the average SUSY scale lies in the several TeV region. The largeness of the SUSY scale relieves the tension on SUGRA models since it helps suppress flavor changing neutral currents and CP violating effects and also helps in extending the proton life time arising from baryon and lepton number violating dimension five operators. The geometry of radiative breaking of the electroweak symmetry and fine tuning in view of the large SUSY scale are analyzed.Consistency with the Brookhaven $g_μ-2$ result is discussed. It is also shown that a large SUSY scale implied by the 126 GeV Higgs boson mass allows for light gauginos (gluino, charginos, neutralinos) and sleptons. These along with the lighter third generation squarks are the prime candidates for discovery at RUN II of the LHC. Implication of the 126 GeV Higgs boson for the direct search for dark matter is discussed. Also discussed are the sparticles mass hierarchies and their relationship with the simplified models under the Higgs boson mass constraint. △ Less", "We suggest a discriminant analysis of new physics beyond the standard model through a detection of photon polarization in a radiative B meson decay. This analysis is investigated in SUSY SU(5) GUT with right-handed neutrino and left-right symmetric models. New physics search via CP asymmetry in the same process are also evaluated in each model for comparison. We show that new physics can be found via detecting the photon polarization in a parameter space of TeV energy scale. △ Less", "We investigate the possibility of satisfying the $SU(5)$ boundary condition $\\mathbf{Y}^d=\\mathbf{Y}^{e\\,T}$ at the GUT scale within the renormalizable $R$-parity conserving Minimal Supersymmetric Standard Model (MSSM). Working in the super-CKM basis, we consider non-zero flavour off-diagonal entries in the soft SUSY-breaking mass matrices and the $A$-terms. At the same time, the diagonal $A$-terms are assumed to be suppressed by the respective Yukawa couplings. We show that a non-trivial flavour structure of the soft SUSY-breaking sector can contribute to achieving precise Yukawa coupling unification for all the three families. However, large non-zero values of the flavour-violating parameter $(m^2_{dl})_{12}$ lead to a strong tension with the Lepton Flavour Violating (LFV) observables. Nevertheless, the LFV problem does not arise when the Yukawa coupling unification requirement is restricted to the second and third families only. We demonstrate that such a scenario is consistent with a wide set of experimental constraints, including flavour and electroweak observables, Higgs physics and the LHC bounds. We also point out that in order to provide a proper value for the relic density of dark matter, the lightest neutralino needs to be almost purely bino-like and with mass in the range of 200$÷$600 GeV. Such a clear experimental prediction makes the flavour-violating $SU(5)$ Yukawa unification scenario fully testable at the LHC 14 TeV. △ Less", "We use our resummed quantum gravity approach to Einstein's general theory of relativity in the context of the Planck scale cosmology formulation of Bonanno and Reuter to estimate the value of the cosmological constant such that ρ_Λ=(0.0024 eV)^4. We argue that the closeness of this estimate to experiment constrains susy GUT models. We discuss in turn various theoretical issues that have been raised about the approach itself as well as about the application to estimate the cosmological constant. Given the closeness of the estimate to the currently observed value, we also discuss the theoretical uncertainty in the estimate -- at this time, we argue it is still large. △ Less", "Using an $SO(10)$-inspired form for the Dirac neutrino mass, we map the neutrino data to right-handed neutrino Majorana mass-matrix, $\\mathcal M$, and investigate a special form with \\emph{seesaw} tribimaximal mixing; it predicts a normal hierarchy, and the values of the light neutrino masses. It may be generated by mapping the top quark hierarchy onto the vacuum values of familon fields transforming under the family group $\\mathcal{ PSL}_2(7)$. We next investigate the hypothesis that these familons play a dual role, generating a hierarchy in the supersymmetric $\\mathbf μ$-mass matrix of Higgses carrying family quantum numbers. A special $\\mathcal{ PSL}_2(7)$ invariant coupling produces a $μ$-matrix with a hierarchy of thirteen orders of magnitude. Only one Higgs field (per hypercharge sector) is light enough (with a $μ$-mass $\\sim 10-100$ GeV) to be destabilized by SUSY soft breaking at the TeV scale, and upon spontaneous symmetry breaking, gives \\emph{tree-level} masses for the heaviest family. △ Less", "We discuss non-minimal quadratic inflation in supersymmetric (SUSY) and non-SUSY models which entails a linear coupling of the inflaton to gravity. Imposing a lower bound on the parameter cR, involved in the coupling between the inflaton and the Ricci scalar curvature, inflation can be attained even for subplanckian values of the inflaton while the corresponding effective theory respects the perturbative unitarity up to the Planck scale. Working in the non-SUSY context we also consider radiative corrections to the inflationary potential due to a possible coupling of the inflaton to bosons or fermions. We find ranges of the parameters, depending mildly on the renormalization scale, with adjustable values of the spectral index ns, tensor-to-scalar ratio r=(2-4)x10^-3, and an inflaton mass close to 3x10^13 GeV. In the SUSY framework we employ two gauge singlet chiral superfields, a logarithmic Kahler potential including all the allowed terms up to fourth order in powers of the various fields, and determine uniquely the superpotential by applying a continuous R and a global U(1) symmetry. When the Kahler manifold exhibits a no-scale-type symmetry, the model predicts ns=0.963 and r=0.004. Beyond no-scale SUGRA, ns and r depend crucially on the coefficient involved in the fourth order term, which mixes the inflaton with the accompanying non-inflaton field in the Kahler potential, and the prefactor encountered in it. Increasing slightly the latter above (-3), an efficient enhancement of the resulting r can be achieved putting it in the observable range. The inflaton mass in the last case is confined in the range (5-9)x10^13 GeV. △ Less", "Testing the idea of naturalness is and will continue to be one of the most important goals of high energy physics experiments. It will play a central role in the physics program of future colliders. In this paper, we present projections of the reach of natural SUSY at future lepton colliders: CEPC, FCC-ee and ILC. We focus on the observables which give the strongest reach, the electroweak precision observables (for left-handed stops), and Higgs to gluon and photon decay rates (for both left- and right-handed stops). There is a \"blind spot\" when the stop mixing parameter Xt is approximately equal to the average stop mass. We argue that in natural scenarios, bounds on the heavy Higgs bosons from tree-level mixing effects that modify the bottom Yukawa coupling together with bounds from b to s gamma play a complementary role in probing the blind spot region. For specific natural SUSY scenarios such as folded SUSY in which the top partners do not carry Standard Model color charges, electroweak precision observables could be the most sensitive probe. In all the scenarios discussed in this paper, the combined set of precision measurements will probe down to a few percent in fine-tuning. △ Less", "In supersymmetric (SUSY) theories with extra dimensions the visible energy in sparticle decays can be significantly reduced and its energy distribution broadened, thus significantly weakening the present collider limits on SUSY. The mechanism applies when the lightest supersymmetric particle (LSP) is a bulk state-- e.g. a bulk modulino, axino, or gravitino-- the size of the extra dimensions larger than ~$10^{-14}$ cm, and for a broad variety of visible sparticle spectra. In such cases the lightest ordinary supersymmetric particle (LOSP), necessarily a brane-localised state, decays to the Kaluza-Klein (KK) discretuum of the LSP. This dynamically realises the compression mechanism for hiding SUSY as decays into the more numerous heavier KK LSP states are favored. We find LHC limits on right-handed slepton LOSPs evaporate, while LHC limits on stop LOSPs weaken to ~350-410 GeV compared to ~700 GeV for a stop decaying to a massless LSP. Similarly, for the searches we consider, present limits on direct production of degenerate first and second generation squarks drop to ~450 GeV compared to ~800 GeV for a squark decaying to a massless LSP. Auto-concealment typically works for a fundamental gravitational scale of $M_*$~10-100 TeV, a scale sufficiently high that traditional searches for signatures of extra dimensions are mostly avoided. If superpartners are discovered, their prompt, displaced, or stopped decays can also provide new search opportunities for extra dimensions with the potential to reach $M_*$~$10^9$ GeV. This mechanism applies more generally than just SUSY theories, pertaining to any theory where there is a discrete quantum number shared by both brane and bulk sectors. △ Less", "The searches for heavy Higgs bosons and supersymmetric (SUSY) particles at the LHC have left the minimal supersymmetric standard model (MSSM) with an unusual spectrum of SUSY particles, namely, all squarks are beyond a few TeV while the Higgs bosons other than the one observed at 125 GeV could be relatively light. In light of this, we study a scenario characterized by two scales: the SUSY breaking scale or the squark-mass scale $(M_S)$ and the heavy Higgs-boson mass scale $(M_A)$.We perform a survey of the MSSM parameter space with $M_S < 10^{10}$ GeV and $M_A < 10^4$ GeV such that the lightest Higgs boson mass is within the range of the observed Higgs boson as well as satisfying a number of constraints. The set of constraints include the invisible decay width of the $Z$ boson and that of the Higgs boson, the chargino-mass limit, dark matter relic abundance from Planck, the spin-independent cross section of direct detection by LUX, and gamma-ray flux from dwarf spheroidal galaxies and gamma-ray line constraints measured by Fermi LAT. Survived regions of parameter space feature the dark matter with correct relic abundance, which is achieved through either coannihilation with charginos, $A/H$ funnels, or both. We show that future measurements, e.g., XENON1T and LZ, of spin-independent cross sections can further squeeze the parameter space. △ Less", "The multi-sector SUSY breaking predicts pseudo-goldstino which can couple to the visible sector more strongly than the ordinary gavitino and thus induce the decays of the lightest neutralino and chargino (collectively called electroweakinos) inside the detector. In this note we study the electroweakino pair productions via vector boson fusion (VBF) processes followed by decays to pseudo-goldstino at the LHC. Our Monte Carlo simulations show that at the 14 TeV LHC with 3000 fb^{-1} luminosity the dominant production channel pp->chargino+neutralino+2 jets can have a statistical significance above 2-sigma while other production channels are not accessible. △ Less", "Recent discovery of the SM-like Higgs boson with $m_h\\simeq 125$ GeV motivates an extension of the minimal supersymmetric standard model (MSSM), which involves a singlet Higgs superfield with a sizable Yukawa coupling to the doublet Higgs superfields. We examine such singlet-extended SUSY models with a Peccei-Quinn (PQ) symmetry that originates from an anomalous $U(1)_A$ gauge symmetry. We focus on the specific scheme that the PQ symmetry is spontaneously broken at an intermediate scale $v_{\\rm PQ}\\sim \\sqrt{m_{\\rm SUSY}M_{\\rm Pl}}$ by an interplay between Planck scale suppressed operators and tachyonic soft scalar mass $m_{\\rm SUSY}\\sim \\sqrt{D_A}$ induced dominantly by the $U(1)_A$ $D$-term, $D_A$. This scheme also results in spontaneous SUSY breaking in the PQ sector, generating the gaugino masses $M_{1/2}\\sim \\sqrt{D_A}$ when it is transmitted to the MSSM sector by the conventional gauge mediation mechanism. As a result, the MSSM soft parameters in this scheme are induced mostly by the $U(1)_A$ $D$-term and the gauge mediated SUSY breaking from the PQ sector, so that the sparticle masses can be near the present experimental bounds without causing the SUSY flavor problem. The scheme is severely constrained by the condition that a phenomenologically viable form of the low energy operators of the singlet and doublet Higgs superfields is generated by the PQ breaking sector in a way similar to the Kim-Nilles solution of the $μ$ problem, and the resulting Higgs mass parameters allow the electroweak symmetry breaking with small $\\tanβ$. We find two minimal models with two singlet Higgs superfields, satisfying this condition with a relatively simple form of the PQ breaking sector, and briefly discuss some phenomenological aspects of the model. △ Less", "We compute the decay width of $h^0 \\to c \\bar{c}$ in the MSSM with quark flavor violation (QFV) at full one-loop level adopting the $\\overline{\\rm DR}$ renormalisation scheme. We study the effects of $\\tilde{c}-\\tilde{t}$ mixing, taking into account the constraints from the B meson data. We show that the full one-loop corrected decay width $Γ(h^0 \\to c \\bar{c})$ is very sensitive to the MSSM QFV parameters. In a scenario with large $\\tilde{c}_{L,R}-\\tilde{t}_{L,R}$ mixing $Γ(h^0 \\to c \\bar{c})$ can differ up to $\\sim \\pm 35\\%$ from its SM value. After estimating the uncertainties of the width, we conclude that an observation of these SUSY QFV effects is possible at an $e^+ e^-$ collider (ILC). △ Less", "I present a brief review of the generalized Brodsky-Lepage-McKenzie (BLM) approaches to fix the scale-dependence of the renormalization group (RG) invariant quantities in QCD. At first, these approaches are based on the expansions of the coefficients of the perturbative series for the RG-invariant quantities in the products of the coefficients $β_i$ of the QCD $β$-function, which are evaluated in the MS-like schemes. As a next step all $β_i$-dependent terms are absorbed into the BLM-type scale(s) of the powers of the QCD couplings. The difference between two existing formulations of the above mentioned generalizations based on the seBLM approach and the Principle of Maximal Conformality (PMC) are clarified in the case of the Bjorken polarized deep-inelastic scattering sum rule. Using the conformal symmetry-based relations for the non-singlet coefficient functions of the Adler D-function and of Bjorken polarized deep-inelastic scattering sum rules $C^{\\rm Bjp}_{\\rm NS}(a_s)$ the $β_i$-dependent structure of the NNLO approximation for $C^{\\rm Bjp}_{\\rm NS}(a_s)$ is predicted in QCD with $n_{gl}$-multiplet of gluino degrees of freedom, which appear in SUSY extension of QCD. The importance of performing the analytical calculation of the N$^3$LO additional contributions of $n_{gl}$ gluino multiplet to $C^{\\rm Bjp}_{\\rm NS}(a_s)$ for checking the presented in the report NNLO prediction and for the studies of the possibility to determine the discussed $\\{β\\}$-expansion pattern of this sum rule at the $O(a_s^4)$-level is emphasised. △ Less", "Supersymmetric (SUSY) explanation of the discrepancy between the measurement of $(g-2)_μ$ and its SM prediction puts strong upper bounds on the chargino and smuon masses. At the same time, lower experimental limits on the chargino and smuon masses, combined with the Higgs mass measurement, lead to an upper bound on the stop masses. The current LHC limits on the chargino and smuon masses (for not too compressed spectrum) set the upper bound on the stop masses of about 10 TeV. The discovery potential of the future lepton and hadron colliders should lead to the discovery of SUSY if it is responsible for the explanation of the $(g-2)_μ$ anomaly. This conclusion follows from the fact that the upper bound on the stop masses decreases with the increase of the lower experimental limit on the chargino and smuon masses. △ Less", "We present an extension to the Mathematica package SARAH which allows for Higgs mass calculations at the two-loop level in a wide range of supersymmetric models beyond the MSSM. These calculations are based on the effective potential approach and include all two-loop corrections which are independent of electroweak gauge couplings. For the numerical evaluation Fortran code for SPheno is generated by SARAH. This allows the prediction of the Higgs mass in more complicated SUSY models with the same precision that most state-of-the-art spectrum generators provide for the MSSM. △ Less", "We present the full $\\mathcal{O}(α_s)$ supersymmetric QCD corrections for stop-anti-stop annihilation into electroweak final states within the Minimal Supersymmetric Standard Model (MSSM). We also incorporate Coulomb corrections due to gluon exchange between the incoming stops. Numerical results for the annihilation cross sections and the predicted neutralino relic density are presented. We show that the impact of the radiative corrections on the cosmologically preferred region of the parameter space can become larger than the current experimental uncertainty, shifting the relic bands within the considered regions of the parameter space by up to a few tens of GeV. △ Less", "We study heterotic ground states in which supersymmetry is broken by coupling the momentum and winding charges of two large extra dimensions to the R-charges of the supersymmetry generators. The large dimensions give rise to towers of heavy string thresholds that contribute to the running of the gauge couplings. In the general case, these contributions are proportional to the volume of the two large dimensions and invalidate the perturbative string expansion. The problem is evaded if the susy breaking sectors arise as a spontaneously broken phase of N=4 -> N=2 -> N=0 supersymmetry, provided that N=4 supersymmetry is restored on the boundary of the moduli space. We discuss the mechanism in the case of Z_2 x Z_2 orbifolds, which requires that the twisted sector that contains the large extra dimensions has no fixed points. We analyse the full string partition function and show that the twisted sectors distribute themselves in non-aligned N=2 orbits, hence preserving the solution to the string decompactification problem. Remarkably, we find that the contribution to the vacuum energy from the N=2 -> N=0 sectors is suppressed, and the only substantial contribution arises from the breaking of the N=4 sector to N=0. △ Less", "We propose a new electroweak baryogenesis scenario in high-scale supersymmetric (SUSY) models. We consider a singlet extension of the minimal SUSY standard model introducing additional vector-like multiplets. We show that the strongly first-order phase transition can occur at a high temperature comparable to the soft SUSY breaking scale. In addition, the proper amount of the baryon asymmetry of the universe can be generated via the lepton number violating process in the vector-like multiplet sector. The typical scale of our scenario, the soft SUSY breaking scale, can be any value. Thus our new electroweak baryogenesis scenario can be realized at arbitrary scales and we call this scenario as a scale free electroweak baryogenesis. This soft SUSY breaking scale is determined by other requirements. If the soft SUSY breaking scale is O(10) TeV, our scenario is compatible with the observed mass of the Higgs boson and the constraints by the electric dipole moments measurements and the flavor experiments. Furthermore, the singlino can be a good candidate of the dark matter. △ Less", "We build explicit supersymmetric unification models where grand unified gauge symmetry breaking and supersymmetry (SUSY) breaking are caused by the same sector. Besides, the SM-charged particles are also predicted by the symmetry breaking sector, and they give the soft SUSY breaking terms through the so-called gauge mediation. We investigate the mass spectrums in an explicit model with SU(5) and additional gauge groups, and discuss its phenomenological aspects. Especially, nonzero A-term and B-term are generated at one-loop level according to the mediation via the vector superfields, so that the electro-weak symmetry breaking and 125 GeV Higgs mass may be achieved by the large B-term and A-term even if the stop mass is around 1 TeV. △ Less"]