["A degenerate sfermionic particle spectrum can escape constraints from flavor physics, and at the same time evade the limits from the direct searches if the degeneracy extends to the gaugino-higgsino sector. Inspired by this, we consider a scenario where all the soft terms have an approximately common mass scale at $M_{\\text{SUSY}}$, with splittings $\\lesssim \\mathcal{O}(10\\%)$. As a result, the third generation sfermions have large to maximal (left-right) mixing, the same being the case with charginos and some sectors of the neutralino mass matrix. We study this scenario in the light of discovery of the Higgs boson with mass $\\sim$ 125 GeV. We consider constraints from $B$-physics, the anomalous magnetic moment of the muon and the dark matter relic density. We find that a supersymmetric spectrum as light as 600 GeV could be consistent with all current data and also account for the observed anomalous magnetic moment of the muon within $2σ$. The neutralino relic density is generally too small to saturate the measured cold dark matter relic density. Direct detection limits from XENON100 and LUX put severe constraints on this scenario which will be conclusively probed by XENONnT experiment. △ Less", "In this paper, we extend the analysis of a Pati-Salam subcritical hybrid $F$-term inflation model, proposed by two of us, by studying the reheating and the baryogenesis (via leptogenesis) of the model. This SUSY GUT model is able to fit low energy electroweak precision data, LHC data, $b$-physics data, in addition to inflation observables such as the tensor-to-scalar ratio and the scalar spectral index. The reheating mechanism of this model is instant preheating due to the bosonic and fermionic broad parametric resonance, while the baryon-to-entropy ratio is obtained from the CP asymmetric right-handed (s)neutrinos decay. The phases in the neutrino Yukawa matrices are fixed by fitting to the low energy observables. With these phases, the heaviest right-handed (s)neutrinos decay to produce a lepton asymmetry with the correct sign, while the two lighter right-handed (s)neutrinos decay to produce the wrong sign. Consequently, the baryogenesis analysis is necessarily performed by including all three families of the right-handed (s)neutrinos. △ Less", "The Affleck-Dine leptogenesis scenario along the LHu flat direction is reconsidered. It is known that successful Affleck-Dine leptogenesis requires that the lightest neutrino mass is extremely small. This situation can be significantly relaxed if the neutrino mass in the early universe is different from the present one. We consider a supersymmetric Dine-Fischler-Srednicki-Zhitnitsky (DFSZ) type model, which provides a solution to the strong CP problem and generates a SUSY mu-term and right-handed neutrino masses. If the PQ scale during lepton number generation is much larger than the present value, leptogenesis is very efficient so that enough baryon number can be generated without introducing a hierarchically small neutrino mass. The final baryon asymmetry is related to the mu-term, and hence linked to the level of electroweak fine-tuning. We also show the PQ breaking scalar dynamics that keeps a large PQ breaking scale during inflation and lepton number generation. The mu-term generating superpotential plays an important role for preserving the lepton asymmetry during saxion oscillation. In this scenario, the axion isocurvature perturbation is naturally suppressed. △ Less", "Radiatively-driven natural SUSY (RNS) models enjoy electroweak naturalness at the $10\\%$ level while respecting LHC sparticle and Higgs mass constraints. Gluino and top squark masses can range up to several TeV (with other squarks even heavier) but a set of light Higgsinos are required with mass not too far above $m_h\\sim 125$ GeV. Within the RNS framework, gluinos dominantly decay via ${\\tilde g} \\to t{\\tilde t}_1^{*},\\ \\bar{t}{\\tilde t}_1 \\to t\\bar{t}{\\widetilde Z}_{1,2}$ or $t\\bar{b}{\\widetilde W}_1^-+c.c.$, where the decay products of the higgsino-like ${\\widetilde W}_1$ and ${\\widetilde Z}_2$ are very soft. Gluino pair production is, therefore, signalled by events with up to four hard $b$-jets and large ${\\not\\!\\!{E_T}}$. We devise a set of cuts to isolate a relatively pure gluino sample at the (high luminosity) LHC and show that in the RNS model with very heavy squarks, the gluino signal will be accessible for $m_{\\tilde g} < 2400 \\ (2800)$ GeV for an integrated luminosity of 300 (3000) fb$^{-1}$. We also show that the measurement of the rate of gluino events in the clean sample mentioned above allows for a determination of $m_{\\tilde g}$ with a statistical precision of $2.5-5\\%$ (depending on the integrated luminosity and the gluino mass) over the range of gluino masses where a $5σ$ discovery is possible at the LHC. △ Less", "We investigate the squark sector of a supersymmetric theory with an extended Higgs sector. We give the mass matrices of stop and sbottom, comparing the Minimal Supersymmetric Standard Model (MSSM) case and the non-minimal case. We discuss the impact of the extra superfields on the decay channels of the stop searched at the LHC. △ Less", "We investigate the general structure of mirror symmetry breaking in the Twin Higgs scenario. We show, using the IR effective theory, that a significant gain in fine tuning can be achieved if the symmetry is broken hardly. We emphasize that weakly coupled UV completions can naturally accommodate this scenario. We analyze SUSY UV completions and present a simple Twin SUSY model with a tuning of around 10% and colored superpartners as heavy as 2 TeV. The collider signatures of general Twin SUSY models are discussed with a focus on the extended Higgs sectors. △ Less", "In supersymmetric models with radiatively-driven naturalness and light higgsinos, the top squarks may lie in the 0.5- 3TeV range and thus only a fraction of natural parameter space is accessible to LHC searches. We outline the range of top squark and lightest SUSY particle masses preferred by electroweak naturalness in the standard parameter space plane. We note that the branching fraction for b-> sγdecay favors top squarks much heavier than 500 GeV. Such a range of top-squark mass values is in contrast to previous expectations where m(stop)<500 GeV had been considered natural. In radiative natural SUSY, top squarks decay roughly equally via t1-> bW1 and Z_{1,2} where W1 and Z_{1,2} are higgsino-like electroweak-inos. Thus, top squark pair production should yield all of t\\bar{t}+\\eslt, t\\bar{b}+\\eslt, b\\bar{t}+\\eslt and b\\bar{b}+\\eslt signatures at comparable rates. We propose that future LHC top squark searches take place within a semi-simplified model which corresponds more closely to expectations from theory. △ Less", "Higgs pair production is not only sensitive to the trilinear Higgs self-coupling, but it can give access to other anomolous couplings, as e.g. a novel $hht\\bar{t}$ coupling. In Composite Higgs Models, this coupling usually leads to a large increase of the cross section. In such a framework an interesting question is, whether it might be possible to observe new physics for the first time in Higgs pair production. This question will be addressed by taking into account projected sensitivities for Higgs coupling measurements and for direct searches of new vector-like quarks. Higher order corrections to Higgs pair production via gluon fusion are sizeable. It is hence not only important to compute them in the Standard Model (SM) but also in its extensions. Here, the computation of the QCD corrections in the SM with dimension 6 operators as well as the SUSY-QCD corrections to Higgs pair production via gluon fusion in the MSSM are presented. △ Less", "Requiring that the contributions of supersymmetric particles to the Higgs mass are not highly tuned places upper limits on the masses of superpartners -- in particular the higgsino, stop, and gluino. We revisit the details of the tuning calculation and introduce a number of improvements, including RGE resummation, two-loop effects, a proper treatment of UV vs. IR masses, and threshold corrections. This improved calculation more accurately connects the tuning measure with the physical masses of the superpartners at LHC-accessible energies. After these refinements, the tuning bound on the stop is now also sensitive to the masses of the 1st and 2nd generation squarks, which limits how far these can be decoupled in Effective SUSY scenarios. We find that, for a fixed level of tuning, our bounds can allow for heavier gluinos and stops than previously considered. Despite this, the natural region of supersymmetry is under pressure from the LHC constraints, with high messenger scales particularly disfavored. △ Less", "It is an appealing possibility that the observed dark matter density in the universe can be fully explained by SUSY. The current experimental knowledge indicates that this possibility strongly favors a co-annihilation scenario. In such scenarios, the mass difference between the next-to-lightest SUSY particle (the NLSP) and the lightest one (the LSP) is quite small, which assures that the annihilation cross-section is sufficient not to predict a too large abundance of dark matter. However, the small mass difference also means that observing SUSY becomes hard at hadron colliders, where the observation hinges on the tell-tale signature of missing transverse energy: if the mass difference NLSP-to-LSP is small, only little energy is carried away by the invisible LSP. This is also true even if several other SUSY particles are within the kinematic reach, since these states would to a large extent decay via cascades ending with an NLSP to LSP decay. A lepton collider does not have this problem. The clean environment and known initial state at such machines assures that SUSY can be detected even if the mass difference is very small, provided the center-of-mass energy is sufficiently high. We present prospects for observation and precision characterization of SUSY with small mass differences at the ILC, based on detailed simulations of the ILD detector concept. The resulting possibility to predict the dark matter relic density is evaluated and compared to the precision obtained from the Planck mission. Taking a specific model as an example, we also discuss the synergies from combining ILC and HL-LHC results. △ Less", "The Minimal Supersymmetric Extension of the Standard Model (MSSM) is able to explain the current data from neutrino physics. Unfortunately Split Supersymmetry as low energy approximation of this theory fails to generate a solar square mass difference, including after the addition of bilinear R-Parity Violation. In this work, it is shown how one can derive an effective low energy theory from the MSSM in the spirit of Split Supersymmetry, which has the potential of explaining the neutrino phenomenology. This is achieved by going beyond leading order in the process of integrating out heavy scalars from the original theory, which results in non-renormalizable operators in the effective low energy theory. It is found that in particular a $d=8$ operator is crucial for the generation of the neutrino mass differences. △ Less", "A core prediction of natural Supersymmetry is the existence of four light higgsinos not too far above the mass of the $Z$ boson. The small mass splittings amongst the higgsinos -- typically 5-20\\,GeV -- imply very little visible energy release from decays of heavier higgsinos. In particular, if other SUSY particles are quite heavy, as can be the case in SUSY with radiatively-driven naturalness, the higgsinos are extremely hard to detect at hadron colliders. The clean environment of electron-positron colliders with $\\sqrt{s} > 2m_{\\mathrm{higgsino}}$, however, would allow for a decisive search for the required light higgsinos. Thus, $e^+e^-$ colliders should either discover or exclude natural SUSY. We present a detailed study of higgsino pair production at the proposed International Linear $e^+e^-$ Collider which is under consideration for construction in Japan. A variety of precision measurements should allow for extraction of underlying parameters and provide a window onto physics at the grand unified scale. △ Less", "The interpretation of Large Hadron Collider (LHC) data in the framework of Beyond the Standard Model (BSM) theories is hampered by the need to run computationally expensive event generators and detector simulators. Performing statistically convergent scans of high-dimensional BSM theories is consequently challenging, and in practice unfeasible for very high-dimensional BSM theories. We present here a new machine learning method that accelerates the interpretation of LHC data, by learning the relationship between BSM theory parameters and data. As a proof-of-concept, we demonstrate that this technique accurately predicts natural SUSY signal events in two signal regions at the High Luminosity LHC, up to four orders of magnitude faster than standard techniques. The new approach makes it possible to rapidly and accurately reconstruct the theory parameters of complex BSM theories, should an excess in the data be discovered at the LHC. △ Less", "We construct models in which the SM Higgs mass scans in a landscape. This is achieved by coupling the SM to a monodromy axion field through Minkowski 3-forms. The Higgs mass scans with steps given by delta(m_H^2)= eta mu f, where mu and f are the axion mass and periodicity respectively, and eta measures the coupling of the Higgs to the associated 3-form. The observed Higgs mass scale could then be selected on anthropic grounds. The monodromy axion may have a mass mu in a very wide range depending on the value of eta, and the axion periodity f. For eta=1 and f = 10^10 GeV, one has 10^{-3}eV < mu < 10^3 eV, but ultralight axions with e.g. mu = 10^{-17} eV are also possible. In a different realization we consider landscape models coupled to the MSSM. In the context of SUSY, 4-forms appear as being part of the auxiliary fields of SUSY multiplets. The scanning in the 4-forms thus translate into a landscape of vevs for the N=1 auxiliary fields and hence as a landscape for the soft terms. This could provide a rationale for the MSSM fine-tuning suggested by LHC data. In all these models there are 3-forms coupling to membranes which induce transitions between different vacua through bubble nucleation. The Weak Gravity Conjecture (WGC) set limits on the tension of these membranes and implies new physics thresholds well below the Planck scale. More generaly, we argue that in the case of string SUSY vacua in which the Goldstino multiplet contains a monodromy axion the WGC suggests a lower bound on the SUSY breaking scale m_{3/2} > M_s^2/M_p. △ Less", "We study supersymmetric (SUSY) models derived from the ten-dimensional SUSY Yang- Mills theory compactified on magnetized orbifolds, with nonvanishing Fayet-Iliopoulos (FI) terms induced by magnetic fluxes in extra dimensions. Allowing the presence of FI-terms relaxes a constraint on flux configurations in SUSY model building based on magnetized backgrounds. In this case, charged fields develop their vacuum expectation values (VEVs) to cancel the FI-terms in the D-flat directions of fluxed gauge symmetries, which break the gauge symmetries and lead to a SUSY vacuum. Based on this idea, we propose a new class of SUSY magnetized orbifold models with three generations of quarks and leptons. Especially, we construct a model where the right-handed sneutrinos develop their VEVs which restore the supersymmetry but yield lepton number violating terms below the compactification scale, and show their phenomenological consequences. △ Less", "We study the feasibility of probing a region of Natural Supersymmetry where the stop and higgsino masses are compressed. Although this region is most effectively searched for in the mono-jet channel, this signature is present in many other non-supersymmetric frameworks. Therefore, another channel that carries orthogonal information is required to confirm the existence of the light stop and higgsinos. We show that a supersymmetric version of the $t \\bar t H$ process, $pp \\to t \\tilde t_1 \\tilde χ^0_{1(2)}$, can have observably large rate when both the stop and higgsinos are significantly light, and it leads to a distinctive mono-top signature in the compressed mass region. We demonstrate that the hadronic channel of the mono-top signature can effectively discriminate the signal from backgrounds by tagging a hadronic top-jet. We show that the hadronic channel of mono-top signature offers a significant improvement over the leptonic channel and the sensitivity reaches $m_{\\tilde t_1} \\simeq 420$ GeV at the 13 TeV LHC with 3 ab$^{-1}$ luminosity. △ Less", "Gauge mediated supersymmetry (SUSY)-breaking (GMSB) furnishes the best idea to overcome the flavor problem in SSMs, supersymmetric stand models (SM). However, implemented in the minimal SSM (MSSM), a very serious fine-tuning problem arises, owing to the absence of a large $A_t$ term in the stop sector to radiatively enhance the SM-like Higgs boson mass. In the extended GMSB coupling $H_u$ to messengers can alleviate this problem but encounters the $A_t/m_{H_u}^2$ problem, i.e., at the same time a large $m_{H_u}^2$ is generated, rendering radiative electroweak spontaneously breaking (EWSB) problematic. This issue shows similarity to another long-standing problem of GMSB, the $μ/{B_μ}$ problem, and, of great interest, we find that they may admit the same solution, nonradiative EWSB. Such a solution is naturally accommodated when both $H_u$ and $H_d$ couple to messengers. As a bonus of nonradiative EWSB, the sleptons tend to be very light due to the significant renormalization group equation effect and they are able to account for the $(g-2)_μ$ puzzle. As a concrete example, we investigate a hidden sector with $(10,\\overline {10})$ messengers. △ Less", "We construct the Supersymmetric Effective Field Theory of Inflation, that is the most general theory of inflationary fluctuations when time-translations and supersymmetry are spontaneously broken. The non-linear realization of these invariances allows us to define a complete SUGRA multiplet containing the graviton, the gravitino, the Goldstone of time translations and the Goldstino, with no auxiliary fields. Going to a unitary gauge where only the graviton and the gravitino are present, we write the most general Lagrangian built out of the fluctuations of these fields, invariant under time-dependent spatial diffeomorphisms, but softly-breaking time diffeomorphisms and gauged SUSY. With a suitable Stückelberg transformation, we introduce the Goldstone boson of time translation and the Goldstino of SUSY. No additional dynamical light field is needed. In the high energy limit, larger than the inflationary Hubble scale for the Goldstino, these fields decouple from the graviton and the gravitino, greatly simplifying the analysis in this regime. We study the phenomenology of this Lagrangian. The Goldstino can have a non-relativistic dispersion relation. Gravitino and Goldstino affect the primordial curvature perturbations at loop level. The UV modes running in the loops generate three-point functions which are degenerate with the ones coming from operators already present in the absence of supersymmetry. Their size is potentially as large as corresponding to $f_{\\rm NL}^{\\rm equil.,\\,orthog.}\\sim 1$ or, for particular operators, even $\\gg 1$. The non-degenerate contribution from modes of order $H$ is estimated to be very small. △ Less", "We investigate multi-lepton signals produced by ElectroWeakino (EWino) decays in the MSSM and the TMSSM scenarios with sfermions, gluinos and non Standard Model Higgses at the TeV scale, being the Bino electroweak-scale dark matter. We recast the present LHC constraints on EWinos for these models and we find that wide MSSM and TMSSM parameter regions prove to be allowed. We forecast the number of events expected in the signal regions of the experimental multi-lepton analyses in the next LHC runs. The correlations among these numbers will help to determine whether future deviations in multi-lepton data are ascribable to the EWinos, as well as the supersymmetric model they originate from. △ Less", "We investigate dark matter in a constrained $E_6$ inspired supersymmetric model with an exact custodial symmetry and compare with the CMSSM. The breakdown of $E_6$ leads to an additional $U(1)_N$ symmetry and a discrete matter parity. The custodial and matter symmetries imply there are two stable dark matter candidates, though one may be extremely light and contribute negligibly to the relic density. We demonstrate that a predominantly Higgsino, or mixed bino-Higgsino, neutralino can account for all of the relic abundance of dark matter, while fitting a 125 GeV SM-like Higgs and evading LHC limits on new states. However we show that the recent LUX 2016 limit on direct detection places severe constraints on the mixed bino-Higgsino scenarios that explain all of the dark matter. Nonetheless we still reveal interesting scenarios where the gluino, neutralino and chargino are light and discoverable at the LHC, but the full relic abundance is not accounted for. At the same time we also show that there is a huge volume of parameter space, with a predominantly Higgsino dark matter candidate that explains all the relic abundance, that will be discoverable with XENON1T. Finally we demonstrate that for the $E_6$ inspired model the exotic leptoquarks could still be light and within range of future LHC searches. △ Less", "Recently ATLAS reported a $3.3σ$ excess in the stop search with $\\ell+jets+E_T^{miss}$ channel. We try to interpret the signal by a light stop pair production in the MSSM. We find: (1) simple models where stop decays into a higgsino or a bino are not favored. (2) an extension of them can explain the data at $2σ$ level without conflicting with the other search channels. A surviving possibility includes a light stop and a light higgsino, which is expected in a natural SUSY scenario. △ Less", "Proton decay is one of the most important predictions of the grand unified theory (GUT). In the supersymmetric (SUSY) GUT, proton decays via the dimension-five operators need to be suppressed. In the $SO(10)$ model where ${\\bf 10}+\\overline{\\bf 126}$ Higgs fields couple to fermions, neutrino oscillation parameters including the CP-violating Pontecorvo-Maki-Nakagawa-Sakata (PMNS) phase can be related to the Yukawa couplings to generate the dimension-five operators in the unified framework. We show how the suppressed proton decay depends on the PMNS phase, and stress the importance of the precise measurements of the PMNS phase as well as the neutrino 23-mixing angle. These become especially important if the SUSY particles are found around less than a few TeV at LHC and proton decays are observed at Hyper-Kamiokande and DUNE experiments in the near future. △ Less", "Radiative neutrino mass generation within supersymmetric (SUSY) construction is studied. The mechanism is considered where the lepton number violation is originating from the soft SUSY breaking terms. This requires MSSM extensions with states around the TeV scale. We present several explicit realizations based on extensions either by MSSM singlet or SU(2)_w triplet states. Besides some novelties of the proposed scenarios, various phenomenological implications are also discussed. △ Less", "We examine updated prospects for detecting WIMPs in supersymmetric models via direct and indirect dark matter search experiments. We examine several historical and also still viable scenarios: projections for well-tempered neutralinos (WTN), projections from the MasterCode (MC), BayesFits (BF) and Fittino (FO) collaborations, non-thermal wino dark matter (NThW) and finally mixed axion-higgsino dark matter from SUSY with radiatively-driven naturalness (RNS). The WTN is ruled out by recent limits from XENON and LUX collaborations. The NThW scenario, previously on tenuous ground due to gamma-line searches, appears also ruled out by recent combined Fermi-LAT/MAGIC limits combined with new HESS results from continuum gamma rays. Substantial portions of MC parameter space and 1 TeV higgsino parameter space from BF group are ruled out. The 100-300 GeV higgsino-like WIMP from RNS survives due to its possible depleted local abundance (where the axion may make up the bulk of dark matter). Projections from ton-scale noble liquid detectors should discover or rule out WIMPs from the remaining parameter space of these surviving models. △ Less", "We pursue the investigation of a model for sub-Chandrasekhar supernovae Ia explosions (SNIa) in which the energy stored in the Pauli tower is released to trigger a nuclear deflagration. The simplest physical model for such a degeneracy breakdown is a phase transition to an exactly supersymmetric state in which the scalar partners of protons, neutrons, and leptons become degenerate with the familiar fermions of our world as in the supersymmetric standard model with susy breaking parameters relaxed to zero. We focus on the ability of the susy phase transition model to fit the total SNIa rate as well as the delay time distribution of SNIa after the birth of a progenitor white dwarf. We also study the ejected mass distribution and its correlation with delay time. Finally, we discuss the expected SNIa remnant in the form of a black hole of Jupiter mass or lower and the prospects for detecting such remnants. △ Less", "The ATLAS and CMS experiments at the Large Hadron Collider (LHC) at CERN have searched for signals of new physics, in particular for supersymmetry. The data collected until 2012 at center-of-mass energies of 7 and 8 TeV and integrated luminosities of 5 fb^-1 and 20 fb^-1, respectively, agree with the expectation from standard model processes. Constraints on supersymmetry have been calculated and interpreted in different models. Limits on supersymmetry particle masses at the TeV scale have been derived and interpreted generally in the context of simplified model spectra. The constrained minimal supersymmetric standard model is disfavored by the experimental results. Natural supersymmetry scenarios with low supersymmetry particle masses remain possible in multiple regions, for example in those with compressed spectra, that are difficult to access experimentally. The upgraded LHC operating at 13 TeV is gaining sensitivity to the remaining unexplored SUSY parameter space. △ Less", "We develop a new class of supergravity cosmological models where inflation is induced by terms in the Kähler potential which mix a nilpotent superfield $S$ with a chiral sector $Φ$. As the new terms are non-(anti)holomorphic, and hence cannot be removed by a Kähler transformation, these models are intrinsically Kähler potential driven. Such terms could arise for example due to a backreaction of an anti-D3 brane on the string theory bulk geometry. We show that this mechanism is very general and allows for a unified description of inflation and dark energy, with controllable SUSY breaking at the vacuum. When the internal geometry of the bulk field is hyperbolic, we prove that small perturbative Kähler corrections naturally lead to $α$-attractor behaviour, with inflationary predictions in excellent agreement with the latest Planck data △ Less", "Neutrino mixing sum rules are common to a large class of models based on the (discrete) symmetry approach to lepton flavour. In this approach the neutrino mixing matrix $U$ is assumed to have an underlying approximate symmetry form $\\tilde{U}_ν$, which is dictated by, or associated with, the employed (discrete) symmetry. In such a setup the cosine of the Dirac CP-violating phase $δ$ can be related to the three neutrino mixing angles in terms of a sum rule which depends on the symmetry form of $\\tilde{U}_ν$. We consider five extensively discussed possible symmetry forms of $\\tilde{U}_ν$: i) bimaximal (BM) and ii) tri-bimaximal (TBM) forms, the forms corresponding to iii) golden ratio type A (GRA) mixing, iv) golden ratio type B (GRB) mixing, and v) hexagonal (HG) mixing. For each of these forms we investigate the renormalisation group corrections to the sum rule predictions for $δ$ in the cases of neutrino Majorana mass term generated by the Weinberg (dimension 5) operator added to i) the Standard Model, and ii) the minimal SUSY extension of the Standard Model. △ Less", "The `$μ$ from $ν$' supersymmetric standard model ($μν$SSM) solves the $μ$ problem of supersymmetric models and reproduces neutrino data, simply using couplings with the three families of right-handed neutrinos $ν$'s. Novel signatures of supersymmetry at the LHC are expected through these new states, and couplings breaking $R$ parity. All supersymmetric particles are potential candidates for the lightest one, which is not stable leading to prompt or displaced vertices and producing final states with multi-leptons/taus/jets/photons and missing energy. Besides, a decaying gravitino turns out to be an interesting candidate for dark matter. It can be searched through gamma-ray observations, such as those of the Fermi Large Area Telescope. The latter, depending on the region of the parameter space of the model, already imposes an upper bound on the gravitino mass of the order of $5-20$ GeV and a lower bound on the lifetime of about $10^{25-28}$ s. △ Less", "The absence of any signal of supersymmetry (SUSY) at the LHC has raised the SUSY particle mass scale compared to $Z$ boson mass $M_Z$. We investigate the naturalness of the electroweak symmetry breaking after considering radiative symmetry breaking along with 125 GeV Higgs mass. We find that the important quantity to measure the naturalness of the hierarchy between the SUSY scale and $M_Z$ is the separation between the radiative symmetry breaking scale, i.e., where $m_{H_u}^2+μ^2$ turns negative for large $\\tanβ$ case ($μ$ is the Higgsino mass and $m_{H_u}$ is the SUSY breaking up-type Higgs boson mass) and the average stop mass. Using this measure, one can show that the electroweak symmetry breaking can be natural even if $μ$ is large contrary to the prevailing claim that $μ$ is needed to be small to maintain the naturalness. △ Less", "We point out that a hypothesis of squarks and sleptons being Nambu-Goldstone (NG) bosons is consistent with pure gravity mediation or minimal split supersymmetry (SUSY). As a concrete example, we consider a SUSY $E_7/SU(5) \\times U(1)^3$ non-linear sigma model in the framework of pure gravity mediation. The model accommodates three families of the quark and lepton chiral multiplets as (pseudo) NG multiplets of the Kahler manifold, which may enable us to understand the origin and number of the families. We point out that squarks in the first and second generations are likely to be as light as a few TeV if the observed baryon asymmetry is explained by the thermal leptogenesis; therefore, these colored particles can be discovered at the LHC Run-2 or at the high luminosity LHC. △ Less", "The Standard Model (SM) of particle physics is a precise model of electroweak interactions, however there is growing tension between the SM and observations (neutrino oscillations, dark matter, dark energy, baryogenesis, among others). There is no reason to expect the validity of the ad hoc SM to remain intact at energy scales above a few TeV, thus a more fundamental theory will almost certainly be required. Motivated by these considerations, we investigate a Supersymmetric version of a natural extension of the SM, the $U(1)_{B-L}$ model, that is obtained by gauging the accidental B-L symmetry that exists in the ordinary SM. The Supersymmetric $U(1)_{B-L}$ extended SM can resolve the neutrino mass problem, the dark matter problem, the hierarchy problem, and provides a mechanism for establishing the observed baryon asymmetry of the Universe. When we include quantum corrections to the Higgs potential of the model, we find that Radiative $B-L$ symmetry breaking occurs through the interplay between large Majorana Yukawa couplings and SUSY breaking masses, and the SM neutrino masses arise through the Type-I seesaw mechanism. We deduce from the form RGEs that $B-L$ will be broken near the TeV scale when the Majorana Yukawa couplings are of order 0.5, leading to TeV scale right-handed neutrinos, which could be accessible at the LHC. We discuss the different vacua of the theory and the viability of a right-handed neutrino dark matter candidate in the R-parity conserving and violating sectors. A new $\\mathbb{Z}_{2}$ parity is postulated in the R-parity violating sector in which case the lightest right handed neutrino becomes a viable Dark Matter candidate in addition to the gravitino. △ Less", "We review the phenomenology of SUSY dark matter in various versions of MSSM, with universal and nonuniversal gaugino masses at the GUT scale. We start with the universal case (CMSSM), where the cosmologically compatible dark matter relic density is achieved only over some narrow regions of parameter space, involving some fine-tuning. Moreover, most of these regions are seriously challenged by the constraints from collider and direct dark matter detection experiments. Then we consider some simple and predictive nonuniversal gaugino mass models, based on SU(5) GUT. Several of these models offer viable SUSY dark matter candidates, which are compatible with the cosmic dark matter relic density and the above mentioned experimental constraints. They can be probed at the present and future collider and dark matter search experiments. Finally, we consider the nonuniversal gaugino mass model arising from anomaly mediated SUSY breaking. In this case the cosmologically compatible dark matter relic density requires dark matter mass of a few TeV, which puts it beyond the scope of collider and direct dark matter detection experiments. However, it has interesting predictions for some indirect dark matter detection experiments. △ Less", "We consider a broad class of inflationary models of two unconstrained chiral superfields, the stabilizer $S$ and the inflaton $Φ$, which can describe inflationary models with nearly arbitrary potentials. These models include, in particular, the recently introduced theories of cosmological attractors, which provide an excellent fit to the latest Planck data. We show that by adding to the superpotential of the fields $S$ and $Φ$ a small term depending on a nilpotent chiral superfield $P$ one can break SUSY and introduce a small cosmological constant without affecting main predictions of the original inflationary scenario. △ Less", "In the context of Standard Model Extensions (SMEs), we analyse four general classes of Super Symmetry (SuSy) and Lorentz Symmetry (LoSy) breaking, leading to {observable} imprints at our energy scales. The photon dispersion relations show a non-Maxwellian behaviour for the CPT (Charge-Parity-Time reversal symmetry) odd and even sectors. The group velocities exhibit also a directional dependence with respect to the breaking background vector (odd CPT) or tensor (even CPT). In the former sector, the group velocity may decay following an inverse squared frequency behaviour. Thus, we extract a massive and gauge invariant Carroll-Field-Jackiw photon term in the Lagrangian and show that the mass is proportional to the breaking vector. The latter is estimated by ground measurements and leads to a photon mass upper limit of $10^{-19}$ eV or $2 \\times 10^{-55}$ kg and thereby to a potentially measurable delay at low radio frequencies. △ Less", "Inflation with plateau potentials give the best fit to the CMB observables as they predict tensor to scalar ratio stringently bounded by the observations from Planck and BICEP2/Keck. In supergravity models it is possible to obtain plateau potentials for scalar fields in the Einstein frame which can serve as the inflation potential by considering higher dimensional Planck suppressed operators and by the choice of non-canonical Kähler potentials. We construct a plateau inflation model in MSSM where the inflation occurs along a sneutrino-Higgs flat direction. A hidden sector Polonyi field is used for the breaking of supersymmetry after the end of the inflation. The proper choice of superpotential leads to strong stabilization of the Polonyi field, $m_{Z}^2\\gg m_{3/2}^2$, which is required to solve the cosmological moduli problem. Also, the SUSY breaking results in a TeV scale gravitino mass and scalar masses and gives rise to bilinear and triliear couplings of scalars which can be tested at the LHC. The sneutrino inflation field can be observed at the LHC as a TeV scale diphoton resonance like the one reported by CMS and ATLAS. △ Less", "In this paper, we perform a full next-to-leading order (NLO) QCD calculation of neutralino scattering on protons or neutrons in the MSSM. We match the results of the NLO QCD calculation to the scalar and axial-vector operators in the effective field theory approach. These govern the spin-independent and spin-dependent detection rates, respectively. The calculations have been performed for general bino, wino and higgsino decompositions of neutralino dark matter and required a novel tensor reduction method of loop integrals with vanishing relative velocities and Gram determinants. Numerically, the NLO QCD effects are shown to be of at least of similar size and sometimes larger than the currently estimated nuclear uncertainties. We also demonstrate the interplay of the direct detection rate with the relic density when consistently analyzed with the program $\\mathtt{DM@NLO}$. △ Less", "We assess how different ATLAS and CMS searches for supersymmetry in the $t\\bar t + E_T^{\\rm miss}$ final state at Run 1 of the LHC constrain scenarios with a fermionic top partner and a dark matter candidate. We find that the efficiencies of these searches in all-hadronic, 1-lepton and 2-lepton channels are quite similar for scalar and fermionic top partners. Therefore, in general, efficiency maps for stop-neutralino simplified models can also be applied to fermionic top-partner models, provided the narrow width approximation holds in the latter. Owing to the much higher production cross-sections of heavy top quarks as compared to stops, masses up to $m_T\\approx 850$ GeV can be excluded from the Run 1 stop searches. Since the simplified-model results published by ATLAS and CMS do not extend to such high masses, we provide our own efficiency maps obtained with CheckMATE and MadAnalysis 5 for these searches. Finally, we also discuss how generic gluino/squark searches in multi-jet final states constrain heavy top partner production. △ Less", "Supersymmetry (SUSY) is a fascinating topic in theoretical physics, because of its unique and counterintuitive properties. It is expected to emerge as new physics beyond the standard model, and it is also a building block for supergravity and superstring theory. A number of exact results obtained via SUSY theories provide insights into field theory. However, the dynamics of many SUSY theories are not yet fully understood, and numerical study of SUSY theories through lattice simulations is promising as regards furthering this understanding. In this paper, I overview the current status of lattice SUSY by discussing its development in chronological order, and by reviewing some simple models. In addition, I discuss the numerical verification of gauge/gravity duality, which is one of the recent significant developments in this field. △ Less", "We compute the two-loop O(as*at) corrections to the Higgs boson masses in supersymmetric extensions of the Standard Model with Dirac gaugino masses. We rely on the effective-potential technique, allow for both Dirac and Majorana mass terms for the gluinos, and compute the corrections in both the DRbar and on-shell renormalisation schemes. We give detailed results for the MDGSSM and the MRSSM, and simple approximate formulae valid in the decoupling limit for all currently-studied variants of supersymmetric models with Dirac gluinos. These results represent the first explicit two-loop calculation of Higgs boson masses in supersymmetric models beyond the MSSM and the NMSSM. △ Less", "Higgs boson mass measurement at $\\sim 125$ GeV points to a high scale for SUSY specifically the scalar masses. If all the scalars are heavy, supersymmetric contribution to the leptonic $g-2$ moments will be significantly reduced. On the other hand the Brookhaven experiment indicates a 3sigma deviation from the standard model prediction. Here we analyze the leptonic $g-2$ moments in an extended MSSM model with inclusion of a vector like leptonic generation which brings in new sources of CP violation. In this work we consider the contributions to the leptonic $g-2$ moments arising from the exchange of charginos and neutralinos, sleptons and mirror sleptons, and from the exchange of $W$ and $Z$ bosons and of leptons and mirror leptons. We focus specifically on the $g-2$ moments for the muon and the electron where sensitive measurements exist. Here it is shown that one can get consistency with the current data on $g-2$ under the Higgs boson mass constraint. Dependence of the moments on CP phases from the extended sector are analyzed and it is shown that they are sensitively dependent on the phases from the new sector. It is shown that the corrections to the leptonic moments arising from the extended MSSM sector will be non-vanishing even if the SUSY scale extends into the PeV region. △ Less", "As we anticipate the first results of the 2016 run, we assess the discovery potential of the LHC to `natural supersymmetry'. To begin with, we explore the region of the model parameter space that can be excluded with various centre-of-mass energies (13 TeV and 14 TeV) and different luminosities (20 fb$^{-1}$, 100 fb$^{-1}$, 300 fb$^{-1}$ and 3000 fb$^{-1}$). We find that the bounds at 95% CL on stops vary from $m_{\\tilde{t}_1}\\gtrsim 900$ GeV expected this summer to $m_{\\tilde{t}_1}\\gtrsim 1500$ GeV at the end of the high luminosity run, while gluino bounds are expected to range from $m_{\\tilde{g}}\\gtrsim 1700$ GeV to $m_{\\tilde{g}}\\gtrsim 2500$ GeV over the same time period. However, more pessimistically we find that if no signal begins to appear this summer, only a very small region of parameter space can be discovered with 5-$σ$ significance. For this conclusion to change, we find that both theoretical and systematic uncertainties will need to be significantly reduced. △ Less", "We investigate the impact of the direct searches for SUSY at LHC Run I on the naturalness of the Next-to-Minimal Supersymmetric Standard Model (NMSSM). For this end, we first scan the vast parameter space of the NMSSM to get the region where the fine tuning measures $Δ_Z$ and $Δ_h$ at the electroweak scale are less than about 50, then we implement by simulations the constraints of the direct searches on the parameter points in the region. Our results indicate that although the direct search experiments are effective in excluding the points, the parameter intervals for the region and also the minimum reaches of $Δ_Z$ and $Δ_h$ are scarcely changed by the constraints, which implies that the fine tuning of the NMSSM does not get worse after LHC Run I. Moreover, based on the results we propose a natural NMSSM scenario where the lightest neutralino $\\tildeχ_1^0$ as the dark matter (DM) candidate is Higgsino-dominated. In this scenario, $Δ_Z$ and $Δ_h$ may be as low as 2 without conflicting with any experimental constraints, and intriguingly $\\tildeχ_1^0$ can easily reach the measured DM relic density due to its significant Singlino component. We exhibit the features of the scenario which distinguish it from the other natural SUSY scenario, including the properties of its neutralino-chargino sector and scalar top quark sector. We emphasize that the scenario can be tested either through searching for $3 l + E_T^{miss}$ signal at 14 TeV LHC or through future DM direct detection experiments. △ Less", "We study the conditions of restoring supersymmetry (SUSY) after inflation in the supergravity-based cosmological models with a single chiral superfield and a quartic stabilization term in the Kähler potential. Some new, explicit, and viable inflationary models satisfying those conditions are found. The inflaton's scalar superpartner is dynamically stabilized during and after inflation. We also demonstrate a possibility of having small and adjustable SUSY breaking with a tiny cosmological constant. △ Less", "In supersymmetric models with radiatively-driven naturalness, higgsino-like electroweak-inos (EW-inos) are expected to lie in a mass range 100--300 GeV, the lighter the more natural. Such states can be pair-produced at high rates at ILC where their masses are nearly equal to the value of the superpotential mu parameter while their mass splittings depend on the gaugino masses M_1 and M_2. The gaugino masses in turn depend on trilinear soft terms---the A parameters, which are expected to lie in the multi-TeV range owing to the 125 GeV Higgs mass---via two-loop contributions to renormalization group running. We examine the extent to which ILC is sensitive to large A-terms via precision EW-ino mass measurement. Extraction of gaugino masses at the percent level should allow for interesting probes of large trilinear soft SUSY breaking terms under the assumption of unified gaugino masses. △ Less", "Null results from dark matter (DM) direct detection experiments and the 125 GeV Higgs both pose serious challenges to minimal supersymmetry. In this paper, we propose a simple extension of the MSSM that economically solves both problems: a \"dark sector\" consisting of a singlet and a pair of $SU(2)$ doublets. Loops of the dark sector fields help lift the Higgs mass to 125 GeV consistent with naturalness, while the lightest fermion in the dark sector can be viable thermal relic DM, provided that it is mostly singlet. The DM relic abundance is controlled by s-wave annihilation to tops and Higgsinos, leading to a tight relation between the relic abundance and the spin-dependent direct detection cross section. As a result, the model will be fully probed by the next generation of direct detection experiments. Finally we discuss the discovery potential at LHC Run II. △ Less", "The LHC experiments ATLAS and CMS have reported an excess in the diphoton spectrum at \\sim 750 GeV. At the same time the motivation for Supersymmetry (SUSY) remains unbowed. Consequently, we review briefly the proposals to explain this excess in SUSY, focusing on \"pure\" (N)MSSM solutions. We then review in more detail a proposal to realize this excess within the NMSSM. In this particular scenario a Higgs boson with mass around 750 GeV decays to two light pseudo-scalar Higgs bosons. Via mixing with the pion these pseudo-scalars decay into a pair of highly collimated photons, which are identified as one photon, thus resulting in the observed signal. △ Less", "It is often argued that the minimal supersymmetric standard model has O(100) free parameters and the generic parameter region is already excluded by the null observation of the flavor and CP violating processes as well as the constraints from the LHC experiments. This situation naturally leads us to consider the case where all the dangerous soft supersymmetry breaking terms such as the scalar masses and scalar couplings are absent, while only the unified gaugino mass term and the mu term are non-vanishing at the grand unification scale. We revisit this simple situation taking into account the observed Higgs boson mass, 125 GeV. Since the gaugino mass and the mu term are fixed in order to explain the Higgs boson and the Z boson masses, there is no free parameter left in this scenario. We find that there are three independent parameter sets exist including ones which have not been discussed in the literature. We also find that the abundance of the dark matter can be explained by relic gravitinos which are non-thermally produced as decay products of the SUSY particles while satisfying constraints from Big Bang Nucleosynthesis. We discuss the effects of the gravity mediation which generically give contribution to the soft terms of the order of the gravitino mass. It turns out that newly found parameter set is preferable to explain the Higgs boson mass as well as the gravitino dark matter while satisfying the constraints from the electric dipole moments of the electron and the nucleon. △ Less", "We analyze the Lepton Flavor Violating (LFV) Higgs decay h -> tau mu in three supersymmetric models: Minimal Supersymmetric Standard Model (MSSM), Supersymmetric Seesaw Model (SSM), and Supersymmetric B-L model with Inverse Seesaw (BLSSM-IS). We show that in generic MSSM, with non-universal slepton masses and/or trilinear couplings, it is not possible to enhance BR(h -> tau mu) without violating the experimental bound on the BR(tau -> mu gamma). In SSM, where flavor mixing is radiatively generated, the LFV process mu -> e gamma strictly constrains the parameter space and the maximum value of BR(h -> tau mu) is of order 10^-10, which is extremely smaller than the recent results reported by the CMS and ATLAS experiments. In BLSSM-IS, with universal soft SUSY breaking terms at the grand unified scale, we emphasize that the measured values of BR(h -> tau mu) can be accommodated in a wide region of parameter space without violating LFV constraints. Thus, confirming the LFV Higgs decay results will be a clear signal of BLSSM-IS type of models. Finally, the signal of h -> tau mu in the BLSSM-IS at the LHC, which has a tiny background, is analyzed. △ Less", "We present a set of NLO SUSY-QCD calculations for the pair production of neutralinos and charginos at the LHC, and their matching to parton-shower programs in the framework of the POWHEG-BOX program package. The code we have developed provides a SUSY Les Houches Accord interface for setting supersymmetric input parameters. Decays of the neutralinos and charginos and parton-shower effects can be simulated with PYTHIA. To illustrate the capabilities of our program, we present phenomenological results for a representative SUSY parameter point. We find that NLO-QCD corrections increase the production rates for neutralinos and charginos significantly. The impact of parton-shower effects on distributions of the weakinos is small, but non-negligible for jet distributions. △ Less", "The absence of the quadratic divergence in the Higgs sector of the Standard Model in the dimensional regularization is usually regarded to be an exceptional property of a specific regularization. To understand what is going on in the dimensional regularization, we illustrate how to reproduce the results of the dimensional regularization for the $λφ^{4}$ theory in the more conventional regularization such as the higher derivative regularization; the basic postulate involved is that the quadratically divergent induced mass, which is independent of the scale change of the physical mass, is kinematical and unphysical. This is consistent with the derivation of the Callan-Symanzik equation, which is a comparison of two theories with slightly different masses, for the $λφ^{4}$ theory without encountering the quadratic divergence. We thus suggest that the dimensional regularization is generic in a bottom-up approach starting with a successful low-energy theory. We also define a modified version of the mass independent renormalization for a scalar field which leads to the homogeneous renormalization group equation. Implications of the present analysis on the Standard Model at high energies and the presence or absence of SUSY at LHC energies are briefly discussed. △ Less", "The observation of charged lepton flavour violation would be a smoking gun for new physics and could help in pinpointing the mechanism at the origin of neutrino masses and mixing. We present here our recent studies of lepton flavour violating Higgs decays in the inverse seesaw and its supersymmetric embedding, two examples of low-scale seesaw mechanisms. We predict branching ratios as large as $10^{-5}$ for the decays $h\\rightarrow τμ$ and $h \\rightarrow τe$ in the inverse seesaw, which can be probed in future colliders. Supersymmetric contributions can enhance the branching ratio of $h\\rightarrow τμ$ up to $1\\%$, making it large enough to explain the small excess observed by ATLAS and CMS. △ Less", "We show that a 750 GeV di-photon excess as reported by the ATLAS and CMS experiments can be reproduced by the Minimal Dirac Gaugino Supersymmetric Standard Model (MDGSSM) without the need of any ad-hoc addition of new states. The scalar resonance is identified with the spin-0 partner of the Dirac bino. We perform a thorough analysis of constraints coming from the mixing of the scalar with the Higgs boson, the stability of the vacuum and the requirement of perturbativity of the couplings up to very high energy scales. We exhibit examples of regions of the parameter space that respect all the constraints while reproducing the excess. We point out how trilinear couplings that are expected to arise in supersymmetry-breaking mediation scenarios, but were ignored in the previous literature on the subject, play an important role. △ Less", "Baryon number violation appears in many contexts. It is a requirement for baryogenesis and is a consequence of Grand Unified Theories (GUTs), which predict nucleon decay. Nucleon decay searches provide the most direct way to test baryon number conservation and also serve as a unique probe of GUT scale physics around $10^{14-16}$ GeV. Such energies cannot be reached directly by accelerators. However, they can be explored indirectly at large underground water Cherenkov (WC) experiments, which due to the size of their fiducial volume are highly sensitive to nucleon decays. We review searches for baryon number violating processes at the state of the art WC detector, the Super-Kamiokande. Analyses of the typically dominant non-SUSY and SUSY nucleon decay channels such as $p \\rightarrow (e^+, μ^+) π^0$ and $p \\rightarrow νK^+$, as well as more exotic searches, will be discussed. Presented studies set the world's best limits, which circumvent the allowed parameter space of theoretical models △ Less", "In previous work, we presented a statistical scan over the soft supersymmetry breaking parameters of the minimal SUSY $B-L$ model. For specificity of calculation, unification of the gauge parameters was enforced by allowing the two ${\\mathbb Z}_{3}\\times {\\mathbb Z}_{3}$ Wilson lines to have mass scales separated by approximately an order of magnitude. This introduced an additional \"left-right\" sector below the unification scale. In this paper, for three important reasons, we modify our previous analysis by demanding that the mass scales of the two Wilson lines be simultaneous and equal to an \"average unification\" mass $\\left<M_{U}\\right>$. The present analysis is 1) more \"natural\" than the previous calculations, which were only valid in a very specific region of the Calabi-Yau moduli space, 2) the theory is conceptually simpler in that the left-right sector has been removed and 3) in the present analysis the lack of gauge unification is due to threshold effects--particularly heavy string thresholds, which we calculate statistically in detail. As in our previous work, the theory is renormalization group evolved from $\\left<M_{U}\\right>$ to the electroweak scale--being subjected, sequentially, to the requirement of radiative $B-L$ and electroweak symmetry breaking, the present experimental lower bounds on the $B-L$ vector boson and sparticle masses, as well as the lightest neutral Higgs mass of $\\sim$125 GeV. The subspace of soft supersymmetry breaking masses that satisfies all such constraints is presented and shown to be substantial. △ Less", "We discuss the gravitino problem in contest of the Exotic see-saw mechanism for neutrinos and Leptogenesis, UV completed by intersecting D-branes Pati-Salam models. In the Exotic see-saw model, supersymmetry is broken at high scales $M_{SUSY}>10^{9}\\, \\rm GeV$ and this seems in contradiction with gravitino bounds from inflation and baryogenesis. However, if gravitino is the Lightest Stable Supersymmetric Particle, it will not decay into other SUSY particles, avoiding the gravitino problem and providing a good Cold Dark Matter. Gravitini are Super Heavy Dark Particles and they can be produced by non-adiabatic expansion during inflation. Intriguingly, from bounds on the correct abundance of dark matter, we also constrain the neutrino sector. We set a limit on the exotic instantonic coupling of $<10^{-2}÷10^{-3}$. This also sets important constrains on the Calabi-Yau compactifications and on the string scale. This model strongly motivates very high energy DM indirect detection of neutrini and photons of $10^{11}÷10^{13}\\, \\rm GeV$: gravitini can decay on them in a cosmological time because of soft R-parity breaking effective operators. △ Less", "The Standard Model of particle physics is assumed to be a low-energy effective theory with new physics theoretically motivated to be around TeV scale. The dissertation presents theories with new physics beyond the Standard Model at the TeV scale testable in the current High Energy Colliders. The study on leptoquarks gauge bosons in reference to TopSU(5) model in chapter 2 showed that their discovery mass range extends upto 1.5 TeV at 14 TeV LHC with luminosity of 100 $fb^{-1}$. On the other hand, in chapter 3 we studied the collider phenomenology of TeV scale mirror fermions in Left-Right Mirror model finding that the reaches for the mirror quarks goes upto $750$ GeV at the $14$ TeV LHC with $~300 ~fb^{-1}$ luminosity. In chapter 4 we have enlarged the bosonic symmetry to fermi-bose symmetry e.g. supersymmetry and have shown that SUSY with non-universalities in gaugino or scalar masses within high scale SUGRA set up can still be accessible at LHC with 14 TeV. In chapter 5, we performed a study in respect to the $e^+e^-$ collider and find that precise measurements of the higgs boson mass splittings upto $\\sim 100$ MeV may be possible with high luminosity in the International Linear Collider (ILC). In chapter 6 we have shown that the experimental data on neutrino masses and mixings are consistent with the proposed 4/5 parameter Dirac neutrino models yielding a solution for the neutrino masses with inverted mass hierarchy and large CP violating phase $δ$ and thus can be tested experimentally. Chapter 7 incorporates a warm dark matter candidate in context of two Higgs doublet model. The model has several testable consequences at LHC. This dissertation presents an endeavor to study beyond standard model (BSM) physics at the TeV scale with testable signals in the Colliders. △ Less", "An earlier paper showed that it is possible to write down new SUSY Actions in which it is not possible to define a Supersymmetry Charge. SUSY is defined in these new Actions by the fact that they satisfy Master Equations. The new SUSY Actions are very easy to write down. One simply takes a Chiral SUSY Action, coupled to Gauge and other Chiral Multiplets, and even SuperGravity, if desired. Then one creates a new Action from this by exchanging all or part of the Scalar Field $S$ for a new Zinn Source $J$, and the corresponding part of the Zinn Source $Γ$ for a new Antighost Field $η$. Since the original Action satisfies a Master Equation, this exchange guarantees that the new Action will satisfy the new Master Equation. As was shown in the earlier paper, the new multiplets have fewer bosonic degrees of freedom than fermionic degrees of freedom. This is possible because they do not have a Supercharge. The resulting new SSM has no need for Squarks or Sleptons. It does not need spontaneous breaking of SUSY, so that the cosmological constant problem does not arise (at least at tree level). It mimics the usual non-supersymmetric Standard Model very well, and the absence of large flavour changing neutral currents is natural. There is no need for a hidden sector, or a messenger sector, or explicit `soft' breaking of SUSY. Spontaneous Gauge Symmetry Breaking implies the existence of two new very heavy Higgs Bosons with mass 13.4 TeV, slightly smaller than the energy of the LHC at 14 TeV. There is also a curious set of Gauginos and Higgsinos which have exactly the same masses as the Higgs and Gauge Bosons. These do not couple to the Quarks and Leptons, except through the Higgs and Gauge Bosons. △ Less", "In this analysis we explore the phenomenological constraints of models with non-holomorphic soft SUSY breaking terms in a beyond the MSSM scenario having identical particle content. The model referred as NHSSM shows various promising features like the possibility of a strong reduction in electroweak fine-tuning even for a scenario of a heavy higgsino type of LSP, a fact that is unavailable in pMSSM models. The other important aspect is satisfying the muon $g-2$ data even for a small $\\tanβ$ via a small value of coupling $A_μ'$ associated with the tri-linear non-holomorphic soft term. Thus, a large SUSY contribution to muon $g-2$ is possible even for a significantly large smuon mass $m_{\\tilde {μ_1}}$. The Higgs mass radiative corrections are contributed by both the holomorphic and non-holomorphic trilinear soft parameters $A_t$ and $A_t'$, thus diluting the requirement to have a larger $A_t$ to satisfy the Higgs mass data. The model also provides with valid parameter space satisfying the constraint of $B \\rightarrow X_s +γ$ for large values of $\\tanβ$, a scenario unfavourable in pMSSM. △ Less", "Spontaneously broken supersymmetry (SUSY) and a vanishingly small cosmological constant imply that R symmetry must be spontaneously broken at low energies. Based on this observation, we suppose that, in the sector responsible for low-energy R symmetry breaking, a discrete R symmetry remains preserved at high energies and only becomes dynamically broken at relatively late times in the cosmological evolution, i.e., after the dynamical breaking of SUSY. Prior to R symmetry breaking, the Universe is then bound to be in a quasi-de Sitter phase---which offers a dynamical explanation for the occurrence of cosmic inflation. This scenario yields a new perspective on the interplay between SUSY breaking and inflation, which neatly fits into the paradigm of high-scale SUSY: inflation is driven by the SUSY-breaking vacuum energy density, while the chiral field responsible for SUSY breaking, the Polonyi field, serves as the inflaton. Because R symmetry is broken only after inflation, slow-roll inflation is not spoiled by otherwise dangerous gravitational corrections in supergravity. We illustrate our idea by means of a concrete example, in which both SUSY and R symmetry are broken by strong gauge dynamics and in which late-time R symmetry breaking is triggered by a small inflaton field value. In this model, the scales of inflation and SUSY breaking are unified; the inflationary predictions are similar to those of F-term hybrid inflation in supergravity; reheating proceeds via gravitino decay at temperatures consistent with thermal leptogenesis; and the sparticle mass spectrum follows from pure gravity mediation. Dark matter consists of thermally produced winos with a mass in the TeV range. △ Less", "We point out that a distinctive mono-top signature is present in Natural SUSY scenarios when a scalar top-quark and higgsinos are almost mass degenerate. This signature originates from a supersymmetric counter part of the $t \\bar t H$ process, i.e. $pp \\to \\tilde t t \\tilde h$. Unlike mono-jet signatures exploiting initial state radiation, this channel can be regarded as a smoking gun signature of a light stop and higgsinos, allowing a direct probe of the stop and neutralino sectors. The production rate of this channel largely depends on the up-type higgsino components in the neutralinos while the stop sector is sensitive to angular distributions of top-quark's decay products. We develop an optimal search strategy to capture the supersymmetric $t \\bar t H$ process and find that a high luminosity LHC can probe the stop and higgsino sectors with $m_{\\tilde t_1} \\lesssim 380$ GeV and $m_{\\tilde t_1} - m_{\\tilde χ_1^0} \\lesssim m_W$. Additionally, we propose a kinematic variable with which one can measure the stop mixing in this channel. △ Less", "A possible explanation of the excesses observed by ATLAS in the Z+jets+MET channel within the p(henomenological)MSSM is discussed. We have found that the cascade of first/second generation squarks to binos to Higgsino LSPs, with judiciously chosen sparticle masses, can provide a viable scenario that is consistent with all other experimental constraints. △ Less", "We study the Yukawa unification, in particular, the unification of the Yukawa coupling constants of $b$ and $τ$, in the framework of supersymmetric (SUSY) model. We concentrate on the model in which the SUSY breaking scalar masses are of the order of the gravitino mass while the gaugino masses originate from the effect of anomaly mediation and hence are one-loop suppressed relative to the gravitino mass. We perform an accurate calculation of the Yukawa coupling constants of $b$ and $τ$ at the grand unified theory (GUT) scale, including relevant renormalization group effects and threshold corrections. In particular, we study the renormalization group effects, taking into account the mass splittings among sfermions, gauginos, and the standard model particles. We found that the Yukawa coupling constant of $b$ at the GUT scale is about $70\\ \\%$ of that of $τ$ if there is no hierarchy between the sfermion masses and the gravitino mass. Our results suggest sizable threshold corrections to the Yukawa coupling constants at the GUT scale or significant suppressions of the sfermion masses relative to the gravitino mass. △ Less", "There exists a vast literature examining the electroweak (EW) fine-tuning problem in supersymmetric scenarios, but little concerned with the dark matter (DM) one, which should be combined with the former. In this paper, we study this problem in an, as much as possible, exhaustive and rigorous way. We have considered the MSSM framework, assuming that the LSP is the lightest neutralino, $χ_1^0$, and exploring the various possibilities for the mass and composition of $χ_1^0$, as well as different mechanisms for annihilation of the DM particles in the early Universe (well-tempered neutralinos, funnels and co-annihilation scenarios). We also present a discussion about the statistical meaning of the fine-tuning and how it should be computed for the DM abundance, and combined with the EW fine-tuning. The results are very robust and model-independent and favour some scenarios (like the h-funnel when $M_{χ_1^0}$ is not too close to $m_h/2$) with respect to others (such as the pure wino case). These features should be taken into account when one explores \"natural SUSY\" scenarios and their possible signatures at the LHC and in DM detection experiments. △ Less", "Realizing that couplings related by supersymmetry (SUSY) can be disentangled when SUSY is broken, it is suggested that unwanted flavor and CP violating SUSY couplings may be suppressed via quenched gaugino-flavor interactions, which may be accomplished by power-law running of sfermion anomalous dimensions. A simple theoretical framework to accomplish this is exemplified and the defeated constraints are tallied. One key implication of the scenario is the expectation of enhanced top, bottom and tau production at the LHC, accompanied by large missing energy. Also, direct detection signals of dark matter may be more challenging to find than in conventional SUSY scenarios. △ Less", "We briefly review the instanton-torus knot duality found in 5d SUSY gauge theories with one compact dimension. The fermion condensate turn out to be the generating function for the torus knot polynomials colored by the fundamental representation. △ Less", "In this talk I discuss recent developments in moduli stabilisation, SUSY breaking and chiral D-brane models together with several interesting features of cosmological models built in the framework of type IIB string compactifications. I show that a non-trivial pre-inflationary dynamics can give rise to a power loss at large angular scales for which there have been mounting observational hints from both WMAP and Planck. I then describe different stringy embeddings of inflationary models which yield large or small tensor modes. I finally argue that reheating is generically driven by the decay of the lightest modulus which can produce, together with Standard Model particles, also non-thermal dark matter and light hidden sector degrees of freedom that behave as dark radiation. △ Less", "Grand Unified Theories (GUTs) are attractive candidates for more fundamental elementary particle theories. They can not only unify the Standard Model (SM) interactions but also different types of SM fermions, in particular quarks and leptons, in joint representations of the GUT gauge group. We discuss how comparing predictive supersymmetric GUT models with the experimental results for quark and charged lepton masses leads to constraints on the SUSY spectrum. We show an example from a recent analysis where the resulting superpartner masses where found just beyond the reach of LHC run 1, but fully within the reach of a 100 TeV pp collider. △ Less", "CP violation, which is crucial for producing the baryon asymmetry of the Universe, is enhanced in particle-antiparticle oscillations. We study particle-antiparticle oscillations (of a particle with mass O(100 GeV)) with CP violation in the early Universe in the presence of interactions with O(ab-fb) cross-sections. We show that, if baryon-number-violating interactions exist, a baryon asymmetry can be produced via out-of-equilibrium decays of oscillating particles. As a concrete example we study a $U(1)_R$-symmetric, R-parity-violating SUSY model with pseudo-Dirac gauginos, which undergo particle-antiparticle oscillations. Taking bino to be the lightest $U(1)_R$-symmetric particle, and assuming it decays via baryon-number-violating interactions, we show that bino-antibino oscillations can produce the baryon asymmetry of the Universe. △ Less", "We consider a specific class of events of the SUSY particle production at the LHC without missing p_T. Namely, we discuss the chargino pair production with a further decay into the W-boson and the neutralino when the masses of the chargino and neutralino differ by 80-90 GeV. In this case, in the final state one has two Ws and missing E_T but no missing P_T. The produced neutralinos are just boosted along Ws. For a demonstration we consider the MSSM with non-universal gaugino masses. In this case, such events are quite probable in the region of parameter space where the lightest chargino and neutralino are mostly gauginos. The excess in the W production cross-section reach about 10 % over the Standard Model background. We demonstrate that the LHC experiments, which presently measure the WW production cross section at the 8 % level can probe chargino mass around 110 GeV within the suggested scenario, which is not accessible via other searches. If the precision of WW cross section measurement at the LHC will achieve the 3 % level, then it would probe chargino masses up to about 150 GeV within the no missing P_T scenario. △ Less", "It is often argued that low fine tuning in the MSSM necessarily requires a rather light Higgsino. In this note we show that this need not be the case when a more complete set of soft SUSY breaking mass terms are included. In particular an Higgsino mass term, that correlates the $μ-$term contribution with the soft SUSY-breaking Higgsino masses, significantly reduces the fine tuning even for Higgsinos in the TeV mass range where its relic abundance means it can make up all the dark matter. △ Less", "Current data (LHC direct searches, Higgs mass, dark matter-related bounds) severely affect the constrained minimal SUSY standard model (CMSSM) with neutralinos as dark matter candidates. But the evidence for neutrino masses coming from oscillations requires extending the SM with at least right-handed neutrinos with a Dirac mass term. In turn, this implies extending the CMSSM with right-handed sneutrino superpartners, a scenario we dub $\\tildeν$CMSSM. These additional states constitute alternative dark matter candidates of the superWIMP type, produced via the decay of the long-lived next-to-lightest SUSY particle (NLSP). Here we consider the interesting and likely case where the NLSP is a $\\tildeτ$: despite the modest extension with respect to the CMSSM this scenario has the distinctive signatures of heavy, stable charged particles. After taking into account the role played by neutrino mass bounds and the specific cosmological bounds from the big bang nucleosynthesis in selecting the viable parameter space, we discuss the excellent discovery prospects for this model at the future runs of the LHC. We show that it is possible to probe $\\tildeτ$ masses up to 600 GeV at the 14 TeV LHC with $\\mathcal{L} = 1100$ fb$^{-1}$ when one considers a pair production of staus with two or more hard jets through all SUSY processes. We also show the complementary discovery prospects from a direct $\\tildeτ$ pair production, as well as at the new experiment MoEDAL. △ Less", "We probe the SUSY at the $10 \\ {\\rm TeV}$ scale in the rare decays and the CP violation of the kaon. We focus on the processes of $K_L \\to π^0 ν{\\bar ν}$ and $K^+ \\to π^+ ν{\\bar ν}$ combined with the CP violating parameters $ε_K$ and $ε_K^\\prime/ε_K$. The Z-penguin mediated by the chargino loop cannot enhance $K_L \\to π^0 ν{\\bar ν}$ and $K^+ \\to π^+ ν{\\bar ν}$ because the left-right mixing of the stop is constrained by the $125$ GeV Higgs mass. On the other hand, the Z-penguin mediated by the gluino loop can enhance the branching ratios of both $K_L \\to π^0 ν{\\bar ν}$ and $K^+ \\to π^+ ν{\\bar ν}$. The former increases up to more than $1.0 \\times 10^{-10}$, which is much larger than the SM prediction even if the constraint of $ε_K$ is imposed. It is remarkable that the Z-penguin mediated by the gluino loop can enhance simultaneously $ε^\\prime_K/ε_K$ and the branching ratio of $K_L \\to π^0 ν{\\bar ν}$, which increases up to $1.0 \\times 10^{-10}$. We also study the decay rates of $K_L\\rightarrow μ^+μ^-$, $B^0\\rightarrow μ^+μ^-$ and $B_s\\rightarrow μ^+μ^-$, which correlate with the $K_L \\to π^0 ν{\\bar ν}$ decay through the Z penguin. It is important to examine the $B^0\\rightarrow μ^+μ^-$ process since we expect the enough sensitivity of this decay mode to the SUSY at LHCb. △ Less", "Within the framework of the Minimal Supersymmetric Standard Model (MSSM), we explore a decoupling of the parameters into separate sectors that determine consistency with collider data, the abundance of dark matter, and potential signatures at direct dark matter searches. We consider weak-scale bino-like neutralino dark matter, and find that annihilations via light slepton exchange present a viable mechanism for obtaining the appropriate dark matter abundance assuming a thermal history. Constraints and prospects for discovery of these models are discussed, including the possibility that direct dark matter searches may be sensitive to these models if light squarks exhibit left-right mixing. Differences between the scenarios presented here and the typical expectations for the MSSM are discussed. △ Less", "The data obtained by the LHC collaborations clearly show that supersymmetric models are not realized in nature in a vanilla form and that in particular strongly interacting supersymmetric particles are most likely heavier than expected. An exception are the partners of the third generation quarks, which also play a dominant role in the breaking of the electroweak symmetry. We consider here an extended class of so-called `natural supersymmetric models' where we allow for a sneutrino as the lightest supersymmetric particle as it appears for example in left-right symmetric models and/or models where supersymmetry is explained via an inverse seesaw mechanism. We evaluate how much existing ATLAS data constrain such scenarios and obtain roughly a bound of 300 GeV on the charginos if the sneutrinos are lighter than about 120 GeV. For the stop we find that only masses up to 300 GeV are excluded independent of the mixing angle. For larger values the exclusion depends on the detail of the scenario and if the mass exceeds 800 GeV no bound is obtained. △ Less", "We revisit the existing limits on the gaugino masses in various Supersymmetric (SUSY) scenarios derived from Run-I data of the LHC. These limits obtained from the various final states rely heavily on the simplified assumptions regarding the masses, compositions and decay branching ratios of the gauginos. The most promising exclusion limits on the gaugino masses are obtained from trilepton final states while the second lightest neutralino ($\\widetilde χ_2^0$) decaying into the SM-like Higgs and lightest SUSY particle (LSP) results in the weakest bounds. Our aim is to assess the extent of deviation of these exclusion limits in more realistic scenarios. After a brief discussion on the various decay modes of the $\\widetilde χ_2^0$ and the lightest chargino ($\\widetilde χ^{\\pm}_1$), we proceed to validate the ATLAS exclusion limits obtained from trilepton, $lγγ$ and $lb\\bar b$ final states associated with missing energy. We then consider different combinations of the relevant branching ratios to study their impact on the existing bounds. The results are presented alongside the existing exclusion limits to showcase the extent of the obtained deviation. We also observe that the three-body decay modes of $\\widetilde χ_2^0$ and $\\widetilde χ^{\\pm}_1$ via off-shell slepton decays resulting in trilepton final states provide bounds that are far more severe in some parts of the available parameter space than that obtained from the usual two-body decay modes of the aforementioned gauginos. △ Less", "We calculate the high and low scale threshold corrections to the D=6 proton decay mode in supersymmetric SU(5) grand unified theories with higher-dimensional representation Higgs multiplets. In particular, we focus on a missing-partner model in which the grand unified group is spontaneously broken by the 75-dimensional Higgs multiplet and the doublet-triplet splitting problem is solved. We find that in the missing-partner model the D=6 proton decay rate gets suppressed by about 60%, mainly due to the threshold effect at the GUT scale, while the SUSY-scale threshold corrections are found to be less prominent when sfermions are heavy. △ Less", "We propose a simple gauged U(1)$_{B-L}$ extension of the minimal supersymmetric Standard Model (MSSM), where R-parity is conserved as usual in the MSSM. The global $B-L$ (baryon number minus lepton number) symmetry in the MSSM is gauged and three MSSM gauge-singlet chiral multiplets with a unit $B-L$ charge are introduced, ensuring the model free from gauge and gravitational anomalies. We assign an odd R-parity for two of the new chiral multiplets and hence they are identified with the right-handed neutrino superfields, while an even R-parity is assigned to the other one ($Φ$). The scalar component of $Φ$ plays the role of a Higgs field to break the U(1)$_{B-L}$ symmetry through its negative mass squared, which is radiatively generated by the renormalization group running of soft supersymmetry (SUSY) breaking parameters from a high energy. This radiative U(1)$_{B-L}$ symmetry breaking leads to its breaking scale being at the TeV naturally. Because of our novel R-parity assignment, three light neutrinos are Dirac particles with one massless state. Since R-parity is conserved, the lightest neutralino is a prime candidate of the dark matter as usual. In our model, the lightest eigenstate of the mixture of the $B-L$ gaugino and the fermionic component of $Φ$ appears as a new dark matter candidate. We investigate phenomenology of this dark matter particle. We also discuss collider phenomenology of our model. In particular, the $B-L$ gauge boson ($Z'$), once discovered at the Large Hadron Collider, can be a probe to determine the number of (right-handed) Dirac neutrinos with its invisible decay width, in sharp contrast with the conventional $B-L$ extension of the SM or MSSM where the right-handed neutrinos are heavy Majorana particles and decay to the SM leptons. △ Less", "In this paper we propose a scale invariant search strategy for hadronic top or bottom plus missing energy final states. We present a method which shows flat efficiencies and background rejection factors over broad ranges of parameters and masses. The resulting search can be easily recast into a limit on alternative models. We show the strength of the method in a natural SUSY setup where stop and sbottom squarks are pair produced and decay into hadronically decaying top quarks or bottom quarks and higgsinos. △ Less", "For particle physics observables at colliders such as the LHC at CERN, it has been common practice for many decades to estimate the theoretical uncertainty by studying the variations of the predicted cross sections with a priori unpredictable scales. In astroparticle physics, this has so far not been possible, since most of the observables were calculated at Born level only, so that the renormalization scheme and scale dependence could not be studied in a meaningful way. In this paper, we present the first quantitative study of the theoretical uncertainty of the neutralino dark matter relic density from scheme and scale variations. We first explain in detail how the renormalization scale enters the tree-level calculations through coupling constants, masses and mixing angles. We then demonstrate a reduction of the renormalization scale dependence through one-loop SUSY-QCD corrections in many different dark matter annihilation channels and enhanced perturbative stability of a mixed on-shell/$\\bar{\\rm DR}$ renormalization scheme over a pure $\\bar{\\rm DR}$ scheme in the top-quark sector. In the stop-stop annihilation channel, the Sommerfeld enhancement and its scale dependence are shown to be of particular importance. Finally, the impact of our higher-order SUSY-QCD corrections and their scale uncertainties are studied in three typical scenarios of the phenomenological Minimal Supersymmetric Standard Model with eleven parameters (pMSSM-11). We find that the theoretical uncertainty is reduced in many cases and can become comparable to the size of the experimental one in some scenarios. △ Less", "We review results from our frequentist analysis of the parameter space of the pMSSM10, in which the following 10 soft SUSY-breaking parameters are specified independently at the mean scalar top mass scale Msusy = \\sqrt{M_stop1 M_stop2}: the gaugino masses M_{1,2,3}, the 1st-and 2nd-generation squark masses M_squ1 = M_squ2, the third-generation squark mass M_squ3, a common slepton mass M_slep and a common trilinear mixing parameter A, the Higgs mixing parameter mu, the pseudoscalar Higgs mass M_A and tan beta, the ratio of the two Higgs vacuum expectation values. We implemented the LHC searches for strongly- and electroweakly-interacting sparticles and light stops, so as to confront the pMSSM10 parameter space with all relevant SUSY searches. In addition, our analysis includes Higgs mass and rate measurements, SUSY Higgs exclusion bounds, the measurements of \\bmm, other B-physics observables, electroweak precision observables, the cold dark matter density and the searches for spin-independent dark matter scattering, assuming that the cold dark matter is mainly provided by the lightest neutralino. We discuss the discovery potential of future e^+e^- linear colliders, such as ILC and CLIC, in the preferred pMSSM10 parameter space. △ Less", "In supersymmetric models where the superpotential mu term is generated with mu<< m_{soft} (e.g. from radiative Peccei-Quinn symmetry breaking or compactified string models with sequestration and stabilized moduli), and where the string landscape 1. favors soft supersymmetry (SUSY) breaking terms as large as possible and 2. where the anthropic condition that electroweak symmetry is properly broken with a weak scale m_{W,Z,h}~100 GeV ({\\it i.e.} not too weak of weak interactions), then these combined landscape/anthropic requirements act as an attractor pulling the soft SUSY breaking terms towards values required by models with radiatively-driven naturalness: near the line of criticality where electroweak symmetry is barely broken and the Higgs mass is ~125 GeV. The pull on the soft terms serves to ameliorate the SUSY flavor and CP problems. The resulting sparticle mass spectrum may barely be accessible at high-luminosity LHC while the required light higgsinos should be visible at a linear e^+e^- collider with \\sqrt{s}>2m(higgsino). △ Less", "Despite their appealing features, models with gauge-mediated supersymmetry breaking (GMSB) typically present a high degree of fine-tuning, due to the initial absence of the top trilinear scalar couplings, $A_t=0$. In this paper, we carefully evaluate such a tuning, showing that is worse than per mil in the minimal model. Then, we examine some existing proposals to generate $A_t\\neq 0$ term in this context. We find that, although the stops can be made lighter, usually the tuning does not improve (it may be even worse), with some exceptions, which involve the generation of $A_t$ at one loop or tree level. We examine both possibilities and propose a conceptually simplified version of the latter; which is arguably the optimum GMSB setup (with minimal matter content), concerning the fine-tuning issue. The resulting fine-tuning is better than one per mil, still severe but similar to other minimal supersymmetric standard model constructions. We also explore the so-called \"little $A_t^2/m^2$ problem\", i.e. the fact that a large $A_t$-term is normally accompanied by a similar or larger sfermion mass, which typically implies an increase in the fine-tuning. Finally, we find the version of GMSB for which this ratio is optimized, which, nevertheless, does not minimize the fine-tuning. △ Less", "We investigate the possibility that the excess observed in the leptonic-$Z +$jets $+\\slashed{E}_T$ ATLAS SUSY search is due to pair productions of a vector-like quark $U$ decaying to the first-generation quarks and $Z$ boson. We find that the excess can be explained within the 2$σ$ (up to 1.4$σ$) level while evading the constraints from the other LHC searches. The preferred range of the mass and branching ratio are $610 < m_{U} < 760$ GeV and ${\\rm Br}(U \\rightarrow Z q) > 0.3$-$0.45$, respectively. △ Less", "The physics program accessible in $e^+e^-$ collisions at the Future Circular Collider (FCC-ee) is summarized. The FCC-ee aims at collecting multi-ab$^{-1}$ integrated luminosities in $e^+e^-$ at $\\sqrt{s}$ = 90, 160, 240, and 350 GeV, yielding 10$^{12}$ Z bosons, 10$^{8}$ W$^+$W$^-$ pairs, 10$^{6}$ Higgs bosons and $4\\cdot 10^{5}$ top-quark pairs per year. Such huge data samples combined with a $\\cal{O}(100 \\rm keV)$ c.m. energy uncertainty will allow for Standard Model measurements with unparalleled precision and searches for new physics in regions not probed so far. The FCC-ee will be able to (i) indirectly discover new particles coupling to the Higgs and electroweak bosons up to scales $Λ\\approx$ 7 and 100 TeV; (ii) perform competitive SUSY tests at the loop level in regions beyond the LHC reach; and (iii) achieve the best potential in direct collider searches for dark matter and sterile neutrinos with masses below 60 GeV. △ Less", "We present a supersymmetric version of a two-field relaxion model that naturalizes tuned versions of supersymmetry. This arises from a relaxion mechanism that does not depend on QCD dynamics and where the relaxion potential barrier height is controlled by a second axion-like field. During the cosmological evolution, the relaxion rolls with a nonzero value that breaks supersymmetry and scans the soft supersymmetric mass terms. Electroweak symmetry is broken after the soft masses become of order the supersymmetric Higgs mass term and causes the relaxion to stop rolling for superpartner masses up to $\\sim 10^9$ GeV. This can explain the tuning in supersymmetric models, including split-SUSY models, while preserving the QCD axion solution to the strong CP problem. Besides predicting two very weakly-coupled axion-like particles, the supersymmetric spectrum may contain an extra Goldstino, which could be a viable dark matter candidate. △ Less", "The 750 GeV diphoton excess reported by ATLAS and CMS indicates the presence of several pairs of the vector-like matter multiplets around TeV scale. If that is the case, radiative corrections from the $SU(3)$ gauge interaction significantly change from those of MSSM, and the infrared-free nature of the gauge interaction leads to characteristic SUSY mass spectra: a ratio of a squark mass to the gluino mass, and scalar trilinear couplings are enhanced at the low-energy scale. Consequently, even in gaugino mediation models, the Higgs boson mass of 125 GeV is explained with the fairly light gluino of 2-3 TeV, which can be accessible at the LHC. △ Less", "A radiative natural SUSY spectrum are proposed in the deflected anomaly mediation scenario with general messenger-matter interactions. Due to the contributions from the new interactions, positive slepton masses as well as a large |A_t| term can naturally be obtained with either sign of deflection parameter and few messenger species (thus avoid the possible Landau pole problem). In this scenario, in contrast to the ordinary (radiative) natural SUSY scenario with under-abundance of dark matter (DM), the DM can be the mixed bino-higgsino and have the right relic density. The 125 GeV Higgs mass can also be easily obtained in our scenario. The majority of low EW fine tuning points can be covered by the XENON-1T direct detection experiments. △ Less", "We study a variation to the SUSY Left-Right symmetric model based on the gauge group $SU(3)_c\\times SU(2)_L\\times SU(2)_R\\times U(1)_{BL}$. Beyond the quark and lepton superfields we only introduce a second Higgs bidoublet to produce realistic fermion mass matrices. This model does not include any $SU(2)_R$ triplets. We calculate renormalization group evolutions of soft SUSY parameters at the one-loop level down to low energy. We find that an $SU(2)_R$ slepton doublet acquires a negative mass squared at low energies, so that the breaking of $SU(2)_R\\times U(1)_{BL}\\rightarrow U(1)_Y$ is realized by a non-zero vacuum expectation value of a right-handed sneutrino. Small neutrino masses are produced through neutrino mixings with gauginos. Mass limits on the $SU(2)_R\\times U(1)_{BL}$ sector are obtained by direct search results at the LHC as well as lepton-gaugino mixing bounds from the LEP precision data. △ Less", "In this note we revisit the SUSY effects in $R_b$ under current experimental constraints including the LHC Higgs data, the $B$-physics measurements, the dark matter relic density and direct detection limits, as well as the precision electroweak data. We first perform a scan to figure out the currently allowed parameter space and then display the SUSY effects in $R_b$. We find that although the SUSY parameter space has been severely restrained by current experimental data, both the general MSSM and the natural-SUSY scenario can still alter $R_b$ with a magnitude sizable enough to be observed at future $Z$-factories (ILC, CEPC, FCC-ee, Super $Z$-factory) which produce $10^9-10^{12}$ $Z$-bosons. To be specific, assuming a precise measurement $δR_b = 2.0 \\times 10^{-5}$ at FCC-ee, we can probe a right-handed stop up to 530 GeV through chargino-stop loops, probe a sbottom to 850 GeV through neutralino-sbottom loops and a charged Higgs to 770 GeV through the Higgs-top quark loops for a large $\\text{tan}β$. The full one-loop SUSY correction to $R_b$ can reach $1 \\times 10^{-4}$ in natural SUSY and $2 \\times 10^{-4}$ in the general MSSM. △ Less", "To explain quark and lepton masses and mixing angles, one has to extend the standard model, and the usual practice is to put the quarks and leptons into irreducible representations of discrete groups. We argue that discrete flavor symmetries (and their concomitant problems) can be avoided if we extend the gauge group. In the framework of SU(12) we give explicit examples of models having varying degrees of predictability obtained by scanning over groups and representations and identifying cases with operators contributing to mass and mixing matrices that need little fine- tuning of prefactors. Fitting with quark and lepton masses run to the GUT scale and known mixing angles allows us to make predictions for the neutrino masses and hierarchy, the octant of the atmospheric mixing angle, leptonic CP violation, Majorana phases, and the effective mass observed in neutrinoless double beta decay. △ Less", "Compared with the MSSM or the NMSSM with a low λ, λ-SUSY theory with a large λaround one has been deemed as a most natural realization of NMSSM. In this work, we treat the next-to-lightest CP-even Higgs boson as the SM-like Higgs boson in λ-SUSY and study the properties of the Higgs bosons and the pair production of the SM-like Higgs boson by considering various experiment constraints. We find that naturalness plays an important role in selecting the parameter space of λ-SUSY. In the most natural region of parameter space, the triple self coupling of the SM-like Higgs boson compared with its SM prediction may get enhanced by a factor about 7, and the most dominant contribution to the Higgs pair production comes from the triple self coupling of the SM-like Higgs boson and the production rate can be greatly enhanced, maximally 10 times larger than the SM prediction. △ Less", "This work presents a complete analysis of fermion fitting and proton decay in a SUSY $SO(10)$ model previously suggested by Dutta, Mimura, and Mohapatra. A key question in any grand unified theory is whether it satisfies the experimental lower limits on proton partial lifetimes. In generic models, substantial fine-tuning is required among GUT-scale parameters to satisfy the limits. In the proposed model, the ${\\bf 10}$, $\\overline{\\bf{126}}$, and ${\\bf 120}$ Yukawa couplings contributing to fermion masses have restricted textures intended to give favorable results for proton lifetime, while still giving rise to a realistic fermion sector, without the need for fine-tuning, even for large $\\tanβ$, and for either type-I or type-II dominance in the neutrino mass matrix. In this thesis, I investigate the above hypothesis at a strict numerical level of scrutiny; I obtain a valid fit for the entire fermion sector for both types of seesaw dominance, including $θ_{13}$ in good agreement with the most recent data. For the case with type-II seesaw, I find that, using the Yukawa couplings fixed by the successful fermion sector fit, proton partial lifetime limits are readily satisfied for all but one of the pertinent decay modes for nearly arbitrary values of the triplet-Higgs mixing parameters, with the $K^+ \\barν$ mode requiring a ${\\cal O}(10^{-1})$ cancellation in order to satisfy its limit. I also find a maximum partial lifetime for that mode of $τ(K^+ \\barν) \\sim 10^{36}\\,$years. For the type-I seesaw case, I find that $K^+ \\barν$ decay mode is satisfied for any values of the triplet mixing parameters giving no major enhancement, and all other modes are easily satisfied for arbitrary mixing values; I also find a maximum partial lifetime for $K^+ \\barν$ of nearly $10^{38}\\,$years, which is sub-dominant to gauge boson decay channels. △ Less", "In this letter we study the Higgs mass in the NMSSM with supersymmetry breaking at high scales $M_{SS}$. With the Standard Model as the effective low energy theory, the computation of the Higgs mass relies on the matching condition of the quartic coupling $λ$ at $M_{SS}$. In the MSSM, the latter is fixed to a semi-positive value and, thus, sets an upper bound on the SUSY-breaking scale near $M_{SS}\\simeq 10^{10}\\text{GeV}$. In the NMSSM, $λ(M_{SS})$ receives an additional contribution induced by the singlet which allows for negative values of $λ(M_{SS})$. In turn, for the measured value of the Higgs mass we find that $M_{SS}$ can take any value up to the GUT scale. Furthermore, the choice of universal soft terms favors SUSY-breaking scales close to the GUT scale. △ Less", "We present a modified Altarelli and Feruglio $A_4$ model where an additional $A_4$ singlet-prime flavon is introduced. In this model, non-zero $θ_{13}$ is given by this additional $A_4$ singlet-prime flavon which breaks tri-bimaximal mixing. In the framework of the supersymmetry with $U(1)_R$ symmetry, we obtain vacuum expectation values (VEVs) and VEV alignments of flavons through driving fields. It is considered that flavon induces distinctive flavor violating process if flavon mass is light. Assuming mass of SUSY particles are sufficiently heavy so that the SUSY contributions can be negligible, we discuss the flavor violating Yukawa interaction through flavon exchange in the charged lepton sector. According to the potential analysis, the VEV of flavon breaks $A_4$ down to $Z_3$ in the charged lepton sector and relation among flavon masses is determined. Thanks for the residual $Z_3$ symmetry, many lepton flavor violating decay modes are forbidden except for $τ\\rightarrow μμ\\bar{e}$ and $τ\\rightarrow e e \\barμ$. A mass limit of the flavon from these three-body decay modes is $60$~GeV taking into account the current experimental lower bounds at the Belle experiment. In our model, we predict a ratio of the branching ratios $τ\\rightarrow μμ\\bar{e}$ and $τ\\rightarrow e e \\barμ$ by using known charged lepton masses. We also find that the production cross section for the flavon can be $\\mathcal{O}(1)$ fb. Thus the flavon would be found at the LHC run 2 by searching for 4-tau lepton signal. △ Less", "We discuss resonant squark production at the LHC via baryonic $R$-parity violating interactions. The cross section easily exceeds pair-production and a new set of signatures can be used to probe squarks, particularly stops. These include dijet resonances, same-sign top quarks and four-jet resonances with large $b$-jet multiplicities, as well as the possibility of displaced neutralino decays. We use publicly available searches at $\\sqrt{s}=8$ TeV and first results from collisions at $\\sqrt{s}=13$ TeV to set upper limits on $R$-parity violating couplings, with particular focus on simplified models with light stops and neutralinos. The exclusion reach of these signatures is comparable to $R$-parity-conserving searches, $m_{\\tilde t}\\simeq 500-700$ GeV. In addition, we find that O(1) couplings involving the stop can be excluded well into the multi-TeV range, and stress that new searches for single- and pair-produced four-jet resonances will be necessary to exclude sub-TeV stops for a natural SUSY spectrum with light higgsinos. △ Less", "Supersymmetry (SUSY) is a theory that gives an explanation for the strong and electroweak interactions from the grand unification scale down to the weak scale. The search for supersymmetric particles still continues at full speed at the LHC without success. The main tasks at the ILC is complementing the LHC result and also search for new physics. In this study, the neutralino pair production via photon-photon collision is studied for the $\\tilde{t}$-coannihilation scenario in the context of MSSM at the ILC. In the calculation, all the possible one-loop diagrams are taken into account for the photon-photon interaction. We present the production cross section and distribution of various observables for the lightest and next-to-lightest neutralino pairs for benchmark models which are specifically presented in the light of LHC8 data analysis, employing these benchmark models for neutralino pair production could show the potential of the ILC concerning the dark matter searches in supersymmetry. △ Less", "We use the Higgs coupling and the muon anomalous magnetic moment measurements to constrain the parameter space of the natural supersymmetry (SUSY) in the Generalized Minimal Supergravity (GmSUGRA) model. We scan the parameter space of the GmSUGRA model with small electroweak fine-tuning measure ($Δ_{\\rm EW} \\leq 100$). The parameter space after applying various sparticle mass bounds, Higgs mass bounds, B-physics bounds, the muon magnetic moment constraint, and the Higgs coupling constraint from measurements at HL-LHC, ILC, and CEPC, is shown in the planes of various interesting model parameters and sparticle masses. Our study indicates that the Higgs coupling and muon anomalous magnetic moment measurements can constrain the parameter space effectively. It is shown that $Δ_{\\rm EW}\\sim$ 30, consistence with all constraints, and having supersymmetric contributions to the muon anomalous magnetic moment within 1$σ$ can be achieved. The precision of $k_b$ and $k_τ$ measurements at CEPC can bound $m_A$ to be above 1.2 TeV and 1.1 TeV respectively. The combination of the Higgs coupling measurement and muon anomalous magnetic moment measurement constrain $\\tilde{e}_R$ mass to be in the range from 0.6 TeV to 2 TeV. The range of both $\\tilde{e}_L$ and $\\tildeν_e$ masses is 0.4 TeV $\\sim$ 1.2 TeV. In all cases, the $\\tildeχ_1^0$ mass needs to be small (mostly $\\leq$ 400 GeV). The comparison of bounds in the $\\tanβ- m_A$ plane shows that the Higgs coupling measurement is complementary to the direct collider searches for heavy Higgs when constraining the natural SUSY. A few mass spectra in the typical region of parameter space after applying all constraints are shown as well. △ Less", "We discuss the characteristic low energy phenomenological implications of an SU(5) Supersymmetric Grand Unified Theory (SUSY GUT) whose flavour structure is controlled by the family symmetry S4 x U(1), which provides a good description of all quark and lepton masses, mixings as well as CP violation. Although the model closely mimics Minimal Flavour Violation (MFV) as shown in arXiv:1511.07886, here we focus on the differences. We first present numerical estimates of the low energy mass insertion parameters, including canonical normalisation and renormalisation group running, for well-defined ranges of SUSY parameters and compare the naive model expectations to the numerical scans and the experimental bounds. Our results are then used to estimate the model-specific predictions for Electric Dipole Moments (EDMs), Lepton Flavour Violation (LFV), B and K meson mixing as well as rare B decays. The largest observable deviations from MFV come from the LFV process mu --> e gamma and the electron EDM. △ Less", "The decay of top-quark to light quarks and Higgs boson is an extremely rare process in the Standard Model (SM) framework. Any measurable signal for this process at the LHC is a smoking gun for new physics. In the framework of Minimal Supersymmetric Standard Model (MSSM) there is a possibility that the branching ratio for this process to reach values several orders of magnitude larger than the corresponding of SM. Having as a primary goal the search of Flavour Changing Neutral Currents (FCNC) processes that could be measurable at current or future LHC runing, we present a calculation in the framework of R-parity conserving MSSM for the decay of top quark to light quarks and the Higgs boson. Considering different constraints, and carefully looking at the cancellations that occur between different contributions, we deduce that there are two possible enhanced scenarios for this process: the first arises from the holomorphic SUSY breaking terms containing right handed up squark mass insertions and the second comes from the dominance of non-holomorphic SUSY breaking terms in combination with a light Higgs boson sector. △ Less", "We explore the relic density of dark matter and the particle spectrum within a constrained version of an $E_6$ inspired SUSY model with an extra $U(1)_N$ gauge symmetry. In this model a single exact custodial symmetry forbids tree-level flavor-changing transitions and the most dangerous baryon and lepton number violating operators. We present a set of benchmark points showing scenarios that have a SM-like Higgs mass of 125 GeV and sparticle masses above the LHC limits. They lead to striking new physics signatures which may be observed during run II of the LHC and can distinguish this model from the simplest SUSY extensions of the SM. At the same time these benchmark scenarios are consistent with the measured dark matter abundance and necessarily lead to large dark matter direct detection cross sections close to current limits and observable soon at the XENON1T experiment. △ Less", "We propose to interpret the 750 GeV diphoton excess in deflected anomaly mediation supersymmetry breaking scenarios, which can naturally predict couplings between a singlet field and vector-like messengers. The CP-even scalar component (S) of the singlet field can serve as the 750 GeV resonance. The messenger scale, which is of order the gravitino scale, can be as light as F_φ\\sim {\\cal O}(10) TeV when the messenger species N_F and the deflection parameter d are moderately large. Such messengers can induce the large loop decay process S \\to γγ. Our results show that such a scenario can successfully accommodate the 125 GeV Higgs boson, the 750 GeV diphoton excess and the muon g-2 without conflicting with the LHC constraints. We also comment on the possible explanations in the gauge mediation supersymmetry breaking scenario. △ Less", "We propose that the sbino, the scalar partner of a Dirac bino can explain the 750 GeV diphoton excess observed by ATLAS and CMS . We analyze a model in which the sbino couples to pairs of Standard Model (SM) gauge bosons. We analyze an effective operator model, as well as a completion in which the sbino couples to pairs of gauge bosons through loops of heavy sfermions. We find that the sbino may be given an appreciable decay width through tree level coupling in the Higgs or Higgsino sector and additionally fit the 750 GeV excess by considering gluon fusion processes with decay to diphotons. △ Less", "We consider the immediate or near-term experimental opportunities offered by some scenarios that could explain the new diphoton excess at the LHC. If the excess is due to a new particle $X_s$ at 750 GeV, additional new particles are required, providing further signals. If connected with naturalness, the $X_s$ may be produced in top partner decays. Then a $t'\\bar t'$ signal, with $t'\\to t X_s$ and $X_s\\to gg$ dominantly, might be discovered by reinterpreting 13 TeV SUSY searches in multijet events with low MET and/or a lepton. If $X_s$ is a bound state of quirks, the signal events may be accompanied by an unusual number of soft tracks or soft jets. Other resonances including dilepton and photon+jet as well as dijet may lie at or above this mass, and signatures of hidden glueballs might also be observable. If the \"photons\" in the excess are actually long-lived particles decaying to photon pairs or to electron pairs, there are opportunities for detecting overlapping photons and/or unusual patterns of apparent photon-conversions in either $X_s$ or 125 GeV Higgs decays. There is also the possibility of events with a hard \"photon\" recoiling against a narrow isolated HCAL-only \"jet\", which, after the jet's energy is corrected for its electromagnetic origin, would show a peak at 750 GeV. △ Less", "Theories with approximate no-scale structure, such as the Large Volume Scenario, have a distinctive hierarchy of multiple mass scales in between TeV gaugino masses and the Planck scale, which we call SUSY's Ladder. This is a particular realization of Split Supersymmetry in which the same small parameter suppresses gaugino masses relative to scalar soft masses, scalar soft masses relative to the gravitino mass, and the UV cutoff or string scale relative to the Planck scale. This scenario has many phenomenologically interesting properties, and can avoid dangers including the gravitino problem, flavor problems, and the moduli-induced LSP problem that plague other supersymmetric theories. We study SUSY's Ladder using a superspace formalism that makes the mysterious cancelations in previous computations manifest. This opens the possibility of a consistent effective field theory understanding of the phenomenology of these scenarios, based on power-counting in the small ratio of string to Planck scales. We also show that four-dimensional theories with approximate no-scale structure enforced by a single volume modulus arise only from two special higher-dimensional theories: five-dimensional supergravity and ten-dimensional type IIB supergravity. This gives a phenomenological argument in favor of ten dimensional ultraviolet physics which is different from standard arguments based on the consistency of superstring theory. △ Less", "We study a singlet extension of the minimal $U(1)_R$ symmetric model, which shares nice properties of Dirac gauginos and $R$-symmetric Higgs sector. At the same time, a superpotential coupling of $R$-charged singlet to the Higgs doublets can give a substantial contribution to the Higgs boson mass. We show that the 125 GeV Higgs boson is consistent with perturbative unification, even if the SUSY scale is as low as 1 TeV and if the $D$-term Higgs potential is suppressed as is often the case in Dirac gauginos. The model also contains a light scalar and fermion, pseudo-moduli and pseudo-Goldstino: The former gets a mass mainly from SUSY breaking soft terms, in addition to a small explicit $R$-symmetry breaking for the latter. We examine how the Higgs mass and width are affected by these light degrees of freedom. Specifically we find thatdepending on parameters of $R$-charged Higgses, the pseudo-moduli lighter than a half of the SM-Higgs boson mass is still allowed by the constraints from invisible decays of the $Z$ and Higgs bosons. We also find that such a light scalar can reduce the Higgs boson mass, at most by a few percents. △ Less", "We propose a new framework of low-scale gauge-mediated supersymmetry (SUSY) breaking with a gravitino mass of O(100) TeV. The usual 4D gauge mediation models predict a light gravitino and suffer from cosmological problems. In our framework, a heavy gravitino in gauge mediation is realized with a flat extra-dimension, whose compactification scale is around the grand unified theory scale. Superparticle masses of the visible sector from gravity/anomaly mediation are suppressed, and they are purely generated by usual gauge mediation on the visible brane. Importantly, the Higgs Bmu-term vanishes at the leading order, which enables us to obtain the suitable mu-Bmu relation for the electroweak symmetry breaking. We discuss such models considering two possibilities of the SUSY breaking source: 1) Scherk-Schwarz SUSY breaking which we call Scherk-Schwarz Gauge Mediation and 2) gravitational SUSY breaking localized on a hidden brane. In the case 2), the cosmological moduli problem may be relaxed as well. △ Less", "We study the bosonic structure of $F$-term Nambu-Goto cosmic strings forming in a realistic SO(10) implementation, assuming standard hybrid inflation. We describe the supersymmetric grand unified theory, and its spontaneous symmetry breaking scheme in parallel with the inflationary process. We also write the explicit tensor formulation of its scalar sector, focusing on the sub-representations singlet under the standard model, which is sufficient to describe the string structure. We then introduce an ansatz for abelian cosmic strings, discussing in details the hypothesis, and write down the field equations and boundary conditions. Finally, after doing a perturbative study of the model, we present and discuss the results obtained with numerical solutions of the string structure. △ Less", "In this work we analyze the possibility to explain the muon anomalous magnetic moment discrepancy within theory and experiment through lepton flavor violation processes. We propose a flavor extended MSSM by considering a hierarchical family structure for the trilinear scalar Soft-Supersymmetric terms of the Lagranagian, present at the SUSY breaking scale. We obtain analytical results for the rotation mass matrix, with the consequence of having non-universal slepton masses and the possibility of leptonic flavour mixing. The one-loop supersymmetric contributions to the leptonic flavour violating process $τ\\to μγ$ are calculated in the physical basis, with slepton flavour mixed states, instead of using the well known Mass Insertion Method. We present the regions in parameter space where the muon g-2 problem is either entirely solved or partially reduced through the contribution of these flavor violating processes. △ Less", "We propose a renormalisable model based on $Δ(27)$ family symmetry with an $SO(10)$ grand unified theory (GUT) leading to a novel form of spontaneous geometrical CP violation. The symmetries, including $Δ(27)$ and $\\mathbb{Z}_{9} \\times \\mathbb{Z}_{12} \\times \\mathbb{Z}_{4}^{R}$, are broken close to the GUT breaking scale to yield the minimal supersymmetric standard model (MSSM) with the standard R-parity. $SO(10)$ is broken via $SU(5)$ with doublet-triplet splitting achieved by a version of the Dimopoulos-Wilczek (missing VEV) mechanism. Low-scale Yukawa structure is dictated by the coupling of matter to $ Δ(27) $ antitriplets $ \\barφ $ whose VEVs are aligned in the CSD3 directions by the superpotential. Light physical Majorana neutrinos masses emerge from a specific implementation of the seesaw mechanism within $SO(10)$. The model predicts a normal neutrino mass hierarchy with the best-fit lightest neutrino mass $ m_1 = 0.13 $ meV and the PMNS mixing parameters $θ^l_{13} \\approx 8.35^{\\circ}$, $θ^l_{12}\\approx 34^{\\circ}$, $θ^l_{23}\\approx 43^{\\circ}$ and an oscillation phase $δ^l\\approx -90^{\\circ}$. △ Less", "We study the effective field theory of KKLT and LVS moduli stabilisation scenarios coupled to an anti-D3-brane at the tip of a warped throat. We describe the presence of the anti-brane in terms of a nilpotent goldstino superfield in a supersymmetric effective field theory. The introduction of this superfield produces a term that can lead to a de Sitter minimum. We fix the Kaehler moduli dependence of the nilpotent field couplings by matching this term with the anti-D3-brane uplifting contribution. The main result of this paper is the computation, within this EFT, of the soft supersymmetry breaking terms in both KKLT and LVS for matter living on D3-brane (leaving the D7-brane analysis to an appendix). A handful of distinct phenomenological scenarios emerge that could have low energy implications, most of them having a split spectrum of soft masses. Some cosmological and phenomenological properties of these models are discussed. We also check that the attraction between the D3-brane and the anti-D3-brane does not affect the leading contribution to the soft masses and does not destabilise the system. △ Less", "We show how approximate Minimal Flavour Violation (MFV) can emerge from an SU(5) Supersymmetric Grand Unified Theory (SUSY GUT) supplemented by an S4 x U(1) family symmetry, which provides a good description of all quark and lepton (including neutrino) masses, mixings and CP violation. Assuming a SUSY breaking mechanism which respects the family symmetry, we calculate in full explicit detail the low energy mass insertion parameters in the super-CKM basis, including the effects of canonical normalisation and renormalisation group running. We find that the very simple family symmetry S4 x U(1) is sufficient to approximately reproduce the effects of low energy MFV. △ Less", "Top squark (stop) plays a key role in the radiative stability of the Higgs boson mass in supersymmetry (SUSY). The LHC searches for stop have made a great progress and tightly constrained the stop mass during Run-1. In this work, we use the LHC Run-1 data to determine the lower mass limit of the right-handed stop in a natural SUSY scenario, where the higgsinos $\\tildeχ^0_{1,2}$ and $\\tildeχ^\\pm_{1}$ are light and nearly degenerate. We find that the stop mass has been excluded up to 430 GeV for $m_{\\tildeχ^0_1} \\lesssim 250$ GeV and to 540 GeV for $m_{\\tildeχ^0_1} \\simeq 100$ GeV by the Run-1 SUSY searches for $2b+E^{miss}_T$ and $1\\ell+jets+E^{miss}_T$, respectively. In a small strip of parameter space with $m_{\\tildeχ^0_1} \\gtrsim 190$ GeV, the stop mass can still be as light as 210 GeV and compatible with the Higgs mass measurement and the monojet bound. The 14 TeV LHC with a luminosity of 20 fb$^{-1}$ can further cover such a light stop window by monojet and $2b+E^{miss}_T$ searches and push the lower bound of the stop mass to 710 GeV. We also explore the potential to use the Higgs golden ratio, $D_{γγ}=σ(pp \\to h \\to γγ)/σ(pp \\to h \\to ZZ^* \\to4\\ell^\\pm)$, as a complementary probe for the light and compressed stop. If this golden ratio can be measured at percent level at the high luminosity LHC (HL-LHC) or future $e^+e^-$ colliders, the light stop can be excluded for most of the currently allowed parameter region. △ Less", "We propose a framework of supersymmetric extensions of the Standard Model that can ameliorate both the SUSY Higgs mass problem and the missing superpartner problem. New vectorlike matter fields couple to the Higgs and provide new loop contributions to its mass. New Yukawa couplings are sizable and large supersymmetry breaking is not needed to lift the Higgs mass. To avoid a Landau pole for the new Yukawa couplings, these fields are charged under a new gauge group, which confines and leads to a Hidden Valley-like phenomenology. The Hidden Valley sector is almost supersymmetric and ordinary sparticles decay to exotic new states which decay back to Standard Model particles and gravitinos with reduced missing energy. We construct a simplified model to simulate this scenario and find a viable parameter space of specific benchmark models which ameliorates both of the major phenomenological problems with supersymmetry. △ Less", "We discuss a scheme to implement the relaxion solution to the hierarchy problem with multiple axions, and present a UV-completed model realizing the scheme. All of the $N$ axions in our model are periodic with a similar decay constant $f$ well below the Planck scale. In the limit $N\\gg 1$, the relaxion $φ$ corresponds to an exponentially long multi-helical flat direction which is shaped by a series of mass mixing between nearby axions in the compact field space of $N$ axions. With the length of flat direction given by $Δφ=2πf_{\\rm eff} \\sim e^{ξN} f$ for $ξ={\\cal O}(1)$, both the scalar potential driving the evolution of $φ$ during the inflationary epoch and the $φ$-dependent Higgs boson mass vary with an exponentially large periodicity of ${\\cal O}(f_{\\rm eff})$, while the back reaction potential stabilizing the relaxion has a periodicity of ${\\cal O}( f)$. A natural UV completion of our scheme can be found in high scale or (mini) split supersymmetry (SUSY) scenario with the axion scales generated by SUSY breaking as $f\\sim \\sqrt{m_{\\rm SUSY}M_*}$, where the soft SUSY breaking scalar mass $m_{\\rm SUSY}$ can be well above the weak scale, and the fundamental scale $M_*$ can be identified as the Planck scale or the GUT scale. △ Less", "We investigate the sensitivity of the next generation of flavor-based low-energy experiments to probe the supersymmetric parameter space in the context of the phenomenological MSSM (pMSSM), and examine the complementarity with direct searches for Supersymmetry at the 13 TeV LHC in a quantitative manner. To this end, we enlarge the previously studied pMSSM parameter space to include all physical non-zero CP-violating phases, namely those associated with the gaugino mass parameters, Higgsino mass parameter, and the tri-linear couplings of the top quark, bottom quark and tau lepton. We find that future electric dipole moment and flavor measurements can have a strong impact on the viability of these models even if the sparticle spectrum is out of reach of the 13 TeV LHC. In particular, the lack of positive signals in future low-energy probes would exclude values of the phases between ${\\cal O}(10^{-2})$ and ${\\cal O}(10^{-1})$. We also find regions of parameter space where large phases remain allowed due to cancellations. Most interestingly, in some rare processes, such as BR($B_s \\to μ^+ μ^-$ ), we find that contributions arising from CP-violating phases can bring the potentially large SUSY contributions into better agreement with experiment and Standard Model predictions. △ Less", "In this paper we study the lepton favor violating decay channels of the neutral Higgs bosons of the Minimal Supersymmetric Standard Model into a lepton and an anti-lepton of different flavor. We work in the context of the most general flavor mixing scenario in the slepton sector, in contrast to the minimal flavor violation assumption more frequently used. Our analytic computation is a one-loop diagrammatic one, but in contrast to the full one-loop computation which is usually referred to the physical slepton mass basis, we use here instead the Mass Insertion Approximation (MIA) which uses the electroweak interaction slepton basis and treats perturbatively the mass insertions changing slepton flavor. By performing an expansion in powers of the external momenta in the relevant form factors, we will be able to separate explicitly in the analytic results the leading non-decoupling (constant at asymptotically large sparticle masses) and the next to leading decoupling contributions (decreasing with the sparticle masses). Our final aim is to provide a set of simple analytic formulas for the form factors and the associated effective vertices, that we think may be very useful for future phenomenological studies of the lepton flavor violating Higgs boson decays, and for their comparison with data. The accuracy of the numerical results obtained with the MIA are also analyzed and discussed here in comparison with the full one-loop results. Our most optimistic numerical estimates for the three neutral Higgs boson decays channels into $τ$ and $μ$ leptons, searching for their maximum rates that are allowed by present constraints from $τ\\to μγ$ data and beyond Standard Model Higgs boson searches at the LHC, are also included. △ Less", "New light bosons that couple weakly to the standard model (SM) particles are predicted in various extensions of the standard model (BSM). Examples include supersymmetric (SUSY) theories with extended Higgs sectors or with a hidden valleys (dark SUSY). In these models the light bosons can be produced directly in the decay of a Higgs boson, or as part of the decay chain of SUSY particles. Depending on the branching fraction, the exotic decays of the SM-Higgs can be undetected in standard analysis techniques or due to its modified production cross section of the Higgs bosons at the LHC. Therefore, direct searches for non-SM decays of the Higgs boson are the fastest way to understand the nature of the Higgs boson. Either it will confirm its SM character, or it will rule out a whole array of BSM scenarios. We present status of the search at CMS for non-SM Higgs boson decays in events with displaced muon-jets. △ Less", "Supersymmetric Standard Models (SSMs) with Dirac gauginos have the appealing supersoft property that they only cause finite contributions to scalar masses. Considering gauge mediated SUSY breaking with conformal sequestering and assuming there is one and only one fundamental parameter with dimension mass arising from supersymmetry breaking, we find a cancellation between the dominant terms that contribute to the EWFT. The resulting EWFT measure can be of order one even for supersymmetric particle masses and $μ$-terms in the TeV range. △ Less", "We suggest a natural split mechanism for sfermions based on $N$=2 supersymmetry (SUSY). $N$=2 SUSY protects a sfermion in an $N$=2 multiplet from gaining weight by SUSY breaking. Therefore, if partly $N$=2 SUSY is effectively obtained, a split spectrum can be realized naturally. As an example of the natural split mechanism, we build a gauge-mediated SUSY breaking-like model assuming $N$=2 SUSY is partly broken in a UV theory. The model explains the Higgs boson mass and the muon anomalous magnetic dipole moment within $1~σ$ level with a splitting sfermion spectrum. The model has seven light sparticles described by three free parameters and predicts a new chiral multiplet, sb: the $N$=2 partner of the ${\\rm U(1)_Y}$ vector multiplet. The bini, the fermion component of the sb, weighs MeVs. We mention the experimental and the cosmological aspects of the model. △ Less", "While it is often stated that the notion of electroweak (EW) naturalness in supersymmetric models is subjective, fuzzy and model-dependent, here we argue the contrary: electroweak naturalness can be elevated to a {\\it principle} which is both objective and predictive. We demonstrate visually when too much fine-tuning sets in at the electroweak scale which corresponds numerically to the measure Δ_{BG}~Δ_{EW}> 30. While many constrained SUSY models are already excluded by this value, we derive updated upper bounds on sparticle masses within the two-extra parameter non-universal Higgs model (NUHM2). We confirm the classic Barbieri-Giudice (BG) result that Δ_{BG}<30 implies mu <350 GeV. However, by combining dependent soft terms which appear as multiples of m_{3/2} in supergravity models, then we obtain m(gluino)< 4 TeV as opposed to the BG result that m(gluino)<350 GeV. We compare the NUHM2 results to a similar scan in the pMSSM with 19 weak scale parameters. In the pMSSM with complete one-loop scalar potential plus dominant two-loop terms, then a m(gluino)<7 TeV bound is found. Our tabulation of upper bounds provides a target for experimenters seeking to discover or else falsify the existence of weak scale supersymmetry. In an Appendix, we show contributions to the naturalness measure from one-loop contributions to the weak scale scalar potential. △ Less", "Simplified models are a successful way of interpreting current LHC searches for models beyond the standard model (BSM). So far simplified models have focused on topologies featuring a missing transverse energy (MET) signature. However, in some BSM theories other, more exotic, signatures occur. If a charged particle becomes long-lived on collider time scales - as it is the case in parts of the SUSY parameter space - it leads to a very distinct signature. We present an extension of the computer package SModelS which includes simplified models for heavy stable charged particles (HSCP). As a physical application we investigate the CMSSM stau co-annihilation strip containing long-lived staus, which presents a potential solution to the Lithium problem. Applying both MET and HSCP constraints we show that, for low values of $\\tanβ$, all this region of parameter space either violates Dark Matter constraints or is excluded by LHC searches. △ Less", "Supersymmetric $SO(10)$ grand unified models with renormalizable Yukawa couplings involving only ${\\bf 10}$ and $\\overline{\\bf 126}$ Higgs fields have been shown to realize the fermion masses and mixings economically. In previous works, the sum rule of the fermion mass matrices are given by inputting the quark matrices, and the neutrino mixings are predicted in this framework. Now the three neutrino mixings have been measured, and in this paper, we give the sum rule by inputting the lepton mass matrices, which makes clear certain features of the solution, especially if the vacuum expectation values of ${\\bf 126}+ \\overline{\\bf126}$ ($v_R$) are large and the right-handed neutrinos are heavy. We perform the $χ^2$ analyses to fit the fermion masses and mixings using the sum rule. In previous works, the best fit appears at $v_R \\sim 10^{13}$ GeV, and the fit at the large $v_R$ scale ($\\sim 10^{16}$ GeV) has been less investigated. Our expression of the sum rule has a benefit to understand the flavor structure in the large $v_R$ solution. Using the fit results, we perform the calculation of the $μ\\to eγ$ process and the electric dipole moment of electron, and the importance of $v_R$ dependence emerges in low energy phenomena. We also show the prediction of the CP phase in the neutrino oscillations, which can be tested in the near future. △ Less", "Folded supersymmetry (f-SUSY) stabilizes the weak scale against radiative corrections from the top sector via scalar partners whose gauge quantum numbers differ from their Standard Model counterparts. This non-trivial pairing of states can be realized in extra-dimensional theories with appropriate supersymmetry-breaking boundary conditions. We present a class of calculable f-SUSY models that are parametrized by a non-trivial twist in 5D boundary conditions and can accommodate the observed Higgs mass and couplings. Although the distinctive phenomenology associated with the novel folded states should provide strong evidence for this mechanism, the most stringent constraints are currently placed by conventional supersymmetry searches. These models remain minimally fine-tuned in light of LHC8 data and provide a range of both standard and exotic signatures accessible at LHC13. △ Less", "In this article we study the full one-loop SUSY contributions to the lepton flavor violating Higgs decay $h \\to τ\\bar μ$, within the context of the supersymmetric inverse sesaw model. We assume that both the right-handed neutrino masses, $M_R$, and their supersymmetric partner masses, $m_{\\tilde ν_R}$, are not far from the interesting ${\\cal O}({\\rm TeV})$ energy scale, and we work with scenarios with large neutrino Yukawa couplings that transmit large lepton flavor violating effects. By exploring the behavior with the most relevant parameters, mainly $M_R$, $m_{\\tilde ν_R}$ and the trilinear sneutrino coupling $A_ν$, we will look for regions of the parameter space where the enhancement of $\\mathrm{BR}(h\\rightarrow τ\\bar μ)$ is large enough to reach values at the percent level, which could explain the excess recently reported by CMS and ATLAS at the CERN Large Hadron Collider. △ Less", "We propose a scenario of brane cosmology in which the Peccei-Quinn field plays the role of the inflaton and solves simultaneously many cosmological and phenomenological issues such as the generation of a heavy Majorana mass for the right-handed neutrinos needed for seesaw mechanism, MSSM $μ$-parameter, the right amount of baryon number asymmetry and dark matter relic density at the present universe, together with an axion solution to the strong CP problem without the domain wall obstacle. Interestingly, the scales of the soft SUSY-breaking mass parameter and that of the breaking of $U(1)_{\\rm PQ}$ symmetry are lower bounded at $\\mathcal{O}(10) {\\mathrm TeV}$ and $\\mathcal{O}(10^{11}) {\\mathrm GeV}$, respectively. △ Less", "The physics beyond the Standard Model with parameters of the compressed spectrum is well motivated both in a theory side and with phenomenological reasons, especially related to dark matter phenomenology. In this letter, we propose a method to tag soft final state particles from a decaying process of a new particle in this parameter space. By taking a supersymmetric gluino search as an example, we demonstrate how the Large Hadron Collider experimental collaborations can improve a sensitivity in these non-trivial search regions. △ Less", "In the search for bottom squark (sbottom) in SUSY at the LHC, the common practice has been to assume a $100\\%$ decay branching fraction for a given search channel. In realistic MSSM scenarios, there are often more than one significant decay modes to be present, which significantly weaken the current sbottom search limits at the LHC. On the other hand, the combination of the multiple decay modes offers alternative discovery channels for sbottom searches. In this paper, we present the sbottom decays in a few representative mass parameter scenarios. We then analyze the sbottom signal for the pair production in QCD with one sbottom decaying via $\\tilde{b}\\rightarrow b χ_1^0,\\ b χ_2^0$, and the other one decaying via $\\tilde{b} \\rightarrow t χ_1^\\pm$. With the gaugino subsequent decaying to gauge bosons or a Higgs boson $χ_2^0 \\rightarrow Z χ_1^0,\\ h χ_1^0$ and $χ_1^\\pm \\rightarrow W^\\pm χ_1^0$, we study the reach of those signals at the 14 TeV LHC with 300 ${\\rm fb^{-1}}$ integrated luminosity. For a left-handed bottom squark, we find that a mass up to 920 GeV can be discovered at 5$σ$ significance for 250 GeV $< m_{χ_1^0} <$ 350 GeV, or excluded up to 1050 GeV at the 95\\% confidence level for the $h$ channel ($μ>0$); similarly, it can be discovered up to 840 GeV, or excluded up to 900 GeV at the 95\\% confidence level for the $Z$ channel ($μ<0$). The sbottom and stop signals in the same SUSY parameter scenario are combined to obtain the optimal sensitivity, which is about 150 GeV better than the individual reach of the sbottom or stop. For a right-handed bottom squark with $\\tilde{b} \\tilde{b}^* \\rightarrow b χ_1^0,\\ t χ_1^\\pm$ channel, we find that the sbottom mass up to 880 GeV can be discovered at 5$σ$ significance, or excluded up to 1060 GeV at the 95\\% confidence level. △ Less", "Solutions to the hierarchy problem usually require top partners. In standard SUSY or composite Higgs theories, the partners carry SM color and are becoming increasingly constrained by LHC searches. However, theories like Folded SUSY (FS), Twin Higgs (TH) and Quirky Little Higgs (QLH) introduce uncolored top partners, which can be SM singlets or carry electroweak charge. Their small production cross section left doubt as to whether the LHC can effectively probe such scenarios. Typically, these partners are charged under their own mirror color gauge group. In FS and QLH, the absence of light mirror matter allows glueballs to form at the bottom of the mirror spectrum. This is also the case in some TH realizations. The Higgs can decay to these mirror glueballs, with the glueballs decaying into SM particles with potentially observable lifetimes. We undertake the first detailed study of this glueball signature and quantitatively demonstrate the discovery potential of uncolored naturalness via exotic Higgs decays at the LHC and a potential future 100 TeV collider. Our findings indicate that mirror glueballs are the smoking gun signature of natural FS and QLH type theories, in analogy to tree-level Higgs coupling shifts for the TH. We show that glueball masses in the $\\sim$ 10-60 GeV mass range are theoretically preferred. Careful treatment of lifetime, mirror-hadronization and nonperturbative uncertainties is required to perform meaningful collider studies. We outline several new search strategies for exotic Higgs decays of the form $h\\to XX \\to 4f$ at the LHC, with $X$ having lifetimes in the $10 μm$ to $km$ range. We find that FS stops can be probed with masses up to 600 (1100) GeV at the LHC with 300 (3000) /fb of data, and TH top partners could be accessible with masses up to 900 (1500) GeV. This makes exotic Higgs decays the prime discovery channel for uncolored naturalness at the LHC. △ Less", "Light top squarks (stops) and light higgsinos are the key features of natural SUSY, where the higgsinos $\\tildeχ^{\\pm}_{1}$ and $\\tildeχ^0_{1,2}$ are nearly degenerate and act as the missing transverse energy ($E^{miss}_T$) at the LHC. Besides the strong production, the stop can be produced via the electroweak interaction. The determination of the electroweak properties of the stop is an essential task for the LHC and future colliders. So in this paper, we investigate the single stop ($\\tilde{t}_1$) production $pp \\to \\tilde{t}_1+ E^{miss}_T$ in the natural SUSY at the LHC, which gives the monotop signature $t+ E^{miss}_T$ from $\\tilde{t}_1\\to t \\tildeχ^0_{1,2}$ or the monobottom signature $b+ E^{miss}_T$ from $\\tilde{t}_1 \\to b \\tildeχ^+_{1}$. We perform Monte Carlo simulations for these signatures and obtain the results: (1) The signal $b+ E^{miss}_T$ has a better sensitivity than $t+ E^{miss}_T$ for probing natural SUSY; (2) The parameter region with a higgsino mass 100 GeV$\\lesssim μ\\lesssim$ 225 GeV and stop mass $m_{\\tilde{t}_1} \\lesssim$ 620 GeV, can be probed through the single stop production with $S/\\sqrt{B} > 3$ and $4\\% \\lesssim S/B \\lesssim19\\%$ at 14 TeV HL-LHC with an integrated luminosity of 3000 fb$^{-1}$. △ Less", "We consider relatively rare events of SUSY production at the LHC without missing $p_T$. Namely, we discuss the chargino production with further decay into the W-boson and the neutralino when the masses of chargino and neutralino differ by 80-90 GeV. In this case, in the final state one has two Ws and missing $E_T$ but no missing $P_T$. The produced neutralinos are just busted along Ws. Within the MSSM such events are quite probable in the region of parameter space close to the EWSB border line. The excess in the W production cross-section may achieve a few \\%. △ Less", "In this paper we analyze Yukawa unification in a three family SO(10) SUSY GUT. We perform a global $χ^2$ analysis and show that SUSY effects do not decouple even though the universal scalar mass parameter at the GUT scale, $m_{16}$, is found to lie between 15 and 30 TeV with the best fit given for $m_{16} \\approx 25$ TeV. Note, SUSY effects don't decouple since stops and bottoms have mass of order 5 TeV, due to RG running from $M_{GUT}$. The model has many testable predictions. Gauginos are the lightest sparticles and the light Higgs boson is very much Standard Model-like. The model is consistent with flavor and CP observables with the $BR(μ\\to eγ)$ close to the experimental upper bound. With such a large value of $m_{16}$ we clearly cannot be considered \"natural\" SUSY nor are we \"Split\" SUSY. We are thus in the region in between or \"SUSY on the Edge.\" △ Less", "In this work, the radiative corrections to the production of a light Higgs boson ($h^0$) with a pair of lightest neutralinos (${\\tildeχ}_1^0$) in $e^+ e^-$ collisions within MSSM are presented, including the on-shell renormalization scheme in the loop calculations. We have studied the QED corrections as well as the weak corrections, where the contribution from both corrections is significant and needs to be taken into account in the future linear colliders experiments. The result includes the numerical calculations for two different SUSY scenarios---Higgsino and Gaugino scenarios--- for $e^+ e^-\\rightarrow{\\tildeχ}_1^0 {\\tildeχ}_1^0 h^0$. △ Less", "There is an avatar of the little hierarchy problem of the MSSM in 3-dimensional supersymmetry. We propose a solution to this problem in AdS$_3$ based on the AdS/CFT correspondence. The bulk theory is a supergravity theory in which U(1) $\\times$ U(1) R-symmetry is gauged by Chern-Simons fields. The bulk theory is deformed by a boundary term quadratic in the gauge fields. It breaks SUSY completely and sources an exactly marginal operator in the dual CFT. SUSY breaking is communicated by gauge interactions to bulk scalar fields and their spinor superpartners. Since the R-charges of scalar and spinor differ, this generates a SUSY breaking shift of their masses. The Ward identity facilitates the calculation of these mass shifts to any desired order in the strength of the deformation. Moduli fields are massless $R$-neutral bulk scalars with vanishing potential in the undeformed theory. These properties are maintained to all orders in the deformation despite the fact that moduli couple in the bulk to loops of R-charged fields. △ Less", "We present a new kit for the study of flavor observables in models beyond the standard model. The setup is based on the public codes SARAH and SPheno and allows for an easy implementation of new observables. The Wilson coefficients of the corresponding operators in the effective Lagrangian are computed by SPheno modules written by SARAH. New operators can also be added by the user in a modular way. For this purpose a handy Mathematica package called PreSARAH has been developed. This uses FeynArts and FormCalc to derive the generic form factors at tree- and 1-loop levels and to generate the necessary input files for SARAH. This framework has been used to implement BR($\\ell_α\\to \\ell_βγ$), BR($\\ell_α\\to 3\\, \\ell_β$), CR($μ-e,A$), BR($τ\\to P \\, \\ell$), BR($h\\to \\ell_α\\ell_β$), BR($Z\\to \\ell_α\\ell_β$), BR($B_{s,d}^0 \\to \\ell \\bar{\\ell}$), BR($\\bar B \\to X_sγ$), BR($\\bar B \\to X_s \\ell \\bar{\\ell}$), BR($\\bar B \\to X_{d,s} ν\\bar ν$), BR($K^+ \\to π^+ ν\\bar ν$), BR($K_L \\to π^0 ν\\bar ν$), $ΔM_{B_s,B_d}$, $ΔM_K$, $\\varepsilon_K$, BR($B \\to K μ\\barμ$), BR($B\\to \\ell ν$), BR($D_s \\to \\ell ν$) and BR($K \\to \\ell ν$) in SARAH. Predictions for these observables can now be obtained in a wide range of SUSY and non-SUSY models. Finally, the user can use the same approach to easily compute additional observables. △ Less", "We propose an $S_{4}$ flavor model based on supersymmetric (SUSY) SU(5) GUT. The first and third generations of \\textbf{10} dimensional representations in SU(5) are all assigned to be $1_{1}$ of $S_{4}$. The second generation of \\textbf{10} is to be $1_{2}$ of $S_{4}$. Right-handed neutrinos of singlet \\textbf{1} and three generations of $\\bar{\\textbf{5}}$ are all assigned to be $3_{1}$ of $S_{4}$. The VEVs of two sets of flavon fields are allowed a moderate hierarchy, that is $\\langleΦ^ν\\rangle \\sim λ_{c}\\langleΦ^{e}\\rangle$. Tri-Bimaximal (TBM) mixing can be produced at both leading order (LO) and next to next to leading order (NNLO) in neutrino sector. All the masses of up-type quarks are obtained at LO. We also get the bottom-tau unification $m_τ=m_{b}$ and the popular Georgi-Jarlskog relation $m_μ=3m_{s}$ as well as a new mass relation $m_{e}=\\frac{8}{27}m_{d}$ in which the novel Clebsch-Gordan (CG) factor arises from the adjoint field $H_{24}$. The GUT relation leads to a sizable mixing angle $θ^{e}_{12} \\sim θ_{c}$ and the correct quark mixing matrix $V_{CKM}$ can also be realised in the model. The resulting CKM-like mixing matrix of charged leptons modifies the vanishing $θ^ν_{13}$ in TBM mixing to a large $θ^{PMNS}_{13}\\simeqθ_{c}/\\sqrt{2}$, in excellent agreement with experimental results. A Dirac CP violation phase $φ_{12}\\simeq\\pmπ/2$ is required to make the deviation from $θ^ν_{12}$ small. We also present some phenomenological numerical results predicted by the model. △ Less", "We present a novel way of realizing the pseudo-Nambu-Goldstone boson mechanism at all orders in perturbation theory, for the doublet-triplet splitting in supersymmetric grand unified theories. The global symmetries of the Higgs sector are attributed to a non-vectorlike Higgs content, which is consistent with unbroken supersymmetry in a scenario with flat extra dimensions and branes. We also show how in such a model one can naturally obtain a realistic pattern for the Standard Model fermion masses and mixings. △ Less"]