["I explore the phenomenology and models of Gauge Mediation with a mixed spectrum of Dirac and Majorana gauginos. Scalar sfermion masses are generated using a mixture of Supersoft and Minimal Gauge Mediated communication mechanisms. I build simple models where Dirac and Majorana gauginos arise from distinct SUSY breaking sectors. I explore the phenomenology of the gauge mediated parameter space, identifying candidate NLSP's and possible mass hierarchies. The phenomenological focus is on 'collider safe' models where the gluino is Dirac. Within this model space I find a range of complex SUSY spectra and decay chains. △ Less", "During the LHC Run-II data-taking period, several searches for supersymmetric particles were performed by the ATLAS collaboration. The results from these searches are concisely reviewed. Model-independent and model-dependent limits on new particle production are set, and interpretations in supersymmetric models are given. △ Less", "Recent work has established a method of constructing non-supersymmetric string models that are stable, with near-vanishing one-loop dilaton tadpoles and cosmological constants. This opens up the tantalizing possibility of realizing stable string models whose low-energy limits directly resemble the Standard Model rather than one of its supersymmetric extensions. In this paper we consider the general structure of such strings and find that they share two important phenomenological properties. The first is a so-called \"GUT-precursor\" structure in which new GUT-like states appear with masses that can be many orders of magnitude lighter than the scale of gauge coupling unification. These states allow a parametrically large compactification volume, even in weakly coupled heterotic strings, and in certain regions of parameter space can give rise to dramatic collider signatures which serve as \"smoking guns\" for this overall string framework. The second is a residual \"entwined-SUSY\" (or e-SUSY) structure for the matter multiplets in which different multiplet components carry different horizontal $U(1)$ charges. As a concrete example and existence proof of these features, we present a heterotic string model that contains the fundamental building blocks of the Standard Model such as the Standard-Model gauge group, complete chiral generations, and Higgs fields --- all without supersymmetry. Even though massless gravitinos and gauginos are absent from the spectrum, we confirm that this model has an exponentially suppressed one-loop dilaton tadpole and displays both the GUT-precursor and e-SUSY structures. We also discuss some general phenomenological properties of e-SUSY, such as cancellations in radiative corrections to scalar masses, the possible existence of a corresponding approximate moduli space, and the prevention of rapid proton decay. △ Less", "We show the new relationship [1] between the anomalous dimensions, resummed through next-to-next-to-leading-logarithmic order, in the Dokshitzer-Gribov-Lipatov-Altarelli-Parisi (DGLAP) evolution equations for the first Mellin moments D{q,g}(\\mu2) of the quark and gluon fragmentation functions, which correspond to the average hadron multiplicities in jets initiated by quarks and gluons, respectively. This relationship, which is independent of the number of quark flavors, strongly improves previous treatments by allowing for an exact solution of the evolution equations. So far, such relationships have only been known from supersymmetric QCD. △ Less", "We discuss spontaneous supersymmetry (SUSY) breaking in a model with an anomalous $U(1)_A$ symmetry. In this model, the size of the each term in the superpotential is controlled by the $U(1)_A$ charge assignment and SUSY is spontaneously broken via the Fayet-Iliopoulos of $U(1)_A$ at the meta-stable vacuum. In the global SUSY analysis, the gaugino masses become much smaller than the sfermion masses, because an approximate R-symmetry appears at the SUSY breaking vacuum. In this paper, we show that gaugino masses can be as large as gravitino mass, taking the supergravity effect into consideration. This is because the R-symmetry is not imposed so that the constant term in the superpotential, which is irrelevant to the global SUSY analysis, largely contributes to the soft SUSY breaking terms in the supergravity. As the mediation mechanism, we introduce the contributions of the field not charged under $U(1)_A$ and the moduli field to cancel the anomaly of $U(1)_A$. We comment on the application of our SUSY breaking scenario to the GUT models. △ Less", "This talk provides a limited review of SUSY scenarios with the focus on the way electroweak symmetry breaking is achieved and understood under different assumptions. Various aspects of naturalness and their implications are discussed and compared. △ Less", "We study the potential of the LHC accelerator, and a future 33 TeV proton collider, to observe the production of a light top squark pair in association with the lightest Higgs boson (${\\tilde t}_1 {\\tilde t}_1 h_1$), as predicted by the Next-to-Minimal Supersymmetric Standard Model (NMSSM). We scan randomly about ten million points of the NMSSM parameter space, allowing all possible decays of the lightest top squark and lightest Higgs boson, with no assumptions about their decay rates, except for known physical constraints such as perturbative bounds, Dark matter relic density consistent with recent Planck experiment measurements, Higgs mass bounds on the next to lightest Higgs boson, $h_2$, assuming it is consistent with LHC measurements for the Standard Model Higgs boson, LEP bounds for the chargino mass and Z invisible width, experimental bounds on B meson rare decays and some LHC experimental bounds on SUSY particle spectra different to the particles involved in our study. We find that for low mass top-squark, the dominating decay mode is ${\\tilde t}_1 \\rightarrow b \\tildeχ_1^{\\pm}$ with $\\tildeχ_1^{\\pm} \\rightarrow W^{\\pm} \\tildeχ_1^0 $. We use three bench mark points with the highest cross sections, which naturally fall within the compressed spectra of the top squark, and make a phenomenological analysis to determine the optimal event selection that maximizes the signal significance over backgrounds. We focus on the leptonic decays of both $W$'s and the decay of lightest Higgs boson into b-quarks ($h_1 \\rightarrow b \\bar b$). Our results show that the high luminosity LHC will have limitations to observe the studied signal and only a proton collider with higher energy will be able to observe the SUSY scenario studied with more than three standard deviations over background. △ Less", "We study the two-body decays of the gluino at full one-loop level in the Minimal Supersymmetric Standard Model with quark-flavour violation (QFV) in the squark sector. The renormalization is done in the DRbar scheme and hard gluon and photon radiations are included by adding the corresponding three-body decay widths. In the numerics the dependence of the gluino decay widths on the QFV parameters is discussed with special emphasis put on the separation of the electroweak and the SUSY QCD corrections. The main dependence stems from the $\\tilde c_R - \\tilde t_R$ mixing in the decays to up-type squarks because there hold strong constraints from B-physics on the other quark-flavour mixing parameters. Including the full one-loop corrections, the changes of the gluino decay widths are mostly negative and of the order of about -10%. The QFV part stays small in the total width but can vary up to -8% for the decay width into the lightest squark. For the corresponding branching ratio, however, the effect is smaller by at least a factor of two. The electroweak corrections can become 35% of the SUSY QCD corrections. △ Less", "According to the standard lore only single monopoles contribute to the superpotential on the Coulomb branch of 3D ${\\mathcal N}=2$ SUSY gauge theories. However we argue that multi-monopole configurations can also generate superpotential terms in the presence of squark VEVs on the mixed Higgs-Coulomb branch. The new ingredient is the confinement of monopoles via Nielsen-Olesen flux tubes. Such confined multi-monopoles will yield a pre-ADS superpotential which depends both on the local Coulomb moduli and matter superfields but has no fractional powers. Once the lifted moduli are integrated out the familiar ADS superpotential is obtained. Our results demonstrate the important role multi-monopoles can play in generating non-perturbative effects and also sheds light on the still somewhat mysterious dynamical origin of the general 4D ADS superpotential. △ Less", "Twin Higgs (TH) models explain the absence of new colored particles responsible for natural electroweak symmetry breaking (EWSB). All known ultraviolet completions of TH models require some non-perturbative dynamics below the Planck scale. We propose a supersymmetric model in which the TH mechanism is introduced by a new asymptotically free gauge interaction. The model features natural EWSB for squarks and gluino heavier than 2 TeV even if supersymmetry breaking is mediated around the Planck scale, and has interesting flavor phenomenology including the top quark decay into the Higgs and the up quark which may be discovered at the LHC. △ Less", "Dismissing traditional naturalness concerns while embracing the Higgs boson mass measurement and unification motivates careful analysis of trans-TeV supersymmetric theories. We take an effective field theory (EFT) approach, matching the Minimal Supersymmetric Standard Model (MSSM) onto the Standard Model (SM) EFT by integrating out heavy superpartners, and evolving MSSM and SMEFT parameters according to renormalization group equations in each regime. Our matching calculation is facilitated by the recent covariant diagrams formulation of functional matching techniques, with the full one-loop SUSY threshold corrections encoded in just 30 diagrams. Requiring consistent matching onto the SMEFT with its parameters (those in the Higgs potential in particular) measured at low energies, and in addition requiring unification of bottom and tau Yukawa couplings at the scale of gauge coupling unification, we detail the solution space of superpartner masses from the TeV scale to well above. We also provide detailed views of parameter space where Higgs coupling measurements have probing capability at future colliders beyond the reach of direct superpartner searches at the LHC. △ Less", "We review the flavor structure of the Standard Model and the ways in which the flavor parameters are measured. This is an extended writeup of the TASI 2016 lectures on flavor physics. Earlier versions of these lectures were presented at pre-SUSY 2015 and Cornell University's Physics 7661 course in 2010. △ Less", "I discuss the construction of Simplified Models for Dark Matter searches at the LHC. After reviewing the phylosophy and some simple example, I turn the attention to the aspect of the theoretical consistency of these models. △ Less", "This century the situation has changed: neutrino oscillations have shown that the SM is incomplete. On the other hand, we have not found signs of SUSY, which is seen as the best candidate for New Dynamics (ND). We should search for ND indirectly with accuracy in regions that are above what LHC can find it directly. General comments: (a) QCD is the only local quantum field theory to describe strong forces. We have to apply non-perturbative QCD on different levels to flavor dynamics in strange, charm \\& beauty hadrons and even for top quarks. We need consistent parameterization of the CKM matrix and apply to weak decays of beauty hadrons with many-body final states. (b) It is crucial to use the Wilsonian OPE as much as possible and discuss \"duality\" in the worlds of quarks and hadrons. The pole mass of heavy quarks is {\\em not} well-defined on the non-perturbative level -- i.e., it is {\\em not} Borel summable in total QCD. (c) We need a novel team to combine the strengths of our tools from MEP and HEP. △ Less", "We explore leptogenesis within the E6 inspired U(1) extension of the MSSM in which exact custodial symmetry forbids tree-level flavour-changing transitions and the most dangerous baryon and lepton number violating operators. This supersymmetric (SUSY) model involves extra exotic matter beyond the MSSM. In the simplest phenomenologically viable scenarios the lightest exotic fermions are neutral and stable. These states should be substantially lighter than 1 eV forming hot dark matter in the Universe. The low-energy effective Lagrangian of the SUSY model under consideration possesses an approximate global U(1)_E symmetry associated with the exotic states. The U(1)_E symmetry is explicitly broken because of the interactions between the right-handed neutrino superfields and exotic matter supermultiplets. As a consequence the decays of the lightest right-handed neutrino/sneutrino give rise to both U(1)_E and U(1)_{B-L} asymmetries. When all right-handed neutrino/sneutrino are relatively light \\sim 10^6-10^7 GeV the appropriate amount of the baryon asymmetry can be induced via these decays if the Yukawa couplings of the lightest right-handed neutrino superfields to the exotic matter supermultiplets vary between 10^{-4}-10^{-3}. △ Less", "We analyse the predictions of both Higgs and top masses in a generic MSSM satisfying gauge-coupling unification, radiative electroweak symmetry breaking, with a natural (non-splitted) spectrum of soft-breaking terms, and an arbitrary soft-breaking scale (above a few TeV). This procedure allows us to identify a relatively narrow SUSY-allowed region in the $(m_h, m_t)$ plane. We argue that the compatibility of the measured values of Higgs and top masses with this SUSY-allowed region is not less surprising than the corresponding compatibility with the narrow SM metastability region. As such, it provides a non-trivial signal of the compatibility of present data with a supersymmetric completion of the SM. △ Less", "Naturalness arguments applied to simple supersymmetric (SUSY) theories require a set of light higgsinos with mass $\\sim |μ|$ not too far from $m_h$. These models have an inverted electroweakino spectrum with $|μ| \\ll M_2$ which leads to a rather clean, hadronically quiet, same-sign diboson (SSdB) signature at hadron colliders arising from neutral-plus-charged wino pair production. We improve and expand our earlier studies of this signature for discovering SUSY in natural SUSY models by (i) including backgrounds which were not previously considered and which turn out to be significant, (ii) devising more efficient cuts to successfully contend with these larger backgrounds and determining the discovery reach and exclusion ranges for winos with these cuts, emphasizing projections for the updated integrated luminosity target for HL-LHC of 3 ab$^{-1}$, and (iii) emphasizing the utility of this channel for natural models without gaugino mass unification. We display the kinematic characteristics of the relatively jet-free same sign dilepton+$\\not\\!\\!\\!{E_T}$ events (from leptonic decays of both $W$s) and find that these are only weakly sensitive to the parent wino mass. We also examine the charge asymmetry in these events and show that its measurement can be used to check the consistency of the wino origin of the signal. Finally, we show that -- because the wino branching fractions in natural SUSY are essentially independent of details of the underlying model -- a determination of the rate for clean, same-sign dilepton events yields a better than 10% determination of the wino mass over the entire mass range where experiments at the HL-LHC can discover the wino signal. △ Less", "We discuss effective models derived from a supersymmetric model whose mediation mechanism of supersymmetry (SUSY) breaking is namely mirage mediation. In this model, light higgsino mass, that is required by the natural realization of the electroweak scale, is achieved by the unification of the soft SUSY breaking parameters at the low scale. Besides, we find that extra Higgs fields are also possibly light in some cases. Then, the effective model is a two Higgs doublet model (2HDM) with higgsinos, and it is distinguishable with namely type-II 2HDM which is widely discussed. In this paper, we study the mass spectrum of SUSY particles and the extra Higgs fields, and summarize the phenomenology in the effective model. We survey the current experimental bounds from the LHC and the dark matter experiments as well as the flavor physics. Then, we point out the expected mass scale of the SUSY particles and reveal the future prospects for the direct and indirect searches. We also discuss the difference between our effective model and the 2HDM in the bottom-up approach. △ Less", "Based on arXiv:1705.07935 and arXiv:1705.07917, we present the first global fits of supersymmetric models using the new Global And Modular Beyond-the-Standard-Model Inference Tool (GAMBIT). With GAMBIT we have performed frequentist fits of the GUT-scale CMSSM, NUHM1 and NUHM2 models, as well as the weak-scale MSSM7, extending existing results in terms of the number of observables included, scanning techniques and treatment of nuisance parameters. For the GUT-scale models our analyses show that a stop co-annihilation scenario provides the best fit to current data, and that in the CMSSM the stau co-annihilation scenario is ruled out at 95% confidence level. For the MSSM7 we find that the best-fit scenario has light higgsinos and highly under-abundant relic density due to efficient chargino co-annihilation. △ Less", "Radiatively-driven natural supersymmetry, a theoretically and experimentally well-motivated framework, centers around the predicted existence of four light, nearly mass-degenerate Higgsinos with mass $\\sim 100-200$ GeV (not too far above $m_Z$). The small mass splittings amongst the higgsinos, typically 4-20 GeV, results in very little visible energy arising from decays of the heavier higgsinos. Given that other SUSY particles are considerably heavy, this makes detection challenging at hadron colliders. On the other hand, the clean environment of an electron-positron collider with $\\sqrt{s}>2m_{higgsino}$ would enable a decisive search of these required higgsinos, and thus either the discovery or exclusion of natural SUSY. We present a detailed simulation study of precision measurements of higgsino masses and production cross sections at $\\sqrt{s}$ = 500 GeV of the proposed International Linear Collider currently under consideration for construction in Japan. The study is based on a Geant4 simulation of the International Large Detector concept. We examine several benchmark points just beyond the HL-LHC reach, with four light higgsinos directly accessible by the ILC, and the mass differences between the lightest SUSY particle and the heavier states ranging from about 4 to 20 GeV. It can be shown that their masses and production cross sections can be precisely measured to approximately 1\\% precision or better. These precise measurements allow for extracting the underlying weak scale SUSY parameters, giving predictions for the masses of heavier SUSY states. These provide motivation for future high-energy colliders. Additionally, dark matter properties may be derived. Evolution of the measured gaugino masses to high energies should allow testing the hypothesis of gaugino mass unification. △ Less", "We consider a scenario where the supersymmetry breaking and its mediation, and the cancellation of the theta parameter of SU(3)c are all caused by a single chiral multiplet. The string axion multiplet is a natural candidate of such a single superfield. We show that the scenario provides a convincing basis of focus point gaugino mediation, where the electroweak scale is explained with a moderate tuning among the parameters of the theory. △ Less", "ATLAS and CMS have been performing a large number of searches for physics beyond the Standard Model (BSM). In particular results of supersymmetry (SUSY) searches are typically interpreted in the context of simplified models. While mass limits obtained in this manner are highly model dependent, cross section upper limits (or efficiency maps) may be used to obtain constraints on generic BSM scenarios without any further event and detector simulation. This procedure has been automatised in the public tool SModelS, which first decomposes the generic scenario into its simplified model components which can then be tested directly against the experimental constraints in the SModelS database. We briefly introduce SModelS and then discuss how the coverage by simplified model results compares to what can be obtained in a full simulation study for the example of the 19 parameter phenomenological MSSM (pMSSM). Considering all parameter points that ATLAS has tested in a comprehensive study [1], we find that about 60 % of the points excluded by ATLAS can be excluded from simplified model constraints. This fraction could be improved by considering currently `missing' simplified model topologies. We show that in particular topologies with asymmetric branches are often important, while long cascade decays with more than one intermediate particle are less relevant. A particularly interesting asymmetric branch topology is a 3 jet + $E_T^{\\mathrm{miss}}$ signature arising from gluino-squark production. △ Less", "We investigate the short distance fate of distinct classes of not asymptotically free supersymmetric gauge theories. Examples include super QCD with two adjoint fields and generalised superpotentials, gauge theories without superpotentials and with two types of matter representation and semi-simple gauge theories such as quivers. We show that for the aforementioned theories asymptotic safety is nonperturbatively compatible with all known constraints. △ Less", "We examine the top squark (stop) and gluino reach of the proposed 33 TeV energy upgrade of the Large Hadron Collider (LHC33) in the Minimal Supersymmetric Standard Model (MSSM) with light higgsinos and relatively heavy electroweak gauginos. In our analysis, we assume that stops decay to higgsinos via ${\\tilde t}_1 \\to t {\\tilde{Z}}_1$, $\\tilde{t}_1 \\to t\\tilde{Z}_2$ and $\\tilde{t}$$_1 \\to b\\tilde{W}_1$ with branching fractions in the ratio 1:1:2 (expected if the decay occurs dominantly via the superpotential Yukawa coupling) while gluinos decay via $\\tilde{g}\\to t\\tilde{t}_1$ or via three-body decays to third generation quarks plus higgsinos. These decay patterns are motivated by models of natural supersymmetry where higgsinos are expected to be close in mass to $m_Z$, but gluinos may be as heavy as $5 - 6$ TeV and stops may have masses up to $\\sim 3 $ TeV. We devise cuts to optimize the signals from stop and gluino pair production at LHC33. We find that experiments at LHC33 should be able to discover stops with $> 5σ$ significance if $m_{\\tilde{t}_1} < 2.3 \\ (2.8) \\ [3.2]$ TeV for an integrated luminosity of 0.3 (1)[3] ab$^{-1}$. The corresponding reach for gluinos extends to 5 (5.5) [6] TeV. These results imply that experiments at LHC33 should be able to discover at least one of the stop or gluino pair signals even with an integrated luminosity of 0.3 ab$^{-1}$ for natural SUSY models with no worse than 3% electroweak fine-tuning, and quite likely both gluinos and stops for an integrated luminosity of 3 ab$^{-1}$. △ Less", "We present comprehensive global fits of supersymmetric (SUSY) models from the Global and Modular Beyond-the-Standard-Model Inference Tool (GAMBIT) collaboration, based on arXiv:1705.07935 and arXiv:1705.07917. We investigate several variants of the minimal supersymmetric standard model, a fully constrained version (CMSSM) with universal scalar ($m_0$), gaugino ($m_{1/2}$) and trilinear masses ($A_0$) at the gauge coupling unification scale, a similar model that is relaxed by adding an extra parameter for the soft Higgs masses (NUHM1), another where the soft Higgs masses are also split (NUHM2) and finally a weak scale MSSM7 model. We use the public GAMBIT global fitting framework and take into account all relevant data to reveal the regions of parameter space with the highest likelihood. Our results reveal that all models have very heavy scenarios that are well out of reach of the LHC, but will be probed by forthcoming dark matter experiments, as well as a stop-co-annihilation region which has better prospects for detection in collider experiments. The stau co-annihilation region is excluded from the CMSSM at $2 σ$ but is present in the NUHM1 and NUHM2 variants. Finally by relaxing constraints in the NUHM1, NUHM2 and MSSM7 we see additional regions appear: lighter chargino co-annihilation region, sbottom co-annihilation and $h/Z$ funnels. △ Less", "The impact of the three-loop effects of order $α_tα_s^2$ on the mass of the light CP-even Higgs boson in the MSSM is studied in a pure $\\overline{\\text{DR}}$ context. For this purpose, we implement the results of Kant et al. into the C++ module Himalaya and link it to FlexibleSUSY, a Mathematica and C++ package to create spectrum generators for BSM models. The three-loop result is compared to the fixed-order two-loop calculations of the original FlexibleSUSY and of FeynHiggs, as well as to the result based on an EFT approach. Aside from the expected reduction of the renormalization scale dependence with respect to the lower order results, we find that the three-loop contributions significantly reduce the difference from the EFT prediction in the TeV-region of the SUSY scale $M_S$. Himalaya can be linked also to other two-loop $\\overline{\\text{DR}}$ codes, thus allowing for the elevation of these codes to the three-loop level. △ Less", "We investigate the possibility of testing supergravity unified models with scalar masses in the range 50-100 TeV and much lighter gaugino masses at the Large Hadron Collider. The analysis is carried out under the constraints that models produce the Higgs boson mass consistent with experiment and also produce dark matter consistent with WMAP and PLANCK experiments. A set of benchmarks in the supergravity parameter space are investigated using a combination of signal regions which are optimized for the model set. It is found that some of the models with scalar masses in the 50-100 TeV mass range are discoverable with as little as 100 fb$^{-1}$ of integrated luminosity and should be accessible at the LHC RUN II. The remaining benchmark models are found to be discoverable with less than 1000 fb$^{-1}$ of integrated luminosity and thus testable in the high luminosity era of the LHC, i.e., at HL-LHC. It is shown that scalar masses in the 50-100 TeV range but gaugino masses much lower in mass produce unification of gauge coupling constants, consistent with experimental data at low scale, with as good an accuracy (and sometimes even better) as models with low ($\\mathcal{O}(1)$ TeV) weak scale supersymmetry. Decay of the gravitinos for the supergravity model benchmarks are investigated and it is shown that they decay before the Big Bang Nucleosynthesis (BBN). Further, we investigate the non-thermal production of neutralinos from gravitino decay and it is found that the non-thermal contribution to the dark matter relic density is negligible relative to that from the thermal production of neutralinos for reheat temperature after inflation up to $10^9$ GeV. An analysis of the direct detection of dark matter for SUGRA models with high scalar masses is also discussed. △ Less", "We examine the dark matter phenomenology of a composite electroweak singlet state. This singlet belongs to the Goldstone sector of a well-motivated extension of the Littlest Higgs with $T$-parity. A viable parameter space, consistent with the observed dark matter relic abundance as well as with the various collider, electroweak precision and dark matter direct detection experimental constraints is found for this scenario. $T$-parity implies a rich LHC phenomenology, which forms an interesting interplay between conventional natural SUSY type of signals involving third generation quarks and missing energy, from stop-like particle production and decay, and composite Higgs type of signals involving third generation quarks associated with Higgs and electroweak gauge boson, from vector-like top-partners production and decay. The composite features of the dark matter phenomenology allows the composite singlet the produce the correct relic abundance while interacting weakly with the Higgs via the usual Higgs portal coupling $λ_{\\text{DM}} \\sim O(1\\%)$, thus evading direct detection. △ Less", "We show that gauge coupling unification in SUSY models can make a non-trivial interconnection between collider and proton decay experiments. Under the assumption of precise gauge coupling unification in the MSSM, the low energy SUSY spectrum and the unification scale are intertwined, and the lower bound on the proton lifetime can be translated into upper bounds on SUSY masses. We found that the current limit on $τ(p \\to π^0 e^+)$ already excludes gluinos and winos heavier than $\\sim 120$ and 40 TeV, respectively, if their mass ratio is $M_3/M_2 \\sim 3$. Next generation nucleon decay experiments are expected to bring these upper bounds down to $\\sim 10$ and 3 TeV. △ Less", "In this paper we describe a novel, model-independent technique of \"rectangular aggregations\" for mining the LHC data for hints of new physics. A typical (CMS) search now has hundreds of signal regions, which can obscure potentially interesting anomalies. Applying our technique to the two CMS jets+MET SUSY searches, we identify a set of previously overlooked $\\sim 3σ$ excesses. Among these, four excesses survive tests of inter- and intra-search compatibility, and two are especially interesting: they are largely overlapping between the jets+MET searches and are characterized by low jet multiplicity, zero $b$-jets, and low MET and $H_T$. We find that resonant color-triplet production decaying to a quark plus an invisible particle provides an excellent fit to these two excesses and all other data -- including the ATLAS jets+MET search, which actually sees a correlated excess. We discuss the additional constraints coming from dijet resonance searches, monojet searches and pair production. Based on these results, we believe the wide-spread view that the LHC data contains no interesting excesses is greatly exaggerated. △ Less", "R-symmetry leads to a distinct realisation of SUSY with a significantly modified coloured sector featuring a Dirac gluino and a scalar colour octet (sgluon). We present the impact of R-symmetry on squark production at the 13 TeV LHC. We study the total cross sections and their NLO corrections from all strongly interacting states, their dependence on the Dirac gluino mass and sgluon mass as well as their systematics for selected benchmark points. We find that tree-level cross sections in the R-symmetric model are reduced compared to the MSSM but the NLO K-factors are generally larger in the order of ten to twenty per cent. In the course of this work we derive the required DREG $\\to$ DRED transition counterterms and necessary on-shell renormalisation constants. The real corrections are treated using FKS subtraction, with results cross checked against an independent calculation employing the two cut phase space slicing method. △ Less", "We construct an unified model of inflation and PeV dark matter which is consistent with the CMB observations and can explain the PeV neutrinos at IceCube. A no-scale Kähler potential and an appropriate choice of gauge kinetic function in MSSM superfields can result in Starobinsky like Higgs-sneutrino plateau inflation from $D$-term potential. The SUSY breaking at the PeV scale is achieved through the Polonyi field. This sets the scales $m_0, m_{\\frac{1}{2}}, A_0$ at the GUT scale in terms of the parameters of the theory. The low energy (PeV scale) spectrum is obtained by running the RGEs. We show that the $\\sim$125 GeV higgs and the gauge coupling unification can be achieved in this model. The $6$ PeV bino-type dark matter is a subdominant fraction ($\\sim 11\\%$) of the relic density and its decay gives the PeV scale neutrino flux observed at IceCube by choosing the couplings of the $R$-parity violating operators. △ Less", "Models with a light, additional gauge boson are attractive extensions of the standard model. Often these models are only considered as effective low energy theory without any assumption about an UV completion. This leaves not only the hierarchy problem of the SM unsolved, but introduces a copy of it because of the new fundamental scalars responsible for breaking the new gauge group. A possible solution is to embed these models into a supersymmetric framework. However, this gives rise to an additional source of fine-tuning compared to the MSSM and poses the question how natural such a setup is. One might expect that the additional fine-tuning is huge, namely, $O(M^2_{\\rm SUSY}/m^2_{Z'})$. In this paper we point out that this is not necessarily the case. We show that it is possible to find a focus point behaviour also in the new sector in co-existence to the MSSM focus point. We call this 'Double Focus Point Supersymmetry'. Moreover, we stress the need for a proper inclusion of radiative corrections in the fine-tuning calculation: a tree-level estimate would lead to predictions for the tuning which can be wrong by many orders of magnitude. As showcase, we use the $U(1)_{B-L}$ extended MSSM and discuss possible consequence of the observed $^8\\textrm{Be}$ anomaly. However, similar features are expected for other models with an extended gauge group which involve potentially large Yukawa-like interactions of the new scalars. △ Less", "We point out that 7 keV axino dark matter (DM) in the R-parity violating (RPV) supersymmetric (SUSY) Dine-Fischler-Srednicki-Zhitnitsky model can simultaneously reproduce the 3.5keV X-ray excess, and evade stringent constraints from the Ly-alpha forest data. Peccei-Quinn symmetry breaking naturally generates both axino interactions with minimal SUSY standard model particles and RPV interactions. The RPV interaction introduces an axino-neutrino mixing and provides axino DM as a variant of sterile neutrino DM, whose decay into a monochromatic photon can be detected by X-ray observations. Axinos, on the other hand, are produced by freeze-in processes of thermal particles in addition to the Dodelson-Widrow mechanism of sterile neutrinos. The resultant phase space distribution tends to be colder than the Fermi-Dirac distribution. The inherent entropy production from late-time saxion decay makes axinos even colder. The linear matter power spectrum satisfies even the latest and strongest constraints from the Ly-alpha forest data. △ Less", "We study the implications of dark matter searches, together with collider constraints, on the phenomenological MSSM with neutralino dark matter and focus on the consequences of the related uncertainties in some detail. We consider, inter alia, the latest results from AMS-02, Fermi-LAT and XENON1T. In particular, we examine the impact of the choice of the dark matter halo profile, as well as the propagation model for cosmic rays, for dark matter indirect detection and show that the constraints on the MSSM differ by one to two orders of magnitude depending on the astrophysical hypotheses. On the other hand, our limited knowledge of the local relic density in the vicinity of the Earth and the velocity of Earth in the dark matter halo leads to a factor 3 in the exclusion limits obtained by direct detection experiments. We identified the astrophysical models leading to the most conservative and the most stringent constraints and for each case studied the complementarities with the latest LHC measurements and limits from Higgs, SUSY and monojet searches. We show that combining all data from dark matter searches and colliders, a large fraction of our supersymmetric sample could be probed. Whereas the direct detection constraints are rather robust under the astrophysical assumptions, the uncertainties related to indirect detection can have an important impact on the number of the excluded points. △ Less", "The calculation of the Higgs mass in general renormalisable field theories has been plagued by the so-called \"Goldstone Boson Catastrophe\", where light (would-be) Goldstone bosons give infra-red divergent loop integrals. In supersymmetric models, previous approaches included a workaround that ameliorated the problem for most, but not all, parameter space regions; while giving divergent results everywhere for non-supersymmetric models! We present an implementation of a general solution to the problem in the public code SARAH, along with new calculations of some necessary loop integrals and generic expressions. We discuss the validation of our code in the Standard Model, where we find remarkable agreement with the known results. We then show new applications in Split SUSY, the NMSSM, the Two-Higgs-Doublet Model, and the Georgi-Machacek model. In particular, we take some first steps to exploring where the habit of using tree-level mass relations in non-supersymmetric models breaks down, and show that the loop corrections usually become very large well before naive perturbativity bounds are reached. △ Less", "We advocate the use of on-shell constrained $M_2$ variables in order to mitigate the combinatorial problem in SUSY-like events with two invisible particles at the LHC. We show that in comparison to other approaches in the literature, the constrained $M_2$ variables provide superior ansatze for the unmeasured invisible momenta and therefore can be usefully applied to discriminate combinatorial ambiguities. We illustrate our procedure with the example of dilepton $t\\bar{t}$ events. We critically review the existing methods based on the Cambridge $M_{T2}$ variable and MAOS-reconstruction of invisible momenta, and show that their algorithm can be simplified without loss of sensitivity, due to a perfect correlation between events with complex solutions for the invisible momenta and events exhibiting a kinematic endpoint violation. Then we demonstrate that the efficiency for selecting the correct partition is further improved by utilizing the $M_2$ variables instead. Finally, we also consider the general case when the underlying mass spectrum is unknown, and no kinematic endpoint information is available. △ Less", "In the Minimal Supersymmetric Standard Model (MSSM) searches for the heaviest CP-even and CP-odd Higgs $H$, $A$ to tau-lepton pairs severely constrain the parameter region for large values of $\\tanβ$ and light Higgs bosons $H$, $A$. We demonstrate how the experimental constraint can be avoided by new decays to light third-generation sfermions, whose left-right couplings to $H$ can be maximised in regions of large trilinear couplings $A_{b}$, $A_τ$ for sbottoms and staus, or large supersymmetric (SUSY) Higgs mass $μ$ for stops. Due to the $\\tanβ$-enhancement in the production cross-sections via gluon-fusion and in association with bottom-quark pairs for $H$ and $A$, we find that down-type sfermions, in particular, sbottoms perform a better job in allowing more parameter space than up-type sfermions such as stops, which require much larger values of $μ$ to compensate for $\\tanβ$. Vacuum stability as well as flavour observables constraints and direct searches for SUSY particles are imposed. We also associate the lightest CP-even Higgs with the observed 125 GeV SM-like Higgs and impose the experimental constraints from the LHC. △ Less", "We discuss how flavour GUT models in the context of supergravity can be completed with a simple SUSY breaking sector, such that the flavour-dependent (non-universal) soft breaking terms can be calculated. As an example, we discuss a model based on an SU(5) GUT symmetry and $A_4$ family symmetry, plus additional discrete \"shaping symmetries\" and a $\\mathbb{Z}_4^\\mathrm{R}$ symmetry. We calculate the soft terms and identify the relevant high scale input parameters, and investigate the resulting predictions for the low scale observables, such as flavour violating processes, the sparticle spectrum and the dark matter relic density. △ Less", "We introduce fully SGUTs, SUSY grand unified theories that, upon symmetry breaking through the Higgs mechanism, decompose into a visible sector and an extra sector where the dynamics of the extra sector gauge group is responsible for SUSY breaking. Fully SGUTs thus have the important feature that all gauge groups of the visible sector and the extra sector unify into a simple gauge group at the SGUT scale, therefore generalizing the successful MSSM gauge coupling unification to all the gauge couplings of the theory. By focusing on the ISS SUSY-breaking mechanism in the extra sector, we show that it is impossible to reproduce the MSSM matter content when there exists a metastable ISS SUSY-breaking state. △ Less", "Gravitinos are a fundamental prediction of supergravity, their mass ($m_{G}$) is informative of the value of the SUSY breaking scale, and, if produced during reheating, their number density is a function of the reheating temperature ($T_{\\text{rh}}$). As a result, constraining their parameter space provides in turn significant constraints on particles physics and cosmology. We have previously shown that for gravitinos decaying into photons or charged particles during the ($μ$ and $y$) distortion eras, upcoming CMB spectral distortions bounds are highly effective in constraining the $T_{\\text{rh}}-m_{G}$ space. For heavier gravitinos (with lifetimes shorter than a few $\\times10^6$ sec), distortions are quickly thermalized and energy injections cause a temperature rise for the CMB bath. If the decay occurs after neutrino decoupling, its overall effect is a suppression of the effective number of relativistic degrees of freedom ($N_{\\text{eff}}$). In this paper, we utilize the observational bounds on $N_{\\text{eff}}$ to constrain gravitino decays, and hence provide new constaints on gravitinos and reheating. For gravitino masses less than $\\approx 10^5$ GeV, current observations give an upper limit on the reheating scale in the range of $\\approx 5 \\times 10^{10}- 5 \\times 10^{11}$GeV. For masses greater than $\\approx 4 \\times 10^3$ GeV they are more stringent than previous bounds from BBN constraints, coming from photodissociation of deuterium, by almost 2 orders of magnitude. △ Less", "In this report, we compare the naturalness and Dark Matter (DM) properties of the Minimal Supersymmetric Standard Model (MSSM) and the $B-L$ Supersymmetric Standard Model (BLSSM), with universality in both cases. We do this by adopting standard measures for the quantitative analysis of the Fine-Tuning (FT), at both low (i.e. supersymmetric (SUSY)) and high (i.e. unification) scales. We will see a similar level of FT for both models in these scenarios, with a slightly better FT for the BLSSM at SUSY scales and MSSM at Grand Unification Theory (GUT) scales. When including DM relic constraints, we drastically confine the MSSM's parameter space, whereas we still find a large parameter space available for the non-minimal scenario. △ Less", "Within the context of the extended bi-spinor gauge theory we describe a new off-shell realization of scalar supersymmetry (s-susy) of massless interacting fields with U(1), U(1) x SU(N) and U(1) x SU(N_1) x SU(N_2) gauge groups. S-susy acts in the space of graded differential forms. The realization is non-linear in the non-abelian case. S-susy would not require the doubling of the SM particle spectrum. Instead, essentially only the forth generation of quarks and leptons would be needed as extra field content. The theory is by construction globally U(2,2) invariant and is an example of a supersymmetric CFT. △ Less", "Given the recent progress in dark matter direction detection experiments, we examine a light bino-higgsino dark matter (DM) scenario ($M_1<100$ GeV and $μ<300$ GeV) in natural supersymmetry with the electroweak fine tuning measure $Δ_{EW}<30$. By imposing various constraints, we note that: (i) For $sign(μ/M_1)=+1$, the parameter space allowed by the DM relic density and collider bounds can almost be excluded by the very recent spin-independent (SI) scattering cross section limits from the XENON1T (2017) experiment. (ii) For $sign(μ/M_1)=-1$, the SI limits can be evaded due to the cancelation effects in the $h\\tildeχ^0_1\\tildeχ^0_1$ coupling, while rather stringent constraints come from the PandaX-II (2016) spin-dependent (SD) scattering cross section limits, which can exclude the higgsino mass $|μ|$ and the LSP mass $m_{\\tildeχ^0_1}$ up to about 230 GeV and 37 GeV, respectively. Furthermore, the surviving parameter space will be fully covered by the projected XENON1T experiment or the future trilepton searches at the HL-LHC. △ Less", "If new physics (e.g. SUSY) does not show up as direct evidence at the LHC, it could still be observable in FCNC processes involving the $t$-quark. We take a close look at the process $t\\to c + h/Z$ and show that its branching ratio in the Standard Model is subject to three mechanisms of suppression. To obtain an observable signal, one needs to evade all these mechanisms in a theory beyond the Standard Model. We show that a theory like the cMSSM cannot provide a big enough enhancement. However, in a framework like $R$-parity-violating SUSY, observable signals are a distinct possibility. △ Less", "We assess the range of validity of sgoldstino-less inflation in a scenario of low energy supersymmetry breaking. We first analyze the consistency conditions that an effective theory of the inflaton and goldstino superfields should satisfy in order to be faithfully described by a sgoldstino-less model. Enlarging the scope of previous studies, we investigate the case where the effective field theory cut-off, and hence also the sgoldstino mass, are inflaton-dependent. We then introduce a UV complete model where one can realize successfully sgoldstino-less inflation and gauge mediation of supersymmetry breaking, combining the alpha-attractor mechanism and a weakly coupled model of spontaneous breaking of supersymmetry. In this class of models we find that, given current limits on superpartner masses, the gravitino mass has a lower bound of the order of the MeV, i.e. we cannot reach very low supersymmetry breaking scales. On the plus side, we recognize that in this framework, one can derive the complete superpartner spectrum as well as compute inflation observables, the reheating temperature, and address the gravitino overabundance problem. We then show that further constraints come from collider results and inflation observables. Their non trivial interplay seems a staple feature of phenomenological studies of supersymmetric inflationary models. △ Less", "In supersymmetric axion models, if the gravitino or axino is the lightest SUSY particle (LSP), the other is often the next-to-LSP (NLSP). We investigate the cosmology of such a scenario and point out that the lifetime of the NLSP naturally becomes comparable to the present age of the universe in a viable parameter region. This is a well-motivated example of the so-called decaying dark matter model, which is recently considered as an extension of the $Λ$CDM model to relax some cosmological tensions. △ Less", "The higgsino world is one of the popular natural SUSY scenarios, in which $|μ| \\ll M_{gauginos} \\ll M_{scalars}$. As such, searching for light degenerate higgsinos becomes an essential task of testing naturalness in supersymmetry (SUSY). In this work, we study the indirect effects of light higgsinos in the process $e^+e^- \\to W^+W^-$ at future Higgs factories, such as Circular Electron Positron Collider (CEPC) in China. we find that the higgsino mass parameter $μ\\lesssim 210$ GeV favored by naturalness can be covered if the accuracy of the measurement of $W^+W^-$ production can reach 0.1\\% at 240 GeV CEPC. △ Less", "The methodology of the heterotic mini-landscape attempts to zero in on phenomenologically viable corners of the string landscape where the effective low energy theory is the Minimal Supersymmetric Standard Model with localized grand unification. The gaugino mass pattern is that of mirage-mediation. The magnitudes of various SM Yukawa couplings point to a picture where scalar soft SUSY breaking terms are related to the geography of fields in the compactified dimensions. Higgs fields and third generation scalars extend to the bulk and occur in split multiplets with TeV scale soft masses. First and second generation scalars, localized at orbifold fixed points or tori with enhanced symmetry, occur in complete GUT multiplets and have much larger masses. This picture can be matched onto the parameter space of generalized mirage mediation. Naturalness considerations, the requirement of the observed electroweak symmetry breaking pattern, and LHC bounds on m(gluino) together limit the gravitino mass to the m_{3/2}~ 5-60 TeV range. The mirage unification scale is bounded from below with the limit depending on the ratio of squark to gravitino masses. We show that while natural SUSY in this realization may escape detection even at the high luminosity LHC, the high energy LHC with \\sqrt{s}=33 TeV could unequivocally confirm or exclude this scenario. It should be possible to detect the expected light higgsinos at the ILC if these are kinematically accessible, and possibly also discriminate the expected compression of gaugino masses in the natural mini-landscape picture from the mass pattern expected in models with gaugino mass unification. The thermal WIMP signal should be accessible via direct detection searches at the multi-ton noble liquid detectors such as Xenon-nT or LZ. △ Less", "Under the expectation that nature is natural, we extend the Standard Model to include SUSY to stabilize the electroweak sector and PQ symmetry to stabilize the QCD sector. Then natural SUSY arises from a Kim-Nilles solution to the SUSY mu problem which allows for a little hierarchy where mu ~ f_a^2/M_P ~ 100-300 GeV while the SUSY particle mass scale m(SUSY)~ 1-10 TeV >> mu. Dark matter then consists of two particles: a higgsino-like WIMP and a SUSY DFSZ axion. The range of allowed axion mass values m(axion) depends on the mixed axion-higgsino relic density. The range of m(axion) is actually restricted in this case by limits on WIMPs from direct and indirect detection experiments. We plot the expected axion detection rate at microwave cavity experiments. The axion-photon-photon coupling is severely diminished by charged higgsino contributions to the anomalous coupling. In this case, the axion may retreat, at least temporarily, back into the regime of near invisibility. From our results, we urge new ideas for techniques which probe both deeper and more broadly into axion coupling versus axion mass parameter space. △ Less", "It is one of the major issues to realize a vacuum which breaks supersymmetry (SUSY) and R-symmetry, in a supersymmetric model. We study the model, where the same sector breaks the gauge symmetry and SUSY. In general, the SUSY breaking model without gauge symmetry has a flat direction at the minimum of F-term scalar potential. When we introduce U(1) gauge symmetry to such a SUSY breaking model, there can appear a runaway direction. Such a runway direction can be lifted by loop effects, and the gauge symmetry breaking and SUSY breaking are realized. The R-symmetry, that is assigned to break SUSY, is also spontaneously broken at the vacuum. This scenario can be extended to non-Abelian gauge theories. We also discuss application to the Pati-Salam model and the SU(5) grand unified theory. We see that non-vanishing gaugino masses are radiatively generated by the R-symmetry breaking and the gauge messenger contribution. △ Less", "In N=1 supergravity the tree-level scalar potential of the hidden sector may have a minimum with broken local supersymmetry (SUSY) as well as a supersymmetric Minkowski vacuum. These vacua can be degenerate, allowing for a consistent implementation of the multiple point principle. The first minimum where SUSY is broken can be identified with the physical phase in which we live. In the second supersymmetric phase, in flat Minkowski space, SUSY may be broken dynamically either in the observable or in the hidden sectors inducing a tiny vacuum energy density. We argue that the exact degeneracy of these phases may shed light on the smallness of the cosmological constant. Other possible phenomenological implications are also discussed. In particular, we point out that the presence of such degenerate vacua may lead to small values of the quartic Higgs coupling and its beta function at the Planck scale in the physical phase. △ Less", "The natural supersymmetry (SUSY) requires light stop quarks, light sbottom quark, and gluino to be around one TeV or lighter. The first generation squarks can be effectively large which does not introduce any hierarchy problem in order to escape the constraints from LHC. In this paper we consider a Yukawa deflect medation to realize the effective natural supersymmetry where the interaction between squarks and messenger are made natural under certain Frogget-Nelson $U(1)_X$ charge. The first generation squarks obtain large and postive contribution from the yukawa deflect mediation. The corresponding phenomenology as well as sparticle spectrum are discussed in detail. △ Less", "We show that couplings of the goldstino field, appearing when global supersymmetry is broken, can always be described in superspace by means of a nilpotent chiral superfield $X$, satisfying $X^2=0$. This applies to both F-term and D-term supersymmetry breaking, even when the supersymmetry breaking model admits a linear description. △ Less", "We propose a systematic programme to search for long-lived neutral particle signatures through a minimal set of displaced searches requiring significant missing transverse energy (dMETs). Our approach is to extend the well-established dark matter simplified models to include displaced vertices. The dark matter simplified models are used to describe the primary production vertex. A displaced secondary vertex, characterised by the mass of the long-lived particle and its lifetime, is added for the displaced signature. We show how these models can be motivated by, and mapped onto, complete models such as gauge-mediated SUSY breaking and models of neutral naturalness. We also outline how this approach may be used to extend other simplified models to incorporate displaced signatures and to characterise searches for long-lived charged particles. Displaced vertices are a striking signature with virtually no backgrounds from SM processes, and thus provide an excellent target for the high-luminosity run of the Large Hadron Collider. The proposed models and searches provide a first step towards a systematic broadening of the displaced dark matter search programme. △ Less", "We study supersymmetric (SUSY) models in which the muon $g-2$ discrepancy and the dark matter relic abundance are simultaneously explained. The muon $g-2$ discrepancy, or a 3$σ$ deviation between the experimental and theoretical results of the muon anomalous magnetic moment, can be resolved by SUSY models, which implies at least three SUSY multiplets have masses of $\\mathop{\\mathcal{O}}(100)\\, \\mathrm{GeV}$. In particular, models with the bino, higgsino and slepton having $\\mathop{\\mathcal{O}}(100)\\, \\mathrm{GeV}$ masses are not only capable to explain the muon $g-2$ discrepancy but naturally contains the neutralino dark matter with the observed relic abundance. We study constraints and future prospects of such models; in particular, we find that the LHC search for events with two hadronic taus and missing transverse momentum can probe this scenario through chargino/neutralino production. It is shown that almost all the parameter space of the scenario can be probed at the high-luminosity LHC, and a large part can also be tested at the XENON1T experiment as well as at the ILC. △ Less", "We revisit the constraints on inflation models by using the current cosmological observations involving the latest local measurement of the Hubble constant ($H_{0} = 73.00\\pm 1.75$ km s $^{-1}$ Mpc$^{-1}$). We constrain the primordial power spectra of both scalar and tensor perturbations with the observational data including the Planck 2015 CMB full data, the BICEP2 and Keck Array CMB B-mode data, the BAO data, and the direct measurement of $H_0$. In order to relieve the tension between the local determination of the Hubble constant and the other astrophysical observations, we consider the additional parameter $N_{\\rm eff}$ in the cosmological model. We find that, for the $Λ$CDM+$r$+$N_{\\rm eff}$ model, the scale invariance is only excluded at the 3.3$σ$ level, and $ΔN_{\\rm eff}>0$ is favored at the 1.6$σ$ level. Comparing the obtained 1$σ$ and 2$σ$ contours of $(n_s,r)$ with the theoretical predictions of selected inflation models, we find that both the convex and concave potentials are favored at 2$σ$ level, the natural inflation model is excluded at more than 2$σ$ level, the Starobinsky $R^2$ inflation model is only favored at around 2$σ$ level, and the spontaneously broken SUSY inflation model is now the most favored model. △ Less", "The lack of observation of supersymmetry thus far implies that the weak supersymmetry scale is larger than what was thought before the LHC era. This observation is strengthened by the Higgs boson mass measurement at $\\sim 125$ GeV which within supersymmetric models implies a large loop correction and a weak supersymmetry scale lying in the several TeV region. In addition if neutralino is the dark matter, its relic density puts further constraints on models often requiring coannihilation to reduce the neutralino relic density to be consistent with experimental observation. The coannihilation in turn implies that the mass gap between the LSP and the NLSP will be small leading to softer final states and making the observation of supersymmetry challenging. In this work we investigate stau coannihilation models within supergravity grand unified models and the potential of discovery of such models at the LHC in the post Higgs boson discovery era. We utilize a variety of signal regions to optimize the discovery of supersymmetry in the stau coannihilation region. In the analysis presented we impose the relic density constraint as well as the constraint of the Higgs boson mass. The range of sparticle masses discoverable up to the optimal integrated luminosity of the HL-LHC is investigated. It is found that the mass difference between the stau and the neutralino does not exceed $\\sim 20$ GeV over the entire mass range of the models explored. Thus the discovery of a supersymmetric signal arising from the stau coannihilation region will also provide a measurement of the neutralino mass. The direct detection of neutralino dark matter is analyzed within the class of stau coannihilation models investigated. The analysis is extended to include multi-particle coannihilation where stau along with chargino and the second neutralino enter in the stau coannihilation process. △ Less", "Presence of the light gravitino as dark matter candidate in a supersymmetric (SUSY) model opens up interesting collider signatures consisting of one or more hard photons together with multiple jets and missing transverse energy from the cascade decay. We investigate such signals at the 13 TeV LHC in presence of compressed SUSY spectra, consistent with the Higgs mass as well as collider and dark matter constraints. We analyse and compare the discovery potential in different benchmark scenarios consisting of both compressed and uncompressed SUSY spectra, considering different levels of compression and intermediate decay modes. Our conclusion is that compressed spectra upto 2.5 TeV are likely to be probed even before the high luminosity run of LHC. Kinematic variables are also suggested, which offer distinction between compressed and uncompressed spectra yielding similar event rates for photons + multi-jets + $E\\!\\!\\!\\!/_T$. △ Less", "A future proton-proton collider with center of mass energy around 100 TeV will have a remarkable capacity to discover massive new particles and continue exploring weak scale naturalness. In this work we will study its sensitivity to two stop simplified models as further examples of its potential power: pair production of stops that decay to tops or bottoms and higgsinos; and stops that are either pair produced or produced together with a gluino and then cascade down through gluinos to the lightest superpartner (LSP). In both simplified models, super-boosted tops or bottoms with transverse momentum of order TeV will be produced abundantly and call for new strategies to identify them. We will apply a set of simple jet observables, including track-based jet mass, N-subjettiness and mass drop, to tag the boosted hadronic or leptonic decaying objects and suppress the Standard Model as well as possible SUSY backgrounds. Assuming 10% systematic uncertainties, the future 100 TeV collider can discover (exclude) stops with masses up to 6 (7) TeV with 3 inverse attobarns of integrated luminosity if the stops decay to higgsinos. If the stops decay through gluinos to LSPs, due to additional SUSY backgrounds from gluino pair production, a higher luminosity of about 30 inverse attobarns is needed to discover stops up to 6 TeV. We will also discuss how to use jet observables to distinguish simplified models with different types of LSPs. The boosted top or bottom tagging strategies developed in this paper could also be used in other searches at a 100 TeV collider. For example, the strategy could help discover gluino pair production with gluino mass close to 11 TeV with 3 inverse attobarns of integrated luminosity. △ Less", "We consider the possibility that supersymmetry is broken above the inflationary mass scale and that the only \"low\" energy remnant of supersymmetry is the gravitino with mass of order the EeV scale. The gravitino in this class of models becomes a candidate for the dark matter of the Universe. To avoid the over-production of gravitinos from the decays of the next-to-lightest supersymmetric particle we argue that the supersymmetric spectrum must lie above the inflationary mass scale ($M_{\\rm SUSY} > 10^{-5} M_{\\rm P} \\sim 10^{13}$ GeV). Since $m_{3/2} \\simeq M_{\\rm SUSY}^2/M_{\\rm P}$, we expect $m_{3/2} \\gtrsim 0.2$ EeV. Cosmological constraints then predict a relatively large reheating temperature between $10^{10}$ and $10^{12}$ GeV. △ Less", "We proposed to introduce general messenger-matter interactions in the deflected anomaly mediated SUSY breaking scenario to explain the $g_μ-2$ anomaly. Scenarios with complete or incomplete GUT multiplet messengers are discussed, respectively. The introduction of incomplete GUT mulitiplets can be advantageous in various aspects. We found that the $g_μ-2$ anomaly can be solved in both scenarios under current constraints including the gluino mass bounds, while the scenarios with incomplete GUT representation messengers are more favored by the $g_μ-2$ data. We also found that the gluino is upper bounded by about 2.5 TeV (2.0 TeV) in Scenario A and 3.0 TeV (2.7 TeV) in Scenario B if the generalized deflected AMSB scenarios are used to fully account for the $g_μ-2$ anomaly at $3σ$ ($2σ$) level. Such a gluino should be accessible in the future LHC searches. Dark matter constraints, including DM relic density and direct detection bounds, favor the scenario B with incomplete GUT multiplets. Much of the allowed parameter space for the scenario B could be covered by the future DM direct detection experiments. △ Less", "The lack of evidence for weak scale supersymmetry from LHC Run-I and Run-II results along with null results from direct/indirect dark matter detection experiment have caused a paradigm shift in expected phenomenology of SUSY models. The SUSY dark matter candidate, neutralino $\\widetilde{Z}_1$, can only satisfy the measured dark matter abundance due to resonance- and co-annihilations in cMSSM model. Moreover, viable parameter space is highly fine-tuned in the cMSSM. In models that can still satisfy the naturalness condition such as NUHM2, the neutralino is underproduced due to its higgsino nature. Neutralino combined with axion that solves the strong CP problem can explain the observed dark matter in the universe. Here I briefly discuss implications of the mixed axion-neutralino scenario. △ Less", "In this note we report on the recent progress in the study of the strongly interacting sector of the Minimal R-symmetric Supersymmetric Standard Model (MRSSM). First, we discuss the limits originating from the search of the sgluon pair production in the same-sign lepton final state at the LHC. Next, we present the first available in literature calculation of the NLO SQCD corrections to the same-sign squark pair production in the MRSSM. We discuss the relative size of $k$-factors compared to the MSSM and some technical details that led to this result. △ Less", "Previous studies of a three family Yukawa unified supersymmetric grand unified theory (SUSY GUT) with SO(10) or Pati-Salam (PS) gauge symmetry proposed by Raby and students show that this model is able to fit low energy and inflation observables. However, the fit to low energy observables is not great especially for $\\sin2β$, and up and down quark masses. In this paper, we show that by choosing PS as the gauge group and modifying the Yukawa sector, the low energy fit improves significantly while other qualities of the model are maintained. In particular, the lightest SUSY particle is the neutralino with mass of order 300 - 500 GeV, the lightest stop and sbottom have mass of order 3 - 5 TeV and the CP odd Higgs mass is of order 5 - 6 TeV, so we are in the decoupling limit for the light Higgs. In addition, we reinterpret gluino simplified model analyses by the ATLAS and CMS collaborations and find that the most stringent gluino mass bound for our model is $M_{\\tilde{g}}\\sim1.9\\,\\text{TeV}$. The current best fit point, consistent with this bound, with gluino mass $M_{\\tilde{g}}=1.9\\,\\text{TeV}$ has $χ^2/\\text{dof}\\approx1.12$, compared to the best fit point of the previous model with $χ^2/\\text{dof}=1.90$. We find that predictions for the electric dipole moment of the electron, the branching ratio $BR(μ\\rightarrow e γ)$ and the CP violating angle in the lepton sector, $\\sinδ$, are affected significantly as compared to previous results. In summary, we are unable to rule out this model or place an upper bound on gluino mass accessible by this run of the LHC because the $χ^2/\\text{dof}$ of this model is well below $2σ$ even for a gluino mass as high as 2.7 TeV. On the bright side, this means that this model is still viable and we might find low energy SUSY particles in the near future. △ Less", "A light stop around the weak scale is a hopeful messenger of natural supersymmetry (SUSY), but it has not shown up at the current stage of LHC. Such a situation raises the question of the fate of natural SUSY. Actually, a relatively light stop can easily be hidden in a compressed spectra such as mild mass degeneracy between stop and neutralino plus top quark. Searching for such a stop at the LHC is a challenge. On the other hand, in terms of the argument of natural SUSY, other members in the stop sector, including a heavier stop $\\tilde{t}_2$ and lighter sbottom $\\tilde{b}_1$ (both assumed to be left-handed-like), are also supposed to be relatively light and therefore searching for them would provide an alternative method to probe natural SUSY with a compressed spectrum. In this paper we consider quasi-natural SUSY which tolerates relatively heavy colored partners near the TeV scale, with a moderately large mass gap between the heavier members and the lightest stop. Then $W/Z/h$ as companions of $\\tilde{t}_2$ and $\\tilde{b}_1$ decaying into $\\tilde{t}_1$ generically are well boosted, and they, along with other visible particles from $\\tilde{t}_1$ decay, are a good probe to study compressed SUSY. We find that the resulting search strategy with boosted bosons can have better sensitivity than those utilizing multi-leptons. △ Less", "We propose a simple modification of the no-scale supergravity Wess-Zumino model of Starobinsky-like inflation to include a Polonyi term in the superpotential. The purpose of this term is to provide an explicit mechanism for supersymmetry breaking at the end of inflation. We show how successful inflation can be achieved for a gravitino mass satisfying the strict upper bound $m_{3/2}< 10^3$ TeV, with favoured values $m_{3/2}\\lesssim\\mathcal{O}(1)$ TeV. The model suggests that SUSY may be discovered in collider physics experiments such as the LHC or the FCC. △ Less", "We present several advances in the effective field theory calculation of the Higgs mass in MSSM scenarios with heavy superparticles. In particular, we compute the dominant two-loop threshold corrections to the quartic Higgs coupling for generic values of the relevant SUSY-breaking parameters, including all contributions controlled by the strong gauge coupling and by the third-family Yukawa couplings. We also study the effects of a representative subset of dimension-six operators in the effective theory valid below the SUSY scale. Our results will allow for an improved determination of the Higgs mass and of the associated theoretical uncertainty. △ Less", "In this article we study the MSSM with stops and Higgs scalars much lighter than gluinos and squarks of the first two generations. In this setup, one should use an effective field theory with partial supersymmetry in which the gluino and heavy squarks are integrated out in order to connect SUSY parameters (given at a high scale) to observables in the stop sector. In the construction of this effective theory, valid below the gluino mass scale, we take into account $O(α_3)$ and $O(Y_{t,b}^2)$ effects and calculate the matching as well as the renormalization group evolution. As a result, the running of the parameters for the stop sector is modified with respect to the full MSSM and SUSY relations between parameters are broken. We show that for some couplings sizable numerical differences exist between the effective field theory approach and the naive calculation based on the MSSM running. △ Less", "We have found the possible region of parameters of the minimal supersymmetric standard model (MSSM) within the bounds from the experimental results of the Higgs mass, the rare decay mode of $b$-quark, the muon $g-2$, the dark matter abundance, and the direct searches for the lighter stop (i.e., one of the supersymmetric partners of top quark) at the LHC. We present numerical results of calculations for the one loop effects of supersymmetric particles in the processes of $τ^+ τ^-$, $b \\overline{b}$, $t \\overline{t}$, and $Z h$ production at the ILC by using benchmark points within the possible region of the MSSM parameters. △ Less", "We consider SUSY-like events with two decay chains, each terminating in an invisible particle, whose true energy and momentum are not measured in the detector. Nevertheless, a useful educated guess about the invisible momenta can still be obtained by optimizing a suitable invariant mass function. We review and contrast several proposals in the literature for such ansatze: four versions of the M_T2-assisted on-shell reconstruction (MAOS), as well as several variants of the on-shell constrained M_2 variables. We compare the performance of these methods with regards to the mass determination of a new particle resonance along the decay chain from the peak of the reconstructed invariant mass distribution. For concreteness, we consider the event topology of dilepton ttbar events and study each of the three possible subsystems, in both a ttbar and a SUSY example. We find that the M_2 variables generally provide sharper peaks and therefore better ansatze for the invisible momenta. We show that the performance can be further improved by preselecting events near the kinematic endpoint of the corresponding variable from which the momentum ansatz originates. △ Less", "We investigate possible scenarios of light-squark production at the LHC as a new mechanism to produce Higgs bosons in association with jets. The study is motivated by the SUSY search for H+jets events, performed by the CMS collaboration on 8 and 13 TeV data using the razor variables. Two simplified models are proposed to interpret the observations in this search. The constraint from Run I and the implications for Run II and beyond are discussed. △ Less", "I discuss a renormalisable model based on $Δ(27)$ family symmetry with an $SO(10)$ grand unified theory (GUT) with spontaneous geometrical $CP$ violation. The symmetries are broken close to the GUT breaking scale, yielding the minimal supersymmetric standard model. Low-scale Yukawa structure is dictated by the coupling of matter to $ Δ(27) $ antitriplets $ \\barφ $ whose vacuum expectation values are aligned in the CSD3 directions by the superpotential. Light physical Majorana neutrinos masses emerge from the seesaw mechanism within $SO(10)$. The model predicts a normal neutrino mass hierarchy with the best-fit lightest neutrino mass $ m_1 \\sim 0.3 $ meV, $CP$-violating oscillation phase $δ^l\\approx 280^{\\circ}$ and the remaining neutrino parameters all within $1 σ$ of their best-fit experimental values. △ Less", "For a long time, the minimal supersymmetric standard model (MSSM) with light masses for the supersymmetric states was considered as the most natural extension of the Standard Model of particle physics. Consequently, a valid approximation was to match the MSSM to the precision measurement directly at the electroweak scale. This approach was also utilized by all dedicated spectrum generators for the MSSM. However, the higher the supersymmetric (SUSY) scale is, the bigger the uncertainties which are introduced by this matching. We point out important consequences of a two-scale matching, where the running parameters within the SM are calculated at $M_Z$ and evaluated up to the SUSY scale, where they are matched to the full model. We show the impact on gauge coupling unification as well as the SUSY mass spectrum. Also the Higgs mass prediction for large supersymmetric masses has been improved by performing the calculation within an effective SM. The approach presented here is now also available in the spectrum generator SPheno. Moreover, also SARAH was extended accordingly and gives the possibility to study these effects now in many different supersymmetric models. △ Less", "We study the grand unification model flipped $SU(5)$ with additional vector-like particle multiplets, or ${\\cal F}$-$SU(5)$ for short, in the framework of General No-Scale Supergravity. In our analysis we allow the supersymmetry (SUSY) breaking soft terms to be generically non-zero, thereby extending the phenomenologically viable parameter space beyond the highly constrained one-parameter version of ${\\cal F}$-$SU(5)$. In this initial inquiry, the mSUGRA/CMSSM SUSY breaking terms are implemented. We find this easing away from the vanishing SUSY breaking terms enables a more broad mass range of vector-like particles, dubbed flippons, including flippons less than 1 TeV that could presently be observed at the LHC2, as well as a lighter gluino mass and SUSY spectrum overall. This presents heightened odds that the General No-Scale ${\\cal F}$-$SU(5)$ viable parameter space can be probed at the LHC2. The phenomenology comprises both bino and higgsino dark matter, including a Higgs funnel region. Particle states emerging from the SUSY cascade decays are presented to experimentally distinguish amongst the diverse phenomenological regions. △ Less", "SCYNet (SUSY Calculating Yield Net) is a tool for testing supersymmetric models against LHC data. It uses neural network regression for a fast evaluation of the profile likelihood ratio. Two neural network approaches have been developed: one network has been trained using the parameters of the 11-dimensional phenomenological Minimal Supersymmetric Standard Model (pMSSM-11) as an input and evaluates the corresponding profile likelihood ratio within milliseconds. It can thus be used in global pMSSM-11 fits without time penalty. In the second approach, the neural network has been trained using model-independent signature-related objects, such as energies and particle multiplicities, which were estimated from the parameters of a given new physics model. While the calculation of the energies and particle multiplicities takes up computation time, the corresponding neural network is more general and can be used to predict the LHC profile likelihood ratio for a wider class of new physics models. △ Less", "The supersymmetric Nambu-Jona-Lasinio model proposed by Cheng, Dai, Faisel and Kong is re-analyzed by using an auxiliary superfield method in which a hidden local U(1) symmetry emerges. It is shown that, in the healthy field-space region where no negative metric particles appear, only SUSY preserving vacua can be realized in the weak coupling regime and a composite massive spin-1 supermultiplets appear as a result of spontaneous breaking of the hidden local U(1) symmetry. In the strong coupling regime, on the other hand, SUSY is dynamically broken, but it is always accompanied by negative metric particles. △ Less", "Weak scale supersymmetry (SUSY) remains a compelling extension of the Standard Model because it stabilizes the quantum corrections to the Higgs and W, Z boson masses. In natural SUSY models these corrections are, by definition, never much larger than the corresponding masses. Natural SUSY models all have an upper limit on the gluino mass, too high to lead to observable signals even at the high luminosity LHC. However, in models with gaugino mass unification, the wino is sufficiently light that supersymmetry discovery is possible in other channels over the entire natural SUSY parameter space with no worse than 3% fine-tuning. Here, we examine the SUSY reach in more general models with and without gaugino mass unification (specifically, natural generalized mirage mediation), and show that the high energy LHC (HE-LHC), a pp collider with \\sqrt{s}=33 TeV, will be able to detect the SUSY signal over the entire allowed mass range. Thus, HE-LHC would either discover or conclusively falsify natural SUSY with better than 3% fine-tuning using a conservative measure that allows for correlations among the model parameters. △ Less", "We investigate how the constraint results of inflation models are affected by considering the latest local measurement of $H_0$ in the global fit. We use the observational data, including the Planck CMB full data, the BICEP2 and Keck Array CMB B-mode data, the BAO data, and the latest measurement of Hubble constant, to constrain the $Λ$CDM+$r$+$N_{\\rm eff}$ model, and the obtained 1$σ$ and 2$σ$ contours of $(n_s, r)$ are compared to the theoretical predictions of selected inflationary models. We find that, in this fit, the scale invariance is only excluded at the 3.3$σ$ level, and $ΔN_{\\rm eff}>0$ is favored at the 1.6$σ$ level. The natural inflation model is now excluded at more than 2$σ$ level; the Starobinsky $R^2$ model becomes only favored at around 2$σ$ level; the most favored model becomes the spontaneously broken SUSY inflation model; and, the brane inflation model is also well consistent with the current data, in this case. △ Less", "We recover in QCD an amazingly simple relationship between the anomalous dimensions, resummed through next-to-next-to-leading-logarithmic order, in the Dokshitzer-Gribov-Lipatov-Altarelli-Parisi evolution equations for the first Mellin moments $D_{q,g}(μ^2)$ of the quark and gluon fragmentation functions, which correspond to the average hadron multiplicities in jets initiated by quarks and gluons, respectively. This relationship, which is independent of the number of quark flavors, dramatically improves previous treatments by allowing for an exact solution of the evolution equations. So far, such relationships have only been known from supersymmetric QCD, where $C_F/C_A=1$. This also allows us to extend our knowledge of the ratio $D_g^-(μ^2)/D_q^-(μ^2)$ of the minus components by one order in $\\sqrt{α_s}$. Exploiting available next-to-next-to-next-to-leading-order information on the ratio $D_g^+(μ^2)/D_q^+(μ^2)$ of the dominant plus components, we fit the world data of $D_{q,g}(μ^2)$ for charged hadrons measured in $e^+e^-$ annihilation to obtain $α_s^{(5)}(M_Z)=0.1205\\genfrac{}{}{0pt}{}{+0.016}{-0.0020}$. △ Less", "We study the effective theory of a generic class of hidden sectors where supersymmetry is broken together with an approximate R-symmetry at low energy. The light spectrum contains the gravitino and the pseudo-Nambu-Goldstone boson of the R-symmetry, the R-axion. We derive new model-independent constraints on the R-axion decay constant for R-axion masses ranging from GeV to TeV, which are of relevance for hadron colliders, lepton colliders and B-factories. The current bounds allow for the exciting possibility that the first sign of SUSY will be the R-axion. We point out its most distinctive signals, providing a new experimental handle on the properties of the hidden sector and a solid motivation for searches of axion-like particles. △ Less", "We study the naturalness properties of the $B-L$ Supersymmetric Standard Model (BLSSM) and compare them to those of the Minimal Supersymmetric Standard Model (MSSM) at both low (i.e., Large Hadron Collider) energies and high (i.e., unification) scales. By adopting standard measures of naturalness, we assess that, in presence of full unification of the additional gauge couplings and scalar/fermionic masses of the BLSSM, such a scenario reveals a somewhat higher degree of Fine-Tuning (FT) than the MSSM, when the latter is computed at the unification scale and all available theoretical and experimental constraints, but the Dark Matter (DM) ones, are taken into account. Yet, such a difference, driven primarily by the collider limits requiring a high mass for the gauge boson associated to the breaking of the additional $U(1)_{B-L}$ gauge group of the BLSSM in addition to the $SU(3)_C\\times SU(2)_L \\times U(1)_Y$ of the MSSM, should be regarded as a modest price to pay for the former in relation to the latter, if one notices that the non-minimal scenario offers a significant volume of parameter space where numerous DM solutions of different compositions can be found to the relic density constraints, unlike the case of the minimal structure, wherein only one type of solution is accessible over an ever diminishing parameter space. In fact, this different level of tension within the two SUSY models in complying with current data is well revealed when the FT measure is recomputed in terms of the low energy spectra of the two models, over their allowed regions of parameter space now in presence of all DM bounds, as it is shown that the tendency is now opposite, the BLSSM appearing more natural than the MSSM. △ Less", "We investigate the lower bounds of sfermion masses from the constraints of chromoelectric dipole moments (CEDMs) in the natural SUSY-type sfermion mass spectrum, in which stop mass $m_{\\tilde t}$ is much smaller than the other sfermion masses $m_0$. The natural SUSY-type sfermion mass spectrum has been studied since the supersymmetric (SUSY) flavor-changing neutral currents (FCNC) are suppressed because of large sfermion masses of the first two generations, and the weak scale is stabilized because of the light stop. However, this type of sfermion mass spectrum is severely constrained by CEDM, because the light stop contributions to the up quark CEDM are not decoupled in the limit $m_0\\rightarrow\\infty$, while the down quark CEDM is decoupled in the limit. It is important that the constraints are severe even if SUSY-breaking parameters (and Higgsino mass) are taken to be real because complex diagonalizing matrices of Yukawa matrices, which are from complex Yukawa couplings, generate nonvanishing CP phases in off-diagonal elements of sfermion mass matrices. We calculate the CEDM of up and down quarks numerically in the minimal SUSY standard model, and give the lower bounds for stop mass and the other sfermion masses. We show that the lower bound of stop mass becomes 7 TeV to satisfy the CEDM constraints from Hg EDM. The result is not acceptable if the weak scale stability is considered seriously. We show that if the up-type Yukawa couplings are taken to be real at the grand unification scale, the CEDM constraints are satisfied even if $m_{\\tilde t}\\sim 1$ TeV. △ Less", "In the framework of MSSM inflation, matter and gravitino production are here investigated through the decay of the fields which are coupled to the udd inflaton, a gauge invariant combination of squarks. After the end of inflation, the flat direction oscillates about the minimum of its potential, losing at each oscillation about 56% of its energy into bursts of gauge/gaugino and scalar quanta when crossing the origin. These particles then acquire a large inflaton VEV-induced mass and decay perturbatively into the MSSM quanta and gravitinos, transferring the inflaton energy very efficiently via instant preheating. Regarding thermalization, we show that the MSSM degrees of freedom thermalize very quickly, yet not immediately by virtue of the large vacuum expectation value of the inflaton, which breaks the $SU(3)_C\\times U(1)_Y$ symmetry into a residual $U(1)$. The energy transfer to the MSSM quanta is very efficient, since full thermalization is achieved after only $\\mathcal{O}(40)$ complete oscillations. The udd inflaton thus provides an extremely efficient reheating of the Universe, with a temperature $T_{reh}=\\mathcal{O}(10^8\\mathrm{GeV})$ that allows for instance several mechanisms of baryogenesis. We also compute the gravitino number density from the perturbative decay of the flat direction and of the SUSY multiplet. We find that the gravitinos are produced in negligible amount and satisfy cosmological bounds such as the Big Bang Nucleosynthesis (BBN) and Dark Matter (DM) constraints. △ Less", "We examined the viability of new-type charged Q-ball dark matter scenario. We considered the case where the relics can be treated as ordinary ions, to which we applied the observational constraint from MICA experiment, where no trail of heavy ion-like object is observed in $10^9$ years old ancient muscovite mica. We have found that the allowed parameter region exists but is smaller than the neutral Q-ball dark matter case. We have also discussed whether our scenario is actually consistent with Affleck-Dine mechanism. △ Less", "In this letter, we present LHC limits on the minimal universal extra dimension (MUED) model from LHC Run 1 data and current limits from searches of the ongoing Run 2. Typical collider signals of the Kaluza-Klein (KK) states mimic generic degenerate supersymmetry (SUSY) missing transverse momentum signatures since the excited KK particles cascade decay to jets, leptons and the lightest KK particle which is stable due to KK parity and thus evades detection. We test the parameter space against a large number of supersymmetry based missing energy searches implemented in the public code CheckMATE. We demonstrate the complementarity of employing various searches which target a large number of final state signatures, and we derive the most up to date limits on the MUED parameter space from 13 TeV SUSY searches. △ Less", "We study the two-body decays of the gluino at full one-loop level in the Minimal Supersymmetric Standard Model with quark-flavour violation (QFV) in the squark sector. The renormalization is done in the $\\overline{\\rm DR}$ scheme. The gluon and photon radiations are included by adding the corresponding three-body decay widths. We discuss the dependence of the gluino decay widths on the QFV parameters. The main dependence stems from the $\\tilde c_R - \\tilde t_R$ mixing in the decays to up-type squarks, and from the $\\tilde s_R - \\tilde b_R$ mixing in the decays to down-type squarks due to the strong constraints from B-physics on the other quark-flavour mixing parameters. The full one-loop corrections to the gluino decay widths are mostly negative and of the order of about -10\\%. The QFV part stays small in the total width but can vary up to -8\\% for the decay width into the lightest squark. For the corresponding branching ratio the effect is somehow washed out by at least a factor of two. The electroweak corrections can be as large as 35\\% of the SUSY QCD corrections. △ Less", "800 GeV gluino pair production is simulated using ISASUSY 1.1 MC-program. The cascade decay of the gluino into two lightest neutralinos, $\\widetilde{g} \\rightarrow \\widetildeχ_2^0 X$, $\\widetildeχ_2^0 \\rightarrow μ^+ μ^- \\widetildeχ_1^0$, is studied for a convenient set of SUSY parameters: $μ$ = 200 GeV, tan$β$ = 2, average squark masses of 1600 GeV, charged Higgs mass of 500 GeV, and top quark mass of 140 GeV. With such parameters the mass difference between $\\widetildeχ_2^0$ and $\\widetildeχ_1^0$ is less than the mass of Z. As a background, $t\\bar{t}$, Z + jets, WW, WZ and ZZ events were generated using ISAJET 6.50 MC-program. The granularities and energy resolutions of the calorimeters in the pseudorapidity range of $\\midη\\mid$ < 5 are taken into account. If missing transverse momentum is greater than 200 GeV, the number of jets in the calorimeters is 4 or more, the invariant mass of two isolated muons is less than 80 GeV, the background in the muon transverse momentum distribution is negligible. △ Less", "The $N=1$ supergravity models of cosmological inflation with inflaton belonging to a massive vector multiplet and spontaneous SUSY breaking after inflation are reformulated as the supersymmetric $U(1)$ gauge theories of a massless vector superfield interacting with the Higgs and Polonyi chiral superfields, all coupled to supergravity. The $U(1)$ gauge sector is identified with the $U(1)$ gauge fields of the super-GUT coupled to supergravity, whose gauge group has a $U(1)$ factor. A positive cosmological constant (dark energy) is included. The scalar potential is calculated, and its de Sitter vacuum solution is found to be stable. △ Less", "YM and QCD are known to be renormalizable, but not ultraviolet finite, order by order in perturbation theory. It is a fundamental question as to whether YM or QCD are ultraviolet finite, or only renormalizable, order by order in the large-N 't Hooft or Veneziano expansions. We demonstrate that Renormalization Group and Asymptotic Freedom imply that in 't Hooft large-N expansion the S-matrix in YM is ultraviolet finite, while in both 't Hooft and Veneziano large-N expansions the S-matrix in confining QCD with massless quarks is renormalizable but not ultraviolet finite. By the same argument it follows that the large-N $\\mathcal{N}=1$ SUSY YM S-matrix is ultraviolet finite as well. Besides, we demonstrate that the correlators of local gauge-invariant operators, as opposed to the S-matrix, are renormalizable but in general not ultraviolet finite in the large-N 't Hooft and Veneziano expansions, neither in pure YM and $\\mathcal{N}=1$ SUSY YM nor a fortiori in massless QCD. Moreover, we compute explicitly the counterterms that arise renormalizing the large-N 't Hooft and Veneziano expansions, by deriving in confining massless QCD-like theories a low-energy theorem of NSVZ type, that relates the log derivative with respect to the gauge coupling of a $k$-point correlator, or the log derivative with respect to the RG-invariant scale, to a $k+1$-point correlator with the insertion of $Tr F^2$ at zero momentum. Finally, we argue that similar results hold in the large-N limit of a vast class of confining QCD-like theories with massive matter fields, provided a renormalization scheme exists, as for example $\\overline{MS}$, in which the beta function is independent on the masses. In particular, in both 't Hooft and Veneziano large-N expansions the S-matrix in confining massive QCD and massive $\\mathcal{N}=1$ SUSY QCD is renormalizable but not ultraviolet finite. △ Less", "We have calculated the high spin parton splitting amplitudes postulating the Yangian symmetry of the scattering amplitudes for tensorgluons. The resulting splitting amplitudes coincide with the earlier calculations, which were based on the BCFW recursion relations. The resulting formula unifies all known splitting probabilities found earlier in gauge field theories. It describes splitting probabilities for integer and half-integer spin particles. We also checked that the splitting probabilities fulfil generalised Kounnas-Ross N=1 supersymmetry relations hinting to the fact that the underlying theory can be formulated in an explicit supersymmetric manner. △ Less", "Two independent criteria are presented that together guarantee exponential suppression of the two-loop cosmological constant in non-supersymmetric heterotic strings. They are derived by performing calculations in both the full string theory and in its underlying effective field theory, and come respectively from contributions that involve only physical untwisted states, and contributions that include orbifold twisted states. The criteria depend purely on the spectrum and charges, so a model that satisfies them will do so with no fine-tuning. An additional consistency condition (emerging from the so-called separating degeneration limit of the two-loop diagram) is that the one-loop cosmological constant must also be suppressed, by Bose-Fermi degeneracy in the massless spectrum. We remark that theories of this kind, that have continued exponential suppression to higher orders, can form the basis for a string implementation of the \"naturalness without supersymmetry\" idea. △ Less", "We show that the $B-L$ Supersymmetric Standard Model with Inverse Seesaw (BLSSMIS) provides new Dark Matter (DM) candidates (lightest right-handed sneutrino and lightest $B-L$ neutralino) with mass of order few hundreds GeV, while most of other SUSY spectrum can be quite heavy, consistently with the current Large Hadron Collider (LHC) constraints. We emphasize that the thermal relic abundance and direct detection experiments via relic neutralino scattering with nuclei impose stringent constraints on the $B-L$ neutralinos. These constraints can be satisfied by few points in the parameter space where the $B-L$ lightest neutralino is higgsino-like, which cannot explain the observed Galactic Center (GC) gamma-ray excess measured by Fermi-LAT. The lightest right-handed sneutrino DM is analysed. We show that for a wide region of parameter space the lightest right-handed sneutrino, with mass between 80 GeV and 1.2 TeV, can satisfy the limits of the relic abundance and the scattering cross with nuclei. We also show that the lightest right-handed sneutrino with mass ${\\cal O}(100)$ GeV can account for the observed GC gamma-ray results. △ Less", "We evaluate the amount of fine-tuning in constrained versions of the minimal supersymmetric standard model (MSSM), with different boundary conditions at the GUT scale. Specifically we study the fully constrained version as well as the cases of non-universal Higgs and gaugino masses. We allow for the presence of additional non-holomorphic soft-terms which we show further relax the fine-tuning. Of particular importance is the possibility of a Higgsino mass term and we discuss possible origins for such a term in UV complete models. We point out that loop corrections typically lead to a reduction in the fine-tuning by a factor of about two compared to the estimate at tree-level, which has been overlooked in many recent works. Taking these loop corrections into account, we discuss the impact of current limits from SUSY searches and dark matter on the fine-tuning. Contrary to common lore, we find that the MSSM fine-tuning can be as small as 10 while remaining consistent with all experimental constraints. If, in addition, the dark matter abundance is fully explained by the neutralino LSP, the fine-tuning can still be as low as $\\sim$ 20 in the presence of additional non-holomorphic soft-terms. We also discuss future prospects of these models and find that the MSSM will remain natural even in the case of a non-discovery in the foreseeable future. △ Less", "We review the realization of Starobinsky-type inflation within induced-gravity Supersymmetric (SUSY) and non-SUSY models. In both cases, inflation is in agreement with the current data and can be attained for subplanckian values of the inflaton. The corresponding effective theories retain perturbative unitarity up to the Planck scale and the inflaton mass is predicted to be 3x10^13 GeV. The supergravity embedding of these models is achieved by employing two gauge singlet chiral supefields, a superpotential that is uniquely determined by a continuous R and a discrete Zn symmetry, and several (semi)logarithmic Kaehler potentials that respect these symmetries. Checking various functional forms for the non-inflaton accompanying field in the Kaehler potentials, we identify four cases which stabilize it without invoking higher order terms. △ Less", "We discuss electric dipole moments (EDMs) in the framework of CP-violating natural supersymmetry (SUSY). Recent experimental results have significantly tightened constraints on the EDMs of electrons and of mercury, and substantial further progress is expected in the near future. We assess how these results constrain the parameter space of natural SUSY. In addition to our discussion of SUSY, we provide a set of general formulas for two-loop fermion EDMs, which can be applied to a wide range of models of new physics. In the SUSY context, the two-loop effects of stops and charginos respectively constrain the phases of $A_t μ$ and $M_2 μ$ to be small in the natural part of parameter space. If the Higgs mass is lifted to 125 GeV by a new tree-level superpotential interaction and soft term with CP-violating phases, significant EDMs can arise from the two-loop effects of $W$ bosons and tops. We compare the bounds arising from EDMs to those from other probes of new physics including colliders, $b \\to s γ$, and dark matter searches. Importantly, improvements in reach not only constrain higher masses, but require the phases to be significantly smaller in the natural parameter space at low mass. The required smallness of phases sharpens the CP problem of natural SUSY model building. △ Less", "A search for a neutrino signal from WIMP pair annihilations in the centre of the Earth has been performed with the data collected with the ANTARES neutrino telescope from 2007 to 2012. The event selection criteria have been developed and tuned to maximise the sensitivity of the experiment to such a neutrino signal. No significant excess of neutrinos over the expected background has been observed. Upper limits at $90\\%$ C.L. on the WIMP annihilation rate in the Earth and the spin independent scattering cross-section of WIMPs to nucleons $σ^{SI}_p$ were calculated for WIMP pair annihilations into either $τ^{+}τ^{-}$, $W^+W^-$, $b\\overline{b}$ or the non-SUSY $ν_μ\\barν_μ$ as a function of the WIMP mass (between $25\\,\\mathrm{GeV/c^2}$ and $1000\\,\\mathrm{GeV/c^2}$) and as a function of the thermally averaged annihilation cross section times velocity $\\langleσ_{A} v\\rangle_{Earth}$ of the WIMPs in the centre of the Earth. For masses of the WIMP close to the mass of iron nuclei ($50\\,\\mathrm{GeV/c^2}$), the obtained limits on $σ^{SI}_p$ are more stringent than those obtained by other indirect searches. △ Less", "In this paper we compute the $\\mathcal{O}(α_s α_t)$ threshold corrections to the running strong coupling constant, the top-Yukawa coupling and the top-quark mass within the MSSM. These parameters present a non-decoupling behaviour with the supersymmetry scale $M_{\\rm SUSY}$. Our numerical analysis shows that the mixed QCD-Yukawa corrections can amount to few GeV for the running top-quark mass and range at the percent level for the top-Yukawa coupling. △ Less", "We study the large $N$ $θ$ dependence and the $η^\\prime$ potential in supersymmetric QCD with small soft SUSY-breaking terms. Known exact results in SUSY QCD are found to reflect a variety of expectations from large $N$ perturbation theory, including the presence of branches and the behavior of theories with matter (both with $N_f \\ll N$ and $N_f \\sim N$). However, there are also striking departures from ordinary QCD and the conventional large $N$ description: instanton effects, when under control, are not exponentially suppressed at large $N$, and branched structure in supersymmetric QCD is always associated with approximate discrete symmetries. We suggest that these differences motivate further study of large $N$ QCD on the lattice. △ Less", "The interpolation from supersymmetric to non-supersymmetric heterotic theories is studied, via the Scherk-Schwarz compactification of supersymmetric 6D theories to 4D. A general modular-invariant Scherk-Schwarz deformation is deduced from the properties of the 6D theories at the endpoints, which significantly extends previously known examples. This wider class of non-supersymmetric 4D theories opens up new possibilities for model building. The full one-loop cosmological constant of such theories is studied as a function of compactification radius for a number of cases, and the following interpolating configurations are found: two supersymmetric 6D theories related by a T-duality transformation, with intermediate 4D maximum or minimum at the string scale; a non-supersymmetric 6D theory interpolating to a supersymmetric 6D theory, with the 4D theory possibly having an AdS minimum; a \"metastable\" non-supersymmetric 6D theory interpolating via a 4D theory to a supersymmetric 6D theory. △ Less", "The dark matter (DM) blind spots in the Minimal Supersymmetric Standard Model (MSSM) refer to the parameter regions where the couplings of the DM particles to the $Z$-boson or the Higgs boson are almost zero, leading to vanishingly small signals for the DM direct detections. In this paper, we carry out comprehensive analyses for the DM searches under the blind-spot scenarios in MSSM. Guided by the requirement of acceptable DM relic abundance, we explore the complementary coverage for the theory parameters at the LHC, the projection for the future underground DM direct searches, and the indirect searches from the relic DM annihilation into photons and neutrinos. We find that (i) the spin-independent (SI) blind spots may be rescued by the spin-dependent (SD) direct detection in the future underground experiments, and possibly by the indirect DM detections from IceCube and SuperK neutrino experiments; (ii) the detection of gamma rays from Fermi-LAT may not reach the desirable sensitivity for searching for the DM blind-spot regions; (iii) the SUSY searches at the LHC will substantially extend the discovery region for the blind-spot parameters. The dark matter blind spots thus may be unblinded with the collective efforts in future DM searches. △ Less", "Motivated by the latest results of the LHC Run-2 and LUX experiments, we examine the status of the constrained minimal supersymmetric standard model (CMSSM) by performing a global fit. We construct a likelihood function including the electroweak precision observables, $B$-physics measurements, LHC Run-1 and -2 data of SUSY direct searches, Planck observation of the dark matter relic density and the combined LUX Run-3 and -4 detection limits. Based on the profile likelihood functions of 1 billion samples, we obtain the following observations: (i) The stau coannihilation region has been mostly excluded by the latest LHC Run-2 data; (ii) The focus point region has been largely covered by the LUX-2016 limits while the $A$-funnel region has been severely restricted by flavor observables like $B_s \\to μ^+μ^-$. The remaining parts of both regions will be totally covered by the future LZ dark matter experiment; (iii) The masses of the stop, the lightest neutralino and the gluino have been pushed up to 1033 GeV, 449 GeV and 2285 GeV, respectively. △ Less", "A light stop with mass almost degenerate with the lightest neutralino has important connections with both naturalness and dark matter relic abundance. This region is also very hard to probe at colliders. In this paper, we demonstrate the potential of searching for such stop particles at the LHC from sbottom decays, focusing on two channels with final states $2\\ell+E^{\\rm miss}_{\\rm T}$ and $1b1\\ell+E^{\\rm miss}_{\\rm T}$. We found that, if the lightest sbottom has mass around or below 1 TeV and has a significant branching ratio to decay to stop and $W$ ($\\tilde{b} \\to \\tilde{t}\\,W$), a stop almost degenerate with neutralino can be excluded up to about 500-600 GeV at the 13 TeV LHC with $300\\,{\\rm fb}^{-1}$ data. The searches we propose are complementary to other SUSY searches at the LHC and could have the best sensitivity to the stop-bino coannihilation region. Since they involve final states which have already been used in LHC searches, a reinterpretation of the search results already has sensitivity. Further optimization could deliver the full potential of these channels. △ Less", "A computation of inclusive cross sections for neutral Higgs boson production through gluon fusion and bottom-quark annihilation is presented in the MSSM with complex parameters. The predictions for the gluon-fusion process are based on an explicit calculation of the leading-order cross section for arbitrary complex parameters which is supplemented by higher-order corrections: massive top- and bottom-quark contributions at NLO QCD, in the heavy top-quark effective theory the top-quark contribution up to N$^3$LO QCD including a soft expansion for the $\\mathcal{CP}$-even component of the light Higgs boson. For its $\\mathcal{CP}$-odd component and the heavy Higgs bosons the contributions are incorporated up to NNLO QCD. Two-loop electroweak effects are also incorporated, and SUSY QCD corrections at NLO are interpolated from the MSSM with real parameters. Finite wave function normalisation factors ensuring correct on-shell properties of the external Higgs bosons are incorporated from the code $\\texttt{FeynHiggs}$. For the typical case of a strong admixture of the two heavy Higgs bosons it is demonstrated that squark effects are strongly dependent on the phases of the complex parameters. The remaining theoretical uncertainties for cross sections are discussed. The results have been implemented into an extension of the numerical code $\\texttt{SusHi}$ called $\\texttt{SusHiMi}$. △ Less", "The supersymmetric (SUSY) minimal SO(10) model is a well-motivated grand unified theory, where the Standard Model (SM) fermions have Yukawa couplings with only one ${\\bf 10}$-plet and one $\\overline{\\bf 126}$-plet Higgs fields and it is highly non-trivial if the realistic quark and lepton mass matrices can be reproduced in this context. It has been known that the best fit for all the SM fermion mass matrices is achieved by a vacuum expectation value of the $\\overline{\\bf 126}$-plet Higgs field being at the intermediate scale of around ${\\cal O}(10^{13})$ GeV. Under the presence of the SO(10) symmetry breaking at the intermediate scale, the successful SM gauge coupling unification is at risk and likely to be spoiled. Recently, it has been shown that the low-energy fermion mass matrices, except for the down-quark mass predicted to be too low, are very well-fitted without the intermediate scale. In order to resolve the too-low down quark mass while keeping the other fittings intact, we consider SUSY threshold corrections to reproduce the right down quark mass. It turns out that this requires flavor-dependent soft parameters. Motivated by this fact, we calculate particle mass spectra at low energies with flavor-dependent sfermion masses at the grand unification scale. We present a benchmark particle mass spectrum which satisfies a variety of phenomenological constraints, in particular, the observed SM-like Higgs boson mass of around 125 GeV and the relic abundance of the neutralino dark matter as well as the experimental result of the muon anomalous magnetic moment. In the resultant mass spectrum, sleptons in the first and second generations, bino and winos are all light, and this scenario can be tested at the LHC Run-2 in the near future. △ Less", "We examine a renormalizable SUSY SO(10) model without fine-tuning. We show how to construct MSSM doublets and to predict proton decay. We find that in the minimal set of Yukawa couplings the model is consistent with the experiments, while including $120_H$ to fit the data there are inconsistencies. △ Less", "We have explored the possibilities of scenarios with heavy gluinos and light stops in supersymmetric (SUSY) standard models with extra vector-like multiplets. If we assume the hierarchical structure for soft masses of the minimal supersymmetric standard model (MSSM) scalar fields and extra scalars, the light stop and the observed Higgs boson can be realized. While the stau is the lightest SUSY particle (LSP) in broad parameter space, we have found that the neutralino LSP is realized in the case that the non-zero soft parameters for the MSSM Higgs doublets or the non-universal gaugino masses are assumed. △ Less", "We consider Supersymmetric (SUSY) and non-SUSY models of chaotic inflation based on the phi^n potential with n=2 or 4. We show that the coexistence of an exponential nonminimal coupling to gravity, fR=Exp(cR phi^p), with a kinetic mixing of the form fK=cK fR^m can accommodate inflationary observables favored by the Planck and Bicep2/Keck Array results for p=1 and 2, 1<=m<=15 and 2.6x10^(-3)<=rRK=cR/cK^(p/2)<=1, where the upper limit is not imposed for p=1. Inflation is of hilltop type and it can be attained for subplanckian inflaton values with the corresponding effective theories retaining the perturbative unitarity up to the Planck scale. The supergravity embedding of these models is achieved employing two chiral gauge singlet supefields, a monomial superpotential and several (semi)logarithmic or semipolynomial Kaehler potentials. △ Less", "We discuss a realization of a small field inflation based on string inspired supergravities. In theories accompanying extra dimensions, compactification of them with small radii is required for realistic situations. Since the extra dimension can have a periodicity, there will appear (quasi-)periodic functions under transformations of moduli of the extra dimensions in low energy scales. Such a periodic property can lead to a UV completion of so-called multi-natural inflation model where inflaton potential consists of a sum of multiple sinusoidal functions with a decay constant smaller than the Planck scale. As an illustration, we construct a SUSY breaking model, and then show that such an inflaton potential can be generated by a sum of world sheet instantons in intersecting brane models on extra dimensions containing $T^2/{\\mathbb Z}_2$ orbifold. We show also predictions of cosmic observables by numerical analyzes. △ Less", "We perform a likelihood analysis of the constraints from accelerator experiments and astrophysical observations on supersymmetric (SUSY) models with SU(5) boundary conditions on soft SUSY-breaking parameters at the GUT scale. The parameter space of the models studied has 7 parameters: a universal gaugino mass $m_{1/2}$, distinct masses for the scalar partners of matter fermions in five- and ten-dimensional representations of SU(5), $m_5$ and $m_{10}$, and for the $\\mathbf{5}$ and $\\mathbf{\\bar 5}$ Higgs representations $m_{H_u}$ and $m_{H_d}$, a universal trilinear soft SUSY-breaking parameter $A_0$, and the ratio of Higgs vevs $\\tan β$. In addition to previous constraints from direct sparticle searches, low-energy and flavour observables, we incorporate constraints based on preliminary results from 13 TeV LHC searches for jets + MET events and long-lived particles, as well as the latest PandaX-II and LUX searches for direct Dark Matter detection. In addition to previously-identified mechanisms for bringing the supersymmetric relic density into the range allowed by cosmology, we identify a novel ${\\tilde u_R}/{\\tilde c_R} - \\tildeχ^0_1$ coannihilation mechanism that appears in the supersymmetric SU(5) GUT model and discuss the role of ${\\tilde ν_τ}$ coannihilation. We find complementarity between the prospects for direct Dark Matter detection and SUSY searches at the LHC. △ Less", "In general, we can propose the hybrid supersymmetry breakings and hybrid mediations in the Supersymmetric Standard Models (SSMs). In this paper, we study the hybrid mediation for supersymmetry (SUSY) breaking. In particular, we study how to keep the good properties of gravity mediation, gauge mediation, and anomaly mediation, while solve their problems simultaneously. As an example, we consider the anomaly-gravity mediation, where all the supersymmetric particles (sparticles) obtain the SUSY breaking soft terms from the traditional gravity mediation while gauge mediation gives dominant contributions to the soft terms in the colored sector due to the splitted messengers. Thus, we can realize the electroweak supersymmetry naturally where the sleptons, sneutrinos, and electroweakinos are light within one TeV while the squarks and gluino are heavy around a few TeVs. And then we can explain 125 GeV Higgs mass, satisfy the LHC SUSY search bounds, and explain the anomalous magnetic momement of muon, etc. Moreover, the gluino and squarks are well beyond the current LHC Run II searches. △ Less", "We derive the latest constraints on various simplified models of natural SUSY with light higgsinos, stops and gluinos, using a detailed and comprehensive reinterpretation of the most recent 13 TeV ATLAS and CMS searches with $\\sim 15$ fb$^{-1}$ of data. We discuss the implications of these constraints for fine-tuning of the electroweak scale. While the most \"vanilla\" version of SUSY (the MSSM with $R$-parity and flavor-degenerate sfermions) with 10% fine-tuning is ruled out by the current constraints, models with decoupled valence squarks or reduced missing energy can still be fully natural. However, in all of these models, the mediation scale must be extremely low ($<100$ TeV). We conclude by considering the prospects for the high-luminosity LHC era, where we expect the current limits on particle masses to improve by up to $\\sim 1$ TeV, and discuss further model-building directions for natural SUSY that are motivated by this work. △ Less", "In the supersymmetric scenario known as mirage mediation (MM), the soft SUSY breaking terms receive comparable anomaly-mediation and moduli-mediation contributions leading to the phenomenon of mirage unification. The simplest MM SUSY breaking models which are consistent with the measured Higgs mass and sparticle mass constraints are strongly disfavoured by fine-tuning considerations. However, while MM makes robust predictions for gaugino masses, the scalar sector is quite sensitive to specific mechanisms for moduli stabilization and potential uplifting. We suggest here a broader setup of generalized mirage mediation (GMM), where heretofore discrete parameters are allowed as continuous to better parametrize these other schemes. We find that natural SUSY spectra consistent with both the measured value of m(h). as well as LHC lower bounds on superpartner masses are then possible. We explicitly show that models generated from natural GMM may be beyond the reach of even high-luminosity LHC searches. In such a case, the proposed International Linear e^+e^- Collider (ILC) will be required for natural SUSY discovery via higgsino pair production reactions. We also outline prospects for detection of higgsino-like WIMPs from natural GMM. △ Less", "We present a supersymmetric (SUSY) model based on trinification $[\\mathrm{SU}(3)]^3$ and family $\\mathrm{SU}(3)_\\mathrm{F}$ symmetries embedded into a maximal subgroup of $\\mathrm{E}_8$, where the sectors of light Higgs bosons and leptons are unified into a single chiral supermultiplet. The common origin of gauge trinification and of the family symmetry from $\\mathrm{E}_8$ separates the model from other trinification-based GUTs, as it protects, in particular, the Standard Model fermions from gaining mass until the electroweak symmetry is broken. Furthermore, it allows us to break the trinification symmetry via vacuum expectation values in $\\mathrm{SU}(3)$-adjoint scalars down to a left-right symmetric theory. Simultaneously, it ensures the unification of the gauge and Yukawa couplings as well as proton stability. Although the low-energy regime (e.g. mass hierarchies in the scalar sector determined by a soft SUSY-breaking mechanism) is yet to be established, these features are one key to revive the once very popular trinification-based GUTs. △ Less", "Within the framework of the Minimal Supersymmetric Standard Model, we investigate the 1-loop effects of supersymmetric particles on the third-generation fermion-pair production at the ILC. Three sets of the SUSY parameters are proposed which are consistent with the observed Higgs mass, the muon g-2, the Dark Matter abundance and the decay branching ratio of B meson. We discuss on the possibility of discovering the signals consistent with SUSY as well as of experimentally distinguishing the proposed sets of SUSY parameters. △ Less", "Although $SO(10)$ Supersymmetric (SUSY) Grand Unification Theories (GUTs) are very attractive for neutrino mass and mixing, it is often quite difficult to achieve successful leptogenesis from the lightest right-handed neutrino $N_1$ due to the strong relations between neutrino and up-type quark Yukawa couplings. We show that in a realistic model these constraints are relaxed, making $N_1$ leptogenesis viable. To illustrate this, we calculate the baryon asymmetry of the Universe $ Y_B $ from flavoured $ N_1 $ leptogenesis in a recently proposed $ Δ(27) \\times SO(10) $ SUSY GUT. The flavoured Boltzmann equations are solved numerically, and comparison with the observed $ Y_B $ places constraints on the allowed values of right-handed neutrino masses and neutrino Yukawa couplings. The flavoured $SO(10)$ SUSY GUT is not only fairly complete and predictive in the lepton sector, but can also explain the BAU through leptogenesis with natural values in the lepton sector albeit with some tuning in the quark sector. △ Less", "Soft-Collinear Effective Theory (SCET) is a framework for modeling the infrared structure of theories whose long distance behavior is dominated by soft and collinear divergences. This paper demonstrates that SCET can be made compatible with supersymmetry (SUSY). Explicitly, the effective Lagrangian for $\\mathcal{N} = 1$ SUSY Yang-Mills is constructed and shown to be a complete description for the infrared of this model. For contrast, we also construct the effective Lagrangian for chiral SUSY theories with Yukawa couplings, specifically the single flavor Wess-Zumino model. Only a subset of the infrared divergences are reproduced by the Lagrangian -- to account for the complete low energy description requires the inclusion of local operators. SCET is formulated by expanding fields along a light-like direction and then subsequently integrating out degrees-of-freedom that are away from the light-cone. Defining the theory with respect to a specific frame obfuscates Lorentz invariance -- given that SUSY is a space-time symmetry, this presents a possible obstruction. The cleanest language with which to expose the congruence between SUSY and SCET requires exploring two novel formalisms: collinear fermions as two-component Weyl spinors, and SCET in light-cone gauge. By expressing SUSY Yang-Mills in \"collinear superspace\", a slice of superspace derived by integrating out half the fermionic coordinates, the light-cone gauge SUSY SCET theory can be written in terms of superfields. As a byproduct, bootstrapping up to the full theory yields the first algorithmic approach for determining the SUSY Yang-Mills on-shell superspace action. This work paves the way toward discovering the effective theory for the collinear limit of $\\mathcal{N} = 4$ SUSY Yang-Mills. △ Less", "Motivated by the simple toroidal compactification of extra-dimensional SUSY theories, we investigate on a partially $N=2$ supersymmetric (SUSY) extension of the standard model which has an $N=2$ SUSY sector and an $N=1$ SUSY sector. We point out that below the scale of the partially breaking of $N=2$ to $N=1$, the ratio of Yukawa to gauge couplings embedded in the original $N=2$ gauge interaction in the $N=2$ sector becomes greater due to a fixed point. Since at the partially breaking scale the sfermion masses in the $N=2$ sector is suppressed due to the $N=2$ non-renormalization theorem, the anomaly mediation effect becomes important. If dominant, the anomaly induced masses for the sfermions in the $N=2$ sector are almost UV-insensitive due to the fixed point. Interestingly, these masses are always positive, i.e. no tachyonic slepton problem. From an example model, we show interesting phenomena differing from the ordinary MSSM. In particular, the dark matter can be a sbino, i.e. the scalar component of the $N=2$ vector multiplet of $\\rm U(1)_Y$. To obtain the correct dark matter abundance, the mass of sbino, as well as the MSSM sparticles in the $N=2$ sector which have a typical mass pattern of anomaly mediation, is required to be small. Therefore, this scenario can be tested and confirmed in the LHC and may be further confirmed by the measurement of the $N=2$ Yukawa couplings in future colliders. This model can explain dark matter, muon $g-2$ anomaly, gauge coupling unification and relaxes some ordinary problems within the MSSM. Also, it is compatible with thermal leptogenesis. △ Less", "We utilize the recent LHC-13 TeV data to study the lower mass bound on top-squark (stop) in natural supersymmetry. We recast the LHC sparticle inclusive search of $(\\ge 1){\\rm jets} + E^{miss}_T$ with $α_T$ variable, the direct stop pair search (1-lepton channel and all-hadronic channel) and the monojet analyses. We find that these searches are complementary depending on stop and higgsino masses: for a heavy stop the all-hadronic stop pair search provides the strongest bound, for an intermediate stop the inclusive SUSY analysis with $α_T$ variable is most efficient, while for a compressed stop-higgsino scenario the monojet search plays the key role. Finally, the lower mass bound on a stop is: (i) 320 GeV for compressed stop-higgsino scenario (mass splitting less than 20 GeV); (ii) 765 (860) GeV for higgsinos lighter than 300 (100) GeV. △ Less", "We present FlexibleEFTHiggs, a method for calculating the SM-like Higgs pole mass in SUSY (and even non-SUSY) models, which combines an effective field theory approach with a diagrammatic calculation. It thus achieves an all order resummation of leading logarithms together with the inclusion of all non-logarithmic 1-loop contributions. We implement this method into FlexibleSUSY and study its properties in the MSSM, NMSSM, E6SSM and MRSSM. In the MSSM, it correctly interpolates between the known results of effective field theory calculations in the literature for a high SUSY scale and fixed-order calculations in the full theory for a sub-TeV SUSY scale. We compare our MSSM results to those from public codes and identify the origin of the most significant deviations between the DR-bar programs. We then perform a similar comparison in the remaining three non-minimal models. For all four models we estimate the theoretical uncertainty of FlexibleEFTHiggs and the fixed-order DR-bar programs thereby finding that the former becomes more precise than the latter for a SUSY scale above a few TeV. Even for sub-TeV SUSY scales, FlexibleEFTHiggs maintains the uncertainty estimate around 2-3 GeV, remaining a competitive alternative to existing fixed-order computations. △ Less", "We discuss resonant leptogenesis arising from the decays of two nearly-degenerate right-handed neutrinos, identified as the inflaton and stabiliser superfields in a model of chaotic sneutrino inflation. We compare an analytical estimate of the baryon asymmetry $ η_B $ in the Boltzmann approximation to a numerical solution of the full density matrix equations, and find that the analytical result fails to capture the correct physics in certain regions of parameter space. The observed baryon asymmetry can be realised for a breaking of the mass degeneracy as small as $ \\mathcal{O}(10^{-8}) $. The origin of such a small mass splitting is explained by considering supersymmetry (SUSY) breaking in supergravity, which requires a constant in the superpotential of the order of the gravitino mass $ m_{3/2} $ to cancel the cosmological constant. This yields additional terms in the (s)neutrino mass matrices, lifting the degeneracy and linking $ η_B $ to the SUSY breaking scale. We find that achieving the correct baryon asymmetry requires a gravitino mass $ m_{3/2} \\geq \\mathcal{O}(100) $ TeV. △ Less", "Flavor symmetries à la Froggatt-Nielsen~(FN) provide a compelling way to explain the hierarchies of fermionic masses and mixing angles in the Yukawa sector. In Supersymmetric~(SUSY) extensions of the Standard Model where the mediation of SUSY breaking occurs at scales larger than the breaking of flavor, this symmetry must be respected not only by the Yukawas of the superpotential, but by the soft-breaking masses and trilinear terms as well. In this work we show that contrary to naive expectations, even starting with completely flavor blind soft-breaking in the full theory at high scales, the low-energy sfermion mass matrices and trilinear terms of the effective theory, obtained upon integrating out the heavy mediator fields, are strongly non-universal. We explore the phenomenology of these SUSY flavor models after the latest LHC searches for new physics. △ Less", "We propose a scenario where only the Higgs multiplets have direct couplings to a supersymmetry (SUSY) breaking sector. The standard model matter multiplets as well as the gauge multiples are sequestered from the SUSY breaking sector; therefore, their masses arise via anomaly mediation at the high energy scale with a gravitino mass of $\\sim$100 TeV. Due to renormalization group running effects from the Higgs soft masses, the masses of the third generation sfermions become O(10) TeV at the low energy scale, while the first and second generation sfermion masses are O(0.1-1) TeV, avoiding the tachyonic slepton problem and flavor changing neutral current problem. With the splitting mass spectrum, the muon g-2 anomaly is explained consistently with the observed Higgs boson mass of 125 GeV. Moreover, the third generation Yukawa couplings are expected to be unified in some regions. △ Less", "In this paper, we investigate predictions of the SO(10) Grand Unified Theory (GUT), where an extra U(1)$^\\prime$ gauge symmetry remains up to the supersymmetry (SUSY) breaking scale. The minimal setup of SO(10) GUT unifies quarks and leptons into a ${\\bf 16}$-representational field in each generations. The setup, however, suffers from the realization of the realistic Yukawa couplings at the electroweak scale. In order to solve this problem, we introduce ${\\bf 10}$-representational matter fields, and then the two kinds of matter fields mix with each other at the SUSY breaking scale, where the extra U(1)$^\\prime$ gauge symmetry breaks down radiatively. One crucial prediction is that the Standard Model quarks and leptons are given by the linear combinations of the fields with two different U(1)$^\\prime$ charges. The mixing also depends on the flavor. Consequently, the U(1)$^\\prime$ interaction becomes flavor violating, and the flavor physics is the smoking-gun signal of our GUT model. The flavor violating $Z'$ couplings are related to the fermion masses and the CKM matrix, so that we can derive some explicit predictions in flavor physics. We especially discuss $K$-$\\overline{K}$ mixing, $B_{(s)}$-$\\overline{B_{(s)}}$ mixing, and the (semi)leptonic decays of $K$ and $B$ in our model. We also study the flavor violating $μ$ and $τ$ decays and discuss the correlations among the physical observables in this SO(10) GUT framework. △ Less", "We consider a class of models with extra complex scalars that are charged under both the Standard Model and a hidden strongly coupled $SU(N)_H$ gauge sector, and discuss the scenarios where the new scalars are identified as the messenger fields that mediate the spontaneously broken supersymmetries from the hidden sector to the visible sector. The new scalars are embedded into 5-plets and 10-plets of an $SU(5)_V$ gauge group that potentially unifies the Standard Model gauge groups. The Higgs bosons remain as elementary particles. In the supersymmetrized version of this class of models, vector-like fermions whose left-handed components are superperpartners of the new scalars are introduced. Due to the hidden strong force, the new low-energy scalars hadronize before decaying and thus evade the common direct searches of the supersymmetric squarks. This can be seen as a gauge mediation scenario with the scalar messenger fields forming low-energy bound states. We also discuss the possibility that among the tower of bound states formed under hidden strong dynamics (at least the TeV scale) one of them is the dark matter candidate, as well as the collider signatures (e.g. diphoton, diboson or dijet) of the models that may show up in the near future. △ Less", "We propose a limited class of models, describing interacting chiral multiplets with a non-minimal coupling to a vector multiplet, in curved superspace of $N=1$ supergravity. Those models are suitable for the inflationary model building in supergravity with inflaton assigned to a massive vector multiplet and spontaneous SUSY breaking in Minkowski vacuum after inflation, for any values of the inflationary parameters $n_s$ and $r$, and any scale of SUSY breaking. △ Less", "We show that by combining the elementary-Goldstone-Higgs scenario and supersymmetry it is possible to raise the scale of supersymmetry breaking to several TeVs by relating it to the spontaneous-symmetry-breaking one. This is achieved by first enhancing the global symmetries of the super-Higgs sector to SU(4) and then embedding the electroweak sector and the Standard-Model fermions. We determine the conditions under which the model achieves a vacuum such that the resulting Higgs is a pseudo-Goldstone boson. The main results are: the supersymmetry-breaking scale is identified with the spontaneous-symmetry-breaking scale of SU(4) which is several TeVs above the radiatively induced electroweak scale; intriguingly the global symmetry of the Higgs sector predicts the existence of two super-Higgs multiplets with one mass eigenstate playing the role of the pseudo-Goldstone Higgs; the symmetry-breaking dynamics fixes $\\tan β= 1$ and requires a supplementary singlet chiral superfield. We finally discuss the spectrum of the model that now features superpartners of the Standard-Model fermions and gauge bosons in the multi-TeV range. △ Less", "The standard model (SM)-like Higgs boson $h$ has spin zero and light mass around weak scale, so it has the potential to mediate a new and relatively strong force for the particle $φ$ in the new physics (NP) sector; then $φ$ may form bound state $B_h$ via exchanging $h$. This phenomena may arise in a wide context, for instance composite Higgs, supersymmetry (SUSY) and radiative neutrino (or more widely in the models with a strong Higgs portal for triggering classical scale symmetry breaking or strong first-order phase transition). For illustration we focus on two typical examples, the stop/sbottom sector and an inert Higgs doublet. Furthermore, we point out that $B_h$ must give rise to a clear resonant di-Higgs signature, which recently has been extensively searched for at the large hadron collider (LHC). Moreover, Higgs radiative decay such as to di-photon probably will be significantly modified provided that $φ$ is charged or/and colored. △ Less", "A key research question at the Large Hadron Collider (LHC) is the test of models of new physics. Testing if a particular parameter set of such a model is excluded by LHC data is a challenge: It requires the time consuming generation of scattering events, the simulation of the detector response, the event reconstruction, cross section calculations and analysis code to test against several hundred signal regions defined by the ATLAS and CMS experiment. In the BSM-AI project we attack this challenge with a new approach. Machine learning tools are thought to predict within a fraction of a millisecond if a model is excluded or not directly from the model parameters. A first example is SUSY-AI, trained on the phenomenological supersymmetric standard model (pMSSM). About 300,000 pMSSM model sets - each tested with 200 signal regions by ATLAS - have been used to train and validate SUSY-AI. The code is currently able to reproduce the ATLAS exclusion regions in 19 dimensions with an accuracy of at least 93 percent. It has been validated further within the constrained MSSM and a minimal natural supersymmetric model, again showing high accuracy. SUSY-AI and its future BSM derivatives will help to solve the problem of recasting LHC results for any model of new physics. SUSY-AI can be downloaded at http://susyai.hepforge.org/. An on-line interface to the program for quick testing purposes can be found at http://www.susy-ai.org/. △ Less", "Search for the bottom squarks (sbottoms) at the Large Hadron Collider (LHC) has recently assumed a heightened focus in the hunt for Supersymmetry (SUSY). The popular framework of the Next-to-Minimal Supersymmetric Standard Model (NMSSM) could conceive a naturally light sbottom which could easily be consistent with available constraints from the experiments at the LHC. Phenomenology of such sbottoms could in principle be as striking as that for a light top squark (stop) thanks to a rather nontrivial neutralino sector (with appreciable mixing among the neutral higgsinos and the singlino) that the scenario gives rise to. Nonetheless, finding such sbottoms might require a moderately large amount of data ($\\sim 300$ $\\text{fb}^{-1}$) at the 13 TeV run of the LHC. A multi-channel analysis establishing a generic depletion of events in the usual $2b$-$jets$ +$\\text{\\sout{E}}_T$ final state while registering, in conjunction, characteristically significant rates in various multi-lepton final states accompanied by $b$-$jets$ might point not only to the presence of light sbottom(s) but could also shed crucial light on their compositions and the (singlino) nature of the lightest SUSY particle (LSP). △ Less", "We consider the signals arising from top partner pair production at the LHC as a probe of theories of Neutral Naturalness. We focus on scenarios in which top partners carry electroweak charges, such as Folded SUSY or the Quirky Little Higgs. In this class of theories the top partners are pair produced as quirky bound states, since they are charged under a mirror color group whose lightest states are hidden glueballs. The quirks promptly de-excite and annihilate into glueballs, which decay back to SM fermions via Higgs mixing. This can give rise to spectacular signatures at the LHC, such displaced decays, or high-multiplicity prompt production of many hard $\\bar b b$ or $τ^+ τ^-$ pairs. We show that signals arising from top partner pair production constitute the primary discovery channel for this class of theories in most regions of parameter space, and might provide the only experimental probe of scenarios with sub-cm glueball decay lengths. The measurement of top partner masses and couplings, which could be used to test the neutral naturalness mechanism directly, is also a tantalizing possibility. △ Less", "In this paper we examine gauge coupling unification of the the non-SUSY SO(10) grand unified theory proposed by Babu and Mohapatra at the two loop level. This theory breaks down to the standard model in a single step and has the distinguishing feature of TeV non-standard model scalars. This leads to a plethora of interesting new physics at the TeV scale and the discovery of new particles at the LHC. This model gives rise to testable proton decay, neutron-antineutron oscillations, provides a mechanism for baryogenesis, and contains potential dark matter candidates. In this paper, we compute the two loop beta function and show that this model unifies to two loop order around $10^{15}$ GeV. We then compute the proton lifetime, taking into account threshold effects and show that these effects place it above the Super Kamiokande limit. △ Less", "In natural SUSY models higgsinos are always light because μ^2 cannot be much larger than M_Z^2, while squarks and gluinos may be very heavy. Unless gluinos are discovered at LHC13, the commonly assumed unification of gaugino mass parameters will imply correspondingly heavy winos and binos, resulting in a higgsino-like LSP and small inter-higgsino mass splittings. The small visible energy release in higgsino decays makes their pair production difficult to detect at the LHC. Relaxing gaugino mass universality allows for relatively light winos and binos without violating LHC gluino mass bounds and without affecting naturalness. In the case where the bino mass M_1<~ μ, then one obtains a mixed bino-higgsino LSP with instead sizable w_1-z_1 and z_2-z_1 mass gaps. The thermal neutralino abundance can match the measured dark matter density in contrast to models with a higgsino-like LSP where WIMPs (weakly interacting massive particles) are underproduced by factors of 10-15. If instead M_2<~ μ, then one obtains a mixed wino-higgsino LSP with large z_2-z_1 but small w_1-z_1 mass gaps with still an under-abundance of thermally-produced WIMPs. Portions of the light wino parameter space may already be excluded by the IceCube upper bound on the spin-dependent neutralino-nucleon cross section. We discuss dark matter detection in other direct and indirect detection experiments and caution that the bounds from these must be interpreted with care. Finally, we show that LHC13 experiments should be able to probe these non-universal mass scenarios via a variety of channels including multi-lepton + etmiss events, WZ+etmiss events, Wh+etmiss events and W^\\pm W^\\pm +etmiss events from electroweak chargino and neutralino production. △ Less", "Here we ask if it is possible to have string unification in $\\mathsf{SU(5)\\times SU(5)}$ gauge group. We specifically investigate the weakly coupled heterotic string unification for the four couplings in this framework. We show that only a limited versions of $\\mathsf{SU(5)\\times SU(5)}$ with adjoint representation components at intermediated scales, between $M_Z$ and $Λ$ (unification), are allowed. This is essentially due to the limitation in the parameter space to the gauge coupling constant $α_1^{-1}$ related to hypercharge. Indeed, only the vanishing hypercharge decompositions of $\\mathsf{SU(5)_L}$ subgroup can help to this unification, namely, the fermion and boson triplets, $Σ_3\\sim(1,3)_0$, and the fermion and boson octets, $Σ_8\\sim(8,1)_0$. Thus, these intermediate particles are compatible with the so-called Adjoint $\\mathsf{SU(5)}$. The triplets must live in TeV region and could be accessible at colliders while the octets must alive in very high energy scales. We also show that the non-SUSY unification scenario requires the introduction of an additional $\\mathsf{SU(2)_L}$ scalar color triplet, $η\\sim (3,3)_{-{1}/{3}}$, at relatively low energies ($\\sim 10^{5-11}$GeV), and it may induce the proton decay. △ Less"]