["In this paper, the bound state solution of the modified Klein-Fock-Gordon equation is obtained for the Hulthén plus ring-shaped lake potential by using the developed scheme to overcome the centrifugal part. The energy eigenvalues and corresponding radial and azimuthal wave functions are defined for any $l\\neq0$ angular momentum case on the conditions that scalar potential is whether equal and nonequal to vector potential, the bound state solutions of the Klein-Fock-Gordon equation of the Hulthén plus ring-shaped like potential are obtained by Nikiforov-Uvarov (NU) and supersymmetric quantum mechanics (SUSYQM) methods. The equivalent expressions are obtained for the energy eigenvalues, and the expression of radial wave functions transformations to each other is revealed owing to both methods. The energy levels and the corresponding normalized eigenfunctions are represented in terms of the Jacobi polynomials for arbitrary $l$ states. A closed form of the normalization constant of the wave functions is also found. It is shown that the energy eigenvalues and eigenfunctions are sensitive to $n_r$ radial and $l$ orbital quantum numbers. △ Less", "We consider a class of $b-τ$ Yukawa unified Supersymmetric (SUSY) $SU(5)$ GUTs, in which the asymptotic gaugino $M_{1,2,3}$ masses are generated through a combination of gravity and mirage mediated supersymmetry breaking. Due to the contributions from mirage mediation, $M_{3}$ is always lighter than M_{1} and M_{2}, and consequently for the range of asymptotic masses considered, the gluino mass at low scale is bounded from above at about 4 TeV. We realize two different regions, one in which the MSSM $μ-$term is less than about 3 TeV. This region yields a stop mass up to 5 TeV, and the stop mass is nearly degenerate with the LSP neutralino for mass around 0.8 to 1.7 TeV. A stau mass can be realized up to about 5 TeV, and the stau mass is approximately degenerate with the LSP neutralino for mass around 2 to 3 TeV. In addition, an A-funnel solution $m_{A}$ with mass $\\sim 1.4-1.8$ TeV is realized. A second region, on the other hand, arises for gluino around 1.1 TeV. The $μ-$term is rather large than 20 TeV, and the LSP neutralino is a bino-wino mixture. The gluino mass ($\\sim 0.8-1.2$ TeV) is nearly degenerate with the LSP neutralino mass and hence, the gluino-neutralino coannihilation processes play a role in reducing the relic abundance of LSP neutralino down to ranges allowed by the current WMAP measurements. The two regions above can be distinguished through the direct detection experiments. The first region with relatively low $μ$ values yields Higgsino-like DM, whose scattering on the nucleus typically has a large cross-section. We find that such solutions are still allowed by the current results from the LUX experiment, and they will be severely tested by the LUX-Zeplin experiment. The second region contains bino-wino DM whose scattering cross-section is relatively low. These solutions are harder to rule out in the foreseeable future. △ Less", "Several ideas exist how the stringent mass limits from LHC on new coloured particles can be avoided. One idea are the so-called `stealth' scenarios in which missing transversal energy (MET) is avoided due a peculiar mass configuration. It is usually assumed that the cascade decay of the dominantly-produced coloured particle finishes in a two-body decay, where this mass configuration leads to a very small amount of MET. We discuss here the potential impact of other decay channels, either loop-induced or via off-shell mediators. It is shown that those channels already become important even for moderate branching ratios of 10%. Larger branching ratios in particular into a photon can completely wash out all benefits of the stealth setup. We discuss this in a model-independent form, but also at the simplest SUSY stealth scenario which can be realised in the NMSSM. △ Less", "We present an overview of direct and indirect constraints in the MSSM, in CP-conserving and CP-violating MSSM scenarios, with some emphasis on the importance of combining the constraints from different sectors, namely SUSY and Higgs direct searches at the LHC, flavour physics, dark matter and electric dipole moments. △ Less", "In this work we consider the HL-LHC discovery potential in the 3 inverse ab data set for gluinos in the gluino-weakino associated production channel. We propose a search in the jets plus missing energy channel which exploits kinematic edge features in the reconstructed transverse mass of the gluino. We find that for squark masses in the 2 TeV range we have 5 sigma discovery potential for gluino masses in the range of 2.4 to 3 TeV, competitive with the projections for discovery potential in the gluino pair production channel. △ Less", "We test the impact of the ATLAS and CMS multi-lepton searches performed at the LHC with 8 as well as 13 TeV center-of-mass energy (using only the pre-2018 results) on the chargino and neutralino sector of the NMSSM. Our purpose consists in analyzing the actual reach of these searches for a full model and in emphasizing effects beyond the MSSM that affect the performance of current (MSSM-inspired) electroweakino searches. To this end, we consider several scenarios characterizing specific features of the NMSSM electroweakino sector. We then perform a detailed collider study, generating Monte-Carlo events through Pythia and testing against current LHC constraints implemented in the public tool CheckMATE. We find e.g. that SUSY decay chains involving intermediate singlino or Higgs-singlet states can modify the naive MSSM-like picture of the constraints by inducing final-states with softer or less-easily identifiable SM particles -- reversely, a compressed configuration with singlino NLSP occasionally induces final states that are rich with photons, which could provide complementary search channels. △ Less", "The format defined by the SUSY Les Houches Accord (SLHA) is widely used in high energy physics to store and exchange information. It is no longer applied only to a few supersymmetric models, but the general structure is adapted to all kind of models. Therefore, it is helpful to have parsers at hand which can import files in the SLHA format into high-level languages as Python and Mathematica in order to further process the data. The focus of the xSLHA package, which exists now for Python and Mathematica, was on a fast read-in of large data samples. Moreover, also some blocks used by different tools, as HiggsBounds for instance, deviate from the standard conventions. These are also supported by xSLHA. △ Less", "The future electron-proton collider proposals, LHeC and FCC-he, can deliver $\\mathcal{O}$(TeV) center-of-mass energy collisions, higher than most of the proposed lepton accelerators, with $\\mathcal{O}$(ab$^{-1}$) luminosity, while maintaining a much cleaner experimental environment as compared to the hadron machines. This unique capability of $e^- p$ colliders can be harnessed in probing BSM scenarios giving final states that look like hadronic noise at $pp$ machines. In the present study, we explore the prospects of detecting such a prompt signal having multiple soft jets at the LHeC. Such a signal can come from the decay of gluino in RPV or Stealth SUSY, where there exists a gap in the current experimental search with $m_{\\tilde{g}} \\approx 50 - 70$ GeV. We perform a simple analysis to demonstrate that, with simple signal selection cuts, we can close this gap at the LHeC at 95 % confidence level, even in the presence of a reasonable systematic error. More sophisticated signal selection strategies and detailed knowledge of the detector can be used to improve the prospects of signal detection. △ Less", "We present some highlights on the complementaries of the Higgs and SUSY searches at the LHC, using the 8 and 13 TeV results. In particular, we discuss the constraints that can be obtained on the MSSM parameters by the determination of the Higgs boson mass and couplings. In addition, we investigate the interplay with heavy Higgs searches, and evaluate how higher LHC luminosities and a future linear collider can help probing the pMSSM Higgs sector and reconstructing the underlying parameters. △ Less", "Searches for the pair-production of colored supersymmetric particles are presented. The results cover different scenarios of gluino and squark production, including models of split supersymmetry that predict long-lived gluinos, compressed supersymmetric mass spectra characterized by soft decay products as well as models with R-parity violation with low or no missing transverse momentum in the final state. The results are based on proton-proton collisions recorded at $\\sqrt{s}=$ 13 TeV with the CMS detector. △ Less", "Based on ideas that relate meson and baryon spectrum considering SUSY QM and light front holography, we propose a procedure to obtain LFWF for baryons starting from mesonic ones. We apply a procedure suggested for Gaussian ansatz used to study mesons. △ Less", "We perform a detailed study of the various decay channels of the heavy charged and neutral gauge bosons ($W_R$ and $Z_R$ respectively) in a left-right supersymmetric (LRSUSY) framework. The decay branching ratios of the $W_R$ and $Z_R$ bosons depend significantly on the particle spectrum and composition of the SUSY states. We show several combinations of mass spectrum for the SUSY particles to facilitate the decay of these heavy gauge bosons into various combinations of final states. Finally, we choose two benchmark points and perform detailed collider simulations for these heavy gauge bosons in the context of the high energy and high luminosity run of the large hadron collider. We analyze two SUSY cascade decay channels -- mono-$W$ + $\\slashed{E}_T$ and mono-$Z$ + $\\slashed{E}_T$ along with the standard dilepton and dijet final states. Our results show that the existence of these heavy gauge bosons can be ascertained in the direct decay channels of dilepton and dijet whereas the other two channels will be required to establish the supersymmetric nature of this model. △ Less", "We construct a supersymmetric model for leptons and quarks with the flavor symmetry Delta(384) and CP. The peculiar features of lepton and quark mixing are accomplished by the stepwise breaking of the flavor and CP symmetry. The correct description of lepton mixing angles requires two steps of symmetry breaking, where tri-bimaximal mixing arises after the first step. In the quark sector the Cabibbo angle theta_C equals sin pi/16 = 0.195 after the first step of symmetry breaking and it is brought into full agreement with experimental data after the second step. The two remaining quark mixing angles are generated after the third step of symmetry breaking. All three leptonic CP phases are predicted, sin delta^l = -0.936, |sin alpha|=|sin beta|=1/sqrt{2}. The amount of CP violation in the quark sector turns out to be maximal at the lowest order and is correctly accounted for, when higher order effects are included. Charged fermion masses are reproduced with the help of operators with different numbers of flavor (and CP) symmetry breaking fields. Light neutrino masses, arising from the type-I seesaw mechanism, can accommodate both mass orderings, normal and inverted. The vacuum alignment of the flavor (and CP) symmetry breaking fields is discussed at leading and at higher order. △ Less", "We give a status report on the theory of resummed quantum gravity. We recapitulate the use of our resummed quantum gravity approach to Einstein's general theory of relativity to estimate the value of the cosmological constant as $ρ_Λ=(0.0024{\\mathrm{eV}})^4$. The estimate is made in the context of the Planck scale cosmology formulation of Bonanno and Reuter. We discuss the constraints on susy GUT models that follow from the closeness of the estimate to experiment. Various consistency checks on the calculation are addressed and we use the Heisenberg uncertainty principle to remove a large part of the remaining uncertainty in our estimate of $ρ_Λ$. △ Less", "We present an overview of the status and recent developments of FeynHiggs (current version: 2.14.3) since version 2.12.2. The main purpose of FeynHiggs is the calculation of the Higgs-boson masses and other physical observables in the MSSM. For a precise prediction of the Higgs-boson masses for low and high SUSY scales, state-of-the-art fixed-order and effective-field-theory calculations are combined. We first discuss improvements of the fixed-order calculation, namely an optional $\\overline{\\text{DR}}$ renormalization of the stop sector and a renormalization of the Higgs sector ensuring the chosen input mass to be equivalent with the corresponding physical mass. Second, we describe improvements of the EFT calculation, i.e. an implementation of non-degenerate threshold corrections as well as an interpolation for complex parameters. Lastly, we highlight some improvements of the code structure easing future extensions of FeynHiggs to models beyond the MSSM. △ Less", "The semi-constrained NMSSM (scNMSSM) extends the MSSM by a singlet field, and requires unification of the soft SUSY breaking terms in the squark and slepton sectors, while it allows that in the Higgs sector to be different. We try to interpret the muon g-2 in the scNMSSM, under the constraints of 125 GeV Higgs data, B physics, searches for low and high mass resonances, searches for SUSY particles at the LHC, dark matter relic density by WMAP/Planck, and direct searches for dark matter by LUX, XENON1T, and PandaX-II. We find that under the above constraints, the scNMSSM can still (i) satisfy muon g-2 at 1$σ$ level, with a light muon sneutrino and light chargino; (ii) predict a highly-singlet-dominated 95~GeV Higgs, with a diphoton rate as hinted at by CMS data, because of a light higgsino-like chargino and moderate $λ$; (iii) get low fine tuning from the GUT scale with small $μ_{\\rm eff},\\, M_0,\\, M_{1/2},\\, {\\rm and}\\, A_0$, with a lighter stop mass which can be as low as about 500 GeV, which can be further checked in future studies with search results from the 13~TeV LHC; (iv) have the lightest neutralino be singlino-dominated or higgsino-dominated, while the bino and wino are heavier because of high gluino bounds at the LHC and universal gaugino conditions at the GUT scale; (v) satisfy all the above constraints, although it is not easy for the lightest neutralino, as the only dark matter candidate, to get enough relic density. Several ways to increase relic density are discussed. △ Less", "We discuss the parameter spaces of supersymmetry (SUSY) scenarios taking into account the improved Higgs-mass prediction provided by FeynHiggs 2.14.1. Among other improvements, this prediction incorporates three-loop renormalization-group effects and two-loop threshold corrections, and can accommodate three separate mass scales: m_{\\tilde q} (for squarks), m_{\\tilde g} (for gluinos) and m_{\\tildeχ} (for electroweakinos). Furthermore, it contains an improved treatment of the DRbar scalar top parameters avoiding problems with the conversion to on-shell parameters, that yields more accurate results for large SUSY-breaking scales. We first consider the CMSSM, in which the soft SUSY-breaking parameters m_0 and m_{1/2} are universal at the GUT scale, and then sub-GUT models in which universality is imposed at some lower scale. In both cases, we consider the constraints from the Higgs-boson mass M_h in the bulk of the (m_0, m_{1/2}) plane and also along stop coannihilation strips where sparticle masses may extend into the multi-TeV range. We then consider the minimal anomaly-mediated SUSY-breaking (mAMSB) scenario, in which large sparticle masses are generic. In all these scenarios the substantial improvements between the calculations of M_h in FeynHiggs 2.14.1 and FeynHiggs 2.10.0, which was used in an earlier study, change significantly the preferred portions of the models' parameter spaces. Finally, we consider the pMSSM11, in which sparticle masses may be significantly smaller and we find only small changes in the preferred regions of parameter space. △ Less", "The ACME collaboration has recently announced a new constraint on the electron EDM, $|d_e| < 1.1 \\times 10^{-29}\\, e\\, {\\rm cm}$, from measurements of the ThO molecule. This is a powerful constraint on CP-violating new physics: even new physics generating the EDM at two loops is constrained at the multi-TeV scale. We interpret the bound in the context of different scenarios for new physics: a general order-of-magnitude analysis for both the electron EDM and the CP-odd electron-nucleon coupling; 1-loop SUSY, probing sleptons above 10 TeV; 2-loop SUSY, probing multi-TeV charginos or stops; and finally, new physics that generates the EDM via the charm quark or top quark Yukawa couplings. In the last scenario, new physics generates a \"QULE operator\" $(q_f \\barσ^{μν}{\\bar u}_f) \\cdot (\\ell {\\barσ}_{μν} {\\bar e})$, which in turn generates the EDM through RG evolution. If the QULE operator is generated at tree level, this corresponds to a previously studied leptoquark model. For the first time, we also classify scenarios in which the QULE operator is generated at one loop through a box diagram, which include SUSY and leptoquark models. The electron EDM bound is the leading constraint on a wide variety of theories of CP-violating new physics interacting with the Higgs boson or the top quark. We argue that any future nonzero measurement of an electron EDM will provide a strong motivation for constructing new colliders at the highest feasible energies. △ Less", "Particle physics models with Peccei-Quinn (PQ) symmetry breaking as a consequence of supersymmetry (SUSY) breaking are attractive in that they solve the strong CP problem with a SUSY DFSZ-like axion, link the SUSY breaking and PQ breaking intermediate mass scales and can resolve the SUSY mu problem with a naturalness-required weak scale mu term whilst soft SUSY breaking terms inhabit the multi-TeV regime as required by LHC sparticle mass limits and the Higgs mass measurement. On the negative ledger, models based on global symmetries suffer a generic gravity spoliation problem. We present a model based on the discrete R-symmetry Z_{24}^R-- which may emerge from compactification of 10-d Lorentzian spacetime in string theory-- where the mu term and dangerous proton decay and R-parity violating operators are either suppressed or forbidden while a gravity-safe PQ symmetry emerges as an accidental approximate global symmetry leading to a solution to the strong CP problem and a weak-scale/natural value for the mu term. △ Less", "We consider a simple version of Left-Right Symmetric Model in which the scalar sector consists of a Higgs bidoublet ($Φ$) with $B-L=0$, Higgs doublets ($H_{L,R}$) with $B-L=1$ and a charged scalar ($δ^+$) with $B-L=2$ leading to radiatively generated Majorana masses for neutrinos and thereby, leads to new physics contributions to neutrinoless double beta decay ($0νββ$). We show that such a novel framework can be embedded in a non-SUSY $SO(10)$ GUT leading to successful gauge coupling unification at around $10^{16}$ GeV with the scale of left-right symmetry breaking around $10^{10}$ GeV. The model can also be extended to have left-right symmetry breaking at TeV scale, enabling detection of $W_R, Z_R$ bosons in LHC and future collider searches. Finally, due to sizeable $W_L-W_R$ mixing to neutrinoless double beta decay, this model can saturate the present bound from GERDA and KamLAND-Zen experiments. △ Less", "We review some recent trends in the inflationary model building, the supersymmetry (SUSY) breaking, the gravitino Dark Matter (DM) and the Primordial Black Holes (PBHs) production in supergravity. The Starobinsky inflation can be embedded into supergravity when the inflaton belongs to the massive vector multiplet associated with a (spontaneously broken) $U(1)$ gauge symmetry. The SUSY and R-symmetry can be also spontaneously broken after inflation by the (standard) Polonyi mechanism. Polonyi particles and gravitinos are super heavy and can be copiously produced during inflation via the Schwinger mechanism sourced by the Universe expansion. The overproduction and instability problems can be avoided, and the positive cosmological constant (dark energy) can also be introduced. The observed abundance of the Cold Dark Matter (CDM) composed of gravitinos can be achieved in our supergravity model too, thus providing the unifying framework for inflation, supersymmetry breaking, dark energy and dark matter genesis. Our supergravity approach may also lead to a formation of primordial non-linear structures like stellar-mass-type black holes, and may include the SUSY GUTs inspired by heterotic string compactifications, unifying particle physics with quantum gravity. △ Less", "Presence of nonholomorphic soft SUSY breaking terms is known to be a possibility in the popular setup of the Minimal Supersymmetric Standard Model (MSSM). It has been shown that such a scenario known as NonHolomorphic Supersymmetric Standard Model (NHSSM) could remain `natural' ( i.e., not fine-tuned) even in the presence of a rather heavy higgsino-like LSP. However, it turns out that distinguishing such a scenario from the MSSM is unlikely to be an easy task, in particular at the Large Hadron Collider (LHC). In a first study of such a scenario at colliders (LHC), we explore a possible way that focuses on the sbottom phenomenology. This exploits the usual $\\tanβ$-dependence (enhancement) of the bottom Yukawa coupling but reinforced/altered in the presence of non-vanishing nonholomorphic soft trilinear parameter $A_b^{\\prime}$. For a given set of masses of the sbottom(s) and the light electroweakinos (LSP, lighter chargino etc.) which are known from experiments, the difference between the two scenarios could manifest itself via event rate in the 2b-jets + ${\\, \\not \\! \\! E_T}$ final state, which could be characteristically different from its MSSM expectation. Impact on the phenomenology of the stops at the LHC is also touched upon. △ Less", "We show the new relationship [1] between the anomalous dimensions, resummed through next-to-next-to-leading-logarithmic order, in the Dokshitzer-Gribov-Lipatov-Altarelli-Parisi (DGLAP) evolution equations for the first Mellin moments D_{q,g}(mu2) of the quark and gluon fragmentation functions, which correspond to the average hadron multiplicities in jets initiated by quarks and gluons, respectively. So far, such relationships have only been known from supersymmetric (SUSY) QCD. Exploiting available next-to-next-to-next-to-leading-order (NNNLO) information on the ratio D_g^+(mu2)/D_q^+(mu2) of the dominant plus components, the fit of the world data of D_{q,g}(mu2) for charged hadrons measured in e+e- annihilation leads to alpha_s^{(5)}(MZ)=0.1205 + 0.0016 - 0.0020. △ Less", "It is well-known that the non-supersymmetric D3 brane (a cousin of BPS D3 brane) including its black version of type IIB string theory has a decoupling limit, where the decoupled geometry is the gravity dual of a non-supersymmetric, non-conformal (finite temperature) quantum field theory having some properties similar to QCD. Using the ideas of AdS/CFT we study some non-perturbative aspects of this quantum field theory. Since in this case we have a Yang-Mills theory (no quarks) with running coupling (non-constant dilaton), we compute the gluon condensate in this theory as a function of temperature and also compute the beta function. The behavior of the gluon condensate is found to resemble much like the SU(3) lattice QCD result and the beta function is found to be negative. We further compute both the pseudoscalar and the scalar glueball mass spectra in this theory using WKB approximation and find that the mass ratios of the first excited state to the ground state of the scalar glueball are quite close to the lattice QCD results. △ Less", "We propose to generate non-universal gaugino masses in SU(5) GUT with the generalized Planck-scale mediation SUSY breaking mechanism, in which the non-universality arises from proper wavefunction normalization with lowest component VEVs of various high dimensional representations of the Higgs fields of SU(5) and an unique F-term VEV by the singlet. Different predictions on gaugino mass ratios with respect to widely studied scenarios are given. The gluino-SUGRA-like scenario, where gluinos are much heavier than winos, bino and universal scalar masses, can be easily realized with appropriate combinations of such high-representation Higgs fields. With 6 GUT-scale parameters in our scenario, we can solve elegantly the tension between mSUGRA and the present experimental results, including the muon g-2, the dark matter (DM) relic density and the direct sparticle search bounds from the LHC. Taking into account the current constraints in our numerical scan, we have the following observations: (i) The large-$\\tanβ$ samples with a moderate $M_3$ a small $|A_0/M_3|$ and a small $m_A$ are favored to generate a 125 GeV SM-like Higgs and predict a large muon g-2, while the stop mass and μparameter, mainly determined by $|M_3|(\\gg M_0,|M_1|,|M_2|)$, can be about 6 TeV; (ii) The moderate-$\\tanβ$(35~40) samples with a negative $M_3$ can have a light smuon but a heavy stau, which predict a large muon g-2 but a small $Br(B_s\\toμ^+μ^-)$; (iii) To obtain the right DM relic density, the annihilation mechanisms should be stau exchange, stau coannihilation, chargino coannihilation, slepton annihilation and the combination of two or three of them; (iv) To obtain the right DM relic density, the spin-independent DM-nucleon cross section is typically much smaller than the present limits of XENON1T 2018 and also an order of magnitude lower than the future detection sensitivity of LZ and XENONnT. △ Less", "Studying the properties of the Higgs boson can be an important window to explore the physics beyond the Standard Model (SM). In this work, we present studies on the implications of the Higgs precision measurements at future Higgs Factories. We perform a global fit to various Higgs search channels to obtain the 95 % C.L. constraints on the model parameter spaces of Two Higgs Double Model (2HDM) and Minimal Supersymmetric Standard Model (MSSM). In the 2HDM, we analyze tree level effects as well as one-loop contributions from the heavy Higgs bosons. The strong constraints on $\\cos(β-α)$, heavy Higgs masses and their mass splitting are complementary to direct search of the LHC as well as possible future Z pole precision measurements. For the MSSM, we study both the Higgs couplings and mass precisions. The constraints on the CP-odd Higgs mass $m_A$ and stop mass scale $m_{SUSY}$ can be complementary to the direct search of HL-LHC. We also compare the sensitivity of various future Higgs factories, namely Circular Electron Positron Collider (CEPC), Future Circular Collider (FCC)-ee and International Linear Collider (ILC). △ Less", "We study the arguments given in [1] which suggest that the uplifting procedure in the KKLT construction is not valid. First we show that the modification of the SUSY breaking sector of the nilpotent superfield, as proposed in [1], is not consistent with non-linearly realized local supersymmetry of de Sitter supergravity. Keeping this issue aside, we also show that the corresponding bosonic potential does actually describe de Sitter uplifting. △ Less", "We derive explicitly the soft SUSY breaking parameters at arbitrary low energy scale in the (deflected) mirage type mediation scenarios with possible gauge or Yukawa mediation contributions. Based on the Wilsonian effective action after integrating out the messengers, we obtain analytically the boundary value (at the GUT scale) dependencies of the effective wavefunctions and gauge kinetic terms. Note that the messenger scale dependencies of the effective wavefunctions and gauge kinetic terms had already been discussed in GMSB. The RGE boundary value dependencies, which is a special feature in (deflected) mirage type mediation, is the key new ingredients in this study. The appearance of $'mirage'$ unification scale in mirage mediation is proved rigorously with our analytical results. We also discuss briefly the new features in deflected mirage mediation scenario in the case the deflection comes purely from the Kahler potential and the case with messenger-matter interactions. △ Less", "The Next-to-Minimal Supersymmetric Standard Model (NMSSM) provides a natural framework to realize a low-scale supersymmetric (SUSY) model, where a singlet superfield is added to the minimal model to generate a SUSY-scale higgsino mass term with its vacuum expectation value. Due to the presence of the extra singlet field, the vacuum conditions to realize the correct electroweak symmetry-breaking become fairly restrictive especially if we impose universality conditions at the unification scale. In this paper, we show that a non-universal gaugino mass spectrum can significantly relax this restriction even though the scalar masses and trilinear couplings are subject to universality conditions. With the gaugino non-universality, we find that higgsino can be the lightest SUSY particle and its thermal relic abundance can reproduce the observed dark matter density in a wide range of parameter space in which the 125~GeV Higgs-boson mass is obtained. This higgsino-like dark matter may be probed in direct detection experiments. We also find that there is an upper bound on the masses of supersymmetric particles in this scenario, and many model points predict colored particles such as gluino to be within the reach of a future 100~TeV collider. Implications for no-scale/gaugino-mediation models are also discussed. △ Less", "We investigate the production of neutralino dark matter in a cosmological scenario featuring an early matter dominated era ending at a relatively low reheating temperature. In such scenarios different production mechanisms of weakly interacting massive particles (WIMPs), besides the well--studied thermal production, can be important. This opens up new regions of parameter space where the lightest neutralino, as the best--known supersymmetric (SUSY) WIMP, obtains the required relic abundance. Many of these new sets of parameters are also compatible with current limits from colliders as well as direct and indirect WIMP searches. In particular, in standard cosmology bino--like neutralinos, which emerge naturally as lightest neutralino in many models, can have the desired relic density only in some finetuned regions of parameter space where the effective annihilation cross section is enhanced by co--annihilation or an $s-$channel pole. In contrast, if the energy density of the universe was dominated by long--lived PeV--scale particles (e.g. moduli or Polonyi fields), bino--like neutralinos can obtain the required relic density over wide regions of supersymmetric parameter space. We identify the interesting ranges of mass and decay properties of the heavy long--lived particles, carefully treating the evolution of the temperature of the thermal background. △ Less", "The electroweak fine-tuning measure Delta(EW) allows for correlated SUSY soft terms as are expected in any ultra-violet complete theory. Requiring no less than 3% electroweak fine-tuning implies upper bounds of about 360~GeV on all higgsinos, while top squarks are lighter than ~3 TeV and gluinos are bounded by ~ 6-9 TeV. We examine the reach for SUSY of the planned high luminosity (HL: 3 ab^{-1} at 14 TeV) and the proposed high energy (HE: 15 ab^{-1} at 27 TeV) upgrades of the LHC via four LHC collider search channels relevant for natural SUSY: 1. gluino pair production followed by gluino decay to third generation (s)quarks, 2. top-squark pair production followed by decay to third generation quarks and light higgsinos, 3. neutral higgsino pair production with QCD jet radiation (resulting in monojet events with soft dileptons), and 4. wino pair production followed by decay to light higgsinos leading to same-sign diboson production. We confront our reach results with upper limits on superpartner masses in four natural SUSY models: natural gravity-mediation via the 1. two- and 2. three-extra-parameter non-universal Higgs models, 3. natural mini-landscape models with generalized mirage mediation and 4. natural anomaly-mediation. We find that while the HL-LHC can probe considerable portions of natural SUSY parameter space in all these models, the HE-LHC will decisively cover the entire natural SUSY parameter space with better than 3% fine-tuning. △ Less", "We show a possibility for the charge quantization of the standard model (SM) particles. If a global symmetry makes the three copies of a generation and supersymmetry (SUSY) relates the Higgs boson to a lepton, all the charges of the SM particles can be quantized through gauge-anomaly cancellation. In the minimal model realizing the possibility, the gravitino mass around the Planck-scale is needed to generate the SM couplings through (quantum) supergravity. Much below the Planck-scale, the SM is obtained as the effective theory. Interestingly, if the gaugino masses are generated through anomaly mediation, one of the neutrino masses is predicted to be around the neutrino oscillation scales. In an extension of the model, millicharged particles can exist without introducing massless hidden photons. △ Less", "We study in a model independent way models of new Physics featuring extra quarks (XQs). These XQs are predicted by extensions of the Standard Model (SM) but have never been observed yet even though many searches have been designed to find them at the LHC. After an introduction about the SM and the LHC, we present the main properties of these XQs and a model independent parametrisation that can be used to describe their phenomenology with generic hypotheses about their mixing with SM quarks, both in the case of XQ coupling with SM bosons and with Dark Matter (DM) candidates. In these cases we study the offshellness effects in pair-production and decay and show that if the Narrow-Width Approximation (NWA) is a good approximation of the full result in the small width over mass ratio limit, sizeable differences occur when the XQ width becomes larger. The conclusion of our analysis is that even though the small width assumption is always conservative it is not possible to trivially rescale the mass bounds obtained considering processes of pair production and decay in the NWA to determine constraints for XQs with large widths. We also study the role of interference in the process of pair production of new heavy XQs decaying to SM particles and show that in the NWA the interference contribution can be described by considering a parameter which contains only the relevant couplings and the scalar part of the propagators of the new quarks, both at the cross section level and at the distribution level. Finally, we study how various SUSY searches perform for our simplified model with XQs decaying to DM. We show that the bound for XQs can be obtained from the SUSY ones just by rescaling the exclusion with the XQ cross section. △ Less", "For the search for electroweak (EW) particles in the Minimal Supersymmetric Standard Model (MSSM) as well as for future precision analyses of these particles an accurate knowledge of their production and decay properties is mandatory. We evaluate the cross sections for the chargino, neutralino and slepton production at e+e- colliders in the MSSM with complex parameters (cMSSM). The evaluation is based on a full one-loop calculation of all possible production channels including soft and hard photon radiation. The dependence of the cross sections on the relevant cMSSM parameters is analyzed numerically. We find sizable contributions to many production cross sections. They amount to roughly 15% of the tree-level results but can go up to 40% or higher in extreme cases. Also the dependence on complex parameters of the one-loop corrections for many production channels was found non-negligible. The full one-loop contributions are thus crucial for physics analyses at a future linear e+e- collider such as the ILC or CLIC. △ Less", "We present the calculation of the light neutral CP-even Higgs mass in the MSSM for a heavy SUSY spectrum by resumming enhanced terms through fourth logarithmic order (N$^3$LL), keeping terms of leading order in the top Yukawa coupling $α_t$, and NNLO in the strong coupling $α_s$. To this goal, the three-loop matching coefficient for the quartic Higgs coupling of the SM to the MSSM is derived to order $α_t^2α_s^2$ by comparing the perturbative EFT to the fixed-order expression for the Higgs mass. The new matching coefficient is made available through an updated version of the program Himalaya. Numerical effects of the higher-order resummation are studied using specific examples, and sources of theoretical uncertainty on this result are discussed. △ Less", "We discuss the status of the SM - The principles - The Lagrangian - The problems - Open questions - The ways beyond. Then we consider possible physics beyond the SM - New symmetries (Gauge, SUSY, etc) - New particles (gauge, axion, superpartners) - New dimensions (extra, large, compact, etc) - New Paradigm (strings, branes, gravity). In conclusion, we formulate the first priority tasks for the future HEP program. △ Less", "We explore the implications of LHC and cold dark matter searches for supersymmetric particle mass spectra in two different grand unified models with left-right symmetry, $SO(10)$ and $ SU(4)_c \\times SU(2)_L \\times SU(2)_R$ (4-2-2). We identify characteristic differences between the two scenarios, which imply distinct correlations between experimental measurements and the particular structure of the GUT group. The gauge structure of 4-2-2 enhances significantly the allowed parameter space as compared to $SO(10)$, giving rise to a variety of coannihilation scenarios compatible with the LHC data, LSP dark matter and the ongoing muon g-2 experiment. △ Less", "We propose a double inflection point inflationary model in supergravity with a single chiral superfield. Such a model allows for the generation of primordial black holes(PBHs) at small scales, which can account for a significant fraction of dark matter. Moreover in vacuum it is possible to give a small and adjustable SUSY breaking with a tiny cosmological constant. △ Less", "Motivated by recent results from neutrino experiments, we study the neutrino masses and mixing in the framework of a SUSY $SU(5)\\times \\mathbb{A}_{4} $ model. The hybrid of Type I and Type II seesaw mechanisms leads to the nonzero value of the reactor angle $θ_{13}\\neq 0$ and to the recently disfavored maximal atmospheric angle $θ_{23} \\neq45^{\\circ}$ by the NOvA experiment. The phenomenological consequences of the model are studied for both normal and inverted mass hierarchies. The obtained ranges for the effective Majorana neutrino mass $m_{ββ}$, the electron neutrino mass $m_{ν_{e}}$, and the $CP$ violating phase $δ_{CP}$ lie within the current experimental allowed ranges where we find that the normal mass hierarchy is favored over the inverted one. △ Less", "Motivated by the recent anomalies in $b\\rightarrow s$ transitions that emerged at LHCb, we consider a model with an $L_μ- L_τ$ gauge symmetry and additional vector-like fermions. We find that by introducing supersymmetry the model can be made consistent with the long-standing deviation in the measured value of the anomalous magnetic moment of the muon, $g-2$, and neutralino dark matter of broad mass ranges and properties. In particular, dark matter candidates include the well-known 1 TeV higgsino, which in the MSSM is typically not compatible with solutions to the $g-2$ puzzle. Moreover, its spin-independent cross section could be at the origin of the recent small excess in XENON-1T data. We apply to the model constraints arising from flavor precision measurements and direct searches at the Large Hadron Collider and show that they do not currently exclude the relevant parameter space regions. △ Less", "The minimal supersymmetric (SUSY) standard model (MSSM) augmented by right chiral sneutrinos may lead to one such sneutrino serving as the lightest supersymmetric particle and a non-thermal dark matter candidate, especially if neutrinos have Dirac masses only. In such cases, if the lightest MSSM particle is a stau, the signal of SUSY at the LHC consists in stable charged tracks which are distinguishable from backgrounds through their time delay between the inner tracker and the muon chamber. We show how to determine in such scenarios the mass hierarchy between the lightest neutralino and right sleptons of the first two families. The techniques of neutralino reconstruction, developed in earlier works, are combined with the endpoint of the variable $M_{T2}$ in smuon (selectron) decays for this purpose. We show that one can thus determine the mass hierarchy for smuons (selectrons) and neutralinos up to 1 TeV, to the level of 5-10\\%. △ Less", "In this paper we study sneutrino dark matter in a recently proposed supersymmetric electroweak-scale inverse seesaw model, in which the majority of the sneutrino dark matter particle is a mixture of the right-handed sneutrino $\\tilde{N}^c$ and the singlet field $\\tilde{S}$. The scalar field $X$ responsible for the generation of neutrino masses can simultaneously play a crucial role for sneutrino annihilation in the early Universe via the pseudoscalar mediator $A_X$ into neutrinos. We focus here on the dominant annihilation channels and provide all the formulas together with analytic estimates in order to identify the relevant parameters. Furthermore, we show that the direct detection scattering cross section is many orders of magnitude below the current limits, and estimate the indirect detection annihilation rate, which is only a few orders of magnitude below the current limits. △ Less", "R-symmetries, which are needed for supersymmetry (SUSY) breaking in O'Raifeartaigh models, often lead to SUSY runaway directions trough a complexified R-transformation. Non-R symmetries also lead to runaway directions in a similar way. This work investigates the occurrence of runaway directions of both SUSY and SUSY breaking types. We clarify previous issues on fractional charges and genericness, and make a refined statement on conditions for runaway directions related to either R-symmetries or non-R symmetries. We present a generic and anomaly-free model to show the existence of runaway directions related to non-R symmetries. We also comment on the possibility to combine the non-R symmetry case to the R-symmetry case by an R-charge redefinition. △ Less", "Supersymmetric $SO(10)$ models with Yukawa coupling matrices involving only a $10_H$ and a $\\overline{126}_H$ of Higgs fields can lead to a predictive and consistent scenario for fermion masses and mixings, including the neutrino sector. However, when coupled minimally to a symmetry breaking sector that includes a $210_H$ and a $126_H$, these models lead either to an unacceptably small neutrino mass scale, or to non-perturbative values of the gauge couplings. Here we show that with the addition of a $54_H$ to the symmetry breaking sector, the successful predictions of these models for fermion masses and mixings can be maintained. The $54_H$ enables a reduction of the $B-L$ symmetry breaking scale to an intermediate value of order $10^{12}$ GeV, consistent with the observed neutrino mass spectrum, while preserving perturbative gauge coupling unification. We obtain an excellent fit to all fermion masses and mixings in this framework. We analyze carefully the prediction of the model for CP violation in neutrino oscillations. Consistency with proton lifetime, however, requires a mini-split SUSY spectrum with the squarks and sleptons having masses of order 100 TeV, accompanied by TeV scale gauginos and Higgsinos. Such a spectrum may arise from pure gravity mediation, which would predict the partial lifetime for the decay $p \\rightarrow \\overlineν K^+$ to be an order of magnitude above the current experimental limit. △ Less", "The observed charged lepton masses satisfy the relations $K \\equiv (m_e +m_μ+m_τ)/(\\sqrt{m_e} +\\sqrt{m_μ} +\\sqrt{m_τ})^2 =2/3$ and $κ\\equiv \\sqrt{m_e m_μm_τ}/(\\sqrt{m_e} +\\sqrt{m_μ} +\\sqrt{m_τ})^3 =1/486$ with great accuracy. These parameters are given as $K=( {\\rm Tr}[ΦΦ])/ ({\\rm Tr}[Φ])^2$ and $κ= {\\rm det} Φ/({\\rm Tr}[Φ])^3$ if the charged lepton masses $m_{ei}$ are given by $m_{ei} \\propto \\sum_k Φ_i^{\\ k} Φ_k^{\\ i}$ where $Φ$ is a U(3)-family nonet scalar. Simple scalar potential forms to realize the relations have been already proposed in non-supersymmetric scenarios, but the potential forms are not stable against the renormalization group effects. In this paper, we examine supersymmetric scenarios and find that the parameters $K$ and $κ$ are made stable against the effects in a very nontrivial way, even though the superpotential itself (in the canonical basis) suffers the usual corrections. We also show possible simple superpotential forms for the relations. △ Less", "The breakdown of E_6 within the supersymmetric (SUSY) Grand Unified Theories (GUTs) can result in SUSY extensions of the standard model (SM) based on the SM gauge group together with extra U(1) gauge symmetry under which right-handed neutrinos have zero charge. In these U(1)_N extensions of the minimal supersymmetric standard model (MSSM) a single discrete \\tilde{Z}^H_2 symmetry may be used to suppress the most dangerous operators, that give rise to proton decay as well as non-diagonal flavour transitions at low energies. The SUSY models under consideration involves Z' and extra exotic matter beyond the MSSM. We discuss leptogenesis within this SUSY model and argue that the extra exotic states may lead to the non--standard Higgs decays. △ Less", "In the minimal supersymmetric standard model (MSSM) the lightest superparticle (LSP) can be a TeV neutralino (mainly dominated by higgsino or wino) which serves as a dark matter candidate with correct thermal relic density. In this work we confront the 1-2 TeV neutralino dark matter with the latest direct and indirect detections from PandaX and AMS-02/DAMPE. Considering various scenarios with decoupled sfermions, with \\textit{A}-mediated annihilation, with squark or stop coannihilation, we find that the parameter space is stringently constrained by the direct detection limits. In the allowed parameter space, the TeV neutralino dark matter annihilation contribution to the anti-proton flux is found to agree with the AMS-02 data while its contribution to eletron/positron flux is too small to cause any visible excess. The current survived parameter space can be mostly covered by the future direct detection experiment LZ7.2T. △ Less", "We study the correlation between proton lifetime and leptonic CP violation in a class of renormalizable supersymmetric SO(10) grand unified theories (GUTs) with {\\bf 10}, {\\bf 126} and {\\bf 120} Higgs fields, which provides a unified description of all fermion masses and possibly resolution of the strong CP problem. This specific model is unique in that it can readily be compatible with current proton lifetime limits for a supersymmetry (SUSY) breaking scale as low as 5 TeV due to the presence of a specific Yukawa texture. Our investigation here reveals that proton partial lifetimes predicted by this class of models will be tested by forthcoming proton decay searches; furthermore, a discovery of leptonic CP violation in neutrino oscillations would also lead to substantial reduction of the parameter space of the model. △ Less", "We analyze the possibility to accommodate current $b \\to s \\ell^+ \\ell^-$ anomalies with TeV-scale mediators that couple to right-handed top quarks and muons, contributing to $b \\to s \\ell^+ \\ell^-\\,$ at the one-loop level. We use the Standard Model Effective Field Theory (SMEFT) framework but also look at specific scenarios by taking into account all possible irreducible representations of the Lorentz and Standard Model gauge group for the mediators. From a global fit of $b \\to s \\ell^+ \\ell^-$ data and LEP-I observables we find that the Wilson coefficients of two SMEFT operators: $\\mathcal{O}_{\\ell u}= (\\bar \\ell_{ L μ} γ^α \\ell_{ L μ}) (\\bar t_R γ_α t_R )$ and $\\mathcal{O}_{e u}= (\\bar μ_{R} γ^α μ_{R}) (\\bar t_R γ_α t_R )$ need to satisfy $\\mathcal{C}_{eu} \\sim \\mathcal{C}_{\\ell u}$. New physics enters then in $b \\to s \\ell^+ \\ell^-$ mainly through the operator $\\mathcal{O}_9 = ( \\bar s γ_μ P_{L} b )( \\bar \\ell γ^μ \\ell )$ of the Weak Effective Theory. After discussing all possible mediators, we concentrate on two scenarios: A vector boson in the irreducible representation $Z_μ^{\\prime} \\sim (1,1,0)$ of the Standard Model gauge group with vectorial coupling to muons, and a combination of two leptoquarks: the scalar $R_2 \\sim (3,2,7/6)$ and the vector $\\widetilde U_{1 μ} \\sim (3,1,5/3)$. We derive LHC constraints by recasting di-muon resonance, $pp \\to t \\bar t t \\bar t$ and SUSY searches. Additionally, we analyze the prospects for discovering these mediators during the high-luminosity phase of the LHC. △ Less", "Genetic Algorithms (GAs) are explored as a tool for probing new physics with high dimensionality. We study the 19-dimensional pMSSM, including experimental constraints from all sources and assessing the consistency of potential signals of new physics. We show that GAs excel at making a fast and accurate diagnosis of the cross-compatibility of a set of experimental constraints in such high dimensional models. In the case of the pMSSM, it is found that only ${\\cal O}(10^4)$ model evaluations are required to obtain a best fit point in agreement with much more costly MCMC scans. This efficiency allows higher dimensional models to be falsified, and patterns in the spectrum identified, orders of magnitude more quickly. As examples of falsification, we consider the muon anomalous magnetic moment, and the Galactic Centre gamma-ray excess observed by Fermi-LAT, which could in principle be explained in terms of neutralino dark matter. We show that both observables cannot be explained within the pMSSM, and that they provide the leading contribution to the total goodness of the fit, with $χ^2_{δa_μ^{\\mathrm{SUSY}}}\\approx12$ and $χ^2_{\\rm GCE}\\approx 155$, respectively. △ Less", "We investigate neutralino dark matter from a string/M-theory perspective. Using the Kallosh-Linde (KL) scenario to stabilize the string moduli requires supersymmetry breaking for uplifting to a de Sitter vacuum. We consider the free magnetic dual description of $\\mathcal{N}=1$ SUSY QCD with massive flavours, the Intriligator-Seiberg-Shih model (ISS), as an F-term dynamical SUSY breaking sector. This framework allows for a gravitino mass in the TeV range. Moreover, due to the plethora of particles from the ISS sector, we investigate the consequences of coupling the MSSM with the KL-ISS setup to obtain constraints from both late entropy production and the dark matter relic density. In addition to thermal neutralino production, we consider neutralino production via the decays of gravitinos and ISS fields. △ Less", "Precise predictions for Higgs boson masses in the Minimal Supersymmetric Standard Model can be obtained by combining fixed-order calculations with effective field theory (EFT) methods for the resummation of large logarithms in case of heavy superpartners. This hybrid approach is implemented in the computer code FeynHiggs and has been applied in previous studies for calculating the mass of the lightest CP-even Higgs boson for low, intermediate and high SUSY scales. In these works it was assumed that the non-standard Higgs bosons share a common mass scale with the supersymmetric squark particles, leaving the Standard Model as the low-energy EFT. In this article, we relax this restriction and report on the implemention of a Two-Higgs-Doublet Model (THDM) as effective theory below the SUSY scale into our hybrid approach. We explain in detail the various steps how our EFT calculation is consistently combined with the fixed-order calculation within the code FeynHiggs. In our numerical investigation we find effects on the mass of the lightest CP-even Higgs boson h of up to 9 GeV in scenarios with low $M_A$ , low $\\tanβ$ and high SUSY scales, when compared with previous versions of FeynHiggs. Comparisons to other publicly available pure EFT codes with a THDM show good agreement. Effects on the mass of the second lightest CP-even Higgs boson H are found to be negligible in the phenomenologically interesting parameter regions where H can be traded for h as the experimentally observed Higgs particle. △ Less", "The high statistics that will be collected during the LHC Run-II (and beyond) open the path to precision measurements at the TeV scale, where the PDFs will play a crucial role in BSM searches. In the di-lepton final state accurate measurements of the Forward-Backward Asymmetry (AFB) will be available, particularly in the invariant mass region around the Z peak. We show that this observable displays a statistical error which is competitive with that assigned to the existing PDF sets and which will rapidly become smaller than the latter as the integrated luminosity grows, thereby offering a means of constraining the (anti)quark PDFs over a sizeable $(x,Q^2)$ range. In the context of SUSY searches we consider the effects of employing threshold-improved PDFs in a consistent calculation at NLO+NLL of slepton pair production cross sections. The calculations featuring a consistent resummation procedure both at PDF and partonic matrix element level are accompanied by PDF and scale uncertainties, and they provide a reliable and updated theoretical estimation for experimental data analyses at the LHC Run-II. △ Less", "We quantify and examine the uncertainties in predictions of the lightest $CP$ even Higgs boson pole mass $M_h$ in the Minimal Supersymmetric Standard Model (MSSM), utilising current spectrum generators and including some three-loop corrections. There are two broadly different approximations being used: effective field theory (EFT) where an effective Standard Model (SM) is used below a supersymmetric mass scale, and a fixed order calculation, where the MSSM is matched to QCD$\\times$QED at the electroweak scale. The uncertainties on the $M_h$ prediction in each approach are broken down into logarithmic and finite pieces. The inferred values of the stop mass parameters are sensitively dependent upon the precision of the prediction for $M_h$. The fixed order calculation appears to be more accurate below a supersymmetry (SUSY) mass scale of $M_S \\approx 1.2$ TeV, whereas above this scale, the EFT calculation is more accurate. We also revisit the range of the lightest stop mass across fine-tuned parameter space that has an appropriate stable vacuum and is compatible with the lightest $CP$ even Higgs boson $h$ being identified with the one discovered at the ATLAS and CMS experiments in 2012; we achieve a maximum value of $\\sim 10^{11}$ GeV. △ Less", "We present a conjecture for the massless sector of perturbative 4D $N=1$ heterotic $(0,2)$ string vacua, including $U(1)^n$ gauge symmetries,one of them possibly anomalous (like in standard heterotic compactifications). Mathematically it states that the positive hull generated by the charges of the massless chiral multiplets spans a sublattice of the full charge lattice. We have tested this conjecture in many heterotic $N=1$ compactifications in 4D. Our motivation for this conjecture is that it allows to understand a very old puzzle in $(0,2)$ $N=1$ heterotic compactification with an anomalous $U(1)$. The conjecture guarantees that there is always a D-flat direction cancelling the FI-term and restoring $N=1$ SUSY in a nearby vacuum. This is something that has being verified in the past in a large number of cases, but whose origin has remained obscure for decades. We argue that the existence of this lattice of massless states guarantees the instability of heterotic non-BPS extremal blackholes, as required by Weak Gravity Conjecture arguments. Thus the pervasive existence of these nearby FI-cancelling vacua would be connected with WGC arguments. △ Less", "We revisit supersymmetric hybrid inflation in the context of flipped $SU(5)$ model. With minimal superpotential and minimal Kähler potential, and soft SUSY masses of order $(1 - 100)$ TeV, compatibility with the Planck data yields a symmetry breaking scale $M$ of flipped $SU(5)$ close to $(2 - 4) \\times 10^{15}$ GeV. This disagrees with the lower limit $M \\gtrsim 7 \\times 10^{15}$ GeV set from proton decay searches by the Super-Kamiokande collaboration. We show how $M$ close to the unification scale $2\\times 10^{16}$ GeV can be reconciled with SUSY hybrid inflation by employing a non-minimal Kähler potential. Proton decays into $e^+ π^0$ with an estimated lifetime of order $10^{36}$ years. The tensor to scalar ratio $r$ in this case can approach observable values $\\sim 10^{-4} - 10^{-3}$. △ Less", "The Lightest Supersymmetric Particle (LSP) is generally regarded as higgsino in focus point supersymmetry (SUSY). Under such circumstance it leads to bileptino LSP when the MSSM is extended by $U(1)_{B-L}$ gauge group within the framework of Double Focus Point (DFP) supersymmetry. The bileptino is a copy of higgsino whose partner, bilepton, is used to break $U(1)_{B-L}$ gauge symmetry spontaneously. Such scenario, however, is not favored by direct detection since it leads to unacceptable spin-independent cross section when one requires correct self-scattering cross section. We point out that is not necessarily the case even in the presence of light $Z^{\\prime}$. The right-handed sneutrino in this model acts as LSP in most of parameter space for non-vanishing soft trilinear coupling $T_η$. It is thus consistent of the requirement of DFP SUSY without involving any direct detection issue. The corrected relic abundance could be achieved via sneutrino annihilate into pair of bilepton which also serve as light mediator in Self-Interacting Dark Matter (SIDM). Moreover, stringent constraint comes from CMB anisotropies can be evaded by considering retarded decay of right-handed neutrinos. We further stress the need for a large soft trilinear term $T_η$ in order to generate desirable self-scattering cross section $σ/m_{\\tildeν_R}$ with moderate Yukawa coupling $Y_η$. The numerical calculation illustrates that SIDM is reliable in our model from the scales of dwarf galaxy to galaxy cluster. △ Less", "The requirement of electroweak naturalness in supersymmetric (SUSY) models of particle physics necessitates light higgsinos not too far from the weak scale characterized by m(weak)~ m(W,Z,h)~100 GeV. On the other hand, LHC Higgs mass measurements and sparticle mass limits point to a SUSY breaking scale in the multi-TeV regime. Under such conditions, the lightest SUSY particle is expected to be a mainly higgsino-like neutralino with non-negligible gaugino components (required by naturalness). The computed thermal WIMP abundance in natural SUSY models is then found to be typically a factor 5-20 below its measured value. To gain concordance with observations, either an additional DM particle (the axion is a well-motivated possibility) must be present or additional non-thermal mechanisms must augment the neutralino abundance. We compare present direct and indirect WIMP detection limits to three natural SUSY models based on gravity-, anomaly- and mirage-mediation. We show that the case of natural higgsino-only dark matter where non-thermal production mechanisms augment its relic density, is essentially excluded by a combination of direct detection constraints from PandaX-II, LUX and Xenon-1t experiments, and by bounds from Fermi-LAT/MAGIC observations of gamma rays from dwarf spheroidal galaxies. △ Less", "In response to the present status that searching for SUSY particles has been unsuccessful, we propose a bold scenario that SUSY particles are confined inside hadrons with a required condition of $P_R=1$ in analog to the color confinement for quarks. The scenario seems to be able to reconcile the beautiful SUSY theory and non-observation at present experiments. On other aspects, some loopholes in the proposal emerge and require to be answered in the future research. △ Less", "It has been recently argued that an embedding of the SM into a consistent theory of quantum gravity may imply important constraints on the mass of the lightest neutrino and the cosmological constant $Λ_{4}$. The constraints come from imposing the absence of any non-SUSY AdS stable vacua obtained from any consistent compactification of the SM to 3 or 2 dimensions. This condition comes as a corollary of a recent extension of the Weak Gravity Conjecture (WGC) by Ooguri and Vafa. In this paper we study $T^2/Z_N$ compactifications of the SM to two dimensions in which SM Wilson lines are projected out, leading to a considerable simplification. We analyze in detail a $T^ 2/Z_4$ compactification of the SM in which both complex structure and Wilson line scalars are fixed and the potential is only a function of the area of the torus $a^2$. We find that the SM is not robust against the appearance of AdS vacua in 2D and hence would be by itself inconsistent with quantum gravity. On the contrary, if the SM is embedded at some scale $M_{SS}$ into a SUSY version like the MSSM, the AdS vacua present in the non-SUSY case disappear or become unstable. This means that WGC arguments favor a SUSY version of the SM, independently of the usual hierarchy problem arguments. In a $T^2/Z_4$ compactification in which the orbifold action is embedded into the $B-L$ symmetry the bounds on neutrino masses and the cosmological constant are recovered. This suggests that the MSSM should be extended with a $U(1)_{B-L}$ gauge group. In other families of vacua the spectrum of SUSY particles is further constrained in order to avoid the appearance of new AdS vacua or instabilities. We discuss a possible understanding of the little hierarchy problem in this context. △ Less", "We propose a 6d model with a SUSY $SU(5)$ gauge symmetry. After compactification, it explains the origin of the $S_4$ Family Symmetry with CSD3 vacuum alignment, as well as $SU(5)$ breaking with doublet-triplet splitting. The model naturally accounts for all quark and lepton (including neutrino) masses and mixings, incorporating the highly predictive Littlest Seesaw structure. It spontaneously breaks CP symmetry, resulting in successful CP violation in the quark and lepton sectors, while solving the Strong CP problem. It also explains the Baryon Asymmetry of the Universe (BAU) through leptogenesis, with the leptogenesis phase directly linked to the Dirac and Majorana phases. △ Less", "We examine the experimental signature of a UV complete Supersymmetry (SUSY) theory, the $G_2$-MSSM. This model predicts that only some superpartners will be produced in possibly detectable amounts at LHC: $p p \\rightarrow \\tilde{g}\\tilde{g}$, $p p \\rightarrow \\tildeχ^{\\pm}_1 \\tildeχ^{\\mp}_1$, and $p p \\rightarrow \\tildeχ^{0}_2 \\tildeχ^{\\pm}_1$. We exclude spectra with $m_{\\tilde{g}} \\approx1.5$ TeV. While spectra with $m_{\\tilde{g}} \\approx1.7$ TeV and $m_{\\tilde{g}} \\approx1.9$ TeV are currently allowed (contrary to what is often claimed), data in hand could exclude these spectra. This is not in tension with reported exclusion limits due to the difference in decay topologies between simplified models and a UV motivated ($G_2$-MSSM) model. △ Less", "Recently, a simple prescription to embed the global Peccei-Quinn (PQ) symmetry into a gauged $U(1)$ symmetry has been proposed. There, explicit breaking of the global PQ symmetry expected in quantum gravity are highly suppressed due to the gauged PQ symmetry. In this paper, we apply the gauged PQ mechanism to models where the global PQ symmetry and supersymmetry (SUSY) are simultaneously broken at around $\\mathcal{O}(10^{11-12})$\\,GeV. Such scenario is motivated by an intriguing coincidence between the supersymmetry breaking scale which explains the observed Higgs boson mass by the gravity mediated sfermion masses, and the PQ breaking scale which evades all the astrophysical and the cosmological constraints. As a concrete example, we construct a model which consists of a simultaneous supersymmetry/PQ symmetry breaking sector based on $SU(2)$ dynamics and an additional PQ symmetry breaking sector based on $SU(N)$ dynamics. We also show that new vector-like particles are predicted in the TeV range in the minimum model, which can be tested by the LHC experiments. △ Less", "The scale at which supersymmetry (SUSY) breaks ($m_{s}$) is still unknown. The present article, following a top-down approach, endeavors to study the effect of varying $m_s$ on the radiative stability of the observational parameters associated with the neutrino mixing. These parameters get additional contributions in the minimal supersymmetric model,(MSSM). A variation in $m_s$ will influence the bounds for which the Standard Model,(SM) and MSSM work and hence will account for the different radiative contributions received from both sectors respectively, while running the renormalization group equations,(RGE). The present work establishes the invariance of the self complementarity relation among the three mixing angles, $θ_{13}+θ_{12}\\approxθ_{23}$ against the radiative evolution. A similar result concerning the mass ratio, $m_2: m_1$ is also found to be valid. In addition to varying $m_s$, the work incorporates a range of different seesaw\\,(SS) scales and tries to see how the latter affects the parameters. △ Less", "For more than forty years virtually all work on the theory of type Ia Supernovae (SN Ia) has assumed that these explosions were due to the transfer of mass to a degenerate star from a partner in a binary system. In these binary models, when the mass of one partner closely approaches the Chandrasekhar maximum for a stable degenerate system, fusion can be initiated and the star explodes. However, there are now a number of indications that fusion could instead be triggered by a phase transition in a sub-Chandrasekhar white dwarf star. Although these indications provide no clue as to what specific phase transition initiates the explosion, it is possible that remarkable and well established host galaxy effects as considered in the present work could point to a specific source of the energy deposition. These host galaxy correlations are, at first glance, surprising since the typical distance scale of white dwarf stars is the earth radius while the typical distance between stars is at the light year scale. Performing a least $χ^2$ fit to the delay time distribution to fix parameters, we give predictions from the susy phase transition model for the host galaxy effects. In addition we discuss a susy insight into the Phillips relation which is basic to the cosmological importance of the type Ia supernovae. △ Less", "Alternative renormalizable minimal non-SUSY SO(10) GUT model is proposed. Instead of a ${\\bf 126}$-dimensional Higgs field, a ${\\bf 120}$-dimensional Higgs filed is ntroducedin addition to a ${\\bf 10}$-dimensional Higgs field and plays a crucial role to reproduce the realistic charged fermion mass matrices. With contributions of ${\\bf 120}$ Higgs field, the original Witten's scenario of inducing the right-handed Majorana neutrino mass through 2-loop diagrams becomes phenomenologically viable. This model inherits the nice features of the conventional renormalizable minimal SO(10) GUT model with ${\\bf 10}+{\\bf \\overline{126}}$ Higgs fields, while supplemented with a low scale seesaw mechanism due to the 2-loop induced right-handed Majorana neutrino mass. % △ Less", "Finite Unified Theories (FUTs) are N = 1 supersymmetric Grand Unified Theories which can be made finite to all orders in perturbation theory, based on the principle of reduction of couplings. The latter consists in searching for renormalization group invariant relations among parameters of a renormalizable theory holding to all orders in perturbation theory. FUTs have proven very successful so far. In particular, they predicted the top quark mass one and half years before its experimental discovery, while around five years before the Higgs boson discovery a particular FUT was predicting the light Higgs boson in the mass range ~ 121 - 126 GeV, in striking agreement with the discovery at LHC. Here we review the basic properties of the supersymmetric theories and in particular finite theories resulting from the application of the method of reduction of couplings in their dimensionless and dimensionful sectors. Then we analyse the phenomenologically favoured FUT, based on SU(5). This particular FUT leads to a finiteness constrained version of the MSSM, which naturally predicts a relatively heavy spectrum with coloured supersymmetric particles above 2.7 TeV, consistent with the non-observation of those particles at the LHC. The electroweak supersymmetric spectrum starts below 1 TeV and large parts of the allowed spectrum of the lighter might be accessible at CLIC. The FCC-hh will be able to fully test the predicted spectrum. △ Less", "The search of the light Higgsino {in the Minimal Supersymmetric Standard Model (MSSM)} is a crucial test for the criteria of the naturalness in supersymmetry. On the other hand, the direct production of light Higgsino is also known as one of the most challenging SUSY searches at the current CERN Large Hadron collider (LHC). The lack of visible leptons due to the compressed spectrum and their small production rates limits their discovery potential in both mono-jet plus MET as well as the weak boson fusion (WBF) production. The signal $S/B$ ratio prediction is usually within the background systematic uncertainties at the LHC. Without color exchange between the beams, the $e-p$ colliders are well-known to have the WBF feature. Therefore, we study the search of the light Higgsinos at two future $e-p$ colliders at CERN, LHeC and FCC-eh.~The light Higgsinos will be produced in pair through weak boson fusion with controlled background at these colliders. We find the Higgsino of 95/145~GeV can be reached at 2$σ$ level at the future LHeC/FCC-eh with a luminosity $3 ~\\text{ab}^{-1}$ respectively. △ Less", "Anomaly-mediated supersymmetry breaking (AMSB) models seem to have become increasingly implausible due to 1. difficulty in generating a Higgs mass m(h)~125 GeV, 2. typically unnatural superparticle spectra characterized by a large superpotential mu term and 3. the possibility of a wino-like lightest SUSY particle (LSP) as dark matter now seems to be excluded. In the present paper we propose some minor modifications to the paradigm model which solve these three issues. Instead of adding a universal bulk scalar mass to avoid tachyonic sleptons, we add distinct Higgs and matter scalar soft masses which then allow for light higgsinos. To gain accord with the measured Higgs mass, we also include a bulk trilinear soft term. The ensuing natural generalized AMSB (nAMSB) model then has a set of light higgsinos with mass nearby the weak scale m(W,Z,h)~100 GeV as required by naturalness while the winos populate the several hundred GeV range and gluinos and squarks occupy the multi-TeV range. For LHC searches, the wino pair production followed by decay to same-sign diboson signature channel offers excellent prospects for discovery at high luminosity LHC along with higgsino pair production leading to soft dileptons plus jet(s)+MET. A linear e^+e^- collider operating above higgsino pair production threshold should be able to distinguish the AMSB gaugino spectra from unified or mirage unified scenarios. Dark matter is expected to occur as a higgsino-like WIMP plus axion admixture. △ Less", "We consider a simple setup with light squarks which is free from the gravitino and SUSY flavor problems. In our setup, a SUSY breaking sector is sequestered from the matter and gauge sectors, and it only couples to the Higgs sector directly with $\\mathcal{O}(100)\\,$TeV gravitino. Resulting mass spectra of sfermions are split: the first and second generation sfermions are light as $\\mathcal{O}(1)\\,$TeV while the third generation sfermions are heavy as $\\mathcal{O}(10)\\,$TeV. The light squarks of $\\mathcal{O}(1)\\,$TeV can be searched at the (high-luminosity) LHC and future collider experiments. Our scenario can naturally avoid too large flavor-changing neutral currents and it is consistent with the $ε_K$ constraint. Moreover, there are regions explaining the muon $g-2$ anomaly and bottom-tau/top-bottom-tau Yukawa coupling unification simultaneously. △ Less", "For the search for electroweak particles in the Minimal Supersymmetric Standard Model (MSSM) as well as for future precision analyses of these particles an accurate knowledge of their production and decay properties is mandatory. We review the evaluation of the cross sections for the chargino, neutralino and scalar lepton production at e+e- colliders in the MSSM with complex parameters (cMSSM). The evaluation is based on a full one-loop calculation of the various production mechanisms, including soft and hard photon radiation. The dependence of the chargino/neutralino/slepton cross sections on the relevant cMSSM parameters is analyzed numerically. We find sizable contributions to many production cross sections. They amount roughly +- 15% of the tree-level results, but can go up to +-40% or higher in extreme cases. Also the complex phase dependence of the one-loop corrections was found non-negligible. The full one-loop contributions are thus crucial for physics analyses at a future linear e+e- collider such as the ILC or CLIC. △ Less", "We review the MasterCode fits of several incarnations of the Minimal Supersymmetric Standard Model (MSSM). These include the GUT models based on mAMSB and SU(5), sub-GUT models as well as a model defined at low energies with 11 free parameters, the pMSSM11. The fit combines consistently measurements of Higgs boson properties, searches for additional Higgs bosons and supersymmetric (SUSY) particles, low-energy and flavor experiments as well as Dark Matter (DM) measurements. We predict the preferred SUSY mass spectra in these models and analyze the discovery potential of future e+e- colliders such as the ILC and CLIC. △ Less", "The identity of Dark Matter (DM) is one of the most captivating topics in particle physics today. The R-parity conserving Minimal Supersymmetric Standard Model (MSSM), which naturally provides a DM candidate in the form of the lightest neutralino ($\\tildeχ_{1}^{0}$), is used as a benchmark scenario to show that a measurement of $Ω_{\\tildeχ_{1}^{0}}h^{2}$ can be achieved from measurements at the CERN Large Hadron Collider. Focus is placed on compressed mass spectra regions, where the mass difference between the $\\tildeχ_{1}^{0}$ and the $\\tildeτ_{1}$ is small and where the $\\tildeτ_{1}$-$\\tildeχ_{1}^{0}$ coannihilation (CA) mechanism of the early Universe plays an important role. The technique for measuring $Ω_{\\tildeχ_{1}^{0}}h^{2}$ relies on two proposed searches for compressed Supersymmetry (SUSY): 1) production via Vector Boson Fusion (VBF) processes; and 2) production with associated energetic jets from initial state radiation (ISR). These approaches allow for the determination of the relic abundance at the LHC for any model where CA is an important DM reduction mechanism in the early Universe. Thus, it is possible to confirm that the DM we observe today were $\\tildeχ_{1}^{0}$'s created in the early Universe. We show that from measurements in the VBF and ISR SUSY searches at the LHC, the dark matter relic density can be measured with an uncertainty of 25\\% with 3000 fb$^{-1}$ of 13 TeV proton-proton data. △ Less", "We solve the Goldstone modes in the renormalizable SUSY SO(10) model with general couplings. The Goldstones are expressed by the Vacuum Expectation Values and the Clebsch-Gordan coefficients of relevant symmetries without explicit dependence on the parameters of the model. △ Less", "In these introductory lectures, we review the theoretical tools used in constructing supersymmetric field theories and their application to physical models. We first introduce the technology of two-component spinors, which is convenient for describing spin-$1/2$ fermions. After motivating why a theory of nature may be supersymmetric at the TeV energy scale, we show how supersymmetry (SUSY) arises as an extension of the Poincaré algebra of spacetime symmetries. We then obtain the representations of the SUSY algebra and discuss its simplest realization in the Wess-Zumino model. In order to have a systematic approach for obtaining supersymmetric Lagrangians, we introduce the formalism of superspace and superfields and recover the Wess-Zumino Lagrangian. These methods are then extended to encompass supersymmetric abelian and non-abelian gauge theories coupled to supermatter. Since supersymmetry is not an exact symmetry of nature, it must ultimately be broken. We discuss several mechanisms of SUSY-breaking (both spontaneous and explicit) and briefly survey various proposals for realizing SUSY-breaking in nature. Finally, we construct the the Minimal Supersymmetric extension of the Standard Model (MSSM), and consider the implications for the future of SUSY in particle physics. △ Less", "Predictions for the scale of SUSY breaking from the string landscape go back at least a decade to the work of Denef and Douglas on the statistics of flux vacua. The assumption that an assortment of SUSY breaking F and D terms are present in the hidden sector, and their values are uniformly distributed in the landscape of D=4, N=1 effective supergravity models, leads to the expectation that the landscape pulls towards large values of soft terms favored by a power law behavior P(m(soft))~ m(soft)^n. On the other hand, similar to Weinberg's prediction of the cosmological constant, one can assume an anthropic selection of weak scales not too far from the measured value characterized by m(W,Z,h)~ 100 GeV. Working within a fertile patch of gravity-mediated low energy effective theories where the superpotential mu term is << m(3/2), as occurs in models such as radiative breaking of Peccei-Quinn symmetry, this biases statistical distributions on the landscape by a cutoff on the parameter Delta(EW), which measures fine-tuning in the m(Z)-mu mass relation. The combined effect of statistical and anthropic pulls turns out to favor low energy phenomenology that is more or less agnostic to UV physics. While a uniform selection n=0 of soft terms produces too low a value for m(h), taking n=1 or 2 produce most probabilistically m(h)~125 GeV for negative trilinear terms. For n>=1, there is a pull towards split generations with m(squarks,sleptons)(1,2)~10-30 TeV whilst m(t1)~ 1-2 TeV. The most probable gluino mass comes in at ~ 3-4 TeV--apparently beyond the reach of HL-LHC (although the required quasi-degenerate higgsinos should still be within reach). We comment on consequences for SUSY collider and dark matter searches. △ Less", "We perform a detailed study of the grand unified theories $SO(10)$ and $E(6)$ with left-right intermediate gauge symmetries of the form $SU(N)_L\\otimes SU(N)_R \\otimes \\mathcal{G}$. Proton decay lifetime constrains the unification scale to be $ \\gtrsim 10^{16}$ GeV and, as discussed in this paper, unwanted cosmological relics can be evaded if the intermediate symmetry scale is $ \\gtrsim 10^{12}$ GeV. With these conditions, we study the renormalization group evolution of the gauge couplings and do a comparative analysis of all possible left-right models where unification can occur. Both the D-parity conserved and broken scenarios, as well as the supersymmetric (SUSY) and Non-supersymmetric (Non-SUSY) versions, are considered. In addition to the fermion and scalar representations at each stage of the symmetry breaking, contributing to the $β$-functions, we list the intermediate left-right groups which successfully meet these requirements. We make use of the dimension-5 kinetic mixing effective operators for achieving unification and large intermediate scale. A significant result in the supersymmetric case is that to achieve successful unification for some breaking patterns, the scale of SUSY breaking needs to be at least a few TeV. In some of these cases, the intermediate scale can be as low as $\\sim 10^{12}$ GeV, for SUSY scale to be $\\sim 30$ TeV. This has important consequences in the collider searches for SUSY particles and phenomenology of the lightest neutralino as dark matter. △ Less", "We explore supersymmetric contributions to the decay $K_S^0\\rightarrowμ^+μ^-$, in light of current experimental data. The Standard Model (SM) predicts $\\mathcal{B}(K_S^0\\rightarrowμ^+μ^-)\\approx5\\times 10^{-12}$. We find that contributions arising from flavour violating Higgs penguins can enhance the branching fraction up to $\\approx 35\\times 10^{-12}$ within different scenarios of the Minimal Supersymmetric Standard Model (MSSM), as well as suppress it down to $\\approx 0.78\\times 10^{-12}$. Regions with fine-tuned parameters can bring the branching fraction up to the current experimental upper bound, $8\\times 10^{-10}$. The mass degeneracy of the heavy Higgs bosons in MSSM induces correlations between $\\mathcal{B}(K_S^0\\rightarrowμ^+μ^-)$ and $\\mathcal{B}(K_L^0\\rightarrowμ^+μ^-)$. Predictions for the $CP$ asymmetry in $K^0\\rightarrowμ^+μ^-$ decays in the context of MSSM are also given, and can be up to eight times bigger than in the SM. △ Less", "We conduct a numerical study over the constrained MSSM (CMSSM), Next-to-MSSM (NMSSM) and $U(1)$ extended MSSM (UMSSM) to probe the allowed mass ranges of the charged Higgs boson and its dominant decay patterns, which might come into prominence in near future collider experiments. {We present results obtained from a limited scan for CMSSM} as a basis and compare its predictions with the extended models. We observe within our data that a wide mass range is allowed as $0.5(1) \\lesssim m_{H^{\\pm}} \\lesssim 17$ TeV in UMSSM (NMSSM). We find that the dominant decay channel is mostly $H^{\\pm}\\rightarrow tb$ such that ${\\rm BR}(H^{\\pm}\\rightarrow tb) \\sim 80\\%$. While this mode remains dominant over the whole allowed parameter space of CMSSM, we realize some special domains in the NMSSM and UMSSM, in which ${\\rm BR}(H^{\\pm}\\rightarrow tb) \\lesssim 10\\%$. In this context, the decay patterns of the charged Higgs can play a significant role to distinguish among the SUSY models. In addition to the $tb$ decay mode, we find that the narrow mass scale in CMSSM allows only the decay modes for the charged Higgs boson to $τν$ ($\\sim 16\\%$), and their supersymmetric partners $\\tildeτ\\tildeν$ ($\\sim 13\\%$). On the other hand, it is possible to realize the mode in NMSSM and UMSSM in which the charged Higgs boson decays into a chargino and neutralino pair up to about $25\\%$. {This decay mode requires non-universal boundary conditions within the MSSM framework to be available, since CMSSM yields ${\\rm BR} (H^{\\pm}\\rightarrow \\tildeχ_{1}^{0}\\tildeχ_{1}^{\\pm}) \\lesssim 1\\%$.} It can also be probed in near future collider experiments through the missing energy and CP-violation measurements... △ Less", "We present the full NLO SUSY-QCD corrections to the pair production of neutralinos and charginos at the LHC in association with a jet and their matching to parton-shower programs in the framework of the POWHEG-BOX package. The code we have developed provides a SUSY Les Houches Accord interface for setting electroweak and supersymmetric input parameters. Decays of the neutralinos and charginos and parton-shower effects can be simulated with multi-purpose programs such as PYTHIA. The capabilities of the code are illustrated by phenomenological results for a parameter point in the framework of pMSSM10, compatible with present experimental limits on supersymmetry. We find that NLO-QCD corrections as well as parton-shower effects are of primary importance for the appropriate description of jet distributions. △ Less", "We study an extension of the minimal supersymmetric standard model (MSSM) with additional right-handed singlet neutrino superfields. While such an extension incorporates a mechanism for the neutrino mass, it also opens up the possibility of having the right-sneutrinos ($\\widetildeν$) as the lightest supersymmetric particle (LSP). In this work, we focus on the the viability of rather small ($\\lesssim 500$ GeV) higgsino mass parameter ($μ$), an important ingredient for \"naturalness\", in the presence of such a LSP. For simplicity, we assume that the bino and wino mass parameters are much heavier, thus we only consider (almost) pure and compressed higgsino-like states, with small $\\mathcal{O}(10^{-2})$ gaugino admixture. Considering only prompt decays of the higgino-like states, especially the lightest chargino, we discuss the importance of leptonic channels consisting of up to two leptons with large missing transverse energy to probe this scenario at the Large Hadron Collider (LHC). Further, we emphasize on how the gaugino mass parameters, although very heavy, affects the decay of the low-lying higgsino-like states, thus significantly affecting the proposed signatures at LHC. △ Less", "It is known that in the absence of a gauge singlet field, a specific class of supersymmetry (SUSY) breaking non-holomorphic (NH) terms can be soft breaking in nature so that they may be considered along with the Minimal Supersymmetric Standard Model (MSSM) and beyond. There have been studies related to these terms in minimal supergravity based models. Consideration of an F-type SUSY breaking scenario in the hidden sector with two chiral superfields however showed Planck scale suppression of such terms. In an unbiased point of view for the sources of SUSY breaking, the NH terms in a phenomenological MSSM (pMSSM) type of analysis showed a possibility of a large SUSY contribution to muon $g-2$, a reasonable amount of corrections to the Higgs boson mass and a drastic reduction of the electroweak fine-tuning for a higgsino dominated $\\widetildeχ^0_1$ in some regions of parameter space. We first investigate here the effects of the NH terms in a low scale SUSY breaking scenario. In our analysis with minimal gauge mediated supersymmetry breaking (mGMSB) we probe how far the results can be compared with the previous pMSSM plus NH terms based study. We particularly analyze the Higgs, stop and the electroweakino sectors focusing on a higgsino dominated $\\widetildeχ^0_1$ and $\\widetildeχ^{\\pm}_1$, a feature typically different from what appears in mGMSB. The effect of a limited degree of RG evolutions and vanishing of the trilinear coupling terms at the messenger scale can be overcome by choosing a non-minimal GMSB scenario, such as one with a matter-messenger interaction. △ Less", "We examine the compressed mass spectrum with sub-TeV top squark ($\\tilde t$) as lightest colored (s)particle in natural supersymmetry (SUSY). Such spectra are searched along with an additional hard jet, not only to boost the soft decay particles, also to yield enough missing transverse momentum. Several interesting kinematic variables are proposed to improve the probe performance for this difficult region, where we concentrate on relatively clean dileptonic channel of the top squark decaying into lightest neutralino ($χ_1^0$), which is also the lightest supersymmetric particle. In this work, we investigate the merit of these kinematic variables, sensitive to compressed mass region extending the search by introducing additional states, chargino and slepton (sneutrino) having masses in between the $\\tilde t$ and $χ_1^0$. Enhanced production and lack of branching suppression are capable of providing a strong limit on chargino and slepton/sneutrino mass along with top squark mass. We perform a detailed collider analysis using simplified SUSY spectrum and found that with the present LHC data $M_{\\tilde t}$ can be excluded up to 710 GeV right away for $M_{χ_1^0}$ of 640 GeV for a particular mass gap between different states. △ Less", "We perform a status analysis of selective supersymmetric GUT models in light of recent constraints from collider and dark matter detection experiments. We find that a significant region of the parameter space of these models is still accessible to these experiments. Amongst the models we analyze, the split family model provides solutions that can explain the observed deviation in anomalous magnetic moment of the muon. Furthermore, there is a notable region of the parameter space of each model which yields the desired relic abundance for neutralino dark matter. We also present the prediction of spin independent and spin dependent neutralino cross sections in these models and find that there is parameter space which can be probed at future experiments searching for dark matter. Our analysis serves as a motivation to continue the search for supersymmetry at various experimental fronts. △ Less", "We explore the dark matter freeze-in mechanism within the gauge mediation framework, which involves a hidden Feebly Interacting Massive Particle (FIMP) coupling feebly with the messenger fields while the messengers are still in the thermal bath. The FIMP is the fermionic component of the pseudo-moduli in a generic metastable supersymmetry (SUSY) breaking model and resides in the hidden sector. The relic abundance and the mass of the FIMP are determined by the SUSY breaking scale and the feeble coupling. The gravitino, which is the canonical dark matter candidate in the gauge mediation framework, contributes to the dark matter relic abundance along with the freeze-in of the FIMP. The hidden sector thus becomes two- component with both the FIMP and gravitino lodging in the SUSY breaking hidden sector. We point out that the ratio between the FIMP and the gravitino is determined by how SUSY breaking is communicated to the messengers. In particular when the FIMP dominates the hidden sector, the gravitino becomes the minor contributor in the hidden sector. Meanwhile, the neutralino is assumed to be both the Weakly Interacting Massive Particle (WIMP) dark matter candidate in the freeze-out mechanism and the Lightest Observable SUSY Particle (LOSP). We further find out the neutralino has the sub-leading contribution to the current dark matter relic density in the parameter space of our freeze-in gauge mediation (FIGM) model. Our result links the SUSY breaking scale in the gauge mediation framework with the FIMP freeze-in production rate leading to a natural and predicting scenario for the studies of the dark matter in the hidden sector. △ Less", "We explore the LHC reach on beyond-the-Standard Model (BSM) particles $X$ associated with a new strong force in a hidden sector. We focus on the motivated scenario where the SM and hidden sectors are connected by fermionic mediators $ψ^{+, 0}$ that carry SM electroweak charges. The most promising signal is the Drell-Yan production of a $ψ^\\pm \\barψ^0$ pair, which forms an electrically charged vector bound state $Υ^\\pm$ due to the hidden force and later undergoes resonant annihilation into $W^\\pm X$. We analyze this final state in detail in the cases where $X$ is a real scalar $φ$ that decays to $b\\bar{b}$, or a dark photon $γ_d$ that decays to dileptons. For prompt $X$ decays, we show that the corresponding signatures can be efficiently probed by extending the existing ATLAS and CMS diboson searches to include heavy resonance decays into BSM particles. For long-lived $X$, we propose new searches where the requirement of a prompt hard lepton originating from the $W$ boson ensures triggering and essentially removes any SM backgrounds. To illustrate the potential of our results, we interpret them within two explicit models that contain strong hidden forces and electroweak-charged mediators, namely $λ$-supersymmetry (SUSY) and non-SUSY ultraviolet extensions of the Twin Higgs model. The resonant nature of the signals allows for the reconstruction of the mass of both $Υ^\\pm$ and $X$, thus providing a wealth of information about the hidden sector. △ Less", "We propose a new approach to generate messenger-matter interactions in deflected anomaly mediated SUSY breaking mechanism from typical holomorphic messenger-matter mixing terms in the Kahler potential. This approach is a unique feature of AMSB and has no analog in GMSB-type scenarios. New coupling strengths from the scaling of the (already known) Yukawa couplings always appear in this approach. With messenger-matter interactions in deflected AMSB, we can generate a realistic soft SUSY breaking spectrum for next-to-minimal supersymmetric standard model(NMSSM). Successful electroweak symmetry breaking conditions, which is not easy to satisfy in NMSSM for ordinary AMSB-type scenario, can be satisfied in a large portion of parameter space in our scenarios. We study the relevant phenomenology for scenarios with (Bino-like) neutralino and axino LSP, respectively. In the case of axino LSP, the SUSY contributions to $Δa_μ$ can possibly account for the muon $g-2$ discrepancy. The corresponding gluino masses, which are found to below 2.2 TeV, could be tested soon at LHC. △ Less", "In supersymmetric (SUSY) field theory, there exist configurations which formally satisfy SUSY conditions but are not on original path integral contour. We refer to such configurations as complexified supersymmetric solutions (CSS). In this paper we discuss that CSS provide important information on large order behavior of weak coupling perturbative series in SUSY field theories. We conjecture that CSS with a bosonic (fermionic) free parameter give poles (zeroes) of Borel transformation of perturbative series whose locations are uniquely determined by actions of the solutions. We demonstrate this for various SUSY observables in 3d $\\mathcal{N}=2$ SUSY Chern-Simons matter theories on sphere. First we construct infinite number of CSS in general 3d $\\mathcal{N}=2$ SUSY theory with Lagrangian where adjoint scalar in vector multiplet takes a complex value and matter fields are nontrivial. Then we compare their actions with Borel transformations of perturbative expansions by inverse Chern-Simons levels for the observables and see agreement with our conjecture. It turns out that the CSS explain all the Borel singularities for this case. △ Less", "We document major new features and improvements of FlexibleSUSY, a Mathematica and C++ package with a dependency on the external package SARAH, that generates fast and precise spectrum generators. The extensions presented here significantly increase the generality and capabilities of the FlexibleSUSY package, which already works with a wide class of models, while maintaining an elegant structure and easy to use interfaces. The FlexibleBSM extension makes it possible to also create spectrum generators for non-supersymmetric extensions of the Standard Model. The FlexibleCPV extension adds the option of complex parameters to the spectrum generators, allowing the study of many interesting models with new sources of $CP$ violation. FlexibleMW computes the decay of the muon for the generated model and thereby allows FlexibleSUSY to predict the mass of the $W$ boson from the input parameters by using the more precise electroweak input of $\\{ G_F, M_Z, α_{\\text{em}} \\}$ instead of $\\{ M_W, M_Z, α_{\\text{em}} \\}$. The FlexibleAMU extension provides a calculator of the anomalous magnetic moment of the muon in any model FlexibleSUSY can generate a spectrum for. FlexibleSAS introduces a new solver for the boundary value problem which makes use of semi-analytic expressions for dimensionful parameters to find solutions in models where the classic two-scale solver will not work such as the constrained E$_6$SSM. FlexibleEFTHiggs is a hybrid calculation of the Higgs mass which combines the virtues of both effective field theory calculations and fixed-order calculations. All of these extensions are included in FlexibleSUSY 2.0, which is released simultaneously with this manual. △ Less", "Within the Standard Model Extension (SME), we expand our previous findings on four classes of violations of Super-Symmetry (SuSy) and Lorentz Symmetry (LoSy), differing in the handedness of the Charge conjugation-Parity-Time reversal (CPT) symmetry and in whether considering the impact of photinos on photon propagation. The violations, occurring at the early universe high energies, show visible traces at present in the Dispersion Relations (DRs). For the CPT-odd classes ($V_μ$ breaking vector) associated with the Carroll-Field-Jackiw (CFJ) model, the DRs and the Lagrangian show for the photon an effective mass, gauge invariant, proportional to $|{\\vec V}|$. The group velocity exhibits a classic dependency on the inverse of the frequency squared. For the CPT-even classes ($k_{F}$ breaking tensor), when the photino is considered, the DRs display also a massive behaviour inversely proportional to a coefficient in the Lagrangian and to a term linearly dependent on $k_{F}$. All DRs display an angular dependence and lack LoSy invariance. In describing our results, we also point out the following properties: i) the appearance of complex or simply imaginary frequencies and super-luminal speeds and ii) the emergence of bi-refringence. Finally, we point out the circumstances for which SuSy and LoSy breakings, possibly in presence of an external field, lead to the non-conservation of the photon energy-momentum tensor. We do so for both CPT sectors. △ Less", "Visible-sector SUSY-breaking effects are computed in terms of hidden-sector correlation functions for generic holomorphic scalar portals. The solutions, which are valid irrespective of the hidden-sector dynamics, are approximated with the help of the operator product expansion (OPE). Indeed, for theories with superconformal symmetry at high energy, the superconformal OPE formalism can be used to disentangle the high-energy dynamics, encoded in the OPE coefficients, from the low-energy dynamics of the SUSY-breaking vacuum expectation values. A systematic method is proposed to compute the OPE coefficients, using relations between correlation functions of superfields and correlation functions of their quasi-primary component fields. The method, which is quite general, could be useful in building models of gauge- or gravity-mediated SUSY breaking and in analysing the viability of such models in a systematic way. △ Less", "We investigate how super-Planckian axions can arise when type IIB 3-form flux is used to restrict a two-axion field space to a one-dimensional winding trajectory. If one does not attempt to address notoriously complicated issues like Kahler moduli stabilization, SUSY-breaking and inflation, this can be done very explicitly. We show that the presence of flux generates flat monodromies in the moduli space which we therefore call 'Monodromic Moduli Space'. While we do indeed find long axionic trajectories, these are non-geodesic. Moreover, the length of geodesics remains highly constrained, in spite of the (finite) monodromy group introduced by the flux. We attempt to formulate this in terms of a 'Moduli Space Size Conjecture'. Interesting mathematical structures arise in that the relevant spaces turn out to be fundamental domains of congruence subgroups of the modular group. In addition, new perspectives on inflation in string theory emerge. △ Less", "We study production of gravitino and Polonyi particles in the minimal Starobinsky-Polonyi $\\mathcal{N}=1$ supergravity with inflaton belonging to a massive vector supermultiplet. Our model has only one free parameter given by the scale of spontaneous SUSY breaking triggered by Polonyi chiral superfield. The vector supermultiplet generically enters the action non-minimally, via an arbitrary real function. This functon is chosen to generate the inflaton scalar potential of the Starobinsky model. Our supergravity model can be reformulated as an abelian supersymmetric gauge theory with the vector gauge superfield coupled to two (Higgs and Polonyi) chiral superfields interacting with supergravity, where the $U(1)$ gauge symmetry is spontaneously broken. We find that Polonyi and gravitino particles are efficiently produced during inflation. After inflation, perturbative decay of inflaton also produces Polonyi particles that rapidly decay into gravitinos. As a result, a coherent picture of inflation and dark matter emerges, where the abundance of produced gravitinos after inflation fits the CMB constraints as a Super Heavy Dark Matter (SHDM) candidate. Our scenario avoids the notorous gravitino and Polonyi problems with the Big Bang Nucleosynthesis (BBN) and DM overproduction. △ Less", "We consider the gauged $U(1)$ clockwork theory with a product of multiple gauge groups and discuss the continuum limit of the theory to a massless gauged $U(1)$ with linear dilaton background in five dimensions. The localization of the lightest state of gauge fields on a site in the theory space naturally leads to exponentially small effective couplings of external matter fields localized away from the site. We discuss the implications of our general discussion with some examples, such as mediators of dark matter interactions, flavor-changing $B$-meson decays as well as D-term SUSY breaking. △ Less", "We investigate to which extent the SUSY search results published by ATLAS and CMS in the context of simplified models actually cover the more realistic scenarios of a full model. Concretely, we work within the phenomenological MSSM (pMSSM) with 19 free parameters and compare the constraints obtained from SModelSv1.1.1 with those from the ATLAS pMSSM study in arXiv:1508.06608. We find that about 40-45% of the points excluded by ATLAS escape the currently available simplified model constraints. For these points we identify the most relevant topologies which are not tested by the current simplified model results. In particular, we find that topologies with asymmetric branches, including 3-jet signatures from gluino-squark associated production, could be important for improving the current constraining power of simplified models results. Furthermore, for a better coverage of light stops and sbottoms, constraints for decays via heavier neutralinos and charginos, which subsequently decay visibly to the lightest neutralino are also needed. △ Less", "Using a 10D lift of non-perturbative volume stabilization in type IIB string theory we study the limitations for obtaining de Sitter vacua. Based on this we find that the simplest KKLT vacua with a single Kahler modulus stabilized by a gaugino condensate cannot be uplifted to de Sitter. Rather, the uplift flattens out due to stronger backreaction on the volume modulus than has previously been anticipated, resulting in vacua which are meta-stable and SUSY breaking, but that are always AdS. However, we also show that setups such as racetrack stabilization can avoid this issue. In these models it is possible to obtain supersymmetric AdS vacua with a cosmological constant that can be tuned to zero while retaining finite moduli stabilization. In this regime, it seems that de Sitter uplifts are possible with negligible backreaction on the internal volume. We exhibit this behavior also from the 10D perspective. △ Less", "The random grid search (RGS) is a simple, but efficient, stochastic algorithm to find optimal cuts that was developed in the context of the search for the top quark at Fermilab in the mid-1990s. The algorithm, and associated code, have been enhanced recently with the introduction of two new cut types, one of which has been successfully used in searches for supersymmetry at the Large Hadron Collider. The RGS optimization algorithm is described along with the recent developments, which are illustrated with two examples from particle physics. One explores the optimization of the selection of vector boson fusion events in the four-lepton decay mode of the Higgs boson and the other optimizes SUSY searches using boosted objects and the razor variables. △ Less", "Various methods are used in the literature for predicting the lightest CP-even Higgs boson mass in the Minimal Supersymmetric Standard Model (MSSM). Fixed-order diagrammatic calculations capture all effects at a given order and yield accurate results for scales of supersymmetric (SUSY) particles that are not separated too much from the weak scale. Effective field theory calculations allow a resummation of large logarithmic contributions up to all orders and therefore yield accurate results for a high SUSY scale. A hybrid approach, where both methods have been combined, is implemented in the computer code FeynHiggs. So far, however, at large scales sizeable differences have been observed between FeynHiggs and other pure EFT codes. In this work, the various approaches are analytically compared with each other in a simple scenario in which all SUSY mass scales are chosen to be equal to each other. Three main sources are identified that account for the major part of the observed differences. Firstly, it is shown that the scheme conversion of the input parameters that is commonly used for the comparison of fixed-order results is not adequate for the comparison of results containing a series of higher-order logarithms. Secondly, the treatment of higher-order terms arising from the determination of the Higgs propagator pole is addressed. Thirdly, the effect of different parametrizations in particular of the top Yukawa coupling in the non-logarithmic terms is investigated. Taking into account all of these effects, in the considered simple scenario very good agreement is found for scales above 1 TeV between the results obtained using the EFT approach and the hybrid approach of FeynHiggs. △ Less", "We present the most comprehensive global fits to date of three supersymmetric models motivated by grand unification: the Constrained Minimal Supersymmetric Standard Model (CMSSM), and its Non-Universal Higgs Mass generalisations NUHM1 and NUHM2. We include likelihoods from a number of direct and indirect dark matter searches, a large collection of electroweak precision and flavour observables, direct searches for supersymmetry at LEP and Runs I and II of the LHC, and constraints from Higgs observables. Our analysis improves on existing results not only in terms of the number of included observables, but also in the level of detail with which we treat them, our sampling techniques for scanning the parameter space, and our treatment of nuisance parameters. We show that stau co-annihilation is now ruled out in the CMSSM at more than 95\\% confidence. Stop co-annihilation turns out to be one of the most promising mechanisms for achieving an appropriate relic density of dark matter in all three models, whilst avoiding all other constraints. We find high-likelihood regions of parameter space featuring light stops and charginos, making them potentially detectable in the near future at the LHC. We also show that tonne-scale direct detection will play a largely complementary role, probing large parts of the remaining viable parameter space, including essentially all models with multi-TeV neutralinos. △ Less", "We study the naturalness, dark matter, and muon anomalous magnetic moment in the Supersymmetric Standard Models (SSMs) with a pseudo-Dirac gluino (PDGSSMs) from hybrid $F-$ and $D-$term supersymmetry (SUSY) breakings. To obtain the observed dark matter relic density and explain the muon anomalous magnetic moment, we find that the low energy fine-tuning measures are larger than about 30 due to strong constraints from the LUX and PANDAX experiments. Thus, to study the natural PDGSSMs, we consider multi-component dark matter and then the relic density of the lighest supersymmetric particle (LSP) neutralino is smaller than the correct value. We classify our models into six kinds: (i) Case A is a general case, which has small low energy fine-tuning measure and can explain the anomalous magnetic moment of the muon; (ii) Case B with the LSP neutralino and light stau coannihilation; (iii) Case C with Higgs funnel; (iv) Case D with Higgsino LSP; (v) Case E with light stau coannihilation and Higgsino LSP; (vi) Case F with Higgs funnel and Higgsino LSP. We study these Cases in details, and show that our models can be natural and consistent with the LUX and PANDAX experiments, as well as explain the muon anomalous magnetic moment. In particular, all these cases except the stau coannihilation can even have low energy fine-tuning measures around 10. △ Less", "Solving by a canonical string theory, of closed strings for the glueballs and open strings for the mesons, the 't Hooft large-$N$ expansion of QCD is a long-standing problem that resisted all the attempts despite the advent of the celebrated gauge/gravity duality in the framework of string theory. We demonstrate that in the canonical string framework such a solution does not actually exist because an inconsistency arises between the renormalization properties of the QCD S matrix at large $N$ -- a consequence of the asymptotic freedom (AF) -- and the open/closed duality of the would-be string solution. Specifically, the would-be open-string one-loop corrections to the tree glueball amplitudes must be ultraviolet (UV) divergent. Hence, naively, the inconsistency arises because these amplitudes are dual to tree closed-string diagrams, which are universally believed to be both UV finite -- since they are closed-string tree diagrams -- and infrared finite because of the glueball mass gap. In fact, the inconsistency follows from a low-energy theorem of the NSVZ type that controls the renormalization in QCD-like theories. The inconsistency extends to the would-be canonical string for a vast class of 't Hooft large-$N$ QCD-like theories including $\\mathcal{N}=1$ SUSY QCD. We also demonstrate that the presently existing SUSY string models with a mass gap -- such as Klebanov-Strassler, Polchinski-Strassler (PS) and certain PS variants -- cannot contradict the above-mentioned results since they are not asymptotically free. Moreover, we shed light on the way the open/closed string duality may be perturbatively realized in these string models compatibly with a mass gap in the 't Hooft-planar closed-string sector and the low-energy theorem because of the lack of AF. Finally, we suggest a noncanonical way-out for QCD-like theories based on topological strings on noncommutative twistor space. △ Less", "We present standard model (SM) estimates for exclusive $c \\to u γ$ processes in heavy quark and hybrid frameworks. Measured branching ratios ${\\cal{B}}(D^0 \\to (φ, \\bar K^{*0}) γ)$ are at or somewhat exceeding the upper range of the SM and suggest slow convergence of the $1/m_D, α_s$-expansion. Model-independent constraints on $|ΔC|=|ΔU|=1$ dipole operators from ${\\cal{B}}(D^0 \\to ρ^0 γ)$ data are obtained. Predictions and implications for leptoquark models are worked out. While branching ratios are SM-like CP asymmetries $\\lesssim 10 \\%$ can be induced. In SUSY deviations from the SM can be even larger with CP asymmetries of $O(0.1)$. If $Λ_c$-baryons are produced polarized, such as at the $Z$-pole, an angular asymmetry in $Λ_c \\to p γ$ decays can be studied that is sensitive to chirality-flipped contributions. △ Less", "We critically examine the classic endpoint method for particle mass determination, focusing on difficult corners of parameter space, where some of the measurements are not independent, while others are adversely affected by the experimental resolution. In such scenarios, mass differences can be measured relatively well, but the overall mass scale remains poorly constrained. Using the example of the standard SUSY decay chain $\\tilde q\\to \\tildeχ^0_2\\to \\tilde \\ell \\to \\tilde χ^0_1$, we demonstrate that sensitivity to the remaining mass scale parameter can be recovered by measuring the two-dimensional kinematical boundary in the relevant three-dimensional phase space of invariant masses squared. We develop an algorithm for detecting this boundary, which uses the geometric properties of the Voronoi tessellation of the data, and in particular, the relative standard deviation (RSD) of the volumes of the neighbors for each Voronoi cell in the tessellation. We propose a new observable, $\\barΣ$, which is the average RSD per unit area, calculated over the hypothesized boundary. We show that the location of the $\\barΣ$ maximum correlates very well with the true values of the new particle masses. Our approach represents the natural extension of the one-dimensional kinematic endpoint method to the relevant three dimensions of invariant mass phase space. △ Less"]