["Since $\\mathrm{SO}(10)$ GUTs unify all fermions of the Standard Model plus a right-chiral neutrino in a representation $\\mathbf{16}$ per family, they have the potential to be maximally predictive regarding the ratios between the masses (or Yukawa couplings) of different fermion types, i.e.~the up-type quarks, down-type quarks, charged leptons and neutrinos. We analyze the predictivity of classes of $\\mathrm{SO}(10)$ (SUSY) GUT models for the fermion mass ratios, where the Yukawa couplings for each family are dominated by a single effective GUT operator of the schematic form $\\mathbf{16}^2\\cdot\\mathbf{45}^n\\cdot\\mathbf{210}^{m}\\cdot\\mathbf{H}$, for $\\mathbf{H}\\in\\{\\mathbf{10},\\mathbf{120},\\mathbf{\\overline{126}}\\}$. This extends previous works to general vacuum expectation value directions for GUT-scale VEVs and to larger Higgs representations. In addition, we show that the location of the MSSM Higgses in the space of all doublets is a crucial aspect to consider. We discuss highly predictive cases and illustrate the predictive power in toy models consisting of masses for the 3rd and 2nd fermion family. △ Less", "In the standard model (SM), the Cabibbo-Kobayashi-Maskawa (CKM) matrix is the only origin of flavor violations (FVs). On the other hand, in general, there are a lot of sources of the FVs in a physics beyond the SM, through the diagonalizing matrices which make Yukawa matrices diagonal. Although most of the diagonalizing matrices are unknown ones, grand unified theories (GUTs) can fix these matrices. In particular, if we consider a GUT model based on the $SO(10)$ group, these diagonalizing matrices are strongly related to each other because of the matter unification. However, this unification causes the problem on the realization of measured SM fermion masses and mixing angles. Up to now, many people showed that supersymmetric (SUSY) threshold corrections can solve this problem, especially unfavorable fermion mass relations. In this paper, we show that how these SUSY threshold corrections affect unknown diagonalizing matrices. Since these contributions are also related to the FVs induced by SUSY particles, we can estimate the maximal effect to the diagonalizing matrices. We found that the $(1, 3)$ and $(3, 1)$ elements of diagonalizing matrices for quarks can be as large as the corresponding mixing angle of the CKM matrix. Moreover, we found that the higher SUSY scale can predict the larger mixing angles, although strong cancellation between the Higgs mass parameters is needed to realize the electroweak symmetry breaking. △ Less", "In the semi-constrained NMSSM (scNMSSM, or NMSSM with non-universal Higgs mass) under current constraints, we consider a scenario where $h_2$ is the SM-like Higgs, $\\tildeχ^0_1$ is singlino-dominated LSP, $\\tildeχ^{\\pm}_1$ and $\\tildeχ^0_{2,3}$ are mass-degenerated, light and higgsino-dominated NLSPs (next-to-lightest supersymmetric particles). We investigate the constraints to these NLSPs from searching for SUSY particles at the LHC Run-I and Run-II, discuss the possibility of discovering these NLSPs in the future, and come to the following conclusions regarding the higgsino-dominated $100\\sim200{\\rm GeV}$ NLSPs in scNMSSM: (i) Among the search results for electrowekinos, the multilepton final state constrain our scenario most, and can exclude some of our samples. While up to now, the search results by Atlas and CMS with Run I and Run II data at the LHC can still not exclude the higgsino-dominated NLSPs of $100\\sim200{\\rm GeV}$. (ii) When the mass difference with $\\tildeχ^0_{1}$ is smaller than $m_{h_2}$, $\\tildeχ^0_{2}$ and $\\tildeχ^0_{3}$ have opposite preference on decaying to $Z/Z^*$ or $h_1$. (iii) The best channels to detect the NLSPs are though the real two-body decay $\\tildeχ^{\\pm}_{1} \\to \\tildeχ^0_1 W^{\\pm}$ and $\\tildeχ^0_{2,3} \\to \\tildeχ^0_1 Z/h_2$. When the mass difference is sufficient, most of the samples can be checked at $5σ$ level with future $300{~\\rm fb}^{-1}$ data at the LHC. While with $3000 {~\\rm fb}^{-1}$ data at the High Luminosity LHC (HL-LHC), nearly all of the samples can be checked at $5σ$ level even if the mass difference is insufficient. (iv) The $a_1$ funnel and the $h_2/Z$ funnel are the two main mechanisms for the singlino-dominated LSP annihilation, which can not be distinguished by searching for NLSPs. △ Less", "The Minimal Supersymmetric Standard Model (MSSM) can be extended to include non-holomorphic trilinear soft supersymmetry (SUSY) breaking interactions that may have distinct signatures. We consider non-vanishing off-diagonal entries of the coupling matrices associated with holomorphic (of MSSM) and non-holomorphic trilinear terms corresponding to sleptons with elements $A^l_{ij}$ and $A^{\\prime l}_{ij}$. We first improve the MSSM charge breaking minima condition of the vacuum to include the off-diagonal entries $A^l_{ij}$ (with $i \\neq j$). We further extend this analysis for non-holomorphic trilinear interactions. No other sources of lepton flavor violation like that from charged slepton matrices are considered. We constrain the interaction terms via the experimental limits of processes like charged leptons decaying with lepton flavor violation (LFV) and Higgs boson decaying to charged leptons with LFV. Apart from the leptonic decays we compute all the three neutral LFV Higgs boson decays of MSSM. We find that an analysis with non-vanishing $A^\\prime_{eμ}$ involving the first two generations of sleptons receives the dominant constraint from $μ\\to e γ$. On the other hand, $A^\\prime_{eτ}$ or $A^\\prime_{μτ}$ can be constrained from the CMS 13 TeV analysis giving limits to the respective Yukawa couplings via considering SM Higgs boson decaying into $eτ$ or $μτ$ final states. Contributions from $A^l_{ij}$ is too little to have any significance compared to the large effect from $A^{\\prime l}_{ij}$. △ Less", "In this work, we explore soft leptogenesis in the NMSSM framework extended by a right-handed neutrino superfield. We calculate the CP asymmetry, $\\varepsilon$, and find it to be non-zero at tree level without using thermal effects for the final state particles. This is in contrast to soft leptogenesis in the MSSM extended by a right-handed neutrino superfield where thermal effects are essential. The difference arises due to the presence of a 3-body decay of the sneutrino in the NMSSM that violates lepton number at tree level. Apart from this, we also find that $\\varepsilon\\neq 0$ if the additional singlet scalar has a complex vacuum expectation value while all the other NMSSM parameters including the soft SUSY breaking ones relevant for CP asymmetry remain real. We estimate the order of magnitudes of these parameters to produce sufficient baryon asymmetry of the Universe. △ Less", "We discuss singularity variables which are properly suited for analyzing the kinematics of events with missing transverse energy at the LHC. We consider six of the simplest event topologies encountered in studies of leptonic W-bosons and top quarks, as well as in SUSY-like searches for new physics with dark matter particles. In each case, we illustrate the general prescription for finding the relevant singularity variable, which in turn helps delineate the visible parameter subspace on which the singularities are located. Our results can be used in two different ways - first, as a guide for targeting the signal-rich regions of parameter space during the stage of discovery, and second, as a sensitive focus point method for measuring the particle mass spectrum after the initial discovery. △ Less", "Many extensions of the Standard Model include a new $U(1)$ gauge group that is broken spontaneously at a scale much above TeV. If a $U(1)$-breaking phase transition occurs at nucleation temperature of $O(100)$-$O(1000)$~TeV, it can generate stochastic gravitational waves in $O(10)$-$O(100)$ Hz range if $β_{\\rm n}/H_{\\rm n}=1000$, which can be detected by ground-based detectors. Meanwhile, supersymmetry (SUSY) may play a crucial role in the dynamics of such high-scale $U(1)$ gauge symmetry breaking, because SUSY breaking scale is expected to be at TeV to solve the hierarchy problem. In this paper, we study the phase transition of $U(1)$ gauge symmetry breaking in a SUSY model in the SUSY limit. We consider a particular example, the minimal SUSY $U(1)_{B-L}$ model. We derive the finite temperature effective potential of the model in the SUSY limit, study a $U(1)_{B-L}$-breaking phase transition, and estimate gravitational waves generated from it. △ Less", "We study the modification to di-Higgs production via gluon fusion within the context of the Minimal Supersymmetric Standard Model(MSSM) and the Next-to-Minimal Supersymmetric Standard Model(NMSSM) in the parameter space allowed by current experimental and theoretical constraints, and also relevant to the Large Hadron Collider(LHC) experiments in the near future. The calculation is based on the analytical expression of the leading order Feynman amplitudes (which includes both quark and squark loops). We separate the di-Higgs production cross section into resonant, non-resonant, and interference parts, in order to better understand the mechanisms that are responsible for the modification to di-Higgs production rate in different regions of the allowed parameter space. We also investigate the sensitivity of High-Luminosity LHC (HL-LHC) to the di-Higgs production in these low energy supersymmetry(SUSY) models. Furthermore, we examine the complementarity between di-Higgs searches and direct searches for BSM particles and precision Higgs couplings measurements at the HL-LHC. We found that the di-Higgs production cross section can be enhanced significantly through resonant production. In the region where the resonant production cross section is small, di-Higgs receives a moderate enhancement due to the modifications in the Higgs couplings. In addition, there is a strong correlation between di-Higgs production and single Higgs production, and di-Higgs is not as sensitive as single Higgs at the HL-LHC. △ Less", "To investigate how inflation model selection is affected by the Pantheon sample of the type Ia supernovae data and the latest local measurement of Hubble constant, we constrain the primordial power spectra by using the Planck 2015 CMB temperature and polarization power spectra data, the Planck 2018 lensing power spectra data, the prior of optical depth $τ=0.054\\pm0.007$ ($1σ$), the BICEP2/Keck Array CMB B-mode data, the baryon acoustic oscillation data, the Pantheon sample of the type Ia supernovae data, and the 1.91% local measurement of the Hubble constant. We find that the addition of the new type Ia supernovae data hardly changes the value of scalar spectral index $n_{\\rm s}$, while adding the latest local $H_{0}$ measurement leads to a larger value of $n_{\\rm s}$. With the addition of the latest local measurement result of $H_{0}$, we see that the natural inflation model is totally excluded at the $2σ$ level, the Starobinsky $R^{2}$ inflation model is marginally favored at around the $2σ$ level, and the spontaneously broken SUSY inflation model is the most favored model. In addition, we find that a running of the scalar spectral index and a running of the running are favored at the $1σ$ level when both of them are considered simultaneously. △ Less", "We have discussed the stop mass and possible signal processes within a class of SUSY GUTs with non-universal gaugino masses. This class of models predicts the stop mass in a wide range from about 400 GeV to 8 TeV, and the DM constraints bound it as $m_{\\tilde{t}_{1}}\\gtrsim 500$ GeV. Being the lightest supersymmetric particle the neutralino always takes part in possible signal processes, and its mass is realized as heavy as about 2.3 TeV in the fundamental parameter space. Similarly, the lightest chargino mass can be realized beyond 3 TeV, while the DM constraints bound its mass at about 2.7 TeV from above. We find that the stop mass below about 1.2 TeV is excluded by the analyses over the $\\tilde{t}_{1}\\rightarrow t\\tildeχ_{1}^{0}$ decay mode performed under the current experimental setups. This mode can help probe the stop mass up to about 6 TeV in future collider experiments. Similar analyses yield that the stop mass will be able to be probed to about 4.8 TeV and 5 TeV, if the $\\tilde{t}_{1}\\rightarrow b W^{\\pm}\\tildeχ_{1}^{0}$ or $\\tilde{t}_{1}\\rightarrow b q\\bar{q}^{\\prime}\\tildeχ_{1}^{0}$ decay modes are allowed. We show that the former decay mode is not available for this class of SUSY GUTs in the current experiments, while it will be able to be tested in future. △ Less", "Most SUSY searches at the LHC are optimised for the MSSM, where gauginos are Majorana particles. By introducing Dirac gauginos, we obtain an enriched phenomenology, from which considerable differences in the LHC signatures and limits are expected as compared to the MSSM. Concretely, in the minimal Dirac gaugino model (MDGSSM) we have six neutralino and three chargino states. Moreover, production cross sections are enhanced for gluinos, while for squarks they are suppressed. In this contribution, we explore the consequences of the current LHC limits on gluinos and squarks in this model. △ Less", "We develop a string-inspired model for particle cosmology, based on a flipped SU(5)$\\times$U(1) gauge group formulated in a no-scale supergravity framework. The model realizes Starobinsky-like inflation, which we assume to be followed by strong reheating, with the GUT symmetry being broken subsequently by a light `flaton' field whose decay generates a second stage of reheating. We discuss the production of gravitinos and the non-thermal contribution made by their decays to the density of cold dark matter, which is assumed to be provided by the lightest neutralino. We also discuss the masses of light and heavy neutrinos and leptogenesis. As discussed previously [1], a key rôle is played by a superpotential coupling between the inflaton, matter and GUT Higgs fields, called $λ_6$. We scan over possible values of $λ_6$, exploring the correlations between the possible values of observables. We emphasize that the release of entropy during the GUT transition allows large regions of supersymmetry-breaking parameter space that would otherwise lead to severe overdensity of dark matter. Furthermore, we find that the Big Bang nucleosynthesis lower limit on the reheating temperature of $\\sim 1$ MeV restricts the supersymmetry-breaking scale to a range ${\\cal O}(10)$ TeV that is consistent with the absence of supersymmetric particles at the LHC. △ Less", "We propose a simple grand unified theory (GUT) scenario in which supersymmetry (SUSY) is spontaneously broken in visible sector. Our model is based on the GUT model that has been proposed to solve almost all problems in conventional GUT scenarios. In the previous work, the problems can be solved by a natural assumption in a supersymmetric vacuum. In this paper, we consider an extension of the model (i.e. omitting one singlet field) and break SUSY spontaneously without new sector. Our model does not have hidden sector and predicts high-scale SUSY where sfermion masses are of order 100-1000 TeV and flavor violating processes are suppressed. In this scenario, we can see an explicit signature of GUT in sfermion mass spectrum since the sfermion mass spectrum respects SU(5) matter unification. In addition, we find a superheavy long lived charged lepton as a proof of our scenario, and it may be seen in the LHC. △ Less", "We study the prospects of detecting and characterising Dark Matter at colliders using Machine Learning (ML) techniques. We focus on the monojet and missing transverse energy (MET) channel and propose a set of benchmark models for the study: a typical WIMP Dark Matter candidate in the form of a SUSY neutralino, a pseudo-Goldstone impostor in the shape of an Axion-Like Particle, and a light Dark Matter impostor whose interactions are mediated by a heavy particle. All these benchmarks are tensioned against the main SM background ($Z$+jets) and against each other. Our analysis uses both the leading-order kinematic features as well as the information in additional hard jets. We use different representations of the data, from a simple event data sample with values of kinematic variables fed into a Logistic Regression algorithm or a Neural Network, to a transformation of the data into images related to probability distributions, fed to Deep and Convolutional Neural Networks. We also study the robustness of our method against including detector effects, dropping kinematic variables, or changing the number of events per image. In the case of signals with more combinatorial possibilities (events with more than one hard jet), the most crucial data features are selected by performing a Principal Component Analysis. We compare the performance of all these methods, and found that using the 2D images improves the performance significantly. We noticed that even when one considers only a few events per image, the classification accuracy is higher than using the NNs on the data in the form of event arrays. △ Less", "We study $3$rd family Yukawa unification in the context of supersymmetric (SUSY) $\\mathrm{SO}(10)$ GUTs and $\\mathrm{SO}(10)$-motivated boundary conditions for the SUSY-breaking soft terms. We consider $μ<0$ such that the SUSY loop-threshold effects enable a good fit to all third family masses of the charged Standard Model (SM) fermions. We find that fitting the third family masses together with the mass of the SM-like Higgs particle, the scenario predicts the masses of the superpartner particles and of the extra Higgs states of the MSSM: while the sparticles are predicted to be comparatively heavy (above the present LHC bound but within reach of future colliders), the spectrum has the characteristic feature that the lightest new particles are the extra MSSM Higgses. We show that this effect is rather robust with respect to many deformations of the GUT boundary conditions, but turns out to be sensitive to the exactness of top-bottom Yukawa unification. Nevertheless, with moderate deviations of a few percent from exact top-bottom Yukawa unification (stemming e.g.\\ from GUT-threshold corrections or higher-dimensional operators), the scenario still predicts extra MSSM Higgs particles with masses not much above $1.5\\,\\mathrm{TeV}$, which could be tested e.g.\\ by future LHC searches for ditau decays $H^0/A^{0}\\toττ$. Finding the extra MSSM Higges before the other new MSSM particles could thus be a smoking gun for a Yukawa unified $\\mathrm{SO}(10)$ GUT. △ Less", "We present a calculation of the light neutral CP-even Higgs boson pole mass in the real MSSM which combines state-of-the-art EFT and fixed-order results, including the three-loop fixed-order QCD corrections as well as the resummation of logarithmic terms in the ratio of the weak to the SUSY scale up to fourth logarithmic order. This hybrid calculation should be valid for arbitrary SUSY scales above the weak scale. Comparison to the pure fixed-order and EFT results provides an estimate of their individual validity range. △ Less", "In a fertile patch of the string landscape which includes the Minimal Supersymmetric Standard Model (MSSM) as the low energy effective theory, rather general arguments from Douglas suggest a power-law statistical selection of soft breaking terms (m(soft)^n where n=2n_F+n_D-1 with n_F the number of hidden sector F-SUSY breaking fields and n_D the number of D-term SUSY breaking fields). The statistical draw towards large soft terms must be tempered by requiring an appropriate breakdown of electroweak (EW) symmetry with no contributions to the weak scale larger than a factor 2-5 of its measured value, lest one violates the (anthropic) atomic principle. Such a simple picture of stringy naturalness generates a light Higgs boson with mass m_h~ 125 GeV with sparticles (other than higgsinos) typically beyond LHC reach. Then we expect first and second generation matter scalars to be drawn independently to the tens of TeV regime where the upper cutoff arises from two-loop RGE terms which drive third generation soft masses towards tachyonic values. Since the upper bounds on m_0(1,2) are the same for each generation, and flavor independent, then these will be drawn toward quasi-degenerate values. This mechanism leads to a natural mixed decoupling/quasi-degeneracy solution to the SUSY flavor problem and a decoupling solution to the SUSY CP problem. △ Less", "We study natural supersymmetric scenarios with light right-handed neutrino superfields, and consider the possibility of having either a neutrino or a sneutrino as a dark matter candidate. For the former, we evaluate the possibility of having SUSY corrections on the $ν_4\\toν_\\ellγ$ decay rate, such that the NuStar bounds are relaxed. We find that corrections are too small. For sneutrino dark matter, we consider thermal and non-thermal production, taking into account freeze-out, freeze-in and super-WIMP mechanisms. For the non-thermal case, we find that the $\\tildeν_R$ can reproduce the observed relic density by adjusting the R-sneutrino mass and Yukawa couplings. For the thermal case, we find the need to extend the model in order to enhance sneutrino annihilations, which we exemplify in a model with an extended gauge symmetry. △ Less", "We investigate stau-antistau annihilation into heavy quarks in the phenomenological Minimal Supersymmetric Standard Model within the DM@NLO project. We present the calculation of the corresponding cross section including corrections up to $\\mathcal{O}(α_s)$ and QED Sommerfeld enhancement. The numerical impact of these corrections is discussed for the cross section and the dark matter relic density, where we focus on top-quark final states and consider either neutralino or gravitino dark matter. Similarly to previous work, we find that the presented corrections should be included when calculating the relic density or extracting parameters from cosmological observations. Considering scheme and scale variations, we estimate the theoretical uncertainty that affects the prediction of the annihilation cross section and thus the prediction of the relic density. △ Less", "Given that the LHC experiment has produced strong constraints on the colored supersymmetric particles (sparticles), testing the electroweak supersymmetry (EWSUSY) will be the next crucial task at the LHC. On the other hand, the light electroweakinos and sleptons in the EWSUSY can also contribute to the dark matter (DM) and low energy lepton observables. The precision measurements of them will provide the indirect evidence of SUSY. In this work, we confront the EWSUSY with the muon $g-2$ anomaly, the DM relic density, the direct detection limits and the latest LHC Run-2 data. We find that the sneutrino DM or the neutralino DM with sizable higgsino component has been excluded by the direct detections. Then two viable scenarios are pinned down: one has the light compressed bino and sleptons but heavy higgsinos, and the other has the light compressed bino, winos and sleptons. In the former case, the LSP and slepton masses have to be smaller than about 350 GeV. While in the latter case, the LSP and slepton masses have to be smaller than about 700 GeV and 800 GeV, respectively. From investigating the observability of these sparticles in both scenarios at future colliders, it turns out that the HE-LHC with a luminosity of 15 ab$^{-1}$ can exclude the whole BHL and most part of BWL scenarios at $2σ$ level. The precision measurement of the Higgs couplings at the lepton colliders could play a complementary role of probing the BWL scenario. △ Less", "Hydrodynamics is now understood as an effective field theory that describes the dynamics of the long-wavelength and slow-time fluctuations of an underlying microscopic theory. In this work we extend the relativistic hydrodynamics to third order in the gradient expansion for neutral fluids in a general curved spacetime of $d$ dimensions. We find 59 new transport coefficients, 20 due to third-order scalar corrections and 39 due to tensorial corrections. In the particular case of a conformal fluid, the number of new transport coefficients is reduced to 19, all of them due to third-order tensorial corrections. The dispersion relations of linear fluctuations in the third-order relativistic hydrodynamics is obtained, both in the rest frame of the fluid and in a general moving frame. As an application we obtain the transport coefficients of a relativistic conformal fluid in three-dimensions by using the AdS/CFT correspondence. The gravity dual of the fluctuations in this conformal fluid is described by the gravitational perturbations of four-dimensional anti-de Sitter black branes, which are solutions of the Einstein equations with a negative cosmological constant. To find the hydrodynamic quasinormal modes (QNMs) of the scalar sector we use the SUSY quantum mechanics of the gravitational perturbations of four-dimensional black branes. Such a symmetry allows us to find the hydrodynamic limit of the scalar-sector wave function from the known solution of the vector sector, which is in general easier to be found directly from the (vector) perturbation equations. △ Less", "Top-squarks (stop) play an important role in SUSY naturalness. The stop pair production is considered as the most effective way to search for stop at the LHC. However, the collider signature of stop pair production is usually characterized by $t\\bar{t}$ plus missing transverse energy, which is also predicted in many other non-supersymmetric models. On the other hand, the single stop production via the electroweak interaction can provide some distinctive signatures, and thus will help to confirm the existence of the stop. In this paper, we investigate the observability of the mono-$b$ events from the single stop production process $pp \\to \\tilde t_1 \\tildeχ^-_1 \\to b+ E\\!\\!\\!\\!/_T$ in a simplified MSSM framework where the higgsinos and stops are the only sparticles at the HL-LHC and HE-LHC. We find that the stop mass and the higgsino mass can be probed up to about 1600 GeV and 550 GeV at $5σ$ level at the HE-LHC with the integrated luminosity ${\\cal L} = 15~\\text{ab}^{-1}$. We also present the $2σ$ exclusion limits of the stop mass at the HL-LHC and HE-LHC. △ Less", "In N=1 supergravity the scalar potential may have supersymmetric (SUSY) and non-supersymmetric Minkowski vacua (associated with supersymmetric and physical phases) with vanishing energy density. In the supersymmetric Minkowski (second) phase some breakdown of SUSY may be induced by non-perturbative effects in the observable sector that give rise to a tiny positive vacuum energy density. Postulating the exact degeneracy of the physical and second vacua as well as assuming that at high energies the couplings in both phases are almost identical, one can estimate the dark energy density in these vacua. It is mostly determined by the SUSY breaking scale M_S in the physical phase. Exploring the two-loop renormalization group (RG) flow of couplings in these vacua we find that the measured value of the cosmological constant can be reproduced if M_S varies from 20 TeV to 400 TeV. We also argue that this prediction for the SUSY breaking scale is consistent with the upper bound on M_S in the higgsino dark matter scenario. △ Less", "We calculate the Higgs-boson mass spectrum and the corresponding mixing of the Higgs states in the Minimal Supersymmetric Standard Model (MSSM). We assume a mass-hierarchy with heavy SUSY particles and light Higgs bosons. To investigate this scenario, we employ an effective-field-theory approach with a low-energy Two-Higgs-Doublet Model (2HDM) where both Higgs doublets couple to up- as well as down-type fermions. We perform a one-loop matching of the MSSM to the 2HDM and evolve the parameters to the low energy scale by exploiting two-loop renormalization group equations, taking the complex parameters into account. For the calculation of the pole mass, we compare three different options, one suitable for large charged Higgs masses, one for low charged Higgs masses, and one approximation that interpolates between the two first ones. The phase dependence of the mass of the lightest neutral Higgs boson can be sizeable, i.e. at the order of a couple of GeV, depending on the scenario. In addition, we discuss the CP composition of the neutral Higgs bosons. △ Less", "A notable feature of the two standard models for thermonuclear and core-collapse supernovae is that, although these two models are fundamentally different, the respective supernova types have quite similar rates and appearances. For instance, both types occur one to several times per century per typical galaxy and both types seed the universe with the heavy elements essential to life. In spite of this, neither standard model provides a reasonably problem-free description of its target phenomenon. A major obstacle to providing a unified picture of supernovae would seem to be the fact that type Ia supernovae occur typically with gigayear delay times after the cessation of carbon fusion while the core-collapse explosions occur only days after such fusion cessation. In this article we study the possibility of extending the successful supersymmetric model for type Ia supernovae to core-collapse events. The question is whether and under what assumptions a phase transition to an exact supersymmetric background can efficiently explain both type Ia and core collapse supernovae. △ Less", "The heavy right-handed neutrinos in supersymmetric models can act as the source of lepton flavor violation (LFV). LFV processes like $ μ\\rightarrow e γ$, $ τ\\rightarrow μγ$, $ τ\\rightarrow e γ$ is an effective way to explore new physics beyond the SM. Among the possible processes, $ μ$ decays have the greatest discovery potential in most of the supersymmetric models. Experimental inference of lepton flavor-violating processes within a supersymmetric type-II seesaw framework in the non-universal Higgs model (NUHM) and non-universal Scalar Mass model for Yukawa mixing scenarios in the $ S_{4} $ theory with an additional discrete symmetry is presented. The numerical analysis includes full 2 loop renormalization group running effects for the the above mentioned Yukawa coupling matrices. The projected discovery reach of LFV experiments (MEG-II) is mentioned and those regions in mSUGRA, NUHM, NUSM models that have already been excluded by the LHC searches or that which is probed by MEG experiments is specified here. The results presented in this work can influence experimental challenges and physics motivations to construct various BSM theories and sensitivity to test these theories at next run of HE/HL LHC is also considered. △ Less", "The Next-to Minimal Supersymmetric Standard Model (NMSSM) with a Type-I seesaw mechanism extends the NMSSM by three generations of right-handed neutrino fields to generate neutrino mass. As a byproduct it renders the lightest sneutrino as a viable DM candidate. Due to the gauge singlet nature of the DM, its scattering with nucleon is suppressed in most cases to coincide spontaneously with the latest XENON-1T results. Consequently, broad parameter spaces in the Higgs sector, especially a light Higgsino mass, are resurrected as experimentally allowed, which makes the theory well suited to explain the long standing $b \\bar{b}$ excess at LEP-II and the continuously observed $γγ$ excess by CMS collaboration. We show by both analytic formulas and numerical results that the theory can naturally predict the central values of the excesses in its broad parameter space, and the explanations are consistent with the Higgs data of the discovered Higgs boson, $B-$physics and DM physics measurements, the electroweak precision data as well as the LHC search for sparticles. Part of the explanations may be tested by future DM experiments and the SUSY search at the LHC. △ Less", "We improve the determination of the Higgs-boson mass in the MSSM with heavy superpartners, by computing the two-loop threshold corrections to the quartic Higgs coupling that involve both the strong and the electroweak gauge couplings. Combined with earlier results, this completes the calculation of the two-loop QCD corrections to the quartic coupling at the SUSY scale. We also compare different computations of the relation between the quartic coupling and the pole mass of the Higgs boson at the EW scale. We find that the numerical impact of the new corrections on the prediction for the Higgs mass is modest, but comparable to the accuracy of the Higgs-mass measurement at the LHC. △ Less", "The lightest Higgs boson mass of the Minimal Supersymmetric Standard Model has been recently computed diagrammatically at the three-loop order in the whole supersymmetric parameters space of the SUSY-QCD sector. The code FeynHiggs combines one- and two-loop fixed-order with the effective-field-theory calculations for the same Higgs mass. The two numerical predictions agree considering the scenario of only one SUSY-scale and vanishing stop mixing parameter below 10 TeV. The agreement is improved by introducing an additional supersymmetric scale and a non-zero stop mixing. Additionally, the combined CMS/ATLAS Higgs mass value was used to derive an upper bound on the needed SUSY scale. In the considered scenario, values above the scale $12.5\\pm1.2~\\rm{TeV}$ are excluded. △ Less", "Since no direct signs of new physics have been observed so far indirect searches in the Higgs sector have become increasingly important. With the discovered Higgs boson behaving very Standard Model (SM)-like, however, indirect new physics manifestations are in general expected to be small. On the theory side, this makes precision predictions for the Higgs parameters and observables indispensable. In this paper, we provide in the framework of the CP-violating Next-to-Minimal Supersymmetric extension of the SM (NMSSM) the complete next-to-leading order (SUSY-)electroweak corrections to the neutralHiggs boson decays that are on-shell and non-loop induced. Together with the also provided SUSY-QCD corrections to colored final states, they are implemented in the Fortran code NMSSMCALC which already includes the state-of-the art QCD corrections. The new code is called NMSSMCALCEW. This way we provide the NMSSM Higgs boson decays and branching ratios at presently highest possible precision and thereby contribute to the endeavor of searching for New Physics at present and future colliders. △ Less", "R-symmetry leads to a distinct low energy realisation of SUSY with a significantly modified colour-charged sector featuring a Dirac gluino and scalar colour octets (sgluons). In the present work we recast results from LHC BSM searches to discuss the impact of R-symmetry on the squark and gluino mass limits. We work in the framework of the Minimal R-symmetric Supersymmetric Standard Model and take into account the NLO corrections to the squark production cross sections in the MRSSM that have become available recently. We find substantially weaker limits on squark masses compared to the MSSM: for simple scenarios with heavy gluinos and degenerate squarks, the MRSSM mass limit is $m_{\\tilde q} > 1.7$ TeV, approximately 600 GeV lower than in the MSSM. △ Less", "We propose a model with $A_4$ flavor symmetry for leptons and quarks in the framework of supersymmetric SU(5) grand unified theory (GUT). The running masses of quarks and charged leptons at GUT scale ($\\sim 10^{16}$ GeV) are realized by the adjoint 24-dimensional Higgs multiplet and additional gauge singlet scalar fields including flavons. In this paper, we focus on a result of the quark and charged lepton masses and quark mixing since our present model is known to reproduce recent experimental results of the neutrino mass and oscillation. Those results are showed numerically. △ Less", "We investigate the physical origins of multiple solutions to boundary value problems in the fully constrained MSSM and NMSSM. We derive mathematical criteria that formulate circumstances under which multiple solutions can appear. Finally, we study the validity of the exclusion of the CMSSM in the presence of multiple solutions. △ Less", "We study the phenomenological consequences of the supersymmetric (SUSY) $E_7/SU(5)\\times U(1)^3$ non-linear sigma model coupled to supergravity, where the three generations of quark and lepton chiral multiplets appear as (pseudo) Nambu Goldstone (NG) multiplets, that is, the origin of the three families is explained. To break SUSY, we introduce a SUSY breaking field charged under some symmetry avoiding the Polonyi problem. The gaugino mass spectrum is almost uniquely determined when one requires the electroweak vacuum to be (meta)stable: it would be a miracle that the mass difference between the bino and wino turns out to be within $O(1)\\%$ at the low energy. Thus, a bino-wino coannihilation is naturally predicted, which can explain the correct relic abundance of dark matter. Moreover, we find that the bottom-tau Yukawa couplings and the gauge couplings are unified up to $O(1)\\%$ in most of the viable region. This scenario can be fully tested at the LHC and future collider experiments since the gauginos and some of the pseudo-NG bosons are light. An axion-like multiplet, which can be identified with the QCD axion, is also predicted. △ Less", "Right-handed neutrinos in supersymmetric models can act as the source of lepton flavor violation (LFV). We present experimental implications of lepton flavor-violating processes within a supersymmetric type-I seesaw framework in the three-extra-parameter non-universal Higgs model (NUHM3) for large (PMNS-like) and small (CKM-like) Yukawa mixing scenarios. We highlight LFV predictions for the natural (low $Δ_{\\rm EW}$) portion of parameter space. Our numerical analysis includes full 2-loop renormalization group running effects for the three neutrino masses and mass matrices. We show the projected discovery reach of various LFV experiments ($\\textit{i.e.}$ Mu2e, Mu3e, MEG-II, Belle-II), and specify regions that have already been excluded by the LHC searches. Our results depend strongly on whether one has a normal sneutrino hierarchy (NSH) or an inverted sneutrino hierarchy (ISH). Natural SUSY with a NSH is already excluded by MEG-2013 results while large portions of ISH have been or will soon be tested. However, LFV processes from natural SUSY with small Yukawa mixing and an ISH seem below any projected sensitivities. A substantial amount of the remaining parameter space of models with large PMNS-like sneutrino mixing will be probed by Mu2e and MEG-II experiments whereas small, CKM-like Yukawa mixing predicts LFV decays which can hide from LFV experiments. △ Less", "We study the imprint of higher spin supermultiplets on cosmological correlators, namely the non-Gaussianity of the cosmic microwave background. Supersymmetry is used as a guide to introduce the contribution of fermionic higher spin particles, which have been neglected thus far in the literature. This necessarily introduces more than just a single additional fermionic superpartner, since the spectrum of massive, higher spin supermultiplets includes two propagating higher spin bosons and two propagating higher spin fermions, which all contribute to the three point function. As an example we consider the half-integer superspin $\\textsf{Y}=s+1/2$ supermultiplet, which includes particles of spin values $j=s+1,~j=s+1/2,~j=s+1/2$ and $j=s$. We compute the curvature perturbation 3-point function for higher spin particle exchange and find that the known $P_{s}(\\cos θ)$ angular dependence is accompanied by superpartner contributions that scale as $P_{s+1}(\\cos θ)$ and $\\sum_{m}P^{m}_{s} (\\cos θ)$, with $P_{s}$ and $P_{s} ^m$ defined as the Legendre and Associated Legendre polynomials respectively. We also compute the tensor-scalar-scalar 3-point function, and find a complicated angular dependence as an integral over products of Legendre and associated Legendre polynomials. △ Less", "We consider a low-energy effective theory of the next-to-minimal supersymmetric Standard Model by decoupling all scalar states except one Higgs doublet and the complex gauge singlet. The mass spectrum of the resulting singlet-extended Standard Model is calculated from two different perspectives: 1) using a matching of the scalar sectors at next-to-leading order; 2) using the simplified-model approach of calculating the masses in the effective theory at fixed order at the weak scale ignoring any connection to the full theory. Significant deviations between the two methods are found not only in the scalar sector, but also properties of the additional fermions can be very different. Thus, only a small part of the parameter space of the simplified model can be embedded in a well motivated SUSY framework. △ Less", "We propose a SUSY scenario to explain the current electron and muon $g-2$ discrepancies without introducing lepton flavor mixings. Threshold corrections to the Yukawa couplings can enhance the electron $g-2$ and flip the sign of the SUSY contributions. The mechanism predicts a flavor-dependent slepton mass spectrum. We show that it is compatible with the Higgs mediation scenario. △ Less", "The notion of stringy naturalness-- that an observable O_2 is more natural than O_1 if more (phenomenologically acceptable) vacua solutions lead to O_2 rather than O_1-- is examined within the context of the Standard Model (SM) and various SUSY extensions: CMSSM/mSUGRA, high-scale SUSY and radiatively-driven natural SUSY (RNS). Rather general arguments from string theory suggest a (possibly mild) statistical draw towards vacua with large soft SUSY breaking terms. These vacua must be tempered by an anthropic veto of non-standard vacua or vacua with too large a value of the weak scale m(weak). We argue that the SM, the CMSSM and the various high-scale SUSY models are all expected to be relatively rare occurances within the string theory landscape of vacua. In contrast, models with TeV-scale soft terms but with m(weak)~100 GeV and consequent light higgsinos (SUSY with radiatively-driven naturalness) should be much more common on the landscape. These latter models have a statistical preference for m_h~ 125 GeV and strongly interacting sparticles beyond current LHC reach. Thus, while conventional naturalness favors sparticles close to the weak scale, stringy naturalness favors sparticles so heavy that electroweak symmetry is barely broken and one is living dangerously close to vacua with charge-or-color breaking minima, no electroweak breaking or pocket universe weak scale values too far from our measured value. Expectations for how landscape SUSY would manifest itself at collider and dark matter search experiments are then modified compared to usual notions. △ Less", "We study the impact of R-parity violating Supersymmetry (RPV SUSY) on the 125 GeV Higgs production and decay modes at the LHC. We assume a heavy SUSY spectrum with multi-TeV squarks and SU(2) scalar singlets as well as the decoupling limit in the SUSY Higgs sector. In this case the lightest CP-even Higgs is SM-like when R-parity is conserved. In contrast, we show that when R-parity violating interactions are added to the SUSY framework, significant deviations may occur in some production and decay channels of the 125 GeV Higgs-like state. Indeed, we assume a single-flavor (mostly third generation) Bilinear RPV (BRPV) interactions, which generate Higgs-sneutrino mixing, lepton-chargino mixing and neutrino-neutralino mixing, and find that notable deviations of ${\\cal O}(20-30\\%)$ may be expected in the Higgs signal strength observables in some channels, e.g., in $p p \\to h \\to μ^+ μ^-, τ^+ τ^-$. Moreover, we find that new and detectable signals associated with BRPV Higgs decays to gauginos, $h\\rightarrowν_τ\\tildeχ_{2}^{0}$ and $h\\rightarrowτ^{\\pm}χ_{2}^{\\mp}$, may also arise in this scenario. These decays yield a typical signature of $h \\to τ^\\pm \\ell^\\mp + {\\not\\!\\! E_T}$ ($\\ell =e,μ,τ$) that can be much larger than in the SM, and may also be accompanied by an ${\\cal O}(20-30\\%)$ enhancement in the di-photon signal $pp \\to h \\to γγ$. We also examine potential interesting signals of Trilinear R-parity violation (TRPV) interactions in the production and decays of the Higgs-sneutrino BRPV mixed state (assuming it is the 125 GeV scalar) and show that, in this case also, large deviations up to ${\\cal O}(100\\%)$ are expected in e.g., $p p \\to h \\to μ^+ μ^-, τ^+ τ^-$, which are sensitive to the BRPV$\\times$TRPV coupling product. △ Less", "We review the prospects of probing $R$-parity violating Supersymmetry (RPV SUSY) at neutrino telescopes using some of the highest energy particles given to us by Nature. The presence of RPV interactions involving ultra-high energy neutrinos with Earth-matter can lead to resonant production of TeV-scale SUSY partners of the SM quarks and leptons (squarks and sleptons), thereby giving rise to potentially anomalous behavior in the event spectrum observed by large-volume neutrino detectors, such as IceCube, as well as balloon-borne cosmic ray experiments, such as ANITA. Using the ultra-high energy neutrino events observed recently at IceCube, with the fact that for a given power-law flux of astrophysical neutrinos, there is no statistically significant deviation in the current data from the Standard Model expectations, we derive robust upper limits on the RPV couplings as a function of the resonantly-produced squark mass, independent of the other unknown model parameters, as long as the squarks decay dominantly to two-body final states involving leptons and quarks through the RPV couplings. Also, we discuss RPV SUSY interpretations of the recent anomalous, upward-going EeV air showers observed at ANITA, in terms of long-lived charged or neutral next-to-lightest SUSY particles. △ Less", "We discuss a new realization of $\\mathcal{N}$-extended quantum-mechanical supersymmetry (QM SUSY) with central charges hidden in the four-dimensional (4D) mass spectrum of higher dimensional Dirac action with curved extra dimensions. We show that this $\\mathcal{N}$-extended QM SUSY results from symmetries in extra dimensions, and the supermultiplets in this supersymmetry algebra correspond to the Bogomol'nyi--Prasad--Sommerfield states. Furthermore, we examine the model of the $S^2$ extra dimension with a magnetic monopole background and confirm that the $\\mathcal{N}$-extended QM SUSY explains the degeneracy of the 4D mass spectrum. △ Less", "In the past few years, several hints of lepton flavour universality (LFU) violation have emerged in the $b \\to c τ\\barν$ and $b \\to s \\ell^+ \\ell^-$ data. Quite recently, the Belle Collaboration has reported the first measurement of the $D^*$ longitudinal polarization fraction in the $B \\to D^* τ\\barν$ decay. Motivated by this intriguing result, together with the recent measurements of $R_{J/ψ}$ and $τ$ polarization, we study $b \\to c τ\\barν$ decays in the Supersymmetry (SUSY) with $R$-parity violation (RPV). We consider $B \\to D^{(*)} τ\\barν$, $B_c \\to η_c τ\\barν$, $B_c \\to J/ψτ\\barν$ and $Λ_b \\to Λ_c τ\\barν$ modes and focus on the branching ratios, the LFU ratios, the forward-backward asymmetries, polarizations of daughter hadrons and $τ$ lepton. It is found that the RPV SUSY can explain the $R_{D^{(*)}}$ anomalies at $2σ$ level, after taking into account various flavour constraints. In the allowed parameter space, the differential branching fractions and LFU ratios are largely enhanced by the SUSY effects, especially in the large dilepton invariant mass region. In addition, a lower bound $\\mathcal B(B^+ \\to K^+ ν\\barν) > 7.37 \\times 10^{-6}$ is obtained. These observables could provide testable signatures at the High-Luminosity LHC and SuperKEKB, and correlate with direct searches for SUSY. △ Less", "We investigate the discovery potential of a Stealth SUSY scenario involving squark decays by reconstructing the lightest neutralino decay products using a large-radius jet containing a high transverse momentum photon. Requirements on the event topology, such as photon and large-radius jet multiplicity result in less background than signal. We also estimated the sensitivity of our analysis and found that it has a better exclusion potential compared to the strongest existing search for the specific benchmark points considered here. △ Less", "We study CP-conserving non-minimal flavour violation in $A_4 \\times SU(5)$ inspired Supersymmetric Grand Unified Theories (GUTs), focussing on the regions of parameter space where dark matter is successfully accommodated due to a light right-handed smuon a few GeV heavier than the lightest neutralino. We find that it is necessary to scan over all NMFV parameters simultaneously in order to properly constrain the space of the model. △ Less", "Different approaches are used for the calculation of the SM-like Higgs boson mass in the MSSM: the fixed-order diagrammatic approach is accurate for low SUSY scales; the EFT approach,for high SUSY scales. Hybrid approaches, combining fixed-order and EFT calculations, allow to obtain a precise prediction also for intermediary SUSY scales. Here, we briefly discuss the hybrid approach implemented into the code FeynHiggs. In addition, we show how the refined Higgs mass prediction was used to define new MSSM Higgs benchmark scenarios. △ Less", "Rather general considerations of the string theory landscape imply a mild statistical draw towards large soft SUSY breaking terms tempered by the requirement of proper electroweak symmetry breaking where SUSY contributions to the weak scale are not too far from m(weak)~ 100 GeV. Such a picture leads to the prediction that m_h~ 125 GeV while most sparticles are beyond current LHC reach. Here we explore the possibility that the magnitude of the Peccei-Quinn (PQ) scale f_a is also set by string landscape considerations within the framework of a compelling SUSY axion model. First, we examine the case where the PQ symmetry arises as an accidental approximate global symmetry from a more fundamental gravity-safe Z(24)^R symmetry and where the SUSY mu parameter arises from a Kim-Nilles operator. The pull towards large soft terms then also pulls the PQ scale as large as possible. Unless this is tempered by rather severe (unknown) cosmological or anthropic bounds on the density of dark matter, then we would expect a far greater abundance of dark matter than is observed. This conclusion cannot be negated by adopting a tiny axion misalignment angle theta_i because WIMPs are also overproduced at large f_a. Hence, we conclude that setting the PQ scale via anthropics is highly unlikely. Instead, requiring soft SUSY breaking terms of order the gravity-mediation scale m_{3/2}~ 10-100 TeV places the mixed axion-neutralino dark matter abundance into the intermediate scale sweet zone where f_a~ 10^{11}-10^{12} GeV. We compare our analysis to the more general case of a generic SUSY DFSZ axion model with uniform selection on theta_i but leading to the measured dark matter abundance: this approach leads to a preference for f_a~ 10^{12} GeV. △ Less", "The implications of the latest measurement of the branching fraction of B($ b\\rightarrow s γ$) of b hadrons, which is another signature of New Physics beyond Standard Model is presented here. The quark transitions $ b \\rightarrow s $, $ b \\rightarrow d $ do not happen at tree level in the Standard Model as the Z boson does not couple to quarks of different flavour. In this work the present bounds on the quark transition $ b \\rightarrow s $ within the constrained minimal supersymmetric extension of the Standard Model (CMSSM), in which there are three independent soft SUSY breaking parameters $ m_{0} $, $ m_{1/2} $ and $ A_{0} $ is illustrated. The recent constraint on B($ b\\rightarrow s γ$), B($ b_{s}\\rightarrow μ^{+}μ^{-}$), the recently measured value of Higgs mass at LHC, $ M_{h} $, the value of $θ_{13}$ from reactor data and the Higgs branching ratios set very strong constraints on New Physics models, in particular supersymmetry. A new epoch for this research has begun since the Large Hadron Collider beauty (LHCb) experiment started affording data for various observables for these decays. The results presented here in mSUGRA/CMSSM models may gain access to supersymmetry even at scales beyond the direct reach of the LHC and the susceptibleness to test these theories at the next run of LHC is also explored. △ Less", "In the minimal SUSY SU(5) GUT with $O(1)$ TeV SUSY particles and $O(1)$ or below self-coupling for the GUT-breaking Higgs field, the width of the dimension-6 proton decay is suppressed below the reach of Hyper-Kamiokande. In this paper, we point out that a SUSY SO(10) GUT which adopts only ${\\bf 45}_{\\rm H}+{\\bf 16}_{\\rm H}+{\\bf \\overline{16}}_{\\rm H}$ GUT-breaking Higgs fields leads to an enhanced dimension-6 proton decay width detectable at Hyper-Kamiokande. The enhancement is because the SU(5)-breaking VEV of ${\\bf 45}_{\\rm H}$ arises due to Planck-suppressed terms, $W\\propto ({\\bf 45}_{\\rm H}^2)^2/M_*+{\\bf 45}_{\\rm H}^4/M_*$, and is therefore substantially larger than the other VEVs that conserve SU(5). As a result, the $({\\bf 3},{\\bf 2},1/6)$ GUT gauge boson mass is about $1/5$ smaller than the $({\\bf 3},{\\bf 2},-5/6)$ GUT gauge boson mass and can induce a fast dimension-6 proton decay. Through a numerical analysis on threshold corrections of the GUT gauge bosons and the physical components of the GUT-breaking Higgs fields, we confirm that the dimension-6 proton decay can be within the reach of Hyper-Kamiokande. △ Less", "Supersymmetric (SUSY) models and dynamical breaking of symmetries have been used to explain hierarchies of mass scales. We find that a chiral representation, $\\overline{\\bf 10}\\, \\oplus\\, \\overline{\\bf 5}\\, \\oplus\\, 2\\cdot{\\bf 5}$ in SUSY SU(5) in the hidden sector, breaks global SUSY dynamically, by producing a composite field $φ$ below the SU(5) confinement scale. This dynamincal SUSY breaking can have two important applications, one in particle physics and the other in cosmology. Gavitational effects transmit this dynamical breaking to the standard model(SM) superpartners and the quintessential vacuum energy. The SM superpartners feel the effects just by the magnitude of the gravitino mass while the smallness of the quintessential vacuum energy is due to the composite nature of a singlet field $φ$. The composite $φ$ carries a global charge which is hardly broken in SUSY and hence its phase can be used toward a quintessential axion for dark energy of the Universe. △ Less", "The Split-Family supersymmetry is a model in which the sfermion masses of the first two generations are in $\\mathcal{O}(100\\text{-}1000)$ GeV while that of the third one is in $\\mathcal{O}(10)$TeV. With such a hierarchical spectrum, the deviation of the muon $g-2$ and the observed Higgs boson mass are explained simultaneously. In this paper, we revisit the Split-Family SUSY model in light of the updated LHC constraints. We also study the flavor changing neutral current problems in the model. As we will show, the problems do not lead to stringent constraints when the Cabibbo-Kobayashi-Maskawa matrix is the only source of the flavor mixing. We also study how large flavor mixing in the supersymmetry breaking parameters is allowed. △ Less", "We present a preliminary study on the possibility to search for massive long-lived electrically charged particles at the MoEDAL detector. MoEDAL is sensitive to highly ionising objects such as magnetic monopoles or massive (meta-)stable electrically charged particles and we focus on the latter in this paper. Requirements on triggering or reducing the cosmic-ray and cavern background, applied in the ATLAS and CMS analyses for long-lived particles, are not necessary at MoEDAL, due to its completely different detector design and extremely low background. On the other hand, MoEDAL requires slow-moving particles, resulting in sensitivity to massive states with typically small production cross sections. Using Monte Carlo simulations, we compare the sensitivities of MoEDAL versus ATLAS/CMS for various long-lived particles in supersymmetric models, and we seek a scenario where MoEDAL can provide discovery reach complementary to ATLAS and CMS. △ Less", "We study a version of Starobinsky-like inflation in no-scale supergravity (SUGRA) where a Polonyi term in the hidden sector breaks supersymmetry (SUSY) after inflation, providing a link between the gravitino mass and inflation. We extend the theory to the visible sector and calculate the soft-SUSY breaking parameters depending on the modular weights in the superpotential and choice of K\u007fähler potential. We are led to either no-scale SUGRA or pure gravity mediated SUSY breaking patterns, but with inflationary constraints on the Polonyi term setting a strict upper bound on the gravitino mass $m_{3/2} < 10^3$ TeV. Since gaugino masses are significantly lighter than $m_{3/2}$, this suggests that SUSY may be discovered at the LHC or FCC. △ Less", "We propose a minimal Yukawa deflection scenario of AMSB from the Kahler potential through the Higgs-messenger mixing. Salient features of this scenario are discussed and realistic MSSM spectrum can be obtained. Such a scenario, which are very predictive, can solve the tachyonic slepton problem with less messenger species. Numerical results indicate that the LOSPs predicted by this scenario can not be good DM candidates. So it is desirable to extend this scenario with a Peccei-Quinn sector to solve the strong CP problem and at the same time provide new DM candidates. We propose a way to obtain a light axino mass in SUSY KSVZ axion model with Yukawa deflected anomaly mediation SUSY breaking mechanism. The axino can possibly be the LSP and act as a good DM candidate. △ Less", "The purpose of this review is to investigate what kind of physics can be extracted at the LHC, assuming a discovery is made in events with missing transverse momentum, as generically expected in supersymmetry (SUSY) with R-parity conservation. To set the scene, we first discuss the collider phenomenology of the six possible electroweakino benchmark scenarios, as they provide valuable insight into what one might be facing at the LHC. We review the existing methods for mass reconstruction from measured kinematic endpoints in the distributions of suitable variables, e.g., the invariant masses of various sets of visible decay products, as well as the $M_{T2}$ and the $M_2$ types of variables. We propose to extend the application of these methods to the various topologies of fully hadronic final states, possibly with hadronically reconstructed massive bosons (W, Z or h). We test the idea with a simplified simulation of events in the main electroweakino benchmark scenarios. We find that the fully hadronic events allow the complete determination of the relevant mass spectrum. For comparison, we also review the potential of the standard kinematic endpoint methods for final states involving leptons from the decays of (on-shell or off-shell) sleptons. We find that with 300 $fb^{-1}$, the statistics for the leptonic events is very marginal and they look less promising than the fully hadronic channels. This corresponds to a complete reversal of the usual paradigm, where leptonic events comprised the gold-plated SUSY channels. Finally, we put together all available information and summarize what level of understanding of the underlying physics can be achieved. We show that, as a by-product of the mass reconstruction, it is also possible to determine the production cross sections and decay branching ratios, which in turn enable us to pinpoint the underlying model. △ Less", "The supersymmetry preserving mu parameter in SUSY theories is naively expected to be of order the Planck scale while phenomenology requires it to be of order the weak scale. This is the famous SUSY mu problem. Its solution involves two steps: 1. first forbid mu, perhaps via some symmetry, and then 2. re-generate it of order the scale of soft SUSY breaking terms. However, present LHC limits suggest the soft breaking scale m_{soft} lies in the multi-TeV regime whilst naturalness requires mu~ m_{W,Z,h}~ 100 GeV so that a Little Hierarchy (LH) appears with mu << m_{soft}. We review twenty previously devised solutions to the SUSY mu problem and re-evaluate them in light of whether they are apt to support the LH. We organize the twenty solutions according to: 1. solutions from supergravity/superstring constructions, 2. extended MSSM solutions, 3. solutions from an extra local U(1)' and 4. solutions involving Peccei-Quinn (PQ) symmetry and axions. Early solutions would invoke a global Peccei-Quinn symmetry to forbid the mu term while relating the mu solution to solving the strong CP problem via the axion. We discuss the gravity-safety issue pertaining to global symmetries and the movement instead toward local gauge symmetries or R-symmetries, either continuous or discrete. At present, discrete R-symmetries of order M (Z_M^R) which emerge as remnants of Lorentz symmetry of compact dimensions seem favored. Even so, a wide variety of regenerative mechanisms are possible, some of which relate to other issues such as the strong CP problem or the generation of neutrino masses. We also discuss the issue of experimental verification or falsifiability of various solutions to the mu problem. Almost all solutions seem able to accommodate the LH. △ Less", "Low-energy lepton observables are discussed in the Minimal R-symmetric Supersymmetric Standard Model. We present comprehensive numerical analyses and the analytic one-loop results for $(g-2)_μ$, $μ\\to e γ$, and $μ\\to e$ conversion. The interplay between the three observables is investigated as well as the parameter regions with large $g-2$. A striking difference to the MSSM is the absence of $\\tanβ$ enhancements; however we find smaller enhancements governed by MRSSM-specific R-Higgsino couplings $λ_d$ and $Λ_d$. As a result we find significant contributions to $g-2$ only in a small parameter space with several SUSY masses below $200$ GeV, compressed spectra and large $λ_d$, $Λ_d$. In this parameter space there is a correlation between all three considered observables. In the parameter region with small $(g-2)_μ$ the SUSY masses can be larger and the correlation between $μ\\to eγ$ and $μ\\to e$ conversion is weak. Therefore already COMET Phase 1 has a promising sensitivity to the MRSSM. △ Less", "An analytical formalism, including RG running at two loop order, is used to link the supersymmetric and GUT spectra in any GUT model in which the three gauge couplings unify. In each specific GUT model, one can then fully explore the interplay between the pattern of supersymmetry breaking and the prediction for the proton lifetime. With this formalism at hand, we study three concrete GUT models: (i) Minimal SU(5) SUSY GUT, (ii) Missing Partner SU(5) SUSY GUT, and (iii) an orbifold SU(5) SUSY GUT. In each case we derive interesting conclusions about the possible patterns of the supersymmetric spectrum once the present limits on the proton lifetime are imposed, and vice versa, we obtain the predictions for the proton lifetime for specific viable choices of the SUSY spectrum. △ Less", "We develop a supersymmetric bi-axion model of high-scale inflation coupled to supergravity, in which the axionic structure originates from, and is protected by, gauge symmetry in an extra dimension. While local supersymmetry (SUSY) is necessarily Higgsed at high scales during inflation we show that it can naturally survive down to the $\\sim$ TeV scale in the current era in order to resolve the electroweak hierarchy problem. We show how a suitable inflationary effective potential for the axions can be generated at tree-level by charged fields under the higher-dimensional gauge symmetry. The inflationary trajectory lies along the lightest direction in the bi-axion field space, with periodic effective potential and an effective super-Planckian field range emerging from fundamentally sub-Planckian dynamics. The heavier direction in the field space is shown to also play an important role, as the dominant source of super-Higgsing during inflation. This model presents an interesting interplay of tuning considerations relating the electroweak hierarchy, cosmological constant and inflationary superpotential, where maximal naturalness favors SUSY breaking near the electroweak scale after inflation. The scalar superpartner of the axionic inflaton, the \"sinflaton\", can naturally have $\\sim$ Hubble mass during inflation and sufficiently strong coupling to the inflaton to mediate primordial non-Gaussianities of observable strength in future 21-cm surveys. Non-minimal charged fields under the higher-dimensional gauge symmetry can contribute to periodic modulations in the CMB, within the sensitivity of ongoing measurements. △ Less", "Weak-scale supersymmetry remains to be one of the best-motivated theories of physics beyond the Standard Model. We evaluate the sensitivities of the High Luminosity (HL) and High Energy (HE) upgrades of the LHC to gluinos and stops, decaying through the simplified topologies $\\tilde{g} \\to q \\bar{q} χ^0$, $\\tilde{g} \\to t \\bar{t} χ^0$ and $\\tilde{t} \\to t \\tildeχ^0$. Our HL-LHC analyses improve on existing experimental projections by optimizing the acceptance of kinematic variables. The HE-LHC studies represent the first 27 TeV analyses. We find that the HL-(HE-)LHC with 3 ab$^{-1}$ (15 ab$^{-1}$) of integrated luminosity will be sensitive to the masses of gluinos and stops at 3.2 (5.7) TeV and 1.5 (2.7) TeV, respectively, decaying to massless neutralinos. △ Less", "The High-Luminosity Large Hadron Collider (HL-LHC) is expected to deliver an integrated luminosity of up to 3000 fb$^{-1}$. The very high instantaneous luminosity will lead to about 200 proton-proton collisions per bunch crossing (pileup) superimposed to each event of interest, thus providing extremely challenging experimental conditions, which will be addressed by accompanying improvements in the decetors. The sensitivity to find new physics Beyond the Standard Model (BSM) is significantly improved and will allow to extend the reach for SUSY, heavy exotic resonances, vector like quarks, dark matter and exotic long-lived signatures, to name a few. This note summarizes several ATLAS and CMS studies performed to asses HL-LHC sensitivity to various BSM models and signatures. △ Less", "This work focuses on the topical survey of precision measurements via ev->ev scattering in the frame work of Non-Standard Interaction (NSI). Both Model Independent (MI) and Model Dependent (MD) are used in addition the Standard Model (SM). R-parity violating Supersymmetry (SUSY) Model is used to perform MD analysis, where the scattering cross-section is influenced by new S-bosons. By using LSND experimental value, we obtain limits for SUSY coupling parameter (lambda) and obtain physically allowed and disallowed regions rather than just limits/bounds for MI paramters. Under the limits of CHARMII, BNL-COL and BNL-E734 experimental values, we get physically allowed and disallowed regions for MI and MD couplings parameters. Sensitivity of these coupling parameters with each other is also discussed. Furthermore, we establish a relation between MI coupling parameters and R-parity violating SUSY Model coupling parameters. △ Less", "The string theory landscape of vacua solutions provides physicists with some understanding as to the magnitude of the cosmological constant. Similar reasoning can be applied to the magnitude of the soft SUSY breaking terms in supersymmetric models of particle physics: there appears to be a statistical draw towards large soft terms which is tempered by the anthropic requirement of the weak scale lying not too far from ~100 GeV. For a mild statistical draw of m_{soft}^n with n=1 (as expected from SUSY breaking due to a single F term) then the light Higgs mass is preferred at ~125 GeV while sparticles are all pulled beyond LHC bounds. We confront a variety of LHC and WIMP dark matter search limits with the statistical expectations from a fertile patch of string theory landscape. The end result is that LHC and WIMP dark matter detectors see exactly that which is expected from the string theory landscape: a Standard Model-like Higgs boson of mass 125 GeV but as yet no sign of sparticles or WIMP dark matter. SUSY from the n=1 landscape is most likely to emerge at LHC in the soft opposite-sign dilepton plus jet plus MET channel. Multi-ton noble liquid WIMP detectors should be able to completely explore the n=1 landscape parameter space. △ Less", "We study the LHC constraints on an $R$-symmetric SUSY model, where the neutrino masses are generated through higher dimensional operators involving the pseudo-Dirac bino, named bi$ν$o. We consider a particle spectrum where the squarks are heavier than the lightest neutralino, which is a pure bi$ν$o. The bi$ν$o is produced through squark decays and it subsequently decays to a combination of jets and leptons, with or without missing energy, via its mixing with the Standard Model neutrinos. We recast the most recent LHC searches for jets+missing energy with $\\sqrt{s}=13~$TeV and $\\mathcal{L}=36~{\\rm fb}^{-1}$ of data to determine the constraints on the squark and bi$ν$o masses in this model. We find that squarks as light as 350~GeV are allowed if the bi$ν$o is lighter than 150~GeV and squarks heavier than 950~GeV are allowed for any bi$ν$o mass. We also present forecasts for the LHC with $\\sqrt{s}=13$~TeV and $\\mathcal{L}=300~{\\rm fb}^{-1}$ and show that squarks up to 1150~GeV can be probed. △ Less", "The standard model of elementary particles (SM) suffers from various problems, such as power-law ultraviolet (UV) sensitivity, exclusion of general relativity (GR), and absence of a dark matter candidate. The LHC experiments, according to which the TeV domain appears to be empty of new particles, started sidelining TeV-scale SUSY and other known cures of the UV sensitivity. In search for a remedy, in this work, it is revealed that affine curvature can emerge in a way restoring gauge symmetries explicitly broken by the UV cutoff. This emergent curvature cures the UV sensitivity and incorporates GR as symmetry-restoring emergent gravity ({\\it symmergent gravity}, in brief) if a new physics sector (NP) exists to generate the Planck scale and if SM+NP is fermi-bose balanced. This setup, carrying fingerprints of trans-Planckian SUSY, predicts that gravity is Einstein (no higher-curvature terms), cosmic/gamma rays can originate from heavy NP scalars, and the UV cutoff might take right value to suppress the cosmological constant (alleviating fine-tuning with SUSY). The NP does not have to couple to the SM. In fact, NP-SM coupling can take any value from zero to $Λ^2_{SM}/Λ^2_{NP}$ if the SM is not to jump from $Λ_{SM}\\approx 500\\, {\\rm GeV}$ to the NP scale $Λ_{NP}$. The zero coupling, certifying an undetectable NP, agrees with all the collider and dark matter bounds at present. The {\\it seesawic} bound $Λ^2_{SM}/Λ^2_{NP}$, directly verifiable at colliders, implies that: {\\it (i)} dark matter must have a mass $\\lesssim Λ_{SM}$, {\\it (ii)} Higgs-curvature coupling must be $\\approx 1.3\\%$, {\\it (iii)} the SM RGEs must remain nearly as in the SM, and {\\it (iv)} right-handed neutrinos must have a mass $\\lesssim 1000\\, {\\rm TeV}$. These signatures serve as a concise testbed for symmergence. △ Less", "We propose two new benchmark scenarios for Higgs-boson searches in the Minimal Supersymmetric Standard Model (MSSM). These scenarios are specifically designed for the low $\\tanβ$ region. A light Higgs-boson mass prediction compatible with the observed value of $125$ GeV is ensured in almost the entire parameter space by employing a flexible supersymmetric (SUSY) mass scale, reaching values of up to $10^{16}$ GeV. The MSSM Higgs-sector predictions are evaluated in an effective field theory (EFT) framework that exhibits a Two-Higgs-Doublet-Model at the low scale. In the first scenario all SUSY particles are relatively heavy, whereas the second scenario features light neutralinos and charginos. Both scenarios are largely compatible with the most recent results from Run 2 of the LHC, and we highlight the main phenomenological features relevant for future LHC searches. In particular, we provide a detailed discussion of heavy Higgs-boson decays to neutralinos and charginos in the second scenario, and the arising collider signatures, in order to facilitate the design of dedicated LHC searches in the near future. △ Less", "We calculate the proton lifetime and discuss topological defects in a wide class of non-supersymmetric (non-SUSY) $SO(10)$ and $E(6)$ Grand Unified Theories (GUTs), broken via left-right subgroups with one or two intermediate scales (a total of 9 different scenarios with and without D-parity), including the important effect of threshold corrections. By performing a goodness of fit test for unification using the two-loop renormalisation group evolution equations (RGEs), we find that the inclusion of threshold corrections significantly affects the proton lifetime, allowing several scenarios, which would otherwise be excluded, to survive. Indeed we find that the threshold corrections are a saviour for many non-SUSY GUTs. For each scenario we analyse the homotopy of the vacuum manifold to estimate the possible emergence of topological defects. △ Less", "The null results of the LHC searches have put strong bounds on new physics scenario such as supersymmetry (SUSY). With the latest values of top quark mass and strong coupling, we study the upper bounds on the sfermion masses in Split-SUSY from the observed Higgs boson mass and electroweak (EW) vacuum stability. To be consistent with the observed Higgs mass, we find that the largest value of supersymmetry breaking scales $M_{S}$ for $\\tanβ=2$ and $\\tanβ=4$ are $\\mathcal{O} (10^{3}\\, {\\rm TeV})$ and $\\mathcal{O} (10^{1.5}\\, {\\rm TeV})$ respectively, thus putting an upper bound on the sfermion masses around $10^{3}\\, {\\rm TeV}$. In addition, the Higgs quartic coupling becomes negative at much lower scale than the Standard Model (SM), and we extract the upper bound of $\\mathcal{O}(10^{4}\\, {\\rm TeV})$ on the sfermion masses from EW vacuum stability. Therefore, we obtain the PeV-Scale Split-SUSY. The key point is the extra contributions to the Renormalization Group Equation (RGE) running from the couplings among Higgs boson, Higgsinos, and gauginos. We briefly comment on the lifetime of gluinos in our study and compare it with current LHC observations. Additionally, we comment on the prospects of discovery of prompt gluinos in a 100 TeV proton-propton collider. △ Less", "In this article we provide explicit computations of the quantum corrections to the lightest CP-even Higgs Boson mass in the real version of the Minimal Supersymmetric Standard Model. We compute the contributions coming from the SUSY-QCD sector with a precision of three loops at order $O(α_tα_s^2)$. The renormalization procedure adopted is based on the dimensional reduction scheme in order to preserve supersymmetry to all perturbative orders. The calculation extends the region of validity of previous studies to the whole supersymmetric parameter space. The involved master integrals have been computed by exploiting new proposed approaches based on the dispersion relation techniques for the numerical calculation of three-loop vacuum integrals with arbitrary mass scales. △ Less", "We present a private SUSY Higgs model with four Higgs doublets, where each fermion type (up, down, and charged leptons) obtain their masses from a different Higgs doublet $H_f\\hspace{0.1cm}( f = u_1, d, e)$. After imposing the conditions for anomaly cancellation, one finds that the remaining doublet $H_{u_2}$, must have the same hypercharge as $H_{u_1}$, and thus can only couple to up-type quarks, which opens the possibility to have FCNC's in this sector. We discuss the Lagrangian and the Higgs potential of the model, in order to identify the Higgs mass eigenstates and their interactions, with Yukawa matrices of the texture type. After imposing LHC constraints on the Higgs properties, we identify viable regions of parameter space, which we use to evaluate the decay $t \\rightarrow ch$, finding that it can reach typically $B.R. (t \\rightarrow ch) \\approx \\mathcal{O}(10^{-5} )$. These rates are compared with current bounds from LHC, finding that some cases are already ruled out, but some cases could only be tested at future LHC stages. △ Less", "The recent results of the LHC search for electroweak production of supersymmetric (SUSY) particles at $\\sqrt{s}=13$ TeV have shown improved lower limits for their masses. In addition, the projected experiment E989 will be able to measure the muon anomalous magnetic moment precisely so that the experimental uncertainty can be reduced by a factor of four. It was pointed out that if the center value of the muon $g-2$ remains unchanged the deviation between the standard model (SM) prediction and the experimental value will be as large as 7.0$σ$. Such a large deviation will be solid evidence for new physics beyond the SM. Motivated by these results, we investigate the minimal SUSY extension of the SM with universal gaugino masses at the grand unified scale in the light of the muon $g-2$ and the updated LHC constraints. The squarks are assumed to be heavy and decoupled from physics at low energy scales to resemble the SM-like Higgs boson mass of 125 GeV and other bounds for squark masses at the LHC. We have pinned down allowed windows for the lightest neutralino and the smuon masses as well as other input parameters relevant to the light SUSY sector. The expected results of the E989 experiment play a crucial role in narrowing these windows. The viability of the model for small mass regions can be tested at the LHC Run 3 and the High Luminosity LHC in the near future. △ Less", "We suggest simple ways of implementing Peccei-Quinn (PQ) symmetry to solve the strong CP problem in renormalizable SUSY $SO(10)$ models with a minimal Yukawa sector. Realistic fermion mass generation requires that a second pair of Higgs doublets survive down to the PQ scale. We show how unification of gauge couplings can be achieved in this context. Higgsino mediated proton decay rate is strongly suppressed by a factor of $(M_{\\rm PQ}/M_{\\rm GUT})^2$, which enables all SUSY particles to have masses of order TeV. With TeV scale SUSY spectrum, $p \\rightarrow \\overlineν K^+$ decay rate is expected to be in the observable range. Lepton flavor violating processes $μ\\rightarrow eγ$ decay and $μ-e$ conversion in nuclei, induced by the Dirac neutrino Yukawa couplings, are found to be within reach of forthcoming experiments. △ Less", "A new realization of extended quantum-mechanical supersymmetry (QM SUSY) with central extension is investigated. We first show that two different sets of $d+2$ ($d+1$) supercharges for $d=$ even (odd), each of which satisfies an $\\mathcal{N}=d+2$ ($d+1$) extended QM SUSY algebra without central extension, are hidden in the four-dimensional (4D) mass spectrum of the $(4+d)$-dimensional Dirac action. We then find that the whole set of the supercharges forms an $\\mathcal{N}=2d+4$ ($2d+2$) extended QM SUSY algebra with central charges for $d=$ even (odd). The representation of the supersymmetry algebra is shown to be $1/2$-Bogomol'nyi--Prasad--Sommerfield states that correspond to a short representation for the supersymmetry algebra with central extension. We explicitly examine the 4D mass spectrum of the models with the hyperrectangle and the torus extra dimensions, and discuss their supersymmetric structures. △ Less", "A novel realization of the gravity-mediated SUSY breaking is presented taking into account a continuous global R symmetry. Consistently with it, we employ a linear superpotential for the hidden sector superfield and a Kaehler potential parameterizing the SU(1,1)/U(1) Kaehler manifold with constant curvature -1/2. The classical vacuum energy vanishes without unnatural fine tuning and non-vanishing soft SUSY-breaking parameters, of the order of the gravitino mass, arise. A solution to the mu problem of MSSM may be also achieved by conveniently applying the Giudice-Masiero mechanism. The potentially troublesome R axion may acquire acceptably large mass by explicitly breaking the R symmetry in the Kaehler potential through a quartic term which does not affect, though, the achievements above. △ Less", "In preparation for upcoming nucleon decay searches at Hyper-Kamiokande, it is important to derive a theoretical upper bound on the proton lifetime in a general class of grand unified theory (GUT) models. In this paper, we make an attempt along this direction for non-SUSY SU(5) models, under the mild restrictions that only one or two SM-decomposed multiplets are singularly light, and that the SU(5) gauge theory is asymptotically free and thus there are no too large representations in the model. We derive criteria for SM-decomposed multiplets that potentially enhance the proton lifetime when they are singularly light. We perform a numerical analysis on the proton lifetime and show that some choices of singularly light multiplets can provide a testable upper bound on the proton lifetime. △ Less", "We study the loop-induced decays $h^0 \\to γ\\, γ$ and $h^0 \\to g \\, g$ in the Minimal Supersymmetric Standard Model (MSSM) with quark flavour violation (QFV), identifying $h^0$ with the Higgs boson with a mass of 125 GeV, where $γ$ and $g$ are photon and gluon, respectively. We perform a MSSM parameter scan and a detailed analysis around a fixed reference point respecting theoretical constraints from vacuum stability conditions and experimental constraints, such as those from B meson data and electroweak precision data, as well as recent limits on supersymmetric (SUSY) particle masses from LHC experiments. We find that (i) the relative deviation of the decay width $Γ(h^0 \\to g \\, g)$ from the Standard Model value, $DEV(g)$, can be large and negative, $\\lesssim - 15\\%$, (ii) the analogous deviation of $Γ(h^0 \\to γ\\, γ)$ is strongly correlated, $DEV(γ) \\simeq -1/4\\,DEV(g)$ for $DEV(g) \\lesssim - 4\\%$, (iii) the relative deviation of the width ratio $Γ(h^0 \\to γ\\, γ)/Γ(h^0 \\to g \\, g)$ from the SM value, $DEV(γ/g)$, can be large (up to $\\sim$ 20\\%), (iv) the deviations can be large due to the up-type squark loop contributions, (v) the SUSY QFV parameters can have a significant effect on these deviations. Such large deviations can be observed at a future $e^+e^-$ collider like ILC. Observation of the deviation patterns as shown in this study would favour the MSSM with flavour-violating squark mixings and encourage to perform further studies in this model. △ Less", "We study CP-conserving non-minimal flavour violation in $A_4 \\times SU(5)$ inspired Supersymmetric Grand Unified Theories (GUTs), focussing on the regions of parameter space where dark matter is successfully accommodated due to a light right-handed smuon a few GeV heavier than the lightest neutralino. In this region of parameter space we find that some of the flavour-violating parameters are constrained by the requirement of the dark matter relic density, due to the delicate interplay between the smuon and neutralino masses. By scanning over GUT scale flavour violating parameters, constrained by low-energy quark and lepton flavour violating observables, we find a striking difference in the results in which individual parameters are varied to those where multiple parameters are varied simultaneously, where the latter relaxes the constraints on flavour violating parameters due to cancellations and/or correlations. Since charged lepton-flavour violation provides the strongest constraints within a GUT framework, due to relations between quark and lepton flavour violation, we examine in detail a prominent correlation between some of the flavour violating parameters at the GUT scale consistent with the stringent lepton flavour violating process $μ\\rightarrow e γ$. We also examine the relation between GUT scale and low scale flavour violating parameters, for both quarks and leptons, and show how the usual expectations may be violated due to the correlations when multiple parameters are varied simultaneously. △ Less", "We investigate the determination of the Higgs-boson propagator poles in the MSSM. Based upon earlier works, we point out that in case of a large hierarchy between the electroweak scale and one or more SUSY masses a numerical determination with $\\overline{\\text{DR}}$ Higgs field renormalization induces higher order terms which would cancel in a more complete calculation. The origin of these terms is the momentum dependence of contributions involving at least one of the heavy particles. We present two different methods to avoid their appearance. In the first approach, the poles are determined by expanding around the one-loop solutions. In the second approach, a \"heavy-OS\" Higgs field renormalization is employed in order to absorb the momentum dependence of heavy contributions. We will find that the first approach leads to an unwanted behaviour of the Higgs boson mass predictions close to crossing points where two Higgs bosons that mix with each other are almost mass degenerate. These problems are avoided in the second approach, which became the default approach used in the public code FeynHiggs. Despite the discussion being very specific to the MSSM, the argumentation and the methods presented in this work are straightforwardly applicable to the determination of propagator poles in other models involving a large mass hierarchy. △ Less", "Extraordinary gauge mediation extension of deflected AMSB scenarios can be interesting because it can accommodate together the deflection in the Kahler potential and the superpotential. We revisit the EGM scenario and derive the analytical expressions for soft SUSY breaking parameters in EGM and EGM extension of deflected AMSB scenarios with wavefunction renormalization approach, especially the case with vanishing gauge beta-function at an intermediate energy scale. The Landau pole and proton decay constraints are also discussed. △ Less", "Stochastic gravitational waves can be produced during the preheating when out-of-equilibrium particles are produced with an anisotropic stress-tensor. We discuss the case where these particles carry spin 3/2. We compute the spectrum of the gravitational waves generated by the transverse and longitudinal components. We find a different scaling of the spectrum near the peak and the longitudinal components lead to an enhancement when compared to spin-1/2 fermions with Yukawa couplings. We note, as expected, that the corresponding typical frequency is too high for the current observation and calls for ultra-high frequency gravitational wave detectors in the future. △ Less", "Top squark (stop) plays a crucial role in the naturalness of supersymmetry (SUSY) models, which has been extensively searched for in the LHC experiments. Due to the parity-violating couplings, top quark and chargino thus produced from stop decay are expected to be polarized. We investigate the polarization of top quark and chargino, from which we find that the mass differences between neutralino and stop/chargino can affect the degree of polarization of top quark/chargino in the stop decay. We then examine the top polarization effects on kinematics of stop decay in natural SUSY (NSUSY) at the LHC and the results show that several observables have the discriminating power for different polarized top quark at the LHC, which may be useful for testing the nature of stop couplings in NSUSY. △ Less", "We present an updated fit of supersymmetric SO(10) models to quark and lepton masses and mixing parameters. Including latest results from lattice QCD determinations of quark masses and neutrino oscillation data, we show that fits neglecting supersymmetric threshold corrections are strongly disfavoured in our setup. Only when we include these corrections we find good fit points. We present $χ^2$-profiles for the threshold parameters, which show that in our setup the thresholds related to the third generation of fermions exhibit two rather narrow minima. △ Less", "FCNC processes offer important tools to test the Standard Model (SM), and to search for possible new physics. In this work, we investigate the $s\\to dν\\barν$ rare hyperon decays in SM and beyond. We find that in SM the branching ratios for these rare hyperon decays range from $10^{-14}$ to $10^{-11}$. When all the errors in the form factors are included, we find that the final branching fractions for most decay modes have an uncertainty of about $5\\%$ to $10\\%$. After taking into account the contribution from new physics, the generalized SUSY extension of SM and the minimal 331 model, the decay widths for these channels can be enhanced by a factor of $2 \\sim 7$. △ Less", "We propose that the $γ+ E \\hspace{-.5em}/\\;\\:$ signal at the Belle-II will be a smoking gun for supersymmetry (SUSY) in the presence of a gauged $U(1)_{L_μ-L_τ}$ symmetry. A striking consequence of breaking the enhanced symmetry in the limit of degenerate (s)leptons is the nondecoupling of the radiative contribution of heavy charged sleptons, appearing in SUSY, to the $γ- Z^\\prime$ kinetic mixing. The signal process, $e^+ e^- \\rightarrow γZ^\\prime \\rightarrow γ+ E \\hspace{-.5em}/\\;\\:$, is an outcome of this ubiquitous feature. We take into account the severe constraints on gauged $U(1)_{L_μ-L_τ}$ models by several low-energy observables and show that any significant excess in all but the highest photon energy bin would be an undeniable signature of such heavy scalar fields in SUSY coupling to $Z^\\prime$. The number of signal events depends crucially on the logarithm of the ratio of stau to smuon mass in the presence of SUSY. In addition, the number is also inversely proportional to the $e^+-e^-$ collision energy, making a low-energy, high-luminosity collider like Belle-II an ideal testing ground for this channel. This process can probe large swathes of the slepton mass ratio vs the additional gauge coupling ($g_X$) parameter space. More importantly, it can explore the narrow slice of $M_{Z^{\\prime}}-g_X$ parameter space still allowed in gauged $U(1)_{L_μ-L_τ}$ models for superheavy sparticles. △ Less", "In the MSSM extended by a complete vectorlike family, precise top, bottom and tau Yukawa coupling unification can be achieved assuming SUSY threshold corrections which are typical for comparable superpartner masses. Furthermore, the unification is possible with a large unified coupling, implying that all three fermion masses can be simultaneously close to their IR fixed points. Assuming unified Yukawa couplings of order one or larger, the preferred common scale of new physics (superpartners and vectorlike matter) is in the 3 TeV to 30 TeV range, with larger couplings favoring smaller scales. Splitting superpartner masses from masses of vectorlike fields, the preferred scales extend in both directions. The multi-TeV scale for superpartners is compatible with and independently suggested by the Higgs boson mass. △ Less", "We present a deep learning solution to the prediction of particle production cross sections over a complicated, high-dimensional parameter space. We demonstrate the applicability by providing state-of-the-art predictions for the production of charginos and neutralinos at the Large Hadron Collider (LHC) at the next-to-leading order in the phenomenological MSSM-19 and explicitly demonstrate the performance for $pp\\to\\tildeχ^+_1\\tildeχ^-_1,$ $\\tildeχ^0_2\\tildeχ^0_2$ and $\\tildeχ^0_2\\tildeχ^\\pm_1$ as a proof of concept which will be extended to all SUSY electroweak pairs. We obtain errors that are lower than the uncertainty from scale and parton distribution functions with mean absolute percentage errors of well below $0.5\\,\\%$ allowing a safe inference at the next-to-leading order with inference times that improve the Monte Carlo integration procedures that have been available so far by a factor of $\\mathcal{O}(10^7)$ from $\\mathcal{O}(\\rm{min})$ to $\\mathcal{O}(μ\\rm{s})$ per evaluation. △ Less", "Low-energy supersymmetric models such as MSSM, NMSSM and MSSM with vectorlike fermion are consistent with perturbative unification. While the non-minimal extensions naturally explain Higgs mass and dark matter in the low energy region, it is unclear how seriously they are constrained in the ultraviolet region. Our study shows that $i)$, In the case of embedding MSSM into $\\rm{SU}(5)$, the fit to SM fermion masses requires a singlet $S$, which leads to unviable embedding of NMSSM into $\\rm{SU}(5)$ because such $S$ feeds singlet $N$ a mass of order unification scale as well. $ii)$, Similar result holds in the case of embedding NMSSM into $\\rm{SO}(10)$, where $S$ is replaced by some Higgs fields responsible for $\\rm{SO}(10)$ breaking. $iii)$, On the contrary, for the embedding of MSSM with $16$-dimensional vectorlike fermions into $\\rm{SO}(10)$, the Higgs field responsible for the vectorlike mass of order TeV scale can evade those problems the singlet $N$ encounters because of an intermediate mass scale in the $126$-dimensional Higgs field. △ Less", "In the simplest picture, the masses of string axions populating the axiverse depend on two parameters: the supersymmetry breaking scale $M_{\\rm susy}$ and the action $S$ of the string instantons responsible for breaking the axion shift symmetry. In this work, we explore whether cosmological data can be used to probe these two parameters. Adopting string-inspired flat priors on $\\log_{10}M_{\\rm susy}$ and $S$, and imposing that $M_{\\rm susy}$ be sub-Planckian, we find $S=198\\pm28$. These bounds suggest that cosmological data complemented with string-inspired priors select a quite narrow axion mass range within the axiverse, $\\log_{10}(m_a/{\\rm eV}) = -21.5^{+1.3}_{-2.3}$. We find that $M_{\\rm susy}$ remains unconstrained due to a fundamental parameter degeneracy with $S$. We explore the significant impact of other choices of priors on the results, and we comment on similar findings in recent previous literature. △ Less", "The lack of a new physics signal thus far at the Large Hadron Collider motivates us to consider how to look for challenging final states, with large Standard Model backgrounds and subtle kinematic features, such as cascade decays with compressed spectra. Adopting a benchmark SUSY-like decay topology with a four-body final state proceeding through a sequence of two-body decays via intermediate resonances, we focus our attention on the kinematic variable $Δ_{4}$ which previously has been used to parameterize the boundary of the allowed four-body phase space. We highlight the advantages of using $Δ_{4}$ as a discovery variable, and present an analysis suggesting that the pairing of $Δ_{4}$ with another invariant mass variable leads to a significant improvement over more conventional variable choices and techniques. △ Less", "We investigate the baryon asymmetry in the supersymmetry Dine-Fischler-Srednicki-Zhitnitsky axion model without R-parity. It turns out that the R-parity violating terms economically explain the atmospheric mass-squared difference of neutrinos and the appropriate amount of baryon asymmetry through the Affleck-Dine mechanism. In this model, the axion is a promising candidate for the dark matter and the axion isocurvature perturbation is suppressed due to the large field values of Peccei-Quinn fields. Remarkably, in some parameter regions explaining the baryon asymmetry and the axion dark matter abundance, the proton decay will be explored in future experiments. △ Less", "We propose six new benchmark scenarios for Higgs boson searches in the Minimal Supersymmetric Standard Model. Our calculations follow the recommendations of the LHC Higgs Cross Section Working Group, and benefit from recent developments in the predictions for the Higgs-boson masses and mixing. All of the proposed scenarios are compatible with the most recent results from Run 2 of the LHC. In particular, they feature a scalar with mass and couplings compatible with those of the observed Higgs boson, and a significant portion of their parameter space is allowed by the limits from the searches for SUSY particles and additional Higgs bosons. We define a scenario where all SUSY particles are relatively heavy, and two scenarios with light colorless SUSY particles (charginos, neutralinos and, in one case, staus). In addition, we present two scenarios featuring alignment without decoupling, realized with either the lighter or the heavier scalar being SM-like, and a scenario with CP violation. △ Less", "Top-squarks (stops) play a crucial role for the naturalness of supersymmetry (SUSY). However, searching for the stops is a tough task at the LHC. To dig the stops out of the huge LHC data, various expert-constructed kinematic variables or cutting-edge analysis techniques have been invented. In this paper, we propose to represent collision events as event graphs and use the message passing neutral network (MPNN) to analyze the events. As a proof-of-concept, we use our method in the search of the stop pair production at the LHC, and find that our MPNN can efficiently discriminate the signal and background events. In comparison with other machine learning methods (e.g. DNN), MPNN can enhance the mass reach of stop mass by several tens of GeV to over a hundred GeV. △ Less", "The experiments at the Large Hadron Collider (LHC) have pushed the limits on masses of supersymmetric particles beyond the $\\sim$TeV scale. This compromises naturalness of the simplest supersymmetric extension of the Standard Model, the minimal supersymmetric Standard Model (MSSM). In this paper we advocate that perhaps the current experimental data are actually hinting towards the physics beyond MSSM. To illustrate this, we treat MSSM as a low energy limit of a more fundamental yet unspecified theory at a scale $Λ$, and compute the fine-tuning measure $Δ$ for generic boundary conditions on soft SUSY breaking parameters and various cut-off scales. As a general trend we observe reduction in fine-tuning together with lowering $Λ$. In particular, perfectly natural [$Δ\\lesssim \\mathcal{O}(10)$] theories with a multi-TeV spectrum of supersymmetric particles and consistent with all current observations can be obtained for $Λ\\sim \\mathcal{O}(100)$TeV. The lowering of the fine-tuning for large cut-off scales can also be observed in theories exhibiting special quasi-fixed point behaviours of parameters. Our observations call for a more throughout exploration of possible alternative ultraviolet completions of MSSM. △ Less", "The strong constraints on the R-parity conserving supersymmetry (SUSY) from the LHC searches motivate us to consider the new models in which the low-scale SUSY is still allowed. We propose a kind of R-parity violating SUSY scenarios with a non-zero $U^c_2 D^c_2 D^c_3$ operator. Three relevant LHC searches are recasted to test the status of this scenario in terms of four simplified models, with either light stop-Bino, stop-Higgsino, sbottom-Bino or sbottom-Higgsino. Some difficult scenarios for the LHC SUSY searches in these simplified models are identified. By extrapolate the current LHC searches to the future 14 TeV LHC with integrated luminosity of 300 fb$^{-1}$, most of the difficult scenarios can be probed, except the sbottom-Bino simplified one. An improved search, which utilises the multiple b-jets as well as its kinematic features, is expected to probe the signature of this case. △ Less", "We propose to generate a realistic soft SUSY breaking spectrum for Next-to-Minimal Supersymmetric Standard Model (NMSSM) with a generalized deflected mirage mediation scenario, in which additional Yukawa and gauge mediation contributions are included to deflect the renormalization group equation(RGE) trajectory. Based on the Wilsonian effective action obtained by integrating out the messengers, the NMSSM soft SUSY breaking spectrum can be given analytically at the messenger scale. We find that additional contributions to $m_S^2$ can possibly ameliorate the stringent constraints from the electroweak symmetry breaking (EWSB) and 125 GeV Higgs mass. Constraints from dark matter and fine-tuning are also discussed. The Barbieri-Giudice fine-tuning measure and electroweak fine-tuning measure in our scenario can be as low as ${\\cal O}(1)$, which possibly indicates that our scenario is natural. △ Less", "In the present paper, we investigate regularization of the one-loop quantum corrections with infinite Kaluza-Klein (KK) states and evaluate Casimir vacuum energy from extra dimensions. The extra dimensional models always involve the infinite massless or massive Kaluza-Klein states, and therefore, the regularization of the infinite KK corrections is highly problematic. In order to avoid the ambiguity, we adopt the proper time integrals and the Riemann zeta function regularization in evaluating the summations of infinite KK states. In the calculation, we utilize the KK regularization method with exchanging the infinite summations and the infinite loop integrals. At the same time, we also evaluate the correction by the the dimensional regularization method without exchanging the summations and the loop integrals. Then, we clearly show that the regularized Casimir corrections from the KK states have the form of $\\propto 1/R^2$ for the Higgs mass and $\\propto 1/R^4$ for the cosmological constant, where $R$ is the compactification radius. We also evaluate the Casimir energy in supersymmetric extra-dimensional models. The contributions from bulk fermions and bulk bosons are not offset because we choose SUSY breaking boundary conditions. The non-zero supersymmetric Casimir corrections from extra dimensions undoubtedly contribute to the Higgs mass and the cosmological constant. We conclude the coefficients of such corrections are enhanced compared to the case without bulk supersymmetry. △ Less", "A unification of left-right $\\rm{SU}(3)_\\rm{L}\\times \\rm{SU}(3)_\\rm{R}$, colour $\\rm{SU}(3)_\\rm{C}$ and family $\\rm{SU}(3)_\\rm{F}$ symmetries in a maximal rank-8 subgroup of ${\\rm{E}}_8$ is proposed as a landmark for future explorations beyond the Standard Model (SM). We discuss the implications of this scheme in a supersymmetric (SUSY) model based on the trinification gauge $\\left[\\rm{SU}(3)\\right]^3$ and global $\\rm{SU}(3)_\\rm{F}$ family symmetries. Among the key properties of this model are the unification of SM Higgs and lepton sectors, a common Yukawa coupling for chiral fermions, the absence of the $μ$-problem, gauge couplings unification and proton stability to all orders in perturbation theory. The minimal field content consistent with a SM-like effective theory at low energies is composed of one $\\mathrm{E}_6$ $27$-plet per generation as well as three gauge and one family $\\rm{SU}(3)$ octets inspired by the fundamental sector of ${\\rm{E}}_8$. The details of the corresponding (SUSY and gauge) symmetry breaking scheme, multi-scale gauge couplings' evolution, and resulting effective low-energy scenarios are discussed. △ Less", "The axion causes two serious cosmological problems, domain wall and isocurvature perturbation problems. Linde pointed that the isocurvature perturbations are suppressed when the Peccei-Quinn (PQ) scalar field takes a large value $\\sim M_{\\text{pl}}$ (Planck scale) during inflation. In this case, however, the PQ field with large amplitude starts to oscillate after inflation and large fluctuations of the PQ field are produced through parametric resonance, which leads to the formation of domain walls. We consider a supersymmetric axion model and examine whether domain walls are formed by using lattice simulation. It is found that the domain wall problem does not appear in the SUSY axion model when the initial value of the PQ field is less than $10^{3}\\times v$ where $v$ is the PQ symmetry breaking scale. △ Less", "We generalize the clockwork theory in several directions. First, we consider beyond nearest neighbors interactions. Considering such interactions keeps a larger subgroup of the original $U(1)^{N+1}$ unbroken and can allow for different symmetry breaking patterns. We recover the original clockwork scenario in the presence of these additional interactions. In such case, the masses of the massive modes change, but a single massless mode remains intact. Such interactions are naturally interpreted as higher derivative terms from the point of view of extra dimensions. Second, we generalize the clockwork shift symmetry to non-abelian global groups. Third, trivial embedding of the clockwork scenario in supergravity, yields an AdS minimum as big as the clockwork interaction. Specifically, the clockwork is connected to the cosmological constant. We analyze the different ways in which a Minkowski supersymmetric minimum can be constructed, and demonstrate simple SUSY breaking mechanisms that preserve or break the clockwork symmetry. We show that the clockwork direction is actually a special SUSY breaking direction, that does not require the inclusion of additional fields or parameters. Fourth, we review the extra-dimensional origin of the mechanism and interpretation, in the case of conformal coupling to gravity. △ Less"]